{"title":"a full february, futile imaginations","link":"https://chias.blog/2023/a-full-february-futile-imaginations/","date":1677531424000,"content":"<span><span>Reading Time: </span> <span>6</span> <span>minutes</span></span>\n<figure><img loading=\"lazy\" width=\"576\" height=\"1024\" src=\"https://chias.blog/wp-content/uploads/image-187-576x1024.png\" srcset=\"https://chias.blog/wp-content/uploads/image-187-576x1024.png 576w, https://chias.blog/wp-content/uploads/image-187-169x300.png 169w, https://chias.blog/wp-content/uploads/image-187-768x1365.png 768w, https://chias.blog/wp-content/uploads/image-187-864x1536.png 864w, https://chias.blog/wp-content/uploads/image-187-1152x2048.png 1152w, https://chias.blog/wp-content/uploads/image-187-620x1102.png 620w\" /><figcaption>rocks</figcaption></figure>\n\n\n\n<p>I’m back from a few weeks in New Haven. It is not a new revelation, but nothing really is; we know what makes us happy, I know what I like and what I don’t like, I know what I need. I get it and then the whole world on fire is collapsing once more, it is burning but not ever touching me.</p>\n\n\n\n<p>In New Haven I wake up to clocktowers, stare at ceilings far grander than I ever thought I would see (the type that my parents might have only seen in European museums), fall asleep half at a hotel with at least four Yale paintings (so you know you’re in New Haven) or in a Twin XL bed in a dorm room building with white people talking about nothing interesting in the room over. I wear my partner’s Aliexpress slides and it’s the only time where we can really go shit together. I am reminded that I am just 22 and could be pulled into any world at all. I am unmistakably a victim of this life: it is all over me. I cancel on half of my friends and do not know who are my friends anymore. One person who ignored several of my texts asks me to answer something about a Google Drive for an article they’re writing; we worked together at the Yale Women’s Center for three years and this is all I have become to them. They write decently but are incredibly uninteresting. I stress my partner out because I am printing one hundred books (not two hundred, I correct him) and made him haul my printer (that was at Kevin’s) to the hotel room. To be fair we Uber’d there, so we just had to bring it down the stairs and up from the car. One weekend we are at a bicycle co-op for a zine fair and the next we are in New York with four of our friends, failing to go gallery hopping but succeeding at a Uniqlo haul. We eat overpriced vegan food at Public Records and see the most beautiful ambient show of our lives. We are all falling asleep in the train and it is maybe one of the last times we will ever be this combination of selves again. I am careful to be precious with each moment. I accidentally pay the expensive Public Records bill on the creidt card that does not have cashback. Another day we are drunk on Valentine’s day morning running through the art gallery, and another night I lose my glasses when we run from a late night happy hour through the streets. I am so in love. Sometimes I am sitting and realize that I am so in love and my body feels so light because there is so much that can come out of all this love. When we are walking through a shitty Feb club party a drink spills on me but he still puts his hand over no one’s glass to prevent anything more. I am finding new bathrooms still in old places. I get pissed because I want to DJ and I wasn’t able to find a place where I can DJ.</p>\n\n\n\n<p>At the same time we barter whether we are better people because of where we have been. I am exchanging my sense of self for nothing.</p>\n\n\n\n<p><a href=\"https://www.instagram.com/p/CpA9N5_vPAk/\">I am so moved by this trip that I finally write a bit about my college graduation.</a> Some people who commented were assholes to me at a teenage leaders’ conference, others are billionaires. Only few people know the lines, as only few people know how to read between the lines of my sad post that is a forever cry for help. I did not win this race yet.</p>\n\n\n\n<p>I’m home and I am forced to feel that my body is connected. Something runs through the right side of my throat, such that when I drink water my ear is pierced with a sharp, stabbing pain. I am so scared to eat, chew, swallow. When I try to induce the disorder this is what it must be dreaming of. If I speak and let saliva pile up, I am induced to move my jaw and it feels so violently painful that I would rather starve. I must sleep in a certain way, avoid speaking unless absolutely necessary. Only warm water passes through without something aching. I am on the same bowl of soft pasta that I cooked four days ago.</p>\n\n\n\n<p>Last last night I had another violent dream where I imagined my friends old and me still in their lives. I thought about them with all their dreams fulfilled: the risograph machine and all her drums, the dance studio in the house, the garden running from the windowsill to the backyard, my friend married to her high school lover and my other friend in independent and fulfilled defiance. We were all dancing in each other’s small lives and then it was everything. I ugly cried about all my loose projections of their selves, so far from what might 1.) actually bring them happiness and 2.) what we would actually see. I rooted myself again in the best idea of a future I have: where I’m with them in hearing what they want in this tumultuous time of ambiguity where we all don’t know what we even are and don’t know what we could become. I thought of the small thing I bring in their lives, this many times unimportant inkling of who they are (already, or who they are going to be) that they can’t quite name for themselves. I am standing with them until they can name this part of themselves.</p>\n\n\n\n<p>When I say it, it sometimes sounds sad but it has always been more matter-of-fact. I never thought I would be the type of person to grow old. I can’t think of myself in the long-term, which is why I do things like buy concert tickets months in advance and beg people to make things with me that might outlast me. I am not interested in legacy as much as being, even if it seems like I’m at direct odds with the ‘being’ part. In the dream I wasn’t there at all. I was a witness to everything instituted, to the wedding and the wine ritual. I had known where they were, what brought them joy, to have been a part of this lifelong act of self-definition: and then it must have been close to a prayer, that realization that this is all a quest of definition and fitting one another in. I was everywhere without needing to see it.</p>\n\n\n\n<p>Nothing new came from the dream but the realization that I want to be a continuous part of molding a world that is better for the people I love; that I want to continue using any bit of social capital and power I accrue to give back, that I want my life to be the platform and gathering space for those I care about, that I want to continue connecting people my whole life and be the crossing point, that I want to see my worlds intertwine forever and ever until we are all just natural consequences of one another. What is my life but a vessel for everyone else? What am I holding but the consequence of it all? To believe in people I had to picture myself there as well: that there was this form of communion that we all contribute to no matter how much we abandon our own selves, that there was this grace of being invoked by ‘being’. I wanted the selfish ability to see the people I love around, and thus I had to be alive. No amount of narcissistic fantasy/imagination could fill these gaps in, one of the few parts of living I can’t conjure for myself. I want to keep seeing us until we all know who we are.</p>\n\n\n\n<h3>art exhibits!</h3>\n\n\n\n<p>I’m trying to explore the art world because it seems like one of the safest avenues where you can gather people around work and share it — and I’m so pleased to share that I’m showing my work at two exhibits around London! </p>\n\n\n\n<p><a href=\"https://www.staffordshirest.com/swordsandkisses\" target=\"_blank\">SWORDS AND KISSES</a> (March 23–26) is a group exhibit presenting trans visions of non-linear time-space presenting the queer technology of fantasy, worldbuilding, avatars, fanfiction, and more. I’ll be showing a variety of my websites and games as well as <a href=\"https://www.eventbrite.co.uk/e/558899151407\" target=\"_blank\">speaking at this March 25th panel remotely!</a> </p>\n\n\n\n<p><a href=\"https://nowplaythis.net/\" target=\"_blank\">NOW PLAY THIS</a> is a festival of experimental game design at Somerset House in London. <a href=\"https://whenwe.love/moving\" target=\"_blank\">We Are Only Moving Towards Each Other</a> will be showcased alongside some crazy names I can’t believe I’m next to..!</p>\n\n\n\n<p><a href=\"https://www.patreon.com/posts/full-february-up-79291846\">Here’s my Patreon update with work details, past and upcoming.</a> If you appreciate my writing (work, or self), a subscription or <a href=\"https://ko-fi.com/hotemogf\">one-time donation helps</a> both financially and cognitively because it fucks with my head that people care enough about what I do to support it with money you have earned elsewhere (in the nicest way possible).</p>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"00056182248b87ea3bcb5bce4d464b639efdcc0e2a75b15b5772bd3e5b383d0c","category":"Sites"}