{"title":"The Primitives Protocol","link":"https://www.usv.com/writing/2024/04/the-primitives-protocol/","date":1712241664000,"content":"<p>For <a href=\"https://www.usv.com/writing/2013/10/bitcoin-as-protocol/\">over a decade now</a>, USV has been eagerly anticipating the emergence of “Web3” alongside “crypto”.  What we mean by this is that while blockchains and crypto assets are still viewed by the world at large as  financial technologies, they are also equal parts computing technologies.  From both a financial and computing perspective, Web3 and crypto provide <a href=\"https://nickgrossman.xyz/superpowers\">superpowers</a> to developers and users that are becoming increasingly apparent as the technology stack matures.</p>\n\n\n\n<p>A front-and-center use case for this today is the social network.  A Web3-style social network is one where the key data elements (identity, published content, social graph, app stores) are owned and controlled directly by creators and consumers, vs by the platform companies.  While this may still seem like an arcane technical distinction, it feels like the world is beginning to wake up to both the limitations of the Web 2 model (content moderation challenges, deplatforming, app store monopolies), and also to the benefits of the Web3 model (ownable digital assets &amp; identity that travel with you across apps).</p>\n\n\n\n<p>We are in the early stages of designing &amp; using Web3-style social graphs.  For example, the Lens protocol is very on-chain-forward, representing the social graph as NFTs; the Farcaster protocol takes a lighter-weight approach storing most data off-chain; publishing platforms like Mirror and Paragraph take a hybrid approach.  These are all high-quality projects serving different communities and use cases, and each built on different underlying technology stacks that inform their design.</p>\n\n\n\n<p>We are excited to see our portfolio company <a href=\"http://primitives.xyz\">Primitives</a> (founded by USV alum <a href=\"https://twitter.com/dgabeau\">David Gabeau</a>) launch their vision for on-chain social graphs via the <a href=\"https://blog.primitives.xyz/announcing-the-primitives-protocol/\">Primitives Protocol</a>. </p>\n\n\n\n<p>The Primitives app is a super fun, mainstream-oriented art collecting app built on Solana.  It’s growing fast, in large part because of the simplicity, cost and speed of transacting on the Solana blockchain.  Primitives has crossover mainstream appeal – most of the creators and collectors on Primitives don’t consider themselves to be “crypto-natives”.</p>\n\n\n\n<p>The Primitives protocol – a fully on-chain representation of a social graph – is built in a uniquely-Solana way, taking advantage of <a href=\"https://solana.com/news/how-to-use-compressed-nfts-on-solana\">compressed NFTs</a> to store an open-ended social graph on-chain in the form of a Merkle tree.   Both the Primitives app and the Primitives Protocol are built in a way that takes advantage of Solana’s integrated approach (our friends at Placeholder aptly describe this as more of an <a href=\"https://www.placeholder.vc/blog/2023/10/10/ethereum-and-solana\">iPhone vs Android approach</a>) that has the potential to be very well-suited to mainstream Web3 social use cases.</p>\n\n\n\n<p>We are excited to see the future vision of Web3 social continue to unfold, including the Primitives team’s vision for enabling a broad array of integrated social experiences in the Solana ecosystem.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/04/the-primitives-protocol/\">The Primitives Protocol</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"001391a37f5e9e494d650097105b5e166ae1e434b9b919284b438edebe3e7205","category":"default"}