{"title":"Apple Intelligence’s Transcriptions Are Very Good","link":"https://om.co/2024/11/04/apple-intelligences-transcriptions-are-very-good/","date":1730768008000,"content":"<p>I have been using MacWhisper for recording and transcribing my conference calls and interviews <a href=\"https://om.co/2023/06/19/why-i-love-macwhisper/\">for quite a while now</a>. I have also tried <a href=\"http://flowvoice.ai/\" target=\"_blank\">FlowVoice.AI</a> for using voice to respond to emails, text messages and do short dictations.  Now that I have upgraded to the latest version of the Mac operating system, today, I decided to put the new Apple Intelligence voice transcription to the test. </p>\n\n\n\n<p>I dropped an audio file with a 58-minute-long interview into a note I created in Apple Notes. Less than a minute later, the conversation was transcribed. I then clicked on the audio file and inserted the transcript into the current note. </p>\n\n\n\n<p>It did a great job of organizing the conversation — questions and answers — in a streamlined fashion. In general, it did a much better of formatting the text in a readable manner. A series of related comments showed up as a single paragraph. There was literally no difference in the actual text generated by Apple Intelligence and MacWhisper. I tried on some older files — the results were equally good. The voice memos app on the iPhone also does a great job of transcribing the conversations. </p>\n\n\n\n<p>While, in theory, MacWhisper should work with OpenAI more effectively, I have so many time outs that I stopped trying. I also encounter errors about the context window. Despite having an API, it never really works. As a result, I default to the built-in models. <br /><br />It pains me to say, considering my bias toward indie developers, but there seems to be no reason for me to open MacWhisper going forward.  Except for old habits, <a href=\"https://om.co/2023/06/19/why-i-love-macwhisper/\">and a soft spot for the app</a>. </p>\n\n\n\n<p><em>Addendum</em>: You can also dictate directly into notes, or if you want to record your interview, just hit the new “audio recording” icon in the Notes menu. You get very good results. However, apps, like FlowVoice do a much better job of summarizing a call or a dictation. </p>\n\n\n\n<p><em><strong>November 4, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"00d7f1df3cc353d362be1d9aa28e16f5ddf40edd715c9c703b5012fceca1b245","category":"Sites"}