{"title":"Elon Musk mind virus","link":"https://blog.webb.page/2024-11-13-elon-mind-virus.txt","date":1731369600000,"content":"<p>Trying to find a suitable tagline for this post is challenging. At first I\nthought \"emotional disability\" would work. Or maybe, \"empathetic disability\" but\nthe \"disability\" I'm talking about is voluntary, which would make it a choice.</p>\n<p>Voluntary retardation fits.</p>\n<p>Exhibit A<a href=\"https://archive.is/UUK7A#15%25\">1</a> from dwr.eth, creator of the Farcaster<a href=\"https://www.farcaster.xyz\">2</a> protocol<a href=\"https://docs.farcaster.xyz/learn\">3</a> and CEO of the\ncompany that builds Warpcast<a href=\"https://warpcast.com\">4</a>, the major client of said protocol:</p>\n<blockquote>\n<p>I’m anti-institutions. I think they are incompetent. Washington DC is at the\ntop of the stack.</p>\n<p>Plenty of coverage of Trump.</p>\n<p>I find mainstream liberals an easy target because they rationalize their\npolitical beliefs to an absurd level.</p>\n<p>Whereas average conservative is honest: I’m voting for the non-liberal\ncandidate. I don’t care about the rationale or logic.</p>\n<p>If average liberal: I’m voting because it’s my team and I don’t care about\nanything else, I would have more respect. Pure tribal affiliation. Politics is\nto help those you like and hurt those you don’t. Very Lindy.</p>\n</blockquote>\n<p>Wait, what?</p>\n<blockquote>\n<p>I’m voting for the non-liberal candidate. I don’t care about the rationale\nor logic.</p>\n</blockquote>\n<p>Wild. There is no point in life that you make decisions in a vacuum but for some\nreason, politics is viable.</p>\n<p>I find mainstream conservatives an easy target because they rationalize their\npolitical beliefs to an absurd level.</p>\n<p>Now, Dan is a smart guy. Quite intelligent, actually. His inability or refusal to\nclarify his own comments is interesting. He'd rather troll<a href=\"https://archive.is/19JCY#55%25\">5</a> and gaslight. He\nraised $150 million at a $1 billion valuation just six months ago. SIGH.</p>\n<p>These are the kinds of people who hope to become the next Twitter. It's quite\nclear Dan's space is not the place for me, so I exported<a href=\"/notes/006-export-farcaster.txt\">6</a> my data and dipped.</p>\n<p>It's funny that just a few days ago I was questioning my continued usage of\nFarcaster and now my account's deleted (but my profile is still up, maybe a cache\nthing, idk). I still have many friends and acquantices over there and I won't\njudge them for staying; everyone's tipping point is different.</p>\n<p>What I will say though is that the future (and especially the next four years) is\ngoing to test your patience and resolve. Personally, I will no longer be tolerant\nof intolerant views. Nor will I stay in places that aren't for me, if I can help\nit. The web is so much bigger than any one person and is WAY bigger than any Elon\nstan. There are already reports of Trumpers realizing what they voted for and\nfeeling immense regret. Let's see if it pays off for 'em<a href=\"https://www.youtube.com/watch?v=0gkC4i96QkA\">7</a>.</p>\n<p>🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"010403ef77dd484812fe48df583409a48b97d33f74ceb7c1844d55bc087cf358","category":"Sites"}