{"title":"Trump’s threat to let Putin invade NATO countries","link":"https://feeds.feedblitz.com/~/869769584/0/marginalrevolution~Trumps-threat-to-let-Putin-invade-NATO-countries.html","date":1707845719000,"content":"<p>I don’t usually blog on “candidate topics,”or “Trump topics,” but a friend of mine asked me to cover this.  As you probably know, Trump threatened to let NATO countries that failed to meet <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.washingtonpost.com/politics/2024/02/12/nato-countries-defense-spending-gdp-trump/\" target=\"_blank\">the two percent of gdp defense budget obligation</a> fend for themselves against Putin (video <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.youtube.com/watch?v=ZbGOS4PCTfo\" target=\"_blank\">here, with Canadian commentary</a>).  Trump even said he would encourage the attacker.</p>\r\n<p>Long-time <strong>MR</strong> readers will know <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.bloomberg.com/view/articles/2017-06-20/forget-caesar-shakespeare-has-another-role-for-trump?sref=htOHjx5Y\" target=\"_blank\">I am not fond of Trump</a>, either as a president or otherwise.  (And I <em>am</em> very fond of NATO.)  But on this issue I think he is basically correct.  Yes, I know all about backlash effects.  But so many NATO members do not keep up serious defense capabilities.  And <em>for decades</em> none of our jawboning has worked.</p>\r\n<p>Personally, I would not have proceeded or spoken as Trump did, and I do not address the collective action problems in my own sphere of work and life in a comparable manner (“if you’re not ready with enough publications for tenure, we’ll let Bukele take you!” or “Spinoza, if you don’t stop scratching the couch, I won’t protect you against <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.facebook.com/fairfaxcountyPD/photos/suspected-coyote-attack-in-annandale-a-dog-is-believed-to-have-been-killed-overn/1806162089425920/?paipv=0&amp;eav=AfZkzaPf_SiRp1-Uhxp0jDC84fIJBag6I15grt8cAOESE65VyHkL1id-yB_jNFeT_XY&amp;_rdr\" target=\"_blank\">the coyotes</a>!”).  So if you wish to take that as a condemnation of Trump, so be it.  Nonetheless, I cannot help but feel there is some room for an “unreasonable” approach on this issue, whether or not I am the one to carry that ball.</p>\r\n<p>Even spending two percent of gdp would not get many NATO allies close to what they need to do (and yes I do understand the difference between defense spending and payments to NATO, in any case many other countries are falling down on the job).  I strongly suspect that many of those nations just don’t have effective fighting forces at all, and in essence they are standing at zero percent of gdp, even if their nominal expenditures say hit 1.7 percent.  Remember <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.washingtonpost.com/news/worldviews/wp/2015/02/19/germanys-army-is-so-under-equipped-that-it-used-broomsticks-instead-of-machine-guns/\" target=\"_blank\">the report</a> that the German Army trained with broomsticks because they didn’t have enough machine guns?  How many of those forces are actually ready to fire and fight in a combat situation?  It is far from obvious that the Ukraine war — a remarkably grave and destructive event — has fixed that situation.</p>\r\n<p>The nations that see no need to have workable martial capabilities at all are a real threat to NATO, and yes this includes Canada, which shares a very large de facto Arctic border with Putin, full of valuable natural resources.  Even a United States led by Nikki Haley cannot do all the heavy lifting here.  What if the U.S. is tied down in Asia and/or the Middle East when further trouble strikes?  That no longer seems like such a distant possibility.  And should Western Europe, over time, really become “foreign policy irrelevant,” relative to the more easternmost parts of NATO?  That too is not good for anybody.</p>\r\n<p>With or without Trump’s remarks, we are likely on a path of nuclear proliferation, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://twitter.com/nexta_tv/status/1757303616182907025\" target=\"_blank\">starting in Poland</a>.</p>\r\n<p>People talk about threats to democracy in Poland, and I am not happy they have restricted the power of their judiciary.  But consider Germany.  The country has given up its energy independence, it may lose a significant portion of its manufacturing base, its earlier economic strategy was to cast its lot with Russia and China, AfD is the #2 party there and growing, and the former east is politically polarized and illiberal, among other problems.  Most of all, the country has lost its will to defend itself.  That is in spite of a well-educated population and a deliberative political systems that in the more distant past worked well.  You can criticize Trump’s stupid provocations all you want, but unless you have a better idea for waking Germany (and other countries) up, you are probably just engaging in your own mood affiliation.  On this issue, “argument by adjective” ain’t gonna’ cut it.</p>\r\n<p>The best scenario is that Trump raises these issues, everyone in Canada and Western Europe screams, they clutch their pearls and are horrified for months, but over time the topic becomes more focal and more ensconced in their consciousness.  Eventually more Democrats may pick up the Trump talking points, as they have done with China.  Perhaps three to five years from now that can lead to some positive action.  And if they are calling his words “appalling and unhinged,” as indeed they are, well that is going to drive more page views.</p>\r\n<p>The odds may be against policy improvement in any case, but by this point it seems pretty clear standard diplomacy isn’t going to work.  I am just not that opposed to a “Hail Mary, why not speak some truth here?” approach to the problem.  Again, I wouldn’t do it, but at the margin it deserves more support than it is getting.  Of course it is hard for the MSM American intelligentsia to show any sympathy for Trump’s remarks, because his words carry the implication that spending more on social welfare has an unacceptably high opportunity cost.  So you just won’t find much objective debate of the issues at stake.</p>\r\n<p>If you’re worried about Trump encouraging Putin, that is a real concern but the nations on the eastern flank of NATO are all above two percent, Bulgaria excepted.  Maybe this raises the chance that Putin is emboldened to blow up some Western European infrastructure?  Make a move against Canada in the Arctic?  I still could see that risk as panning out into greater preparedness, greater deterrence, and a better outcome overall.  Western Europe of course has a gdp far greater than that of Putin’s Russia. they just don’t have the right values, in addition to not spending enough on defense.</p>\r\n<p>So on this one Trump is indeed the Shakespearean truth-teller, and (I hope) for the better.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html\">Trump’s threat to let Putin invade NATO countries</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/869769584/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/869769584/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/869769584/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/869769584/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/869769584/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/869769584/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comment-160717539\">In reply to WB.   Exactly this. And after 2 decades in the EU, ...</a> <i>by JMCSF</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comment-160717514\">I dislike Putin and his goals as much as anyone. But have we ...</a> <i>by Tom C</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comment-160717509\">In reply to Hazel Meade.   As a Canadian I'm kind of irritated ...</a> <i>by drpgq</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comment-160717497\">In reply to Anonymous.   i like the Ruskies but the Holodomor ...</a> <i>by ged</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comment-160717483\">In reply to WB.   Towards the end Tyler said “If you’re ...</a> <i>by Kevin Postlewaite</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/trumps-threat-to-let-putin-invade-nato-countries.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/lithium.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=lithium\">Lithium</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/be-long-energy-infrastructure.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=be-long-energy-infrastructure\">Be long energy infrastructure, find the truly scarce input there</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/sticky-norms.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=sticky-norms\">Sticky norms</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"0146e7922dacd7b43251097f80708c8ea4bf8ca2495db2d85eb864de2d1db8cd","category":"default"}