{"title":"Siri Sucks, Even By Apple’s Numbers","link":"https://om.co/2024/10/23/siri-sucks-even-by-apples-numbers/","date":1729692757000,"content":"<p>The Wall Street Journal’s technology columnist Joanna Stern interviewed Apple software chief Craig Federighi (<a target=\"_blank\" href=\"https://l.threads.net/?u=https%3A%2F%2Fyoutu.be%2Ffr8ALcEiYAk%3Fsi%3DQQ_9htZDWonNMQaY&amp;e=AT2ubjdB3EHnJdYS-R584G51Z-hUcJ9dMl54jxcNDC7Gkq8MxKMHhp29qmf_Q5ix4zDyj0iVYO9Q6AJ-UohiV7PnZQtXDQaWbW0Q9Qp-Mj3aJANUTS4IbHPVfhrME3qTm8jfXwolHz54\">watch the interview</a>) ahead of the Apple Intelligence launch. <a target=\"_blank\" href=\"https://www.wsj.com/tech/personal-tech/apple-intelligence-3833c320?st=g7PRxL&amp;reflink=desktopwebshare_permalink\">It is a good chat</a>, but one bit caught my attention:</p>\n\n\n\n<blockquote>\n<p><strong>Joanna</strong>: Siri was introduced 13 years ago, which is kind of hard to believe. Is Siri gonna finally live up to that promise?</p>\n\n\n\n<p><strong>Craig</strong>: The journey never ends. Siri processed today, I think it’s something like 1.5 billion requests every day.</p>\n</blockquote>\n\n\n\n<p>If my memory serves me correctly, it’s roughly the same number Apple shared during the WWDC keynote. So, essentially flat. While 1.5 billion might appear big, when it comes to internet scale, it isn’t such a large number for a company the size of Apple. I looked up the number of active Apple devices. That number is estimated to be 2.2 billion devices — I assume this includes phones, computers, watches, headphones, TV-streaming devices, and speakers. So 1.5 billion requests a day is actually far less than <em>one daily request per active device</em>.</p>\n\n\n\n<p>I have most of Apple’s devices and rarely does Siri get any use. And when it does, it is when I have accidentally called up Siri on occasion. I wonder if Apple includes erroneous Siri requests in this number. The only time I really use it is to start a phone call or send a text message on the Apple Watch — even though at times it calls the wrong person or garbles the message because of my East Indian accent.</p>\n\n\n\n<p>In other words, I avoid Siri if possible. I have no such problems with any of the modern “voice” engines — though I know I’m compromising my privacy and giving them my voice samples for likely future abuse. Anyway, having used OpenAI’s voice interface, for example, I know what a good experience looks, feels, and sounds like. And Siri isn’t it. I <a href=\"https://om.co/2024/10/20/waiting-for-apples-intelligence/\">pointed this out in my post earlier this week</a>.</p>\n\n\n\n<p>Siri, no matter how you look at it is a 13-year-old product. It was born in an era before the emergence of current technologies such as LLM, which carry a lot of context and understanding. Siri is a good brand to build upon, but Apple needs to really jettison Siri-as-we-know-it and replace it with something more current, modern, and functional. </p>\n\n\n\n<p>Let’s hope Apple Intelligence helps Siri get a much-needed makeover.</p>\n\n\n\n<p><em><strong>October 23, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"015f2c0512aef0b6a96e6466b1723388b1979a6a8d4f010c61370cc8907d2adf","category":"Sites"}