{"title":"View.art","link":"https://www.usv.com/writing/2024/08/view-art/","date":1724430636000,"content":"<p>I have long been interested in displaying digital art on the walls in my home and office. I wrote this back in 2017 and this when we opened our new USV office in 2022.</p>\n<p>I have digital art running on off the shelf displays in many places that I live and work and it brings me endless joy. I also run view.art on the second screen on my desktop when I don’t need it for zooms and the like.</p>\n<p>Here is some digital art on the TV in our family room:</p>\n<p>https://opensea.io/assets/ethereum/0x0a1bbd57033f57e7b6743621b79fcb9eb2ce3676/35000046</p>\n<p>But there are issues with the tech needed to make all of this work and I’ve been eager for something simpler that would be easy for everyone to use.</p>\n<p>Today the Bright Moments community is opening view.art to the public and anyone can use it. USV has been an investor in the Bright Moments DAO for the last three years and I’ve watched them evolve the technology they use to put digital art on screens and make it better and simpler. View.art means that the technology that Bright Moments has used to run some of the most important digital art shows all over the world is now available to everyone.</p>\n<p>View.art allows anyone to run a digital art collection in a browser and showcase it on any screen that can be connected to a browser. The digital art needs to be “onchain” (aka NFTs). That makes the art publicly accessible because all onchain assets are.</p>\n<p>Here are some of my collections:</p>\n<p>https://view.art view.art Curate and showcase onchain art anywhere</p>\n<p>https://view.art view.art Curate and showcase onchain art anywhere</p>\n<p>The first one is a channel I made using view.art . The second one is the vault where I keep my favorite NFTs.</p>\n<p>If you have an old laptop or mac mini, you can connect that to a screen, fire up a browser, and show off your art.</p>\n<p>If you don’t have a spare computer to use, you might try a yodeck , which is a tiny raspberry pi computer we use at USV for our NFT screens, and put the view.art URLs into the yodeck dashboard and get them onto your screen that way.</p>\n<p>Many smart TVs have browsers in them and if you have one of those, you most likely can just put the view.art URLs directly into them.</p>\n<p>Of course, you can showcase art you don’t own as long as you know where to access it. View.art has already curated a bunch of collections on their home page.</p>\n<p>So if you want to showcase your digital art or someone else’s digital art on a screen in your home or office, I encourage you to try view.art . I think you will like it.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/view-art/\">View.art</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"0175231059ac6f405c2a59f57d9b128f5c870cbe8ad741a463f8343427de3137","category":"Sites"}