{"title":"the Michael Browne suits","link":"https://sive.rs/suits","date":1681516800000,"content":"<p>\nIn 2020, I was about to move to New York City.\nI wanted to get to know all of its ethnic enclaves, like visiting the whole world in one city.\nBut I know I have a tendency to stay at home, immersed in my work.\n</p><p>\nSo I made a rule for myself.\nIf I move to New York, I must not be home between the hours of 9am to 5pm.\nI would do all of my writing and reading in public places as a way of keeping myself out in the world.\nBut that meant thousands of hours of sitting in cafés, museums, libraries, and such.\n<strong>\nI might not be very welcome, unless I looked high-class.\n</strong>\n</p><p>\nI had been meaning to get nicer clothes anyway.\nI <a href=\"https://sive.rs/wds\">saw myself on stage</a> and realized my appearance no longer matched my self-image.\nMy friend <a href=\"https://cyber.harvard.edu/people/mwong\">Meng Weng Wong</a> had made a great argument in favor of <a href=\"https://sive.rs/led\">wearing a great suit</a>.\nNow I had two reasons.\n</p><p>\nActually I had three reasons, because I was living near London at the time, and realized this was my one-and-only chance to have a custom suit made on the famous <a href=\"https://en.wikipedia.org/wiki/Savile_Row\">Savile Row</a>, just to have that once-in-a-lifetime experience.\n</p><p>\nSo I nerded out for a week, spending a few hours a day reading books on the subject and watching a great YouTube channel called <a href=\"https://www.youtube.com/@SARTORIALTALKS\">Sartorial Talks</a>.\nIts creator, <a href=\"https://www.parisiangentleman.com/\">Hugo Jacomet</a>, is passionate and fascinating on the subject of well-made clothing.\nHe (and others) said that the best tailor in all of London is a man that used to work on Savile Row, but has surpassed it.\nThat’s the great <a href=\"https://www.michaelbrowne.eu/\">Michael Browne</a>.\n</p><p>\nI contacted Michael but he didn’t reply.\nSo I contacted Hugo Jacomet, and he very kindly introduced me to Michael, who agreed to see me the following week.\nMichael asked me about who I am, what I do, my self-image, my audience, my plans, and more.\nThen he picked a style and fabric and got to work.\nIt took six visits over six months before the suit was done.\n</p><p>\nHe asked what shirt I’d be wearing with it, and I said, “Whatever shirt you think I should wear.”\nHe told me to get <a href=\"https://www.johnsmedley.com/\">John Smedley</a> roll necks in sea island cotton, so I did.\n</p><p>\nHe asked what shoes I’d be wearing, and I said, “Whatever shoes you think I should wear.”\nHe told me to go to <a href=\"https://uk.linkedin.com/in/daniel-wegan-07006499\">Daniel Wegan</a> of <a href=\"https://www.instagram.com/catellashoemaker/\">Catella Shoemaker</a>, so I did.\n</p><p>\nWe did all of these fittings during the first round of Covid lockdowns, early 2020.\nIt was amazing to be in central London while it was completely empty, meeting at his atelier office, spending hours talking while he worked.\nWhen the suit was all done, he made a duplicate in a different fabric, so now I have two.\n</p><p>\nAnyway, due to Covid and family things, we didn’t move to New York City at all.\nMoved back to New Zealand instead.\nSo now I just wear my suits whenever I’m in public.\n</p>\n<figure>\n<img src=\"/images/MichaelBrowne.jpg\" alt=\"Michael Browne\" />\n<figcaption>photo of Michael Browne from <a href=\"https://robbreport.com/style/menswear/michael-brown-bespoke-tailor-london-2865718/\">Robb Report</a></figcaption>\n</figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"01da009ba66166c4ef066520ba7257340850cd0a793bea9c057e065be43e17ab","category":"default"}