{"title":"A Graph of Solar Eclipse Coolness: Totality or GTFO","link":"https://kottke.org/24/04/a-graph-of-solar-eclipse-coolness-totality-or-gtfo","date":1712073653000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/xkcd-eclipse-coolness.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/xkcd-eclipse-coolness.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/xkcd-eclipse-coolness.jpg 1200w\" loading=\"lazy\" width=\"1218\" height=\"650\" alt=\"A partial eclipse is like a cool sunset. A total eclipse is like someone broke the sky\" /></p>\n\n<p>As usual, XKCD is spot on with <a href=\"https://xkcd.com/2914/\">this graph of solar eclipse coolness as a function of distance from the path of totality</a>. The image’s alt text reads:</p>\n\n<blockquote><p>A partial eclipse is like a cool sunset. A total eclipse is like someone broke the sky.</p></blockquote>\n\n<p>See also <a href=\"https://xkcd.com/1880/\">the 2017 version</a>. After witnessing the 2017 total solar eclipse, <a href=\"https://kottke.org/17/08/my-2017-total-solar-eclipse-trip\">I wrote</a>:</p>\n\n<blockquote><p>We saw the Baily’s beads and the diamond ring effect. And then…sorry, words are insufficient here. When the Moon finally slipped completely in front of the Sun and the sky went dark, I don’t even know how to describe it. The world stopped and time with it. During totality, Mouser took the photo at the top of the page. I’d seen photos like that before but had assumed that the beautifully wispy corona had been enhanced with filters in Photoshop. But no…that is actually what it looks like in the sky when viewing it with the naked eye (albeit smaller). Hands down, it was the most incredible natural event I’ve ever seen.</p></blockquote>\n\n<p><a href=\"https://kottke.org/17/10/the-eclipse-was-not-black-but-some-other-color-that-screamed-evil\">Vi Hart</a>:</p>\n\n<blockquote><p>I’m not sure exactly what I expected, but this wasn’t it. I’d seen photos of coronas around suns, but this wasn’t that. And I’d expected that those photos, like many astronomical pictures, are long exposure, other wavelengths, and otherwise capturing things the naked eye can’t see. I thought there might be a glow of light in a circle, or nothing, or, I don’t know. What I did not expect was an unholy horror sucking the life and light and warmth out of the universe with long reaching arms, that what I’d seen in pictures was not an exaggeration but a failure to capture the extent of this thing that human eyes, and not cameras, are uniquely suited to absorb the horror of.</p></blockquote>\n\n<p><a href=\"https://www.theatlantic.com/science/archive/2017/08/annie-dillards-total-eclipse/536148/?gift=j9r7avb6p-KY8zdjhsiSZ9i5sABxUkd-MuMvHWmMY68\">Annie Dillard</a>:</p>\n\n<blockquote><p>I had seen a partial eclipse in 1970. A partial eclipse is very interesting. It bears almost no relation to a total eclipse. Seeing a partial eclipse bears the same relation to seeing a total eclipse as kissing a man does to marrying him, or as flying in an airplane does to falling out of an airplane. Although the one experience precedes the other, it in no way prepares you for it.</p></blockquote>\n\n<p>I am so looking forward to Monday and crossing my fingers for clear skies — the path of totality goes right over my house.</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/2017%20solar%20eclipse\">2017 solar eclipse</a> · <a href=\"https://kottke.org/tag/2024%20solar%20eclipse\">2024 solar eclipse</a> · <a href=\"https://kottke.org/tag/astronomy\">astronomy</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/Sun\">Sun</a> · <a href=\"https://kottke.org/tag/XKCD\">XKCD</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/a-graph-of-solar-eclipse-coolness-totality-or-gtfo\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"036a73883ee8cbc751eeef5c28d7af66842c4b53ebecbf3fee7aebd20655cd60","category":"default"}