{"title":"WWW: The Way We Were","link":"https://kottke.org/24/07/www-the-way-we-were-1","date":1722267050000,"content":"\n        <p><em>Note: There are some *major* unavoidable spoilers about the finale of season three of <a href=\"http://www.amc.com/shows/halt-and-catch-fire\">Halt and Catch Fire</a> in this post. If you’ve been watching (and you definitely should be), you might want to catch the finale first and then come back.</em></p>\n\n<p>The final two episodes of Halt and Catch Fire aired last night. The previous eight episodes of the season took place in the mid-1980s with Joe running something like Norton or McAfee in San Francisco, and Cameron, Donna, and Gordon running a dial-up service like Compuserve for playing online video games, chatting, and selling stuff on a nascent Etsy. In the 8th episode, a lot of that changed and the characters headed their separate ways.</p>\n\n<p>For the final two episodes, the show jumps forward to 1990, and in the last episode, Donna brings the four main characters (plus Cameron’s husband Tom, who works for Sega in Japan) back together to talk about a new and potentially revolutionary idea that’s crossed her desk at the VC firm where she’s now a senior partner: the World Wide Web. The five of them meet over two days, trying to figure out if there’s a business to be built on the Web — Joe argues metaphorically that they should build a stadium while Cameron says that no one’s gonna come to the stadium unless you have a kickass band playing (lack of compelling content) and then Gordon retorts that rock n’ roll hasn’t even been invented yet (aka there’s no network for this to run on). The discussion, some anachronisms and having the benefit of hindsight aside, is remarkably high level for a television audience…I doubt I could explain the Web so well.</p>\n\n<p>At the second meeting, Joe, who is a Steve Jobs / Larry Ellison sort of character, has had some time to think about the appeal of the Web and lays out his vision (italics mine):</p>\n\n<blockquote><p>Joe: Berners-Lee wrote HTML to view and edit the Web and HTTP so that it could talk to itself. The chatter could be cacophonous, it could be deafeningly silent. Big picture: What will the World Wide Web become? Short answer: Who knows?</p>\n\n<p>Donna: Ok, so what’s your point?</p>\n\n<p>Joe: It’s a waste of time to try to figure out what the Web will become, we just don’t know. Because right now, at the end of the day, it’s just an online research catalog running on NeXT computers on a small network in Europe.</p>\n\n<p>Cam: So, you’re saying everything we’ve talked about since we got here has been a waste of time?</p>\n\n<p>Joe: I’m saying let’s take a step back. Literally step back.</p>\n\n<p>Gordon: What is this on the board?</p>\n\n<p>Joe: It’s the code for the Web browser. </p>\n\n<p>Tom: And you wrote it all on the whiteboard.</p>\n\n<p>Donna: The online catalog of research?</p>\n\n<p>Cameron: Full of Norwegian dudes’ physics papers and particle diagrams and stuff?</p>\n\n<p>Gordon: And we care about this because why?</p>\n\n<p>Joe: How did we all get here today? The choices we made? The sheer force of our wills, something like that? Here’s another answer: the winds of fate, random coincidence, some unseen hand pushing us along. Destiny. How did we all get here today? We walked through this door. We don’t have to build a big white box or stadium or invent rock n’ roll. The moment we decide what the Web is, we’ve lost. The moment we try to tell people what to do with it, we’ve lost. All we have to do is build a door and let them inside.</p>\n\n<p>When I was five, my mother took me to the city. And we went through the Holland Tunnel and it was basic, concrete and steel, but it was also my excitement sitting in the backseat, wondering when it was going to be our turn to emerge, it was the explosion of sunlight. And when we exited the tunnel, all of Manhattan was laid out before us. And that was the best part of the trip: <em>the amazing possibility to be able to go anywhere within something that is magnificent and never-ending</em>.</p>\n\n<p>This is the first Web browser, the one CERN built to view and edit research. I wrote it up here for you to see how simple it is. It takes up one whiteboard — that’s basic concrete and steel — but we can take this and we can build a door and we can be the first ones to do it because right now, everyone else sees this…</p>\n\n<p>Donna: …as an online research catalog…</p>\n\n<p>Gordon: …running on NeXT…</p>\n\n<p>Cameron: …on a network in Europe.</p>\n\n<p>Joe: And with this handful of code, we can build the Holland Tunnel.</p></blockquote>\n\n<p>It’s <a href=\"https://www.youtube.com/watch?v=suRDUFpsHus\">Don Draper’s carousel speech from Mad Men</a>…but for the Web. And it hit me right in the feels. Hard. When I tell people about the first time I saw the Web, I sheepishly describe it as love at first sight. Logging on that first time, using an early version of NCSA Mosaic with a network login borrowed from my physics advisor, was the only time in my life I have ever seen something so clearly, been sure of anything so completely. It was a like a thunderclap — “the amazing possibility to be able to go anywhere within something that is magnificent and never-ending” — and I just knew this was for me and that it was going to be huge and important. I know how ridiculous this sounds, but the Web is the true love of my life and ever since I’ve been trying to live inside the feeling I had when I first saw it.</p>\n\n<p>Which is why this scene wrecked me so hard. The Web that they are talking about on the show, the open Web, is ailing, dying. It was like listening to a eulogy at a funeral, this thing that I love, poured the best of my self into, gone forever. Of course that’s not strictly true, the Web is still a fabulous place where anyone can set up a site to do, say, or sell whatever they want, but instead of the promise of <a href=\"http://www.smallpieces.com/content/preface.html\">small pieces loosely joined</a>, what we mostly got was large pieces tightly coupled. Today’s Web browsers and apps are Holland Tunnels that open up right into shopping malls instead of open city streets. Facebook makes it absurdly easy to start your own blog that all your friends and family can conveniently read, but you give up the freedom to say anything you want, it’s impossible to move those words elsewhere if you’d like (I’m talking with URLs and social graph intact), and they sell advertising against your words &amp; images and you don’t get a cut.</p>\n\n<p>Now, I’m not advocating a Make The Web Great Again policy because the open Web of the 90s had many problems, the greatest of which was a lack of access for anyone without the free time and skills necessary to set up a web server, install software, etc. etc., not to mention the expense involved. Today’s Web is much more accessible to people of all ages, backgrounds, and skill levels and as a result you see much more participation across the socioeconomic spectrum, especially in developing countries.</p>\n\n<p>But the open Web enthusiasts and advocates missed an opportunity to take what the Web was in the 90s and make that available to everyone. Instead of walled gardens like Facebook, Pinterest, and Medium (which echo the closed online services like AOL, Prodigy, and Compuserve that predated the Web), imagine a bunch of smaller services bound together with open protocols where individuals have both freedom and convenience. At this stage, building an open Twitter or open Facebook is nearly impossible, but it wouldn’t have been 10-12 years ago. I hope I’m wrong, but with all of the entrenched incumbents and money pumping into online services, I’m afraid that time has truly passed. And it’s breaking my heart.</p>\n\n         <p><em>[This is a vintage post originally from Oct 2016.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Halt%20and%20Catch%20Fire\">Halt and Catch Fire</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/TV\">TV</a> · <a href=\"https://kottke.org/tag/WWW\">WWW</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"03de68590948cd614985c94e046be5be2ee834af47ba47232db14c8da5387122","category":"default"}