{"title":"Hollywood's cheap AI fix won't work","link":"https://www.garbageday.email/p/hollywoods-cheap-ai-fix-wont-work","date":1711993453000,"content":"<div><div><h2>AI Is Probably Too Boring For Movies</h2><p>The new horror film <i>Late Night with the Devil </i>hit theaters late last month amid a lot of really good buzz. It has a <a href=\"https://www.rottentomatoes.com/m/late_night_with_the_devil?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">96% on Rotten Tomatoes</a> and has <a href=\"https://bloody-disgusting.com/movie/3805868/immaculate-and-late-night-with-the-devil-broke-records-for-their-distributors-in-the-same-weekend/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">broken box office records</a> for its distributor, IFC Films. It seemed poised to become the indie movie success story of the first half of 2024. But that buzz has curdled quite a bit once word started to circulate that generative AI had been used in the film.</p><p>And Letterboxd filled up with negative reviews. “Listen. There’s AI all over this in the cutaways and ‘we’ll be right back’ network messages,” reads one <a href=\"https://letterboxd.com/film/late-night-with-the-devil/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">top review</a> for the film. “Complacency in accepting AI now is complacency for AI in the future— a very bleak future. ,” <a href=\"https://letterboxd.com/jaragon23/film/late-night-with-the-devil/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">reads</a> another. </p><p>But the way AI was used in <i>Late Night with the Devil </i>is interesting because it highlights an often-undiscussed element of the tech: So far, it’s been deployed in pretty boring ways.</p><p>When you hear that a horror film <a href=\"https://www.fastcompany.com/90978537/ai-in-hollywood?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">used AI</a>, you might assume that it was in place of practical effects or traditional CGI, but that’s not actually true. <i>Late Night with the Devil</i> is full of your classic puppetry, blood, slime, and levitating objects. Instead, the AI images only appear on screen briefly.</p><p><i>Late Night with the Devil</i> is set on Halloween night in 1977 and follows a Johnny Carson-like late night host who ends up summoning a demon on live television. The movie is constructed like an episode of a talk show, and it cuts to ad breaks at different points throughout. It’s during these cutaways that the AI-generated images are used as <a href=\"https://variety.com/2024/film/news/late-night-with-the-devil-ai-images-clarification-1235947599/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">interstitial cards</a>. They’re basically just retro-looking pictures of skeletons with the fictional talk show’s name written on them. </p><p>(Even more curious, they appear to be a relatively new addition to the movie. According to viewers who saw its premiere at South by Southwest 2023, the AI-generated images weren’t in that earlier version of the film. Directors Cameron and Colin Cairnes <a href=\"https://variety.com/2024/film/news/late-night-with-the-devil-ai-images-clarification-1235947599/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">told </a><i><a href=\"https://variety.com/2024/film/news/late-night-with-the-devil-ai-images-clarification-1235947599/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">Variety</a></i>, “We experimented with AI for three still images which we edited further and ultimately appear as very brief interstitials in the film.”) </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6487b00c-5aa0-48eb-876a-4590215f62aa/Screenshot_2024-04-01_at_12.30.25_PM.png?t=1711989033\" /><div><span><p>(One of the AI title cards)</p></span></div></div><p>Last year’s WGA and SAG strikes were inspired by a bevy of challenges facing America’s entertainment industry, with AI <a href=\"https://www.fastcompany.com/90893629/hollywood-started-leaning-toward-automation-long-before-ai?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">cited as a chief concern</a>. And both WGA and SAG walked away with basic protections against AI encroaching on their livelihoods. But that hasn’t stopped the AI creep.</p><p>One TV editor I spoke with, who asked not to be named, told me that at their last job they <a href=\"https://www.adobe.com/products/premiere/ai-video-editing.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">were asked</a> by an executive to use Adobe’s new AI editing tool, which would have essentially replaced their job. They say that it was pitched to them as a way to automate a part of their work so they had time to “do more other stuff.”</p><p>“The excitement from the senior executive who brought it up was troubling,” they said.</p><p>And this is the main way viewers are encountering generative AI in movies and TV shows right now. Cheap filler used to speed up production or quickly fill in gaps.</p><p>All the way back in 2021, Marvel <a href=\"https://www.slashfilm.com/1356387/disney-created-digital-replicas-wandavision-extras-never-be-paid/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">was making</a> AI-generated replicas of extras to use in background of scenes of <i>WandaVision</i>. And last year, Marvel’s <i>Secret Invasion</i> used a custom Stable Diffusion model trained on original artwork to generate an eerie opening credit sequence (which, if you ask me, was one of the only interesting things about the whole show). Earlier this year, HBO MAX’s <i>True Detective: Night Country</i> <a href=\"https://www.theverge.com/2024/1/22/24047230/yes-apparently-thats-an-ai-generated-poster-in-true-detective?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">was caught</a> using AI-generated posters in one scene. And last month, R. Lance Hill, the screenwriter of the original <i>Road House</i>, <a href=\"https://variety.com/2024/film/news/road-house-writer-sues-amazon-ai-replicate-actors-voices-1235924407/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">sued Amazon Studios</a>, accusing them of copyright infringement and claimed that the studio used AI audio to do automated dialogue replacement during the SAG strike last summer. None of which are particularly exciting examples of this supposedly revolutionary technology. In fact, it all kind of sucks.</p><p>But it’s not just Hollywood executives dreaming of cheaper productions driving the AI entertainment boom. AI companies have quickly realized that Hollywood is the perfect place to shop around their newest models. <i>Bloomberg</i> <a href=\"https://www.bloomberg.com/news/articles/2024-03-22/openai-courts-hollywood-in-meetings-with-film-studios-directors?srnd=undefined&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">reported</a> recently that OpenAI is now actively pitching studios on their new AI video generator, Sora. But nothing I’ve seen so far has convinced me that Sora has any real utility beyond, once again, low-grade crap.</p><p>Which is certainly true in the case of <i>Late Night with the Devil</i>. The AI interstitials aren’t so awful that they break the whole movie — they’re only on screen for a few seconds at a time — but they do stick out like a sore thumb in a movie that is so clearly handmade, full of practical effects. Which is really the ultimate question when it comes to using AI. Is the quick fix worth it? And it’s likely many movie studios are about to discover it’s not.</p><p><i>This essay was co-published with the fine folks at Fast Company. You can read a longer version of it over on their site by </i><i><a href=\"https://www.fastcompany.com/91071900/ai-has-arrived-in-hollywood-its-a-lot-more-boring-than-you-might-think?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">clicking here</a></i><i>.</i></p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/cbb3a9cc-bce6-4c5e-8366-68f22bb212bd/Fujocoded_Frame_34__2_.png?t=1711980123\" /></div><p>Sad about the enshittification of the web? Wish there was something you could do to help bring about a better future?</p><p>For the past four years, we’ve been working within the transformative fandom community to understand the barriers in the way of people building online spaces for themselves. This experience led us to create a series of both small and large projects that chart a path towards a future where online subcultures take more control of their own experience on the web.</p><p>Last year, we took a bold step towards this future by fundraising for <a href=\"https://www.fujoweb.dev/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">The Fujoshi Guide to Web Development</a>. Today, we’re asking the internet to do what it does best: give us some of its seed (money) to help us formalize all we’ve been working towards under <a href=\"https://fujocoded.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">a real company with a real mission</a>!</p><p>Support <a href=\"https://www.backerkit.com/c/projects/fujocoded-llc/fujocoded-software-and-education-for-a-better-web?preview_token=pRP66u0ywMO&amp;ref=garbage_day&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">FujoCoded on BackerKit today</a> and help us cover our start-up costs, pay our lawyers, and launch our store so we can provide accessible web development education, open source software, and supportive communities to often marginalized online subcultures.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\"><span> Upgrade </span></a></div><hr /></div><h2>Good Post</h2><blockquote><p></p><p>*to the tune of We Didn't Start the Fire*</p><p></p><a href=\"https://twitter.com/kanesthename/status/1774230906951078148?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\"><p> — Kane Brough (@KanesTheName) <br /> Mar 31, 2024 </p></a></blockquote><hr /><h2><i>The New York Times</i> Is <i>Roblox</i></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/3a5fbe9d-798d-4412-ab52-2b1a3fa126b0/GJ_8FvKWMAAgoNs.jpeg?t=1711984664\" /><div><span><p>(SEC.gov/ValueAct)</p></span></div></div><p>The above chart was created by ValueAct Capital, a hedge fund that invests in <i>The New York Times</i>, and it ended up in <a href=\"https://www.sec.gov/Archives/edgar/data/1351069/000119312524062156/d809296dpx14a6g.htm?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">a recent SEC report</a>. <i>Semafor</i> <a href=\"https://www.semafor.com/newsletter/03/31/2024/how-to-keep-your-media-job?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">described</a> it as “remarkable,” and it’s been <a href=\"https://twitter.com/ballmatthew/status/1774413955940639199?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">making waves</a> on X and Threads all weekend.</p><p>If you can’t tell what you’re looking at, it basically shows that <i>The Times</i>’s news app has remained more or less flat since January 2020, spiking around the election and the January 6th insurrection in 2021. Meanwhile, <i>The Times</i>’s games app now appears to be more popular than, well, everything else the “newspaper” does.</p><p>I am very excited about this chart because, as I wrote last month, <i>The New York Times</i> is a <a href=\"https://www.garbageday.email/p/new-york-times-tech-platform-now?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">tech platform now</a>, but, specifically, they’re a gaming platform. Which I always suspected would be the Next Big Thing in digital media and I’ve been desperate for example of how it would work.</p><p>You can track stages of internet development by the evolution of the web portal. And the biggest publishers tend to operate downstream and also mimic those portals. In the read-only age of AOL and Yahoo, you had static news sites. In the search and social age of Facebook and Google, you had aggregation and viral media. And the new age coming into focus right now is almost certainly led by interactive entertainment platforms. Entire ecosystems built around videos and games. And, like it or not, the next Pop Crave will be inside of <i>Fortnite</i> or, possibly, own their own version of it.</p><hr /><h2>The Kate Middleton Truthers Think The Bench Video Was AI</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/f9c6b329-dd69-44a2-8afd-5cae5b1d504b/Screenshot_2024-04-01_at_11.47.37_AM.png?t=1711986473\" /><div><span><p>(X.com/@FourTomatoz)</p></span></div></div><p>I don’t want to dwell on this too much because I have written more about the royal family in the last few weeks than I’ve ever wanted to. But #WhereIsKate truthers are completely convinced that the video the Palace released of her revealing she has cancer was AI-generated. They’re particularly obsessed with <a href=\"https://twitter.com/kaiseratcb/status/1774537102656413955?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">her teeth</a>. First, as I alluded to in today’s top essay, AI-generated video and even lip syncing isn’t good enough to do what these people think it can do. And, also, even if it was, regardless of all the historic wealth hoarded by the British monarchy, they’re so bad at technology they can’t even use Photoshop correctly, as we saw recently.</p><p>The “evidence” conspiracy theorists are pointing to as proof that the video is totally fake is a disclaimer from Getty Images on the video which reads, “This Handout clip was provided by a third-party organization and may not adhere to Getty Images’ editorial policy.” Sounds sketchy? Sure, but what that is saying is that Getty did not film it. It could have been edited, lit cinematically, scripted, etc. But that doesn’t mean that the video generated by an AI. Because, once again, AI can’t do that (yet).</p><hr /><h2>Threads Is Still Not Very Good, Maybe Getting Worse</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4dbf9ed5-2061-41f3-a7f9-1c481865692b/Screenshot_2024-04-01_at_12.32.05_PM.png?t=1711989135\" /><div><span><p>(Threads/@owswills)</p></span></div></div><p>I came across <a href=\"https://www.threads.net/@witty_wang22/post/C4rkBSxo_0M?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">this fascinating Threads post</a> last week. A user named @witty_wang22 took a photo from a 2013 <i>Huff Post</i> article and passed it off as something that happened to them. Other users quickly <a href=\"https://www.threads.net/@owswills/post/C4trBbdogvf/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">noticed</a> this photo was a repost and the replies, of which there are thousands, are split down the middle between people saying some version of “why are you lying” and other people saying, “wow, humanity is amazing,” or whatever.</p><p>It’s a great example of what Max Read recently called “<a href=\"https://maxread.substack.com/p/threads-is-the-gas-leak-social-network?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">the gas-leak social network</a>,” but it’s also a terrific picture of what Meta has been building behind the walls of its closed-off ecosystem for the last 20 years. This is the core Meta experience across all their apps. It’s also a perfect display of where Threads is at as a social network right now. A Carnival cruise ship’s worth of typical Meta posters — context-allergic boomers that sometimes <a href=\"https://www.garbageday.email/p/why-do-facebook-users-keep-commenting?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">literally pray</a> to chain letters and memes — and an upper layer of bewildered journalists who spent the last 15 years on Twitter ignoring these people.</p><hr /><h2>This Is The Powerful Chinese Cyber Weapon Congress Is So Afraid Of</h2><blockquote><p></p><p>There's this TikTok challenge where people are pouring their hearts into mastering the phonetics of this Chinese song and delivering a dramatic performance.</p><p></p><a href=\"https://twitter.com/manyapan/status/1774275635105464773?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\"><p> — Manya Koetse (@manyapan) <br /> Mar 31, 2024 </p></a></blockquote><p>The new big trend on TikTok is lip-syncing to the song “This Life’s Fate,” by Chinese singer Chuan Zi. As Chinese internet culture blog <i><a href=\"https://www.whatsonweibo.com/the-chinese-viral-tiktok-song-explained-no-its-not-about-samsung/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">What’s On Weibo</a></i> explains, Americans have been calling it the “Samsung” song because it features the Mandarin word, “cāngsāng” (沧桑), which westerners think sounds like the phone brand. It means “ups and downs.”</p><p>This isn’t the first time a piece of Chinese internet culture has turned into a meme in the States recently. Back in December, a clip of a CGI beaver performing a dramatic monologue in Cantonese went viral on English-speaking TikTok after getting uploaded to Chinese video-sharing platform Bilibili. The original audio from the beaver video was from a Hong Kong action movie <a href=\"https://www.complex.com/pop-culture/a/backwoodsaltar/chinese-beaver-meme-internet-in-feels?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">called </a><i><a href=\"https://www.complex.com/pop-culture/a/backwoodsaltar/chinese-beaver-meme-internet-in-feels?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">A Better Tomorrow</a></i>.</p><p>China’s soft power is getting too effective! We’ve got to pull the plug and save America’s youth from being exposed to dangerous pop songs and cartoon beavers.</p><hr /><h2>I Think This Is An April Fools Thing, But It Should Be Real</h2><blockquote><p></p><p>Announcement: Saori’s got the head. Hideki’s got the body. Together they make one capybara! Are they destined soulmates? Follow the Barahumans as they navigate love’s murky waters. My Capybara Soulmate drops Fall 2025.</p><p></p><a href=\"https://twitter.com/VIZMedia/status/1774829284248396016?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\"><p> — VIZ (@VIZMedia) <br /> Apr 1, 2024 </p></a></blockquote><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.deezlinks.com/p/menswear-is-a-spindly-glory-hole?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">“Menswear is … a spindly glory hole that, if you dare jam your dick in, tickles for a second but mostly makes you feel broke and sad”</a></p></li><li><p><a href=\"https://slate.com/human-interest/2024/03/costco-vodka-kirkland-wirecutter-best-taste-grey-goose.html?pay=1711983721586&amp;support_journalism=please&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\">“Why Is the Best Vodka From Costco?”</a></p></li></ul><hr /><p><span>P.S. here’s</span><span><a href=\"https://www.tiktok.com/@streetpizzallangollen/video/7343905593528257824?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-s-cheap-ai-fix-won-t-work\" target=\"_blank\"> some good kebab shop content</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=8a5b5e78-27a3-4e08-a918-77bbcbb11db6&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"03dec14eee6e2b5957402e7923249d3ed41d361d8fafa108d5dfc25114b34e9a","category":"default"}