{"title":"Portugal. The Country","link":"https://www.usv.com/writing/2024/08/portugal-the-country/","date":1724241845000,"content":"<p>We just had a family vacation in Portugal. Last summer, we took our kids to Italy for two weeks and showed them Rome, Umbria, and Sardinia. It was a magical trip so we decided to do it again and this time traveled across Lisbon, Algarve, and Santa Cruz for roughly ten days.</p>\n<p>There are so many things to love about the country. Some that stood out to me on our trip:</p>\n<p>The beaches are beautiful, serene, and remarkably clean. Even on the most crowded of beaches, I don’t think I saw a single piece of trash on the ground.</p>\n<p>The view from one of our favorite restaurants, Bronzear A beach in Algarve The climate and topography very much remind me of California. The Santa Cruz area is like Big Sur with big cliffs that drop into the ocean. There are beaches here that are totally deserted and wild and make you feel like the last person on earth.</p>\n<p>The view atop the cliffs at Praia do Seixo Surfing in Santa Cruz is a super fun family experience, even in the cold water</p>\n<p>Like most of Europe, the food is meaningfully different than the US. I am rather disgusted by our domestic food system. It costs an arm and a leg, and it’s practically a full-time job to be able to heat healthy whole foods and avoid processed poison. I feel great after meals in Europe, and Portugal has delicious, fresh and affordable food all around. The seafood is incredible.</p>\n<p>One thing I really like is how rest stops on the highway have delightful restaurant-like areas with terrific food you can either grab to go or comfortably sit and eat there. They also have quaint outdoor picnic areas. It was a delight to see a service stop be idyllic.</p>\n<p>I barely noticed a police presence anywhere, and at no point did we feel unsafe in Lisbon (which was crowded). We maybe saw two groups of police officers in the city.</p>\n<p>Portuguese fashion is awesome and places a focus on sustainability and quality. It’s now up there for me with Japanese apparel, and I am going to go out of my way to shop for Portuguese brands. There are tons of cool stores and places to shop in Lisbon, and street art is part of the culture.</p>\n<p>Crack Kids, a store devoted to street art in Lisbon August is becoming impossibly hot to travel in Europe. We will likely do these trips in June and early July to avoid the heat and the crowds.</p>\n<p>I am looking forward to returning to Lisbon and exploring other parts of Portugal like the Douro Valley and Silver Coast. I really love our annual summer Europe trip and im glad it’s now a tradition of ours.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/portugal-the-country/\">Portugal. The Country</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"042210744174c350f495ab0de4499226db7632200c709e3f07fbfc56cd4c71d9","category":"default"}