{"title":"Things I learned from my parents","link":"https://blog.webb.page/2022-04-24-things-i-learned.txt","date":1650758400000,"content":"<p>When you're a kid, the people you look up to tend to be your own parent(s)/\nlegal guardian(s). The older you get, the more you realize your parents and\nother adults are very much floundering, trying to figure things out. As your\nown life experiences grow, you may look back on your childhood with resentment\nand wonder if your parents were intentional in their harm, or oblivious. I've\nspent far too much time dwelling on the past and keeping grudges. An\nunfortunate truth that's gotten me past that is realizing my parents most\nlikely do not remember how their actions and/or words affected me. While I'm\nsimmering over events that transpired a decade or more prior, they're living\ntheir lives — watching TV, doing laundry, figuring out what to eat, &amp;c.</p>\n<p>I know now I was willingly engaging in mental self-harm.</p>\n<p>Yesterday, I had a bit of back-and-forth with my father about COVID-19 in the\nfamily group chat. Mask mandates, vaccine effectiveness, \"narratives,\" \"COVID\nfear messaging and marketing,\" the works. Needless to say, the conversation\ndevolved into petty remarks so I stopped responding (ironically, my father\nstated he wanted respect for his views while gaslighting me for mine, but\nI digress).</p>\n<p>I won't lie, the conversation bothered me. It feels like I lost my father to\nFox News and conspiracy websites with dubious sources, one of which he\npresented as wholly factual and apparent proof of my idiocy.</p>\n<p>My relationship with my parents have not been the best but in recent years I've\nbeen trying to work through my issues with being close to them for the reasons\nmentioned at the top of this post. But uh, wow…it was relatively easy to slide\nback into those negative thoughts I used to have. Too easy.</p>\n<p>I awoke today, refreshed and, thinking about how I used to see my parents when\nI was a young kid. After all, I <strong>am</strong> a product of their teachings,\nintentional and otherwise.</p>\n<p>What I learned from my father:</p>\n<ul>\n<li>It takes two people to argue (the irony is not lost on me).</li>\n<li>Ensure doors and windows are closed and locked before heading to bed.</li>\n<li>There are no new problems in the world. If you have a problem, someone's\nwritten a book about it.</li>\n<li>Look someone in the eye when shaking their hand.</li>\n<li>If you have something to say, be clear. Say it with your chest.</li>\n<li>Hard work and dedication is how you get things done.</li>\n<li>Being responsible is the single best trait you can have.</li>\n<li>Games are good.</li>\n</ul>\n<p>What I learned from my mother:</p>\n<ul>\n<li>Don't ever let someone tell you you can't do something.</li>\n<li>To say \"I'm sorry\" is to say, \"I'm a sorry person.\" \"I apologize,\" is better.</li>\n<li>Art is good.</li>\n<li>Techno is good.</li>\n<li>Be yourself.</li>\n</ul>\n<p>What I learned from both my parents:</p>\n<ul>\n<li>Parenting doesn't end just because a marriage does.</li>\n<li>No one escapes consequences.</li>\n<li>Every person in the world is trying their best with the cards they're dealt.</li>\n<li>Racism sucks, is stupid, and definitely doesn't make sense. Especially since\nBlack people built this country (America).</li>\n<li>I can do anything I put my mind to.</li>\n<li>The truth shall set you free.</li>\n</ul>\n<p>We are all shaped by the experiences life either politely sends or violently\nthrows our way. Much of the sadness we feel when thinking of the past is the\nfact that the people we miss from back then are not the same people we know\nnow. Sure, they may respond to the same name, and may even have the same phone\nnumber, but we are all changing, all the time.</p>\n<p>For better or worse. 🕸</p>\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"05109ba2dbabefbed39451e1d1edf583404d8db690c3f4bab3025ef33c04b8cc","category":"Sites"}