{"title":"sharing your work as creative release","link":"https://keningzhu.com/journal/sharing-your-work-as-creative-release","date":1723148220000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/10-sharing-your-work-as-creative-release/id1731169431?i=1000664762121\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/3AfL7o3sYJ7JC4T00WrNMQ?si=e38375d3e9074ef6\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>on a radically different way to relate to sharing your work on the internet — how to see sharing as <em>a part</em> of the creative process, not separate from it. I’ll explore the shifts in perspective that unlocked the act of showing up as myself, in public. we’ll explore:</p><ul><li><p>emotional resistance to sharing your work — swimming through feelings of overwhelm, creative stuckness, and guilt.</p></li><li><p>sharing as being in energetic flow with the world</p></li><li><p>sharing as creative release &amp; death cycle</p></li><li><p>sharing as cultivating creative self worth</p></li><li><p>sharing as an act of surrender</p></li><li><p>my 4 guidelines for more effortless and easeful sharing</p></li></ul><p>I’ll explain why I think sharing your work is NOT about the audience, or for “the other” — it’s first and foremost — for ourselves, and our creative flow. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/a557d508-88bb-4563-b4a8-9185410a0ac6/ep_10._8-8.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction</h1><p><em>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet. My name is Kening and I'll be your guide.<br /></em></p><p>In the last episodes, I started talking about the value of process and practice over emphasizing product and end results -- and how essential it is to commit to making art independent of whether or not anyone is watching.</p><p>This week, I want to explore this from another perspective.</p><p><strong>That is, if creativity is all about process, then why is finishing a creative project important?</strong></p><p>Why is the act of sharing your work important?</p><p>As in, why can't you just keep all of your creative projects in a secret folder on your hard drive?</p><p>I'll explore the symptoms of what it feels like to not share, to feel creatively clogged, which I've experienced for so many years.</p><p>And I'll reframe reasons, motivations for sharing in four different ways.</p><p>And these four different perspectives are the way I think about sharing that has truly helped me commit to sharing, not from a sense of obligation, but from a sense of purpose.</p><ol><li><p>Number one is <strong>sharing as energetic flow with the world.</strong></p></li><li><p>Number two is <strong>sharing as creative release and completing a cyclical process.</strong></p></li><li><p>Number three is <strong>sharing as nurturing creative self-confidence and self-worth.</strong></p></li><li><p>And number four is <strong>sharing as an act of surrender.</strong></p></li></ol><p>I think crucial to these four different perspectives looking at sharing is to think of the creative self as a channel for greater inspiration or energy to flow through you, rather than thinking of sharing as shipping a product, putting the product on the market and see how people respond to it.</p><p>I think especially as sensitive creative souls, the idea of shipping something and allowing it to be judged by others creates resistance.</p><p>I wanna take this episode to reframe sharing as a way of empowerment and then explore four different guidelines for how to share with more ease and effortlessness.</p><p></p><h1>the feelings of not sharing</h1><p>So let's start with the problem, the feeling of being creatively clogged.</p><p>What it feels like is having all of these half-finished things lingering in the atmospheric space of your psyche and a huge reason for not sharing is perfectionism, the feeling of not being ready to share.</p><p>And then it's exacerbated by the feeling of overwhelm.</p><p>Like there's too many things, there's not enough energy left to share the thing, to complete the thing.</p><p>And if you're like me, I just get overwhelmed and want to do nothing.</p><p>Because the idea of sharing is always seemingly tied with the other, the person that's receiving what you share on the other end.</p><p>The feeling of not sharing might manifest as first this vulnerability and shyness and pressure and then guilt for not showing up, a sense of embarrassment.</p><p>And it oscillates between this fear of disappointing your readers or your audience and fear of showing up in the first place.</p><p>An example of this is ghosting your newsletter and being overwhelmed by something, not writing.</p><p>And then once you do feel like it's time to write and share something, you're too embarrassed to show up.</p><p>Like how can I face these people after?</p><p>I haven't spoken to them in weeks or months.</p><p>And trust me, that was me, like just last year.</p><p>I've been able to find a rhythm of consistency since then and to be more gentle to myself when I fall off rhythm.</p><p>And I would say, yes, there are systems and processes that have helped me create this consistency, but more important is the shift in perspective that we'll explore today.</p><p></p><h1>who is sharing for? </h1><p>And I think the crucial reframing for this is to think of <em>sharing as NOT for the other.</em></p><p><strong>Sharing is first and foremost for yourself.</strong></p><p>It's for your own creative metabolism.</p><p>It's for your own relationship to spirit, to energy, to your work and your business.</p><p>What was paradigm shifting for me was to think of sharing as completing the creative exhale, as in I can't hold my breath for more than a couple of days or perhaps a couple of weeks.</p><p>If I do, I will feel this inner implosion.</p><p>And so the exhale, the release is so crucial for renewing creative energy.</p><p>So let's unpack this reframing.</p><p></p><h1>sharing as energetic flow with the world</h1><p>Number one is sharing as energetic flow with the world.</p><p>And this one is the most obvious.</p><p>This is really about sharing as a way of nurturing wealth.</p><p>And when I say wealth, I don't just mean money and business.</p><p>I mean that when you share, you're giving your inner wealth.</p><p>You're giving your resources of insight, creativity, wisdom, knowledge.</p><p>Sharing is a prerequisite to being in energetic flow with the world.</p><p>If you desire your creative work to sustain your material life, then it must exist in the world where it can interact with other people and impact other people.</p><p>The more you share, the more you become a public creative as a form of giving of yourself, the more you'll receive energy, visibility, opportunities, connections, customers, and money in return.</p><p>Sharing as energetic flow is a really powerful business motivator.</p><p>But for me personally, I think this reason is not quite enough.</p><p>Because in this perspective, it's a little bit easy for sharing to feel like a means to an end, rather than an end in itself.</p><p>You feel obligated like I must share in order for my business to work.</p><p>And that is so true, but it's easier said than done.</p><p>And so for me personally, I needed to reframe sharing as a practice that is so deeply integrated with my creative process, rather than separate from it.</p><p>So that sharing can feel joyful, effortless, and easeful for me.</p><p></p><h1>sharing as creative release</h1><p>And so this brings me to the idea of sharing as creative release.</p><p>That is the completion of a cyclical process.</p><p>I think of process as always ongoing.</p><p>However, process is also iterative.</p><p>It also happens in seasons and cycles.</p><p>You don't complete one line of a project trajectory from A to B.</p><p>You complete one circle and then decide it's done at a certain place on that circle.</p><p>It helps me to think about it in terms of seasonality.</p><p>So if your creative process were divided into four seasons, spring as the energy of excitement and the new vision, new ideas, summer as the full flow of creation, autumn is about harvesting and allowing death.</p><p>And then winter is a sort of hibernation and rest.</p><p>In this seasonal framework, sharing would be autumn.</p><p>Sharing is a sort of creative death and release, because it's the end of one cycle.</p><p>It's allowing the idea to be born from a seed, to grow through the summer.</p><p>And then the act of sharing is to surrender it into the collective consciousness, in this case, probably the internet.</p><p>This is a kind of creative death because it's no longer inside your system only.</p><p>It's birthed from you.</p><p>Whether or not that idea or creation is seen or acknowledged is a whole separate thing.</p><p></p><h1>sharing as nurturing creative self worth  </h1><p>The third reframing is sharing as nurturing, creative confidence and a sense of self-worth.</p><p>Speaking from personal experience, my perfectionism can be a positive asset in terms of my attention and dedication to craft and detail orientedness.</p><p>But I think on the flip side, there's also this unconscious belief that my perfectionism could save me from judgment or rejection.</p><p>Once my work is out in the world.</p><p>And I think for many of us, allowing ourselves to be seen in the world through our work, our true work, not the things that perhaps our culture or society or family have praised us for in the past, to be seen for our true work can feel deeply threatening and scary, especially for the nervous system at the very beginning.</p><p>And so the act of sharing is to say to yourself and especially to your inner artist child that it's safe to be seen.</p><p>To share is to strengthen this muscle within you, this creative muscle where you know each time you share that you're allowed to be your creative, wild self in the world and nothing bad will happen.</p><p>No one will grade you for this.</p><p>This sounds really basic, but I think these beliefs are built in at a very root level that sometimes we're not even conscious of them.</p><p>And the question I ask myself sometimes here is, if I felt completely safe in my creativity, what would I create and want to share?</p><p>After you've practiced and strengthened this muscle, that is embody the practice of sharing, you move past the place where you're afraid of judgment.</p><p>And I think sometimes we're afraid of judgment without even realizing it, or we're afraid of our own pressure that we've put on ourselves for something to give us results, to give us a sense of safety, to allow us to quit our day jobs.</p><p>And sharing your work is such a crucial juncture point of letting your work be in the world, letting it be seen.</p><p>And then being curious about what feedback you receive.</p><p>The feedback you receive is about being in conversation with the other.</p><p>It's about listening to the ripples of your work, the echoes that come back to you from the wilderness.</p><p>At the beginning and throughout the process, nurturing the act of sharing is first to say, I believe in my creative worth.</p><p>I am confident in myself and my creativity.</p><p>Enough that I feel safe, not only to not hide, but to be me, that I'm willing to be public.</p><p>And I think to ground yourself in that belief is to move you from sharing with a need to prove, to sharing from a place of self-love and personal power.</p><p></p><h1>sharing as creative surrender   </h1><p>The fourth way of reframing sharing is to think about sharing as creative surrender.</p><p>And crucial to this concept is to really think about the creative self, not as the artist tied to their identity, owning all the ideas that come through us, but instead to think of ourselves as channels.</p><p>That is a creative idea sparks within us.</p><p>We are tasked or we task ourselves with the process of feeding, nourishing and giving birth to it.</p><p>And then the process of autumn, of death, of release is about letting go.</p><p>It's releasing these ideas into the world where it belongs no longer just to us, but to the collective soup of consciousness.</p><p>I think crucial in this concept is to reframe the idea of possession, of attachment, as in your job as a creator is to be a temporary vessel for beautiful ideas, to not hoard inspiration, but instead to be a channel through which something greater can flow through you.</p><p>And at a deeper level, this is about the difference between a scarcity versus an abundance mindset towards creative energy.</p><p>Whatever you create, there's more of that where that comes from.</p><p>And in talking about sharing as surrender, mostly as an inner framework, a way to relate to your own process, as in the more that you complete a project, the more that you share it, the more you metabolize creativity and life, the more you find your own rhythms.</p><p>And as creative energy can trust itself, as you trust yourself to move the creative energy through you, the more it will come.</p><p>And thus the process of releasing and sharing a project is not about the need to have something to show to the other.</p><p>It's about aligning yourself, aligning your creative rhythms and metabolism to its fullest expressive flow.</p><p>And I find that when I'm in this state of being, I just feel like all of my pores are open.</p><p>I can fully receive, fully absorb.</p><p>And after I've released, I just feel the sense of great satisfaction and clarity and oneness with my purpose.</p><p></p><h1>four guidelines for sharing </h1><p>So in the second part of this podcast episode, I wanna share four guidelines for how to share with more ease.</p><p>This is going to be a very big picture overview.</p><p>The first thing is to think about creativity in terms of energy flow and containers.</p><p>Energy is your fuel or the flow, the source, the electricity that wants to create something.</p><p>And the containers is where that energy goes.</p><p>So all of my guidelines and suggestions are going to be around paying more attention to your energy and simplifying your flow.<br /></p><h1>#1 - simplify sharing containers </h1><p>Guideline number one is to simplify your sharing containers.</p><p>Having too many containers, as in trying to be on too many platforms.</p><p>There's a lot of FOMO around, okay, maybe I'm on the wrong platform, therefore I need to spread my eggs into different baskets.</p><p>But ultimately I find that it really complicates the process and especially when you don't have clear rituals for each container and a clear reason to be on these different platforms.</p><p>It's a recipe for paralysis and overwhelm.</p><p>So my suggestion here is to choose one or two sharing containers if you're starting out.</p><p>And as you build more ease, figure out containers that feels aligned and manageable for you.</p><p>Personally, I have three containers, that is my website, my podcast, and my newsletter.</p><p>I'm not on any other platforms, social media or sub-stack, and I will explain why in a later episode.<br /></p><h1>#2 - clarify rituals &amp; systems </h1><p>Guideline number two is to clarify your rituals and systems.</p><p>Rituals are any sort of creative rhythm or sharing rhythm that can help you move forward even when your creative flow isn't feeling it.</p><p>So if you're having a long day and feeling overwhelmed, it's much easier to go through the motions of a ritual than to try to reinvent how you're going to share something every single time.</p><p>So this is really about repeating the process enough times to build a system, a step-by-step flow that you can iterate and improve over time.</p><p>And I've slowly cultivated my own rituals and processes for each season of the creative process.</p><p></p><h1>#3 - attune to creative energy </h1><p>Guideline number three is to attune to creative energy.</p><p>That is to be curious about how your creative energy ebbs and flows rather than demanding it to be extremely constant and consistent like a machine.</p><p>Instead, to think of it as water.</p><p>There's changing weather patterns to water.</p><p>There's different rhythms and flow rates, and that can depend on your body, how you're feeling.</p><p>Sometimes your creativity feels like a desert.</p><p>Sometimes I feel dry and bored and empty of inspiration.</p><p>Other times it feels like a stream or a river or like riding a tsunami wave of energy.</p><p>It has its own force.</p><p>It has its own sense of direction and momentum.</p><p>And the typical way to think about completing a project is to time slot it into the same 90-minute blocks three days a week or five days a week.</p><p>But I'm suggesting to start the process of observing your creative energy as its own entity to know that if you are in the wild flow of summer where you have a lot of creative energy, perhaps you could create in three hours what would have taken you two weeks to create.</p><p>The creative process is not linear.</p><p>And so the skill and practice here is to be able to tune in, to be sensitive enough to your energy, to be aware of the fluctuation and to ride the flow.</p><p>Then you're able to offer nourishment in these different phases or seasons to be patient with it when it wants to hibernate and to ride the momentum when it's at a peak.</p><p></p><h1>#4 - face your shadow resistance</h1><p>My fourth guideline is to face your shadow and sources of resistance.</p><p>I think many of us, especially if you're more of the introverted hermit type, have deep fear of being seen.</p><p>As in it's safer to hide in the shadows where no one will look at us, no one will judge us.</p><p>And this is especially hard when it's combined with a sense of perfectionism.</p><p>Perfectionism is to always move the finish line so that we never quite reach it.</p><p>We're never quite enough.</p><p>Your shadow resistance could come in so many different forms.</p><p>For me, there's a wild extreme, simultaneously a fear of rejection as an inner child in the world.</p><p>And this sort of rebelliousness, like I don't need to show you this because I don't need your approval anyway.</p><p>You wouldn't understand what I'm creating anyway.</p><p>That oscillates with the fear that if I share this and it doesn't get the outcome I secretly desire, then it means nothing I create is enough.</p><p>Then it means nothing I am or do is enough.</p><p>These subconscious beliefs can be such a slippery slope and it's so individual for each person.</p><p>So in facing your shadows, in facing your resistance, I would ask yourself, journal about this.</p><p>If I show myself unfiltered and true and authentic in my creativity, what is the worst thing that can happen?</p><p>What within me is resisting sharing my work?</p><p>What's resisting being seen?</p><p>How can I make that part of me feel safe?</p><p></p><h1>closing thoughts </h1><p>So in closing this episode, I wanna reiterate how I've been reframing sharing, not as completing and shipping a project so that it can be judged by an invisible other, but instead as being in energetic flow with the world, as creative release and completion, as nurturing self-confidence and worth, and sharing as an act of surrender.</p><p>The more we share, the more that we give value to our creativity to exist in the world.</p><p>Sharing is first and foremost for ourselves.</p><p>It's to let our ideas out and to let them have a life of their own.</p><p>Sharing is not something that follows after the fact of the creative process.</p><p>Instead, it's deeply integrated.</p><p>It is the death and completion cycle, the autumn of the creative seasons.</p><p>And when we think of the self as a creative channel, there's a sense of surrender in the process, a sense of trust in our own metabolism, in inspiration to continue to flow through us.</p><p>It's allowing things to be ongoing, allowing ourselves to be a work in progress, always evolving and changing.</p><p>And the more we give, the more we hold and release our creative energy, the more we'll receive in creative energy, in relationships, in material energy back into our worlds.</p><p>And so I hope this episode inspires you to think about sharing not out of pressure or guilt or obligation, but instead to approach it as an embodied practice of allowing yourself to be seen first and foremost by yourself, by the universe, by creative spirit, by life, and then by the other.<br /></p><p>~</p><p><em>Thank you, creative friends, for being here and for listening.</em></p><p><em>You can find more of my work on my website world, keningzu.com.</em></p><p><em>I also send a weekly newsletter on creative alchemy called \"Guide Notes\"</em></p><p><em>I'll look forward to speaking to you again soon.</em></p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"05e1f31b7dd49fc8b01f1833c1de380d46f6779ced85fbc5ac26f1ef45ef5fa8","category":"Sites"}