{"title":"Going on a Voyage","link":"https://www.usv.com/writing/2024/06/going-on-a-voyage/","date":1717625565000,"content":"<p>Growing up in Germany my parents and I would spend two weeks every summer going to the Chiemsee to sail. We stayed at Gästehaus Grünäugel in Gstadt (no that’s not the resort in Switzerland ). I learned how to sail from my Dad who was self-taught. Thanks, Dad!</p>\n<p>It was a ton of fun to be out on the water and I also built a deep association between sailing and vacation. What a great way to take one’s mind off things! I wound up not sailing during college and for quite a few years after that. But then on a family vacation in the BVI I took a Hobie Cat off the beach and was immediately hooked again.</p>\n<p>Susan and I were living in Scarsdale at the time, which is only 20 minutes from Larchmont and the Long Island Sound. We also discovered that friends of ours belonged to the Larchmont Yacht Club . We took the plunge and bought a J100 (admittedly a J100 was the only boat we test sailed and I may or may not have loved it so much that I charged ahead and bought one).</p>\n<p>We have spent many wonderful moments on Galatrona since. Sailing on the Sound with Manhattan in the background is delightful. We have also brought her out to Montauk a few times, where there is always wind. With every year of sailing I also remembered how as a child I had devoured the Horatio Hornblower series of books. The adventure of being at sea and braving storms seemed ever so exciting. I started following various ocean races online (the New York Vendée is on right now ). And out of all this came an idea: what about an Atlantic crossing?</p>\n<p>For a while this seemed like a bucket list item that I would probably postpone forever. But then one day our son Peter brought up that he would love to do this together with me. We mentioned it to my friend HL , who has been my sailing mentor for many years. And then all of a sudden a plan came together. We would buy a boat, race Newport Bermuda and then go on from there across the Atlantic. And that’s exactly what we are now doing.</p>\n<p>A few words about the boat. Frolic is a J44 . It is hull #4, built in 1989. Pretty much everything else on the boat has been rebuilt over the last year starting with a brand new mast. J44s are cruiser-racers that perform extremely well under a wide range of conditions from light to heavy air. We have been trialing the boat by participating in a couple of early season races, including the EDLU and Block Island.</p>\n<p>Now the big voyage is coming up! We are starting with the Newport Bermuda race on June 21st. This will be a shakedown for the boat and maybe as importantly for the crew, in particular for Peter and me. While we done a lot of sailing, it has all been in the Long Island Sound and near Montauk. So there is some chance that once we get to Bermuda we will simply not want to carry on.</p>\n<p>For right now though, I couldn’t be more excited to be going on voyage. You can follow our adventure on Twitter , Instagram and our blog . Let me know what you want to hear about and I will try to post on that.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/going-on-a-voyage/\">Going on a Voyage</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"05e439f9b836060f733165f77a0399da9ef3ed36cc0a2ff7411e0eb6d53e0d52","category":"default"}