{"title":"Weekend Leftovers: Good Reads & More","link":"https://om.co/2024/03/24/weekend-leftovers-good-reads-more/","date":1711289429000,"content":"<p><em>While my blog is about technology, I wanted to share some of the articles, videos, and other stuff I enjoyed during this past week — Om</em>.</p>\n\n\n\n<hr />\n\n\n\n<blockquote>\n<p>“What you have is all you need.”</p>\n<cite>Pico Iyer, <strong>A Beginner’s Guide to Japan</strong></cite></blockquote>\n\n\n\n<hr />\n\n\n\n<figure><div>\n<div></div>\n</div></figure>\n\n\n\n<p>Imagine turning your Mac Studio and an iPad into a vintage Macintosh. Clever. It is amazing what you can do with new 3D printing software and printers these days. I quite enjoyed this video.</p>\n\n\n\n<hr />\n\n\n\n<p><a href=\"https://www.theatlantic.com/magazine/archive/2024/05/david-frum-miranda-daughter-grief/677815/\" target=\"_blank\">Miranda’s Last Gift</a> is a touching and emotional story of a dad, his daughter, and her dog. David Frum, known for his political editorial salvos, has outdone himself with the story about his daughter Miranda, her health struggles, and her dog Ringo, a unique Cavalier King Charles spaniel. Dogs have a unique way of finding a way into our hearts.</p>\n\n\n\n<hr />\n\n\n\n<p><a href=\"https://disquiet.com/2024/03/22/nils-frahm-retreats/\" target=\"_blank\">Disquiet’s review</a> of Nils Frahm’s new (surprise) album “Day” says it better than I would. “The album feels like a series of wordless entries in a wordless diary from a stint in tech-addiction rehab,” writes Marc Weidenbaum. “The intimacy is kind of intoxicating in its own way.” If you like piano, ambient, and Nils, this isn’t to be missed.</p>\n\n\n\n\n\n\n<hr />\n\n\n\n<p>If you are a fan of Prince, you must check out this story about Steve Parke, the personal photographer of the maverick rockstar. As a photographer, I learned so much about him, Prince, and what it means to have a singular subject for over a decade. The photos in the article are a bonus. [<a href=\"https://themalestrom.com/interviews/picturing-prince-steve-parke-exhibition/\" target=\"_blank\">The Maelstrom</a>.]</p>\n\n\n\n<hr />\n\n\n\n<p>The sheer amount of betting and gambling involved in modern sports in the guise of fantasy and gaming is incredible. IPL much like MLB is a vehicle for these apps and services. Craig Calcaterra, a veteran baseball writer said it best when he quipped that MLB is “essentially in the business of content creation for the gambling industry now.” We shouldn’t be surprised by the Shohei Ohtani-Ippei Mizuhara gambling scandal. <a href=\"https://cupofcoffee.beehiiv.com/p/cup-coffee-extra-breaking-shohei-ohtaniippei-mizuhara-story\">This is a must-read.</a></p>\n\n\n\n<hr />\n\n\n\n<p><em>March 24, 2024. San Francsco</em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"061b0c62d1373191bd9f328ce9624b61ae2efb1ff951a4978fc85aa1291cf9ca","category":"default"}