{"title":"Suno + Udio Lawsuits","link":"https://ghuneim.com/2024/06/25/suno-udio-lawsuits/","date":1719311003000,"content":"<div>\n<div>\n<p>What happens to music, happens to everyone.</p>\n<p>Suno: <a href=\"https://s3.documentcloud.org/documents/24776034/1.pdf\">https://s3.documentcloud.org/documents/24776034/1.pdf</a></p>\n<p>Udio: <a href=\"https://s3.documentcloud.org/documents/24776030/1.pdf\">https://s3.documentcloud.org/documents/24776030/1.pdf</a></p>\n<p>“Accompanying this Complaint and designated as Exhibit C is a thumb drive that contains all the Udio outputs referenced herein and in Exhibit B. In the event Udio seeks to remove this evidence of its infringing conduct from public view, the examples cited herein are preserved on this medium.”  (at last this language -ed)</p>\n<p><em>Show the LLM weights, LLM data,  open code, or delete the models.</em></p>\n</div>\n<p><span>It’s not the the technology is bad, it’s that rights holders did not see this coming, and did not lay the legal frameworks, and industry best practices. The game started without them (again). These are conversations that should have happened years ago, but likely distracted by some metaverse or quantum something, something,. </span></p>\n<p><span>The declaration from one major label setting boundaries recently as well as this lawsuit, even if was a day late and model short,  it’s exactly what I am talking about. Do it.   </span></p>\n<p><span>Prove or remove it should be the remit from all major rights holders in unison and then set the deal terms on a flat playing field, adding on the value of the IP that was stolen and used for to gain market share to the bill.  Remember when Google search launched its news area and the news industry did not negotiate a rev split,  this, is that again. </span></p>\n</div>\n<p>Do new deals with rights in tact,  auditable deeply embedded rights trackers in latent space  for downstream revenues.</p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"061bde54751f2f867a71986ffe2efc7d78cc97424448565b2f021178564376ca","category":"default"}