{"title":"Emile Zola’s The Ladies’ Paradise Reviewed by Furman","link":"https://feeds.feedblitz.com/~/901254869/0/marginalrevolution~Emile-Zolas-The-Ladies%e2%80%99-Paradise-Reviewed-by-Furman.html","date":1721042327000,"content":"<p><a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.harvard.edu/people/jason-furman\">Jason Furman</a> (eight years as a top economic adviser to President Obama) is an excellent economist who reads a lot of books. His Goodreads has 2300 books read, with some <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.goodreads.com/review/list/4651295-jason-furman?order=d&amp;sort=review&amp;view=reviews\">1200 reviews</a> in economics, fiction, history and science. I greatly enjoyed his <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.goodreads.com/review/show/6497195146\">latest review</a> of Zola’s <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/Ladies-Paradise-Oxford-Worlds-Classics/dp/0199536902/ref=sr_1_1?tag=marginalrevol-20\">The Ladies Paradise</a> which came about after he “asked a colleague in the English department if any fiction had positive depictions of business and capitalism (other than Ayn Rand).” Here is Furman’s review:</p>\r\n<blockquote><p>A 19th century novel that is a paean to the consumer welfare standard.</p>\r\n<p>…The department store is really the leading character in this book, the protagonist of the Bildungsroman. It is like a living, breathing creature with needs, desires and most importantly constant growth. It becomes increasing complex, mature and alive as it develops. From a few departments to many, takes over more and more of the square block—eventually engulfing the one stubborn holdout. The novel also has amazing depictions of innovations, not just classical invention (e.g., an improved type of umbrella at one point) but also management of inventory, holding sales, selling some products at a loss, advertising, managing inventories, and more. I never thought an entire chapter of a novel (and they’re long chapters) devoted to inventory management could be so thrilling but that one was nothing compared to the description of the sale.</p>\r\n<p>In the shadow of the Ladies Paradise are a number of small shops that are having an increasingly difficult time competing. The larger shop buys out some, builds on innovations by others, and aggressively competes on price with still others. Émile Zola does not sugarcoat the pain of all of this, depicting deaths and suicide attempts in the wake of the store. But he does not blame all the maladies on the Ladies Paradise itself and, consistent with the consumer welfare standard, he keeps the focus on the ways in which this profit ultimately benefits customers. Moreover, some of the small businesses do innovate in ways that help keep themselves in business: “longing to create competition for the colossus; [a small business owner] believed that victory would be certain if several specialized shops where customers could find a very varied choice of goods could be created in the neighbourhood.”</p>\r\n<p>Interestingly there is a chapter that reads like an explanation of an economic model, Bertrand competition, in which two competitors keep lowering prices by smaller and smaller amounts until they are pricing as low as they possibly can (their marginal cost). What made this especially interesting to me was that The Ladies Paradise was published in 1883, the same year Joseph Louis François Bertrand published his model.</p>\r\n<p>And it is not just consumers. The novel depicts how the productivity gains the Ladies Paradise makes as a result of its scale and its innovations are passed through to workers in the form of higher pay and improved benefits. For example, early on there is a brutal depiction of the process of laying off workers during the slow time of year. Later on, the store develops a system that is more like furloughs with insurance. And also, unlike the small shops in the area, it has opportunities for advancement within the store, moving up the ranks of managerial positions. Notably, all of this is not because of the benevolence of the owner (as it is in a few other 19th century novels) but because of competition from other stores so the need to attract and retain talent.</p>\r\n<p>All of this makes employment in the colossus considerably better than the smaller, neighboring shops where people are poorly paid, lack opportunities for advancement and face harassment. Although it is still not all wonderful—for example, the department store frowns on women who are married and dismisses them when they have children.</p>\r\n<p>Overall, the combination of low prices for consumers and high expenses—including pay and benefits to attract and retain employees—mean that the business has a very thin profit margin but applies that margin to a very large base: “Doubtless with their heavy trade expenses and their system of low prices the net profit was at most four per cent. But a profit of sixteen hundred thousand francs was still a pretty good sum; one could be content with four per cent when one operated on such a scale.”</p>\r\n<p>The biggest wrinkle in the consumer welfare standard is some of the ambivalence Zola has about consumer preferences themselves….The idea that people—or women to be more specific—are buying things they do not “need” but “desire” is an issue it grapples with. And that desire can even rise to the level of a mad frenzy, like the sales it depicts or the shoplifters, some of them affluent but driven by an almost mad desire to acquire lace, silk, and more.</p>\r\n<p>All of this is embedded in a larger economic and technological system that is operating in the background: large factories in Lyon that are producing at scale in a way that is symbiotic with the department store, rail transportation to bring the constant inflow of goods, a mail system that supports catalog purchases, and more.</p>\r\n<p>…I’m still astounded about how breathtaking fiction can be made which understands and depicts the ways in which innovation and scale combine with competition to generate benefits for consumers and workers—while also not sugarcoating the many that lose from this process.</p></blockquote>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html\">Emile Zola’s The Ladies’ Paradise Reviewed by Furman</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/901254869/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/901254869/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/901254869/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/901254869/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/901254869/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/901254869/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comment-160782456\">In reply to kev.   My History of Business professor at Rice U. ...</a> <i>by Steve Sailer</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comment-160782444\">In reply to It Ain't Necessarily So.   Can I say we read this ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comment-160782441\">In reply to JB.   What if “works” means making consumers ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comment-160782420\">In reply to mort main.   I went to college at a school where ...</a> <i>by Kaleberg</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comment-160782419\">In reply to Chris Hibbert.   His “A Town Like Alice” was ...</a> <i>by Kaleberg</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/emile-zolas-the-ladies-paradise-les-rougon-macquart-11.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/thinking-about-the-roman-empire.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=thinking-about-the-roman-empire\">Thinking about the Roman Empire</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/bryan-caplan-on-yimby-in-the-nyt.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=bryan-caplan-on-yimby-in-the-nyt\">Bryan Caplan on YIMBY in the NYT</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/my-excellent-conversation-with-brian-winter.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-brian-winter\">My excellent Conversation with Brian Winter</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"06423c2186125376561bd038ead4e326bfc5dcd9e32bdf7c2d9fff6483c2c4f2","category":"default"}