{"title":"Why FTC Needs to Rethink Tech Regulation","link":"https://om.co/2024/07/16/why-ftc-needs-to-rethink-tech-regulation/","date":1721158422000,"content":"<figure><img width=\"2560\" height=\"2371\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-scaled.jpeg\" alt=\"Photo of Capital Hill, Washington, D.C.\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-scaled.jpeg 2560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-300x278.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-1024x948.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-768x711.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-1536x1422.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-2048x1896.jpeg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-192x178.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-1100x1019.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-560x519.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/andy-feliciotti-on_cuy1v7hs-unsplash-edited-1800x1667.jpeg 1800w\" /><figcaption>Photo by <a href=\"https://unsplash.com/@someguy\">Andy Feliciotti</a> on <a href=\"https://unsplash.com/?utm_source=on-my-om&amp;utm_medium=referral\">Unsplash</a> </figcaption></figure>\n\n\n\n<p><br />If you’ve been a regular reader, you know I’m a little skeptical of government regulators (including the FTC and DOJ) being able to control and rein in Big Tech, and more importantly, bring about change that is timely, impactful and meaningful in the long run.</p>\n\n\n\n<p>No matter how well-meaning their intentions might be — and this assumes they aren’t political — the current regulatory system isn’t set up to consider regulations in a long-term fashion in our technology-driven world.</p>\n\n\n\n<p>While it is laudable that the FTC wants to help create opportunities for non-Big Tech companies, the reality of the technology ecosystem is very different. Andrej Karpathy, who was previously director of AI at Tesla and was on the founding team of OpenAI, summed it up well in <a target=\"_blank\" href=\"https://x.com/karpathy/status/1812983013481062761\">a recent tweet.</a></p>\n\n\n\n<blockquote>\n<p>“I wished for tech to look like “a thriving coral reef” ecosystem but sometimes it feels more like mostly plankton, a few clown fish, two tunas, and 5 killer whales circling above.”</p>\n</blockquote>\n\n\n\n<p>Karpathy was responding <a target=\"_blank\" href=\"https://x.com/ID_AA_Carmack/status/1812978264484552987\">to a tweet</a> by John Carmack, former chief technology officer of Oculus and founder of id Software and Keen Technologies.</p>\n\n\n\n<blockquote>\n<p>I have been dragged into two court cases where the FTC sued Meta over acquiring tiny VR companies, but I didn’t realize the breadth of the issue — big tech has significantly ramped down acquisitions across the board, which is bad for startups. Founders have been pushed away from IPOs for a long time, and now acquisition exits are being curtailed. The ideological position is that the FTC wants startups to stay independent and compete with the existing big tech companies, but an awful lot of tech dynamism is due to half-decade pushes that end in acquisitions.</p>\n</blockquote>\n\n\n\n<p>Carmack is right. I suspect regulators in Washington, D.C., have overplayed their hand. Many large companies are looking at Adobe’s failed attempt to buy Figma and wondering if it’s worth the money, time, effort and distraction. Others that can grow to become bigger are simply staying private and eschewing public market scrutiny.</p>\n\n\n\n<p>A company that should be a perfect testimonial for the FTC’s ideological scale is fintech upstart Stripe. Valued at about $75 billion and enabling nearly $1 trillion in annual transactions, it should be public and using its equity to add to its heft via acquisitions. Instead, it is choosing to avoid scrutiny and continue to grow privately. These are unintended consequences.</p>\n\n\n\n<p>But not all startups are Stripe. Most, if very lucky, are like Figma. They catch lightning in a bottle and gather momentum, but they aren’t necessarily likely to become the next Adobe. I sincerely hope they do, but they won’t have the luxury of time to reach that level of success. Why? Because technological shifts are now happening at an escalating rate. The PC-to-internet shift took quite a long time, but since then we have seen social, mobile and cloud upend the established orders.</p>\n\n\n\n<p>Carmack is right when he says that “an awful lot of tech dynamism is due to half-decade pushes that end in acquisitions.” I have been in Silicon Valley long enough to know that this is a fact. There are, and there will be, many companies that are created and produce technologies that can’t scale up to the level of Figma or Stripe. What happens to them if there are no buyers? And no public offerings?</p>\n\n\n\n<p>If regulators’ idealistic outcome was to thwart Big Tech from buying startups (or rivals) and getting bigger, the large companies have already come up with a way to outmaneuver them. Both Amazon and Microsoft have figured it’s safer <a target=\"_blank\" href=\"https://www.theverge.com/2024/7/1/24190060/amazon-adept-ai-acquisition-playbook-microsoft-inflection\">to hire a startup’s team,</a> then license its intellectual property and technology. Who wants to bother with antitrust regulators? Amazon snagged AI startup Adept, following Microsoft’s absorption of Inflection. Somehow, the tech giants have made the duck look like a chicken.</p>\n\n\n\n<p>I am repeating myself, but regulators are those who show up at a bar just when last call has been announced.</p>\n\n\n\n<p>When we shifted from the “personal computer” age to the “internet era,” Microsoft was caught napping. It reacted by pouring billions into buying a browser (Spyglass) and then going after the then-upstart, Netscape. It did many questionable things — we don’t need to go into all that. The company got into trouble with regulators who brought an antitrust case against it.</p>\n\n\n\n<p>Fat lot of good it did for Netscape, which was toast by then — as much a victim of its own hubris and missteps as Microsoft’s monopolistic moves. Having lived through those times, I can tell you Microsoft made a better browser than Netscape for a few years before it completely Microsoft-ed it.</p>\n\n\n\n<p>The natural shift from PCs to the internet and the web did more to Microsoft’s long-term prospects than the Department of Justice, though the DOJ did distract the company long enough. Regulation often comes at the very end of a technology cycle. We are seeing “social” as we know it coming to an end. And so is “search.” These shifts mean that social and search giants will face their natural technological mortality.</p>\n\n\n\n<p>If regulators want to be serious about reining in “Big Tech,” they need to start rethinking what constitutes a monopoly — and how it extends into the future. In Microsoft’s case, regulators incorrectly decided that “desktop” was the monopoly. Looking back, it was “developers” where Microsoft enjoyed a real edge. Regulators should have been pushing for change around that advantage. Those developers have helped Microsoft survive the PC doldrums and become a cloud and AI behemoth that is worth many times more than it was at the time of the Justice Department action.</p>\n\n\n\n<p>The big tech companies have one thing in common: They control our digital identities and data. With enough AI training, Meta and Google can evolve to become “advertising engines” of the future. Amazon can mutate into anything it wants with that data. Apple can sell us anything. If anything, the real regulation should start with that ground truth.</p>\n\n\n\n<p>To be proactive, we need to rethink what constitutes a monopoly in the digital age. Sadly, this is unlikely to happen because there’s little long-term thinking in Washington. Common sense is lacking. Consumer rights and interests are sacrificed to party loyalty, and everything revolves around post-office riches rather than the job at hand.</p>\n\n\n\n<p><em><strong>July 16, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"0720755c4aa3d8d9cd511217560878f8ddb15588331fd2a4c195f2c78fe8644d","category":"default"}