{"title":"Thinking something nice about someone? Tell them.","link":"https://sive.rs/nice","date":1678147200000,"content":"<p>\nWhen you think something nice about someone, you should tell them.\n</p><p>\nPeople don’t hear enough compliments.\n</p><p>\n<strong>\nEven well-known people.\n</strong>\nWe assume they must hear it too much.\nBut famous people often say the thanks from the public is <strong>the best part of the job</strong>.\nThey work really hard to spread their creations widely.\nThey could just sit home and keep their thoughts to themselves, but instead they do the hard labor of turning their ideas into something digestable, then brave public critique in the media, all for the generous act of sharing their work with the world.\nIt’s not for the money, since they could make more as a banker.\nIt’s for the deeper happiness of making a difference in people’s lives.\n</p><p>\nSo I think of it as my <strong>duty</strong>, when someone has made a difference in my life, to <strong>let them know</strong>.\n</p><p>\nRecent examples:\n</p><ul><li>\nEmailed <a href=\"https://shrutiraj.com/\">Shruti Rajagopalan</a> to say I’m a fan of her work, and I met two of her mutual friends in India.\n</li><li>\nContacted <a href=\"https://www.duarte.com/\">Nancy Duarte</a> after six years to say I’m still using her <a href=\"https://www.duarte.com/resources/books/resonate/\">Resonate</a> framework of presentation, and I’m glad we met ten years ago.\n</li><li>\nEmailed <a href=\"https://austinkleon.com/\">Austin Kleon</a> to let him know that three different people referenced him last month in India.\n</li><li>\nFound the email address for professor <a href=\"https://philpeople.org/profiles/sharon-kaye\">Sharon Kaye</a> after reading her book, <a href=\"https://sive.rs/book/PhilosophyCI\">Philosophy: a Complete Introduction</a>, to tell her that she is the clearest writer I’ve ever read.\n</li><li>\nEmailed <a href=\"https://en.wikipedia.org/wiki/Russ_Roberts\">Russ Roberts</a> to say how much I love <a href=\"https://www.econtalk.org/\">his podcast</a> and <a href=\"https://sive.rs/book/WildProblems\">new book</a>.\n</li><li>\nTexted my friend <a href=\"https://ie.linkedin.com/in/laura-clesceri/en\">Laura Clesceri</a> to tell her I appreciate our conversations.\n</li><li>\nTexted <a href=\"https://markmanson.net/\">Mark Manson</a> a photo of my cinema ticket after seeing <a href=\"https://www.imdb.com/title/tt12380422/\">his movie</a>.\n</li><li>\nTold the guy at the cafe that I loved his shirt with the <a href=\"https://duckduckgo.com/?t=ffab&amp;q=atari+adventure+dragon&amp;iax=images&amp;ia=images\">Atari Adventure dragon</a>.\n</li><li>\n... and complimented three adorable dogs (to their owners) while out on my walk in the forest today.\n</li></ul><p>\nThese examples took a combined total of about fifteen minutes of my life.\nBy text or email, I send <strong>just two or three sentences</strong>.\n</p><p>\nAs soon as I feel the feeling of appreciation, I flip over to my email app, <em>tap tap tap send</em>, and get back to what I was doing.\n</p><p>\n<strong>\nThere really is no better use of my time, or yours.\n</strong>\n</p><p>\n<em>\nSide note: Only about half of them reply.\nBut that’s OK, since I’m not doing it for the reply.\n</em>\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0724e5738111f4b3431ada7135ea9c0834dccf39e463e458dd0a50591e3b5f07","category":"Sites"}