{"title":"Training the Weird","link":"https://www.usv.com/writing/2024/01/training-the-weird/","date":1706650676000,"content":"<p>We are entering a new age of consumer fun and function. AI is going to supercharge both the utility and entertainment of consumer products, introducing new form factors and experiences that feel made for me. As Jared wrote recently, <a href=\"https://www.usv.com/writing/2024/01/weird/\">we are ready for the weird.</a> Models trained on our own data and tailor-made for our own needs will shape this next generation of breakout software. Whatever the specific use case– social networks, games, chiefs of staff, personal stylists, study companions, romantic relationships, financial advisors, healthcare co-captains–the ability to quickly ingest our data with enough signal and scale to seamlessly personalize results is a critical step. </p>\n\n\n\n<p>Getting users to do setup “work” has generally been difficult, even when that work may pay off. The web is littered with abandoned carts from sign up pages full of fields. Netflix learned early on that tailoring the algorithm off of what we watch, even if that means initially the content isn’t as personalized, is a better approach than keeping that tedious preference funnel they started with. The best new products are likely to figure out how to make that data collection both easy and, ideally, a fun part of the experience instead of an upfront cost. The two options to do this seem to be:</p>\n\n\n\n<ol>\n<li>Make all my personal data seamless and portable. As Plaid has done for financial services, we need a robust enablement layer that creates the data network for consumer applications. The easiest way to jumpstart new personalized products requiring training would be to connect and move my data from existing sources with high signal (email, messaging, socials, browsing, fitness apps, etc.) This requires trust in the new product I am trying, fast utility that makes that user “give” worth it, and, primarily, ecosystems open enough to allow for those connective tissues to form.</li>\n</ol>\n\n\n\n<p>It also increasingly favors an ecosystem where controls over data sit with the person and not the platform. Albert outlined this idea a bunch of years ago when he wrote a post imagining what the internet would look like if we all had the right to be <a href=\"https://continuations.com/post/180985743645/world-after-capital-bots-for-all-of-us\">represented by a bot</a>. Right now, accessing and sharing, let alone protecting, our personal data is too difficult by design. Changing it will require a combination of pressures: technology pressure that makes this data portability easy; regulatory pressure on the systems that currently control it; and consumer pressure with users actually asking for it and knowing what they want to do with it. There really hasn’t been enough we could do with most of our consumer data, even if we had better access to it. But, now, the applications that will demand this are getting closer. We can imagine using our existing data from our email, browsing, search, swiping, or transacting to train a personal model, get the most fun and useful apps up to speed on us quickly, and create faster and better fun and utility.</p>\n\n\n\n<ol>\n<li>Make collecting training data super fun, repeatable, and useful so the “investment” feels both “buttery” and like utility. If in web 2.0 training comes from the breadth of my social graph, in AI-driven consumer it will come from the depth and relevancy of my personal data. The success of the party isn’t driven by the guest count but the experience of each guest, even if some applications will both enable better social engagement over time and also be improved by it. With a cold start data challenge instead of a cold start social graph challenge, builders are incentivized to create depth and consistency of use and engagement rather than sheer scale of signups. Think: Tinder teaching addictive swiping or <a href=\"https://en.wikipedia.org/wiki/Hunch_(website)\">Hunch’s</a> addictive questions back in the day. The best new products will invent new forms of engagement to collect the most and highest quality data in the most fun and novel ways. </li>\n</ol>\n\n\n\n<p>We’re ready for the weird but we are also ready for the market and behavioral shifts that support the weird: open systems of moving data around for user-controlled and determined training and retention-obsessed applications committed to that intersection of fun and utility. </p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/01/training-the-weird/\">Training the Weird</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Rebecca Kaden","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"0741da56cafe669e444366c5fb7be44b11c489ac6064b9a44ee8d750da979470","category":"default"}