{"title":"Here’s how to live: Do whatever you want now.","link":"https://sive.rs/htl11","date":1639180800000,"content":"<p>\nThe past?\n<br />\nThat’s what we call our memories.\n<br />\nThe future?\n<br />\nThat’s what we call our imagination.\n<br />\nNeither exists outside of your mind.\n<br />\nThe only real time is this moment.\n<br />\nSo live accordingly.\n<br />\nWhatever benefits you right now is the right choice.\n</p><p>\nYou know immediately whether you like something or not.\n<br />\nBut if someone asks why, you start making up reasons.\n<br />\nThe truth is you like it or you don’t.\n<br />\nThat’s it.\n<br />\nThat’s life.\n<br />\nDo whatever you like.\n<br />\nYou don’t need explanations.\n</p><p>\nWhen people ask the meaning of life, they’re looking for a story.\n<br />\nBut there is no story.\n<br />\nLife is a billion little moments.\n<br />\nThey’re not a part of anything.\n</p><p>\nPeople think they’ll do something later.\n<br />\nThey think they’ll have more time in the future than they do today, as if later is a magical time when everything will happen.\n<br />\nForget the whole notion of the future.\n<br />\nThere is only today.\n<br />\nIf you want to do something, do it now.\n<br />\nIf you don’t want to do it now, then you don’t want to do it at all, so let it go.\n</p><p>\nDoing whatever makes you happy now is smart.\n<br />\nWhen you’re happy, you think better.\n<br />\nMore of your brain is engaged.\n<br />\nYou’re more open to possibilities and connecting ideas.\n<br />\nYou learn better and are more creative.\n<br />\nSo forget the future and past.\n<br />\nFocus fully on whatever fascinates you now.\n</p><p>\nYou don’t need a schedule.\n<br />\nJust pay attention to what excites you.\n<br />\nIf you’re not excited about what you’re doing, move on to something else.\n</p><p>\nYou don’t need plans.\n<br />\nPlans are just predictions about what you might want in the future.\n<br />\nBut your future self shouldn’t be bound to what your past self predicted.\n<br />\nSo never make plans.\n<br />\nWhen someone asks, just say you can’t know until that day.\n<br />\nAll you know is now.\n</p><p>\nLive like a frog sitting on a lily-pad.\n<br />\nWhen it feels like it, it jumps to a different one, and stays until it feels like jumping again.\n</p><p>\nYour feelings are wise.\n<br />\nBad feelings mean you need to take action.\n<br />\nGood feelings mean you took the right action.\n<br />\nFollowing your feelings is the most natural and rewarding thing to do.\n</p><p>\nMost problems are not about the real present moment.\n<br />\nThey’re anxiety, worried that something bad might happen in the future.\n<br />\nThey’re trauma, remembering something bad in the past.\n<br />\nBut none of them are real.\n<br />\nIf you stop and look around the room, and ask yourself if you have any actual problems right now, the answer is probably no.\n<br />\nUnless you’re in physical pain or danger, the problems were all in your head.\n<br />\nMemories and imagined futures are not real.\n<br />\nThe present moment is real and safe.\n</p><p>\nPeople with severe amnesia are surprisingly happy.\n<br />\nThey can’t remember the past, and they don’t try to predict the future since they have no trajectory.\n<br />\nThey have only the present moment, so they enjoy it without burden.\n<br />\nFollow their example.\n<br />\nForget the past and future.\n</p><p>\nHappiness is something to do, someone to love, and something to desire.\n<br />\nHeaven is not what’s at the end of the path.\n<br />\nHeaven is the path itself.\n</p><p>\nDoing whatever you want, at every moment, is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0741def1a9f3fa60f82e2d8046e20c7b6072ff9155219fd29e9a04abb2ce528b","category":"default"}