{"title":"The digital equivalent of wearing a fake Chanel bag","link":"https://www.garbageday.email/p/the-digital-equivalent-of-wearing","date":1705346823000,"content":"<div><div><h2>There Is Still No Real Use Case For AI Art</h2><p>I’m not totally against AI art. There are probably real ways to do it ethically and I think some generative-AI tools could easily fit into existing applications like Photoshop or After Effects. If you hate it and think it’s evil, though, that’s fine, I get it. But when I grew up in the early days of Wikipedia, Photoshop, and music piracy and you’d be surprised how quickly attitudes change around this kind of thing.</p><p>That said, there is a question about AI art I keep coming up against that has slowly consumed me. It’s a question that is never asked by the endless AI evangelists on X, breathlessly posting about the limitless potential of generative AI. The completely interchangeable tech guys with names like Törbend and Jorsh, who all dress like Kanye West at <a href=\"https://pyxis.nymag.com/v1/imgs/fa9/306/c29485b612cbbf743f64d3dbe667762f61-13-kanye-west-tlop.2x.h473.w710.jpg?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">the </a><i><a href=\"https://pyxis.nymag.com/v1/imgs/fa9/306/c29485b612cbbf743f64d3dbe667762f61-13-kanye-west-tlop.2x.h473.w710.jpg?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">Life Of Pablo</a></i><a href=\"https://pyxis.nymag.com/v1/imgs/fa9/306/c29485b612cbbf743f64d3dbe667762f61-13-kanye-west-tlop.2x.h473.w710.jpg?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\"> release party</a>. The guys with newsletters about AI that boast hundreds of thousands of subscribers even though you’ve never heard of them before. That start all their threads with question prompts like, “what’s the best passive income hustle? The IRS doesn’t want you to know about these.” And “Will OnlyFans models be put out of a job? I asked my AI girlfriend and what she said will blow your mind.” And that question is why. </p><p>Why would anyone need to make a lot of low-effort digital content? Who is the actual person that would ever need to generate hundreds of meaningless JPGs? Why not just draw or commission one good image or video instead of asking a machine to fart out a hundred terrible ones?</p><p>But I actually think we’re beginning to finally to get an answer: The only real use case for AI art is flooding social media with a bunch of worthless garbage. And the only reason to do that is to advertise something or scam people. </p><p>Earlier this month, Wizards of the Coast appears to have used AI images in tweets <a href=\"https://twitter.com/rahll/status/1743810708075131186?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">promoting</a> a new <i>Magic the Gathering</i> campaign. And Wacom, the company behind a line of popular digital art tablets, <a href=\"https://twitter.com/wacom/status/1744814055137919388?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">had to apologize</a> for using AI-generated art in a tweet, as well. Interestingly enough, Wacom claims they purchased art from Adobe’s image library which was likely not probably tagged as being AI-generated. Then, last week, <i>Futurism</i> <a href=\"https://futurism.com/amazon-products-ai-generated?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">discovered</a> that Amazon has filled up with AI-generated product listings, many with names like “I Cannot Fulfill This Request It Goes Against OpenAI Use Policy”. While <i>404 Media</i> <a href=\"https://www.404media.co/joe-rogan-taylor-swift-andrew-tate-ai-deepfake-youtube-medicare-ads/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">discovered</a> a large-scale network on YouTube using AI-generated celebrities hawking a medicare scam.</p><p>In the early 2010s, big social platforms transformed the internet from a place of mostly text into a network of visual content. In 2011, Twitter <a href=\"https://phys.org/news/2011-06-twitter-photo-sharing.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">launched</a> the ability to embed images directly into tweets. And a year later, Instagram was purchased by Facebook and began <a href=\"https://www.vox.com/recode/23274761/facebook-instagram-land-the-giants-mark-zuckerberg-kevin-systrom-ashley-yuki?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">its slow morph</a> from hipster Polaroid app to Facebook 2.0 for millennials. After that, our social feeds became primarily visual. This was doubly true for brands. Every algorithm suddenly required some kind of image to break through. And after Instagram launched Reels in 2020 to compete with TikTok, you began needing video, as well.</p><p>Nowadays, user-generated content platforms are basically just widgets for JPGs. This is especially true for brands using these sites. Which is a problem because digital media is a game of scale and if you need a team of designers, if not an entire video production workflow, to catch the attention of an algorithm, it quickly stops being useful. </p><p>This is so far, the only problem I’ve seen AI art fix. But, of course, it’s not even a real problem. It’s just a bunch of dumb publishing guidelines imposed on the web by tech companies that decided they were better for engagement metrics. But it turns out AI art isn’t even really good at that because it all feels like spam now.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/ea5918cb-cad4-40ee-b6d1-c43402dce104/2bc7bfec-5760-45d0-8fd7-d9a8e71ef20c_608x670.png?t=1705691538\" /></div><p>This is something the <i>New Yorker</i>’s Kyle Chayka actually <a href=\"https://twitter.com/chaykak/status/1620891495502057472?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">argued last year</a> as the most likely outcome of generative AI, writing, “Algorithmic feeds have pushed content creators to conform to the acceptable aesthetic and cultural average; AI generation will just automatically produce that average from the start.”</p><p>Which is a sentiment I saw repeated again over the weekend, albeit much more critically. A user on X talking about Nicki Minaj’s new AI-driven Gag City marketing campaign, <a href=\"https://twitter.com/thecarteldel/status/1745997488694456637?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">wrote</a>, “You know what I realized about AI images in your marketing? It sends out the message that you've got no budget. It's the digital equivalent of wearing an obviously fake Chanel bag. Your whole brand immediately appears feeble and impoverished.”</p><p>If you haven’t been following the Gag City meme, Minaj’s fans <a href=\"https://www.garbageday.email/p/the-disgusting-tiktok-sink-food-man?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">have been using</a> AI generators to promote a fantasy world based on her music. <i>TechCrunch</i> <a href=\"https://techcrunch.com/2023/12/08/gag-city-barbz-nicki-minaj-stans-meme-brand-accounts/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">recently called it</a> a “viral win” for Minaj, which I agree with, but its quickly losing steam, like all AI memes. The more Minaj has embraced it, the tackier it has started to feel. </p><p>Because these tools can’t create anything new. They spin together the most basic aesthetics of digital art into a slurry that feels immediately dated upon creation. Which is why, less than two years after DALL-E 2 launched to the public, ushering in a new age of AI, the content these tools produce has quickly gone from shiny new toy to visual shorthand for e-waste. They are basically a high-tech version of a Bitmoji.</p><p>And even if company’s like Midjourney and OpenAI figure out the copyright issues, I’m not sure you can fix that. </p><hr /><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/62c8d39b-4f46-48c0-bc4b-35e8e28ccc18/25e408f1-aecf-44e8-b124-ec065b31ba00_2200x96.png?t=1705691538\" /></div><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/9944f353-70ec-44f7-87c5-dd84750bb841/3078be6f-7753-4179-95fe-f816c5c3a431_1541x994.jpeg?t=1705691539\" /></div><p>There are many reasons the internet feels less fun in this moment than in other eras. I think the biggest one is that so much of our online lives are now dictated by algorithmic feeds, recommendation equations that constantly guess what we might like and often get it wrong. I wrote my new book <i><b><a href=\"https://www.penguinrandomhouse.com/books/695902/filterworld-by-kyle-chayka/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">Filterworld: How Algorithms Flattened Culture</a></b></i><i> </i>to break down that ecosystem of algorithms and point the way toward a better way of consuming culture — online and off.</p><p><i>Filterworld </i>is available from all the online retailers and will be in stores tomorrow, January 16. To make my own algorithmic recommendation: If you like Garbage Day, you’ll like this book. I’ll be on book tour in the coming weeks in Washington DC (1/16), NYC (1/17), Boston (1/18), LA (1/23), and SF (1/24). Hopefully I’ll meet some other Garbage Day readers on the way!</p><p>Let’s all have more fun on the internet,</p><p>Kyle Chayka</p><hr /><h2>Josh Wine Is The Hot New Meme</h2><p><i>—by Adam Bumas</i></p><p>Josh wine is having a big week online. Thanks to <a href=\"https://twitter.com/OptimusGrind__/status/1743802372525036031?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">a single post</a> on X on January 6th that got picked up by the algorithm, the cheap wine with the fun name has become the subject of hundreds of silly memes, puns, and the things I’ll probably never be able to stop calling “tweets”. My favorite so far:</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4dd4c1a9-dc63-45ba-ba79-67f2519caf46/d69b42bc-8606-475c-ae17-c9808e82ac30_1218x1028.png?t=1705691540\" /></div><p>I’ve seen a lot of “explainers” for the meme going around in the past few days, but Josh was already <a href=\"https://www.winebusiness.com/news/article/269463?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">mega-popular</a>, as wines go. It’s at that sweet spot of being the third least expensive thing in the store, and it has unusually simple branding without seeming inferior. These are marketing strategies that have worked for decades, and the meme is happening because they’re getting a chance to work in new spaces.</p><p>In terms of explanations, I think it’s more valuable to step back a little and note how indistinguishable memes like this are from regular purchasing trends. It’s not new, but it’s getting more common to have the central element of a meme just being a product people enjoy. Stanley tumblers, Big Red Boots, even Barbenheimer. There’s interesting stuff to be said about subcultures and expression with all these memes, but the core concept always comes back to just being a thing you need to buy.</p><p>I don’t put every single meme about a product in this category. I’m sure McDonald’s made a lot of money off the Grimace Shake videos from last year, but it was its own absurdist trend. It was drawing off all the jokes about <a href=\"https://knowyourmeme.com/memes/purple-drank?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">lean</a> in the 2000s that got revived on TikTok <a href=\"https://knowyourmeme.com/memes/day-1-2-3-no-lean?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">in 2021</a>. Similarly, the <a href=\"https://knowyourmeme.com/memes/sleepytime-tea-bear?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">Sleepytime Tea Bear</a> gets a new crop of memes every year or so, but they’re maybe 5% about the actual tea and 95% about the bear’s cozy, <a href=\"https://knowyourmeme.com/memes/nightcap-nightgown-candle-stick-holder?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">honk-shoo</a> vibe. Josh wine memes aren’t following the same kind of tradition. There’s no central joke other than the name, and there’s no creative element like the shakes or social element like <a href=\"https://en.wikipedia.org/wiki/Icing_(game)?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">Icing</a> a decade ago. </p><p>It’s purely commercial, and that’s why I was surprised to find that Josh has virtually zero presence on TikTok. The most popular videos mentioning the wine in the past week only have a few thousand views, and they’re mostly people asking what the deal is, or reposting memes from other sites.</p><p>It surprised me because TikTok Shop and partnered videos are one of the main things driving this commodification of meme-hood. I’ve seen people complain that their entire FYP is nothing but TikTok Shop videos, only broken up by regular ads. That definitely sounds like a saturation point. Would you watch TV if the only channel you could watch was QVC?</p><hr /><h2>A Good TikTok</h2><div></div><hr /><h2>Artifact Is Shutting Down</h2><p>I wrote about this app before <a href=\"https://www.garbageday.email/i/138491082/artifact-is-actually-pretty-good?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">in Garbage Day</a>. I was a big fan! It was essentially a news reader that used a bit of machine learning to send you push alerts for content it thought you might care about. And I used it pretty much every day. </p><p>It was created by Kevin Systrom and Mike Krieger, the co-founders of Instagram, and they published a <a href=\"https://medium.com/artifact-news/shutting-down-artifact-1e70de46d419?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">blog post</a> after announcing the shuttering of the app over the weekend.</p><p>Interestingly, Systrom and Krieger dedicated the final paragraph of their post to the “existential” crisis of the American news industry:</p><div><blockquote><p>News and information remain critical areas for startup investment. We are at an existential moment where many publications are shutting down or struggling, local news has all but vanished, and larger publishers have fraught relationships with leading technology companies. My hope is that technology can find ways to preserve, support and grow these institutions and that these institutions find ways of leveraging the scale that things like AI can provide. </p><figcaption></figcaption></blockquote></div><p>Which sounds nice, except the near-unanimous consensus about where Artifact went wrong was shoving a bunch of awful social features into their app. About nine months into the app’s short life, it morphed into a horrible Pinterest/TikTok hybrid that basically broke it. Oh well…</p><hr /><h2>A <i>Spider-Man 2 </i>Voice Actor Posted NSFWish Fan Art Of Her Character</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5e394ac5-2236-4e38-93c2-e23abc8a7583/1c09386b-2e7c-49f1-98ed-b38993f98b74_1226x1100.png?t=1705691542\" /></div><p>Jacqueline Piñol is the voice actor for Rio Morales, the mother of Miles Morales, in Insomniac’s <i>Spider-man 2</i>. And on New Years Eve, she posted a NSFW-ish image of her character created by the NSFW Blender artist QuickEsfm. </p><p>Interestingly enough, a few days later, Piñol <a href=\"https://twitter.com/jacquipinol/status/1746315330165903767?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">told her followers</a> that she’d be keeping the image up on her account, writing that, “as an actor, I am part of bringing this multi-dimensional female character to the screen. I do like the convo about it being OK for moms to feel like they can still be sexy too!” Alright!</p><p>Admittedly, I was a bit confounded by this whole thing, but Garbage Day researcher Adam made a good point that sharing NSFW content is actually a pretty good growth hack X. In fact, Piñol has even tweeted about how many views her post got. So beyond this just being a weird thing, it’s also a good example of how all viral content on X is sort of collapsing into porn in a way we haven’t really seen on a mainstream platform before.</p><hr /><h2>An Excellent Weather Forecast</h2><div></div><p>If you go to his page, he actually does A LOT of these kinds of videos. But I think this one is especially impressive.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://twitter.com/SomeMoreNews/status/1745900887191560545?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">I was on the Some More News podcast!!!</a></p></li><li><p><a href=\"https://bloodknife.com/were-similar-were-compatible-were-perfect/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">“We're Similar. We're Compatible. We're Perfect.”</a></p></li><li><p><a href=\"https://www.washingtonpost.com/style/interactive/2024/ken-fritz-greatest-stereo-auction-cost/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">An incredible story about a hi-fi stereo</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://www.tiktok.com/@dimitribeauchamp/video/7323335754388606250?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">some good </a><i><a href=\"https://www.tiktok.com/@dimitribeauchamp/video/7323335754388606250?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">Final Fantasy </a></i><a href=\"https://www.tiktok.com/@dimitribeauchamp/video/7323335754388606250?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-digital-equivalent-of-wearing-a-fake-chanel-bag\" target=\"_blank\">content</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=7686ebc5-5c11-4caf-ae4e-3546b4cf1cd3&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"07c995707270e7ff282dae861031f728a32640dc38a57930eb12d0216da1eb2f","category":"default"}