{"title":"On the Regular","link":"https://kottke.org/24/09/on-the-regular-1","date":1725919031000,"content":"\n        <p>Former NY Times restaurant critic Frank Bruni <a href=\"http://www.nytimes.com/2013/09/18/dining/frank-bruni-former-restaurant-critic-on-the-joys-of-repeat-visits.html\">writes about the joys of being a regular</a> at your neighborhood restaurant.</p>\n\n<blockquote><p>What you have with a restaurant that you visit once or twice is a transaction. What you have with a restaurant that you visit over and over is a relationship.</p></blockquote>\n\n<p>My wife and I eat out at least once a week and we used to travel all over the city to try all sorts of different places, just-opened hot spots and old favorites alike. It was great. But now we mostly go to a bar/restaurant<sup><a href=\"#fn:1476219361\">1</a></sup> around the corner from where we live and that’s even better. Bruni covers the experience pretty well, but I just wanted to share a couple of seemingly small aspects of being a regular:</p>\n\n<p>1. Our local is popular and always crowded, especially during the dreaded 7-10pm hours and double especially Thu-Sat nights. But even when I go in by myself at a peak time, when the bar’s jam-packed, there’s always a seat for me. It might take a bit, but something opens up and they slot me in, even if I’m only stopping in for a drink and they could seat a two-top for dinner at the bar. (A regular in the hand is worth two in the rush.)</p>\n\n<p>2. This is a totally minor thing but I love it: more than once, I’ve come in early in the evening, had a drink, left without paying to go run an errand or meet someone somewhere else, and then come back later for another drink or dinner and then settle my bill. It’s like having a house account without the house account.</p>\n\n<p>3. Another nice thing about being a regular at a place that values regulars is that you meet the other regulars. This summer I was often left to my own devices for dinner and a couple times a week, I ended up at my local. And almost without exception, I ended up having dinner with someone I’d previously met at the bar. Routinely turning a solo dining experience into dinner with a friend is an amazing accomplishment for a restaurant.</p>\n\n<ol><li><p>Something I read in one of food writer Jeffrey Steingarten’s books has always stuck with me. He said there are certain restaurants he frequents that he never writes about critically. Those places are just for him and he would never recommend them to his readers. Having written for so long here on kottke.org, there are certain things I hold back, that are just for me. Having a public opinion on absolutely everything you love is no way to live.</p>\n\n<p>So, no, I’m not going to tell you what restaurant I’m talking about. It’s beside the point anyway…Bruni’s not trying to persuade you to try Barbuto or Charlie Bird, it’s about you finding your own local.<a href=\"#fnref:1476219361\">↩</a></p><p></p></li></ol>\n\n         <p><em>[This is a vintage post originally from Sep 2013.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/Frank%20Bruni\">Frank Bruni</a> · <a href=\"https://kottke.org/tag/NYC\">NYC</a> · <a href=\"https://kottke.org/tag/restaurants\">restaurants</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"07f6438b10572e8ac2b79bbb662ead892b520d9275700cac5f0a4599e74212c0","category":"Sites"}