{"title":"Moving for good","link":"https://sive.rs/mfg","date":1522454400000,"content":"<p>\nYou are the way you are because of what you’ve experienced.\n</p><p>\nYour country, family, town, random circumstances, and friends have shaped the way you think.\nIf you had grown up on the other side of the world, you would have a different set of values and thought patterns.\n</p><p>\nBut if you keep experiencing the same things, your mind keeps its same patterns.\nSame inputs, same responses.\nYour brain, which was once curious and growing, gets fixed into deep habits.\nYour values and opinions harden and resist change.\nIf you don’t flex, you lose your flexibility.\n</p><p>\nYou really learn only when you’re surprised.\nIf you’re not surprised, then everything is fitting into your existing thought patterns.\n<strong>\nSo to get smarter, you need to get surprised, think in new ways, and deeply understand different perspectives.\n</strong>\n</p><p>\nWith effort, you could do this from the comfort of home.\nBut the most effective way to shake things up is to move across the world.\nPick a place that’s most unlike what you know, and go.\n</p><p>\nThis keeps you in a learning mindset.\nPreviously mindless habits, like buying groceries, now keep your mind open, alert, and noticing new things.\nNew arrivals in a culture often notice what the locals don’t.\n(<a href=\"https://sive.rs/fish\">Fish don’t know they’re in water.</a>)\n</p><p>\nDon’t think of yourself as visiting.\nSay that you’ve moved here, and mean it.\nCommit.\nImmerse.\nGo native.\n</p><p>\nForm deep friendships with locals.\nAsk lots of questions.\nAsk people to explain and show you how things are done.\nWhen they state a fact, ask how they know.\nWhen they state an opinion, ask for examples.\n</p><p>\nAt first, their values and methods will feel wrong.\nYou’ll feel the urge to tell them how their lives or ideas could be better — more like what you know.\nBut try to understand a perspective where they are right and you are wrong.\n<strong>\nEventually you’ll realize that your beliefs were not correct — they were just the local culture of where you grew up.\n</strong>\nYou’re a product of your environment.\n</p><p>\nEvery country has a shared and working philosophy.\nDive in and really try to understand it.\nThis is one of the best things you can do for your brain.\nStay immersed at least until you feel yourself saying “we” instead of “they.”\n</p><p>\nThen, if you want to keep your brain actively learning and growing forever, keep moving across the world and immersing yourself like this for the rest of your life.\n</p>\n<div><em>(I wrote this for Tynan’s new book “<a href=\"http://tynan.com/forevernomad\">Forever Nomad</a>”, so please <a href=\"http://tynan.com/forevernomad\">buy his book</a> if you like this subject.)</em></div>\n<a href=\"http://tynan.com/forevernomad\"><img alt=\"Forever Nomad\" src=\"/images/forevernomad.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"08ae12a6916749bb841e70c4e92c3ff70616bd0c5803077e0ff53175c135f6a3","category":"default"}