{"title":"Here’s how to live: Chase the future.","link":"https://sive.rs/htl13","date":1639353600000,"content":"<p>\nLive in the world of tomorrow.\n<br />\nSurround yourself only with what’s brand new and upcoming.\n<br />\nThat’s where life is made.\n<br />\nIt’s the most optimistic environment, full of hope and promises.\n</p><p>\nIt’s the smartest way to live.\n<br />\nYou’re moving forward in time, so you should watch where you’re headed.\n<br />\nGo where things are going.\n</p><p>\nIt’s the most exciting way to live.\n<br />\nEvery day will be like a child’s birthday, with surprising new breakthroughs.\n<br />\nIt keeps your brain healthy, young, and active.\n<br />\nSince everything will always be new, you won’t rely on assumptions or habits.\n<br />\nYou’ll pay full attention and keep learning every day.\n</p><p>\nMove to South Korea, and keep an apartment in Songdo, Incheon.\n<br />\nSouth Korean culture places the highest value on what’s new.\n</p><p>\nWork as a futurist and technology journalist.\n<br />\nStay on the cutting edge of things so new they barely exist.\n<br />\nEvery new invention will come to you first, before the world has heard of it.\n<br />\nLearn the basics of every field, so you can understand new innovations in logistics or chemistry or anything else.\n</p><p>\nListen only to new music.\n<br />\nWatch only new shows.\n<br />\nUse only the newest media.\n</p><p>\nGive away everything you haven’t used in a week.\n<br />\nOwnership binds you to the past.\n<br />\nDon’t get invested in any one thing.\n<br />\nStay immersed only in what’s coming next.\n</p><p>\nSpend your social time meeting new people.\n<br />\nYou’re not the same person you were last year or even last week.\n<br />\nOld friends and family see you as you used to be, and unintentionally discourage your growth.\n</p><p>\nReplace your personal daily routines.\n<br />\nWhen something becomes a habit, quit.\n</p><p>\nEvery month, visit China.\n<br />\nEverything there changes so fast that if you miss more than a month, you’ll be out of touch.\n<br />\nEvery year, visit Singapore, Jakarta, Addis Ababa, Lagos, Mumbai, Ho Chi Minh City, and Silicon Valley.\n<br />\nEach is creating the future in very different ways.\n</p><p>\nWhen a new country declares independence, go immediately.\n<br />\nAll conversations there will be focused on the future.\n</p><p>\nAvoid Europe and anywhere that lives in the past.\n<br />\nPlaces that resist change have no vision, only memories.\n<br />\nYesterday is gone for good.\n<br />\nThe past is dead.\n<br />\nResurrecting it makes ghosts and zombies.\n</p><p>\nAvoid religion because faith is not meant to be questioned.\n<br />\nTradition is the opposite of what you want.\n<br />\nNothing worshipped will change.\n</p><p>\nOppose convention because that’s how things were.\n<br />\nSlavery was a convention.\n<br />\nHuman sacrifice was a convention.\n<br />\nDenying human rights to women was a convention.\n<br />\nSome day our current conventions will seem as wrong as these.\n<br />\nSince you live in the future, start condemning them now.\n</p><p>\nThe best benefit of living this way is how you cut all ties and never look back.\n<br />\nEvery day will be like amnesia.\n<br />\nWhatever traumatic thing might have happened in your past, it no longer defines you.\n<br />\nIn your world, the past has no power at all.\n</p><p>\nChasing the future is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"08fcb333b73cf5015ff404f82e6c29e64d5757d41ab525edd735dae9ef1ad7d9","category":"default"}