{"title":"Squaring the Reality of What We See","link":"https://kottke.org/24/05/squaring-the-reality-of-what-we-see","date":1715022903000,"content":"\n        <p>Gareth Fearn writing for the London Review of Books about the student protests on US campuses: <a href=\"https://www.lrb.co.uk/blog/2024/may/liberalism-without-accountability\">Liberalism without Accountability</a>.</p>\n\n<blockquote><p>This is a toxic combination: universities reliant on investment portfolios in a system where mega-profits are made by companies that threaten and destroy human life, influenced by an increasingly radicalised class of billionaires, teaching students whose degrees won’t earn them enough to pay off their loans, managed by supine administrators threatened by (or willingly collaborating with) a reactionary right, who have decided that young people’s minds are being turned against capitalism not by their own lived experience of austerity and racialised police violence but by ‘woke Marxist professors’. This situation has now met with a live-streamed genocide which is supported, and brazenly lied about, by political leaders and commentators who claim to stand for truth and justice. Students, like much of the public, cannot square the reality of what they see with the world as constructed by politicians and the media.</p>\n\n<p>Under such circumstances, pitching tents, raising placards and demanding divestment are really quite mild-mannered responses. That they have been met, in many US universities, with militarised policing reflects the fragility of liberalism — in the face of the growing hegemony of the conservative right as well as its own inability to offer a future even to Ivy League college students, let alone the less privileged.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/education\">education</a> · <a href=\"https://kottke.org/tag/Gareth%20Fearn\">Gareth Fearn</a> · <a href=\"https://kottke.org/tag/policing\">policing</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"09e35e8cab1eb911dd2809967bfb45293e818bfc57a64f93377d63cb46445406","category":"default"}