{"title":"FTC: Rule on Impersonation of Individuals","link":"https://ghuneim.com/2024/02/20/rule-on-impersonation-of-individuals/","date":1708430190000,"content":"<p>The Federal Trade Commission (FTC or Commission) requests public comment on its proposal to amend the trade regulation rule entitled<a href=\"https://www.ftc.gov/system/files/ftc_gov/pdf/r207000_impersonation_snprm.pdf\"> Rule on Impersonation of Government and Businesses </a>(Impersonation Rule or Rule) to revise the title of the Rule, add a prohibition on the impersonation of individuals, and extend liability for violations of the Rule to parties who provide goods and services with knowledge or reason to know that those goods or services will be used in impersonations of the kind that are themselves unlawful under the Rule. </p>\n<p>The agency is taking this action in light of surging complaints around impersonation fraud, as well as public outcry about the harms caused to consumers and to impersonated individuals. Emerging technology – including AI-generated deepfakes – threatens to turbocharge this scourge, and the FTC is committed to using all of its tools to detect, deter, and halt impersonation fraud.</p>\n<p>Statement of Chair Lina M. Khan expands on AI’s impact </p>\n<p>The rise of generative AI technologies risks making these problems worse by turbocharging scammers’ ability to defraud the public in new, more personalized ways. For example, the proliferation of AI chatbots gives scammers the ability to generate spear-phishing emails using individuals’ social media posts and to instruct bots to use words and phrases targeted at specific groups and communities.7 AI-enabled voice cloning fraud is also on the rise, where scammers use voice-cloning tools to impersonate the voice of a loved one seeking money in distress or a celebrity peddling fake goods.8 Scammers can use these technologies to disseminate fraud more cheaply, more precisely, and on a much wider scale than ever before.</p>\n<p>A summary of the changes…</p>\n<p><strong>Proposed Changes to the Impersonation Rule</strong></p>\n<p><strong>Title Change:</strong> To reflect the broader scope of the rule, including the impersonation of individuals alongside businesses and government entities, the title is proposed to be changed to “Rule on Impersonation of Government, Businesses, and Individuals.”</p>\n<p><strong>Definition of “Individual”:</strong> The addition of a definition for “Individual” to mean any person, entity, or party, real or fictitious, other than those constituting a business or government. This aims to clarify the types of impersonation prohibited.</p>\n<p><strong>Prohibition of Individual Impersonation:</strong> Introduction of a new section, “Impersonation of Individuals Prohibited,” to explicitly prohibit impersonation of individuals in commerce, mirroring existing prohibitions against impersonating government entities and businesses.</p>\n<p><strong>Provision of Goods or Services for Unlawful Impersonation</strong>: A new section to make it unlawful to provide goods or services with knowledge, or reason to know, that they will be used in impersonation scams. This amendment seeks to address concerns about broad interpretation and potential imposition of strict liability on unaware third parties, by including a knowledge requirement.</p>\n<p>Impact Across Sectors</p>\n<p>The language that extends liability — would impact entities that provide goods and services used in impersonation scams, knowingly or with reason to know, are held liable under the proposed amendments. This would include telecommunications companies to social media platforms, essentially any service that could be used as a means or instrumentality for impersonation. The proposal emphasizes a knowledge component to prevent undue liability on those unknowingly involved, aiming to balance the enforcement of rules against scammers with the legitimate operations of businesses.</p>\n<p>Get your comments in during the window  </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"0a04c2361e884c850cb6b702159df9794258c4464021bc68ae7e8e07772827cf","category":"default"}