{"title":"Streaks","link":"https://www.usv.com/writing/2024/06/streaks-2/","date":1719232805000,"content":"<p>Farcaster added streaks to the protocol a few days ago:</p>\n<p>And I started one in the /AVC channel .</p>\n<p>Streaks are a powerful mechanism to bring users back every day. Duolingo and Snap have been very successful using streaks to increase frequency and retention and user value.</p>\n<p>I have a long history with streaks. As this post lays out , I had a streak of blogging every day for about sixteen years between 2003 and 2019.</p>\n<p>So why are streaks so powerful?</p>\n<p>Well first and foremost, they establish a goal, to do something every day, and remind you to do it. This technique has been used very effectively in fitness, weight loss, education, and many other sectors long before technology became part of every day life.</p>\n<p>But also, the streak becomes more powerful the longer they go on. A streak of a few days can easily be tossed aside. A streak of sixteen years? Not so easily.</p>\n<p>During my blogging streak, I woke up every day thinking “what am I going to write about today?” It was a lot of fun, I got an enormous amount of benefit from it, and like many streaks, it became a burden eventually.</p>\n<p>Streaks reprogram the brain to need to do something every day to feel complete.</p>\n<p>You don’t need technology to learn to do these things:</p>\n<p>save a bit of money every paycheck</p>\n<p>break a sweat every day</p>\n<p>teach yourself something new every week</p>\n<p>But these things are so great for you. They can change your life. A tiny little bit every day or week.</p>\n<p>And using technology to help you get on a streak and stay on one is about as good a use of technology as there is.</p>\n<p>So when you build your app, build streaks, streak notifications, and streak recognition into it. It will help bring users back, increase frequency, retention, and user value.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/streaks-2/\">Streaks</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"0a4fb0ff0c550300d20210ee34d3bc8795bc8fe43b7db861c28e9eaed9dd311a","category":"default"}