{"title":"Travel is best with young children","link":"https://sive.rs/tk","date":1652054400000,"content":"<p>\n“Once you have a baby, you can’t travel.”\nI’ve heard this so many times, although only from people who haven’t done it.\n</p><p>\nBut I took my baby to nine countries before he was one year old.\nThen another ten countries by the time he was eight.\nSo I can tell you from experience that <strong>it’s not only easy but great.</strong>\n</p><p>\nWe need to share this with new parents.\nToo many new families are cooped-up, stewing, frustrated, and bored in their home, when it’s actually the best time to get out.\n</p><p>\nTravelling with a baby or young child is <strong>the best way to visit somewhere new, exotic, and interesting.</strong>\nIt’s even <strong>better than travelling alone or as a couple.</strong>\nHere’s why.\n</p>\n\n<h2>\nThey help you stop and appreciate.\n</h2>\n<p>\nWhen my baby was ten days old, I took him out to a park for the first time, and he saw his first tree.\nI imagined it from his perspective, as if I’d never seen a tree before.\nSo complex!\nSo beautiful.\nI appreciate trees more since then.\n</p><p>\nSame with the other senses.\nSmelling dirt.\nTouching a caterpillar.\nListening to birds.\n</p><p>\nBefore him, I was often in a hurry, trying to get somewhere else.\n<strong>\nBabies help you stop and pay attention.\nWhen you travel, this is what you need.\n</strong>\nLess rushing to a destination.\nMore stopping to appreciate everything inbetween.\n</p>\n\n<h2>\nYou see better through their new eyes.\n</h2>\n<p>\n<a href=\"https://www.drawright.com/\">One way</a> to teach realistic drawing is to turn an image upside down before drawing it.\nThis helps you see what’s actually there instead of what you think <em>should</em> be there.\nUpside down, you see just lines and shading.\nDraw those, and you get a more accurate result.\nThis trains you to see more reality than assumption.\n</p><p>\nSame with your child’s senses.\nInstead of categorizing something — like “tree” — and overlooking it, you can experience it through their eyes to see the wonderful complexity of <strong>what’s actually there</strong>.\nNo names.\nNo labels.\nWhich leads to the next point…\n</p>\n\n<h2>\nNo prejudice.\n</h2>\n<p>\nIndia, Pakistan, Israel, Brazil, Vietnam, Nigeria, China, Russia.\nYou have thoughts about these places.\nYou’ve heard people say things about them, and that’s affected your perception.\nYou judged them before actually going there.\n</p><p>\nMen in monk’s robes or camouflage.\nWomen in burqas or bikinis.\nEye shape.\nSkin color.\nIt’s hard to see past your pre-judgements.\n</p><p>\n<strong>\nYour child has no prejudices.\n</strong>\nThis is my favorite part.\nI often go to places I’m biased against.\nSeeing them through my child’s unbiased perception, and interacting with the people as such, helps me connect, which then helps me expire my old opinions.\n</p><p>\nI wish I could take him with me everywhere, like glasses.\n</p>\n\n<h2>\nNothing (everything) is weird.\n</h2>\n<p>\nJapan, Peru, and Zanzibar feel exotic to me.\nStrange.\nSuper-different.\nWeird. \n</p><p>\nYour home feels normal and right because you spent many years there.\nThen when you go somewhere very different, it feels exotic and even wrong.\nYou think of your home as “normal” and the new place as “weird”.\nYou keep it at a distance.\nYou think “them” not “us”.\n</p><p>\nBut to your child, everything is new anyway.\n<strong>\nEverything is equally strange, so nothing is strange.\n</strong>\nThis helps you see it as just another way of doing things.\nNot weird.\nNot wrong.\nThis helps bridge the differences, and feel like “us” not “them”.\n</p>\n\n<h2>\nAirports are more fun.\n</h2>\n<p>\nEspecially for children, airports are <strong>not just a way to get somewhere else, but their own destination.</strong>\nGreat people-watching.\nSo many sounds.\nSo many other kids to play with, waiting at gates.\nYou learn to get to the airport super-early to leave time for all of this.\n</p><p>\nYou get preferential treatment when flying.\nBoarding early.\nFlight attendants extra-friendly.\n</p><p>\nAnd until my son was three years old, the only time we ever let him watch a screen was on a plane, so he was completely transfixed while flying.\n</p>\n\n<h2>\nYou don’t need to bring much.\n</h2>\n<p>\nWhen you go somewhere exotic, it’s fair to worry that they might not have something you need — like a special part for your electronic thing.\nBut packing for kids is easy.\nBaby supplies are everywhere.\nEverywhere has diapers, baby food, and all necessities.\n<strong>\nPack only for the journey.\n</strong>\nGet everything else after you arrive.\n</p>\n\n<h2>\nKids aren’t impressed with “impressive”.\n</h2>\n<p>\nThis took me a long time to learn.\nI would travel for hours to take my son somewhere really impressive — some superlative structure or view.\nOnce we arrived, he would be thrilled by the tiniest thing.\n“Oooh! Look! Caterpillar!”\nHe was never impressed with what was supposed to be impressive.\n</p><p>\nI drove hours to take him to a famous landmark, but we never made it past the entrance because he was so fascinated with a dead log filled with bugs.\nWe played with that log for hours until it was time to leave.\n</p><p>\nEnd result?\nThey’re right!\n“Impressive” is for adults.\n“Impressive” is often satisfying a bucket list, but it can make you overlook <strong>what’s actually fun</strong>.\nKids help you keep this in perspective.\n</p>\n\n<h2>\nBabies bring out the best in people.\n</h2>\n<p>\nEverybody loves babies.\nIt’s like travelling with a puppy.\nEveryone melts.\nEveryone stops to interact.\n<strong>\nBabies connect you with people.\n</strong>\n</p><p>\nI met with a friend in Chiang Mai, Thailand.\nHe’s lived there for ten years.\nWe walked around town for an afternoon with my son.\nSo many people stopped to interact with my baby, make faces with him, and ask questions about where we were from.\nAfterwards my friend said that more people stopped to talk with us that one afternoon than in his ten years of living there combined.\n</p>\n<br />\n<p>\nSo, yes.\nDispel the myth.\nSpread the word.\n<strong>\nTravelling with babies or young children is the best.\n</strong>\n</p>\n\n<img src=\"/images/tk.jpg\" alt=\"photo of baby on jackfruit\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0ae1e41a08ee7b14f1769d5cec6658cc9eac3cf0174d9c276ad9617e8c7db54e","category":"default"}