{"title":"Filtered for home robots, fast and slow","link":"https://interconnected.org/home/2024/09/20/filtered","date":1726850580000,"content":"<div>\n<h3>1.</h3>\n<p>This robot arm can do your tidying up.</p>\n<p>TidyBot, a research “mobile manipulator” from Princeton, <a href=\"https://tidybot.cs.princeton.edu\">successfully puts away 85.0% of objects in real-world test scenarios</a>.</p>\n<p>It uses large language models to quickly learn preferences (e.g. shirts on the shelf vs in a drawer).</p>\n<p>Instruction following used to be one of the great challenges for home robots. LLMs solved that problem at a stroke.</p>\n<p>I have previously speculated about portable home robot arms…</p>\n<p><a href=\"https://interconnected.org/home/2021/08/25/cobots\">From 2021</a>:</p>\n<blockquote>\n<p>it would pick up all the toys and tidy them away, shelve any books, and find the TV remote control and put it back in the regular place.</p>\n</blockquote>\n<p>Or do the washing up. Or open my post.</p>\n<p><a href=\"https://interconnected.org/home/2022/03/22/robots\">From 2022</a>:</p>\n<blockquote>\n<p>Knead sourdough. Mix cocktails. Catch tiny house plant flies out of the air.</p>\n</blockquote>\n<p>Or, having used my credit card to buy material, knowing that today’s AIs can already author web apps, <a href=\"https://interconnected.org/home/2024/06/21/overton\">build furniture</a>: <em>\"hey siri make me a table.\"</em></p>\n<p>Why not? What gives?</p>\n<h3>2.</h3>\n<p>Here’s a very fast robot.</p>\n<p><a href=\"https://ishikawa-vision.org/fusion/Janken/index-e.html\">This robot hand will beat you at rock-paper-scissors 100% of the time.</a></p>\n<p>It can recognise a competing hand gesture in 1 millisecond and move its own hand to make the winning gesture to complete at the same time.</p>\n<p>At a certain point in the future, it will be cheaper for me to purchase a superhumanly quick catching robot to follow me around in case I drop my iPhone versus buying AppleCare in case of a shattered screen.</p>\n<p>I wonder when the cost crossover point will be. Sooner than we imagine, I bet.</p>\n<h3>3.</h3>\n<p><a href=\"https://www.youtube.com/watch?v=Y2usYHt0eAs\">A robot bedside lamp that walks like a spider</a> <em>(YouTube).</em></p>\n<blockquote>\n<p>With this, you don’t have to be afraid when you leave your room to go to the bathroom in the middle of the night.</p>\n</blockquote>\n<p>Except for the fact that you are following a lamp carried by a scuttling ROBOT SPIDER I guess.</p>\n<p>The robot is made by user @lanius_movie who is an individual inventor in Japan.</p>\n<p>See also their <a href=\"https://www.youtube.com/watch?v=R3PPk_Fs1g0\">robot spider laundry basket controlled by ChatGPT</a>:</p>\n<blockquote>\n<p>I have started an experiment where housekeeping robots work autonomously based on the conditions inside the home. <u>When the washing machine finishes drying, the walking laundry basket goes ahead and waits in the laundry area.</u> I’m letting ChatGPT handle the decision-making process.</p>\n</blockquote>\n<p>I want this now?</p>\n<p>Observations:</p>\n<ol>\n<li>That laundry basket video? <em>74 views.</em> Their most popular vid, the spider bedside lamp: 5,130 views. That’s all. Frankly we deserve to live with domestic drudgery if we can’t pay attention to stuff like this.</li>\n<li>I can’t think of any of my home furnishings that wouldn’t be improved with (a) legs and (b) autonomy.</li>\n</ol>\n<h3>4.</h3>\n<p>Here’s a very slow robot for yard work.</p>\n<p>In April, <a href=\"https://x.com/natfriedman/status/1781364271429058893\">Nat Friedman posted on X</a>:</p>\n<blockquote>\n<p>Instead of leaf blowers, I want a quiet little robot that picks leaves up one at a time and puts them in a bag, at night while I’m sleeping.</p>\n</blockquote>\n<p>By August, a small team had made it: <a href=\"https://x.com/natfriedman/status/1825243549455327483\">here’s a video clip</a>.</p>\n<p>And that feels ideal?</p>\n<p>Instead of noisy and quick and energy intensive…</p>\n<p>…why shouldn’t a robot bask in the sun during the to charge its batteries, and quietly move around picking up leaves one by one all night?</p>\n<hr />\n<p>Look, you lazy trillionaires.</p>\n<p>Give me a robot that can defrag my home.</p>\n<p>Let me point at any object and say where it should be instead.</p>\n<p>That toy should be upstairs. Those shoes should be in the tub. Move any used crockery to where the dishwasher is. All t-shirts older than X years should be gathered for recycling. </p>\n<p>Overnight, and while we’re  out, the domestic defrag robot moves all the things to other rooms, upstairs and downstairs, and stacks like objects neatly.</p>\n<p>It doesn’t move at all if anyone is present.</p>\n<p>It doesn’t matter how unhurried it is. It has all the time in the world.</p>\n\n\t<hr />\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/filtered-for\">filtered-for</a>\n\t(110), \n\t\n\t<a href=\"https://interconnected.org/home/tagged/robots\">robots</a>\n\t(8).\n\t\n\t</small></p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"0af5b3251abead40b301af6e03bbd6a3e9a50170ab8f97edc7481a8041392560","category":"Sites"}