{"title":"Beware of advice","link":"https://sive.rs/advice","date":1456358400000,"content":"<p>\nImagine that you hand someone your camera, and ask him to take a photo of you.\nHe does, but when you look at the photo later, you notice that he took a photo of himself by mistake.\n</p><p>\nImagine you’ve got a big question like, “Should I quit my job and start my own company?”\nYou go ask the advice of some successful people you respect.\nBecause they can’t know everything about you and your unique situation, they’ll give advice that’s really just a reflection of their own current situation.\n</p><p>\nSo let’s look at some ways that advice is biased.\n</p><p><strong>\nLottery numbers:\n</strong>\nWhen successful people give advice, I usually hear it like this:\n“Here are the lottery numbers I played: 14 29 71 33 8. They worked for me!”\nSuccess is based on so many factors.\nSome are luck.\nSome are not.\nIt’s hard to know which are which.\nSo which do you learn from?\n</p><p><strong>\nUnderdog opinion in their context:\n</strong>\nSomeone giving advice doesn’t want to say what’s been said too much already.\nBut he’s basing that on his surroundings, not yours.\nSo if everyone around him is quitting their jobs, his advice to you will be to keep your job.\nThat advice has nothing to do with what’s best for you — it’s just the opinion that seems under-represented in his environment that day.\n</p><p><strong>\nCreative sparks:\n</strong>\nYou ask, “What should I do, option A or B?”\nHe replies, “Zebra!”\nHe’s treating the situation as an invitation to brainstorm, giving a crazy suggestion just to open up <a href=\"https://sive.rs/options\">more options</a>.\nLike an <a href=\"https://duckduckgo.com/?q=oscar+wilde+quotes\">Oscar Wilde quip</a>, it was meant to be mostly entertaining, maybe useful, and probably not correct.\n</p><p>\nThe problem is taking any one person’s advice too seriously.\nIdeally, asking advice should be like <a href=\"https://en.wikipedia.org/wiki/Human_echolocation\">echolocation</a>.\nBounce ideas off of all of your surroundings, and listen to all the echoes to get the whole picture.\n</p><p>\n<strong>Ultimately, only you know what to do</strong>, based on all the feedback you’ve received and all your personal nuances that no one else knows.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0bac42e71d4d52cfceb1a9e0ddbad5b778dcb1d9098f99ae01e4cf0844f51095","category":"default"}