{"title":"Citibike Needs Competition","link":"https://www.usv.com/writing/2024/06/citibike-needs-competition/","date":1718279706000,"content":"<p>We just got back from week in Paris. We rode Lime and Dott bikes all over town and also rode the Metro extensivey. With the exception of the ride to and from the airport and a trip to the flea market, we didn’t get into a car all week.</p>\n<p>Paris has massively reduced it’s dependence on car traffic and has built an extensive bike lane system. Apparently the pollution from cars is way down in Paris as a result.</p>\n<p>Paris has had a city owned bike system called Velib for going on twenty years. Like Citibike, Velib has upgraded in recent years and offers electric bikes.</p>\n<p>But in addition to Velib, Paris has licensed ebike companies like Lime and Dott that compete directly with Velib. From what I see out and about in Paris, it has not impacted the use of Velibs, but has done two very important things.</p>\n<p>First, Lime and Dott offer ebikes exclusively so the availability of ebikes in Paris is abundant whenever you want one. And Lime and Dott are not Kiosk based but do have to park in designated “Velo” parking spots. Those spots are basically on almost every block.</p>\n<p>Contrast this with NYC, which also has built an extensive bike lane system and has seen biking explode as an alternative to the subway and cars.</p>\n<p>This morning my nearest Citibike kiosk had only eight bikes in it. Six were the new grey ebikes and none were available due to dead batteries. Of the other two regular bikes, only one was available. So I took it and rode to my coffee shop where I’m writing this post.</p>\n<p>Citibike has been great for NYC. I use it pretty much every day when it is nice outside. I love it. But it needs competitors like Lime and Dott.</p>\n<p>NYC only needs to look to Paris to see the benefits of competition and kiosk less systems. Bringing them to NYC won’t hurt Citibike but it will massively expand the amount of riding going on, particularly on ebikes which are easier to ride and are a great way to get to and from work.</p>\n<p>In the current NYC, where congestion pricing is dead and the subway system is scrambling for money, doubling down on biking makes all the sense in the world.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/citibike-needs-competition/\">Citibike Needs Competition</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"0c4c9e6a5aa54c1b219cfd64e2f6e6535f3e0197c9bf604a4f98ed649a270081","category":"default"}