{"title":"Y&#8217;all Like Books?","link":"https://kottke.org/24/03/yall-like-books","date":1711757929000,"content":"\n        <p>I love books a bunch, mostly contemporary fiction and sometimes non-fiction, and I thought it would be fun if we had a comments thread about books you like or don’t like or want to read? Maybe you’ll get a suggestion for something you’d like to read.</p>\n\n<p>Here are some books I’ve loved the last few years:<br />\n</p><ul><li>Harlem Shuffle and Crooks Manifesto by Colson Whitehead</li><br />\n<li>Heaven and Earth Grocery and Deacon King Kong and The Good Lord Bird by James McBride</li><br />\n<li>Final Revival of Opal and Nev by Dawnie Walton</li><br />\n<li>Tomorrow, and Tomorrow, and Tomorrow by Gabrielle Zevin</li><br />\n<li>Sellout by Dan Ozzi</li><br />\n<li>Gone to the Wolves by John Wray</li></ul><p></p>\n\n<p>This year I’ve really liked: <br />\n</p><ul><li>North Woods by Daniel Mason</li><br />\n<li>Wellness by Nathan Hill</li><br />\n<li>Biography of X by Catherine Lacey (I actually can’t decide if I liked this or if I just want to talk to people about it. I hated all the characters.)</li><br />\n<li>The Rachel Incident by Caroline O’Donoghue </li><br />\n<li>Running the Light by Sam Tallent</li></ul><p></p>\n\n<p>Favorites of all time!!<br />\n</p><ul><li>Undermajordomo Minor by Patrick deWitt and </li><br />\n<li>Gentleman in Moscow by Amor Towles. (<a href=\"https://www.youtube.com/watch?v=5PpUtjfZB5g\">The long awaited TV adaptation</a> of GiM with Ewan McGregor starts today on Showtime.)</li><br />\n<li>Pride and Prejudice by Jane Austen</li></ul><p></p>\n\n<p>Also, what do you think about a Kottke.org book club? Let’s do a bookclub, right? I’m not really sure how it would work except for probably we’d all read the same book at around the same time and then probably we’d all gather somewhere on this website and talk about the book, probably in a comments thread, though it remains to be seen. Comment down below if y’all are interested and Jason’s gonna come back from vacation and I’ll say, “Surprise, buddy, now youse got a book club!” and then we’ll go from there. <br />\n(And by “there” I mean we’ll figure out a book and time and method for discussion and then we’ll tell you about it.) </p>\n\n<p>What have you been reading? </p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/yall-like-books\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"0c8304d80b5c9f9dc9a0348c7880830fd932580af3fb5ff523c32f99a8327b03","category":"default"}