{"title":"Business Models at the Edge of Healthcare","link":"https://www.usv.com/writing/2024/11/business-models-at-the-edge-of-healthcare/","date":1732191089000,"content":"<p>I am convinced that the best way to fix the healthcare system is to reinvent it from the outside in. I am hopeful that this is possible and that there are enough entrepreneurs and people disenchanted with the status quo who are ready to create this change. There are certainly tailwinds, many of which we articulated in Healthcare at the Edge . People are fed up with the existing system, they are taking charge of their own health and wellness, we have tools like Supp and Consensus to make our own research-informed decisions, the DeSci movement is pushing science to the edge, and services and products are popping up at the edge of the system that are going direct to consumers.</p>\n<p>One thing I have been thinking about lately is the types of structural business models that might emerge to facilitate this transformation. Right now, the way our healthcare system works in the US is insane. For most of the population, our employers pay for our insurance which dictates what doctors or hospitals we can visit and how much we pay for medications. This makes absolutely no sense and is the result of years of bad policy, lobbying, and decisions that were sometimes made with the best of intentions but, when layered upon each other, created a labyrinthine mess of complexity and inefficiency. It also put everyone else’s interests at the center of the system and leaves the patient on the periphery. Fuck that.</p>\n<p>Insurance, in every other industry, is used to hedge risk in the event of a catastrophic event. Imagine if your home insurance had final approval on how you could furnish or paint your house. Or if your car insurance only let you fill your gas tank at certain stations they cut deals with. Insurance is a product we buy so we can have assistance in times of dire need. So why does our health insurance dictate what doctors we can see, what drugs we can buy, what procedures or tests we can have done, and how the people who are supposed to care for us behave? It should be there for us if we suffer from a medical emergency. It should not dictate how we interact with the health system in between emergencies.</p>\n<p>The best way to build things at the edge of the healthcare system is to work directly with patients and individuals. There are two primary and obvious business models here that stand out: the patient (customer) pays directly, or the product is free and someone else pays (eg an advertiser) is the equal or primary customer.</p>\n<p>On the former, I keep hearing about the “Tesla model.” Entrepreneurs start with a high-end service (like the concierge doctor I pay for out of pocket) that is only affordable to a small subset of the population. Over time, they can deliver a lower-cost product to a mass market audience because of AI, operational improvements, economies of scale, etc. This was the Tesla strategy – start high-end and work your way down the affordability spectrum over time.</p>\n<p>The latter model is closer to what we experience with social media. You can use products for free, but your data is used to target you with contextually relevant offers (eg pharmaceutical advertising, full-body MRI scans, etc.). I would like to see a lot more in this category, and I hope we will. Free products that help people, even with an ad-supported model, are a net good when the core offering helps people.</p>\n<p>I think both of these models are perfectly acceptable and should be broadly embraced. If there is enough demand for these products that operate at the edge of the system, maybe things will change at the center of it. Perhaps we will find new ways to create insurance programs or models to fund drug development and for patients to pay for their medications. Perhaps insurance won’t dictate so many things about our own health and wellness decisions. I am excited for these changes to happen, but they rely on the proliferation of new business models and products and services that consumers will embrace. I am eager to see more of them emerge and for creative people to develop new business model opportunities here that we haven’t yet imagined.</p>\n<p>I am convinced that the best way to fix the healthcare system is to reinvent it from the outside in. I am hopeful that this is possible and that there are enough entrepreneurs and people disenchanted with the status quo who are ready to create this change. There are certainly tailwinds, many of which we articulated in Healthcare at the Edge. People are fed up with the existing system, they are taking charge of their own health and wellness, we have tools like Supp and Consensus to make our ow…</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/business-models-at-the-edge-of-healthcare/\">Business Models at the Edge of Healthcare</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"0d778368ddc69e898ec7fae05cb9d84d6b04b057c65c7382c55f5b54e2649d68","category":"Sites"}