{"title":"","link":"http://scripting.com/2024/09/24.html#a154033","date":1727192433000,"content":"<a href=\"https://en.wikipedia.org/wiki/The_Carey_Treatment\"><img src=\"https://imgs.scripting.com/2024/09/24/careyTreatment.png\" /></a>Imagine no doctor would treat you for a serious illness until it was on the verge of killing you. That's the situation women with troubled pregnancy, if she lives in the wrong state, is in, in the United States, now. Imagine the frustration of people in the medical system. It must drive them crazy, because it's so counter to their purpose and ethics. They <i>have to </i>help a patient in need. From the patient's point of view, I have a slight inkling about what this is like because twice in my life I've needed health care to save me from imminent death. The health care system never hesitated to help. But what if they had said \"we're calling our lawyers to see if we can help you\" or \"the lawyer will be here soon to do a physical exam to decide if we can treat the problem,\" or \"we can't admit you until a judge rules that we can.\" In the new USA, abortion is like a pardon, something only the government can grant. Forget about juries of our peers. It raises so many questions. If a woman is about to miscarry are they even allowed to admit her to the hospital, or does she until she is actually dying? If you can check her in, what are the limits of the treatment they can provide? Aspirin? Blood? Oxygen? The can't have any idea what the courts will say was an abortion or not, because all they have is the Supreme Court decision. And btw, medicine has advanced a <i>lot</i> since before Roe v Wade. Whatever practices they had for avoiding abortion can't apply now. This is the kind of thing no society should change the way we changed it. We are learning about a serious flaw in our system of government. They should not be allowed to enter the practice of medicine. That should be a constitutional amendment, at least as revered as the 2nd Amendment. If you're a man do you think your mother, sister, wife, daughter, friend -- are any less protected than your gun?","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"0dc23e60321d377ab83d95162425c2d75391055bc1553072786ce9654db697a8","category":"Sites"}