{"title":"Yo-Yo Ma Performs Bach in Alaska for Earth Day","link":"https://kottke.org/24/04/yo-yo-ma-performs-bach-in-alaska-for-earth-day","date":1714166380000,"content":"\n        <p></p>\n\n<p>This is a nice thing to end the week on: Yo-Yo Ma playing “Bach’s Prélude from Suite No. 2, amidst the melting permafrost on Lower Tanana Dene lands in Fairbanks, Alaska.” He was brought to this birch forest by <a href=\"https://www.instagram.com/daazhraii/\">Princess Daazhraii Johnson</a>, a member of the <a href=\"https://gwichincouncil.com/gwichin\">Neets’aii Gwich’in</a> people, who wrote:</p>\n\n<blockquote><p>Our relationship to our birch relatives, our salmon relatives, and all the beings of Alaska are sacred. Our traditional stories tell us that at one point we all spoke the same language … we still do. If we find the time to truly listen, we might recognize ourselves in the melting permafrost or the fallen birch, but we might also recognize ourselves in the songs of the birds or the freshness of the Arctic breeze. There is still hope when we experience life. We should all fall in love with the places we live and let this love drive our determination to protect the waters, the salmon, the caribou, and all our plant relatives so that future generations may also experience such joy and sustenance.</p></blockquote>\n\n<p>Have a good weekend, everyone.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Alaska\">Alaska</a> · <a href=\"https://kottke.org/tag/Johann%20Sebastian%20Bach\">Johann Sebastian Bach</a> · <a href=\"https://kottke.org/tag/music\">music</a> · <a href=\"https://kottke.org/tag/Princess%20Daazhraii%20Johnson\">Princess Daazhraii Johnson</a> · <a href=\"https://kottke.org/tag/Yo-Yo%20Ma\">Yo-Yo Ma</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"0de31ac08ec63346f76df298aa8ccadbd2f1baa49765cca42b252978443f94d9","category":"default"}