{"title":"Capturing The Vibes","link":"https://www.usv.com/writing/2024/11/capturing-the-vibes/","date":1732195864000,"content":"<p>Sharing music has always been central to USV. Over the firm’s lifetime, we’ve invested in companies like SoundCloud, Mediachain, turntable.fm, Sofar Sounds, and Splice. Back in ‘91, one of us hosted a public access television show called Underground Railroad: Independent Music for Independent Minds , dedicated to discovering and celebrating emerging artists. In some months, we attend as many live shows as board meetings. And, for as long as Twitter was Twitter, Fred and Andy have started their mornings by sharing new music with each other.</p>\n<p>We like to say, “USV is a conversation.” But if we were anything else, we’d be a playlist.</p>\n<p>Our new office at 817 Broadway carries forward this tradition of melomania. We’ve equipped the space with 3 Sonos Moves and a connected iPad at the front desk, always ready to set the tone. With this setup comes a new ritual: the first person in the office each morning has the honor—and the responsibility—of selecting the day’s soundtrack.</p>\n<p>Some mornings, the default is pre-set pop hits. Most days, it’s classic rock. But occasionally, someone will try to take us on a journey.</p>\n<p>We’re a firm that values sharing—whether it’s our perspectives, our work, or our interests. And because music is such an integral part of who we are, it feels natural to share our musical rituals with the world, much like we do with our investment theses or the way Fred and Andy used to share tracks each morning.</p>\n<p>“I’m in the process of going over all of the songs I favorited this year and putting my top ones into a playlist… It forces me to reflect, think, and focus on what is/was most important.” – Fred Wilson, Putting The Year In The Review Mirror (2017)</p>\n<p>To that end, we created Office Vibes , a simple GPT-powered tool built using Zapier. Here’s how it works: every song we listen to in the office is automatically recorded in a Notion database via Spotify &amp; Soundcloud accounts owned by The Librarian. At 4 PM each day, Office Vibes pulls the playlist from that database and sends it, along with a custom system prompt, to a GPT that does two things:</p>\n<p>Captures the day’s vibes – It analyzes the playlist to reflect the mood and energy of the office.</p>\n<p>Creates matching visuals – It generates imagery inspired by the day’s musical feel.</p>\n<p>Today’s Office Vibes: Breezy guitar strums from DOPE LEMON and Faye Webster meet the lush synths of Khruangbin and Say She She. Alice Phoebe Lou and Arlo Parks add tender intimacy, while Jungle and Mk.gee inject subtle grooves. A balance of mellow warmth and exploratory beats.</p>\n<p>We then share those vibes with the world—a small but meaningful way to open a window into life at USV, through the lens of the music that moves us through the day.</p>\n<p>How we capture and share our daily soundtracks with the world.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/capturing-the-vibes/\">Capturing The Vibes</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"The Librarian","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"0e53589b24c0f2a73d14e12c2b34a2456dfecb4a864fa370c6db05aaa6a65cce","category":"Sites"}