{"title":"Everything Wrong with the Democrats","link":"https://www.usv.com/writing/2024/06/everything-wrong-with-the-democrats/","date":1718052369000,"content":"<p>The US political system is in turmoil because the Republicans have been high-jacked by Trump and the Democrats have become hypocritical technocrats. I have written a fair bit about Trump and will write more, but today’s post is reserved for “everything” I find wrong with the Democrats. There is more and also more detail to each of these criticisms, so consider this to be an overview:</p>\n<p>Democrats have embraced an intrusive ninny state that patronizes citizens. I blame books like Nudge and the theories behind it. Government should be about creating the conditions for progress, not about micro managing citizens’ lives.</p>\n<p>Democrats have supported the surveillance state and forever wars coming out of 9/11. The recent extension of the Patriot Act is an utter disgrace. Abroad, Democrats have supported poorly thought through interventions (I am not for splendid isolation, just for not succumbing to the neocon hawks).</p>\n<p>Democrats are largely anti innovation (sometimes inadvertently, sometimes on purpose). I am a firm believer in the need for agencies such as the SEC, the FDA, and the EPA, but they require tight mandates or they will stifle innovation. We urgently need to streamline how these agencies operate. Instead, Democrats have been championing overly complex regulation. Side note: the IRA and Chips Act will stimulate innovation to a degree, but they are a crude overcorrection.</p>\n<p>Democrats are beholden to big banking. The financial crisis was an opportunity to restructure the financial sector and push back against financialization. Instead, we have wound up with even bigger and banks and more powerful asset managers. The Democrats’ rejection of crypto/web3 as a counterweight to concentration in the financial sector is a failure of imagination.</p>\n<p>Democrats don’t seem to understand how to regulate digital technology. They worry rightly about the market power of big corporations such as Google, Facebook and Amazon, but then go back to an industrial age toolbox, instead of coming up with digitally native regulation.</p>\n<p>Democrats are wrong on immigration. Yes, we absolutely need immigration (I am an immigrant and we get the job done). We should make legal immigration easy and illegal immigration hard. And back to the idea of conditions for progress: at a time when many people feel they are falling behind, public support for immigration will diminish. Also: no country will be able sustain the pressure of growing immigration waves as the climate crisis unfolds.</p>\n<p>Democrats have pursued a failed strategy on diversity and gender. Making a large section of the population feel bad will not get people to change their beliefs it will just make them resent you and the people you are trying to help (I will write a blog post at some point about another approach that I have come across recently that seems much more promising). Thankfully this seems to be somewhat on the way out.</p>\n<p>So yes. I can easily see a type of Republican candidate that I would vote for in a presidential election. This would be someone of strong character who has a real plan to tackle these problems by building a broad coalition. Alas, Trump is not that.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/everything-wrong-with-the-democrats/\">Everything Wrong with the Democrats</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"0e55408f2cc3adb98077a217550f03e88cd61b86767584f815a86c01b942a746","category":"default"}