{"title":"What&#8217;s The One Thing Only You Noticed?","link":"https://kottke.org/24/12/whats-the-one-thing-only-you-noticed","date":1733848360000,"content":"\n        <p>As you know, I am passionate about sweet things. All different kinds. So imagine my dismay back in 2017 when I discovered the recipe for Heath Bar Klondike had been changed to remove any trace of Heath Bar bits from the Klondike. It wasn’t just one box of Heathless wonders neither, it was box after box, which I kept buying like some kind of fool. This post has a point past petty dessert-themed grievances, I stg, bear with me. But first, look at this nonsense. (If you want the point, just skip to the last paragraph.)</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/DJpJ-iAW0AE6OYN.jpeg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/DJpJ-iAW0AE6OYN.jpeg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/DJpJ-iAW0AE6OYN.jpeg 1200w\" loading=\"lazy\" width=\"768\" height=\"1024\" alt=\"DJpJ-iAW0AE6OYN.jpeg\" /></p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/DJpKagDXgAAK8Vg.jpeg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/DJpKagDXgAAK8Vg.jpeg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/DJpKagDXgAAK8Vg.jpeg 1200w\" loading=\"lazy\" width=\"900\" height=\"1200\" alt=\"DJpKagDXgAAK8Vg.jpeg\" /></p>\n\n<p>2017 was a time when Google still worked so I searched to see if anyone else had noticed this change and didn’t find anything. I am not a narcissist, but I can spin a yarn, so the narrative I told myself was I was the only person in the world with the following traits: 1) cares a lot about desserts 2) likes Heath Bar Klondike Bars 3) is stubborn enough to buy a product multiple times after being so wronged and 4) is perceptive enough to notice the lack of Heath Bar bits on the Heath Bar Klondikes. </p>\n\n<p>I did what was customary at the time and complained to Klondike on Twitter. Klondike put me in touch with customer service who insisted my lying eyes hadn’t seen what they saw, and the recipe hadn’t been changed at all. It clearly had because sometime in late 2018, I tried another box and the Heath Bar bits were back. Still not as prevalent as they had been, but back nonetheless.</p>\n\n<p>All this to say at some point, my friend Mike, on the other side of the country, also noticed the lack of bits on his bars and mentioned something about it, which thus made me feel less crazy for noticing it. I was no longer alone.</p>\n\n<p>My most recent example of this phenomenon, is Irish Spring changing the formula in 2022, which many people have mentioned online because the scent changed. I don’t care about any of that, but what does bug me is you used to be able to marry an old bar with a new bar. That is, if you put the sliver of your old bar on to the new bar, it would melt into the new bar. After the formula change this doesn’t happen anymore. You stick the old bar on the new bar and never the twain shall meet. IT DRIVES ME CRAZY.</p>\n\n<p>Anyway, I was wondering if any of y’all have any bugaboos like this where you feel like you’re the only one who knows this is happening. Put it in the comments and feel less alone. </p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/food\">food</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/12/whats-the-one-thing-only-you-noticed\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"0f62f2529aa2c7f90b19b001513d36a70ae6f663d5ae301cf424f4236db2437b","category":"Sites"}