{"title":"Parenting : Who is it really for?","link":"https://sive.rs/pa","date":1498435200000,"content":"<p>\nSince my son was born five years ago, I’ve spent at least thirty hours a week with him, just one-on-one, giving him my full attention.\nBut I’ve never written about parenting before because it’s a touchy subject — too easily misunderstood.\n</p><p>\nSo why am I writing about it today?\nBecause I realized that <strong>the parenting things I do for him are also for myself.</strong>\nAnd that’s an idea worth sharing.\n</p><p>\n<strong>\nHere are the things I’ve been doing for my son since he was born:\n</strong>\n</p>\n<h3>\nCultivating a long attention span\n</h3>\n<p>\nWhatever he’s doing right now, that’s the most important thing.\nSo I encourage him to keep doing it as long as possible.\nI never say, “Come on! Let’s go!”\n</p><p>\nWe’ll go to the beach or forest, and make things with sticks and sand for half a day before he’s ready to switch.\n</p><p>\nOther families come to the playground for twenty or thirty minutes, but we stay there for hours.\n</p><p>\nNobody else can play with us like this.\nEveryone else gets so bored.\n</p><p>\nOf course my adult mind wanders to all the other things we could be doing.\nBut I let it go, and return to that present focus.\n</p>\n<h3>\nEntering his world\n</h3>\n<p>\nI’m very ambitious and try to do a lot with my life.\nBut when I’m with him, I stop everything else.\nPhone off.\nComputer off.\n</p><p>\nI try to see things through his eyes — to put myself into his mind.\nWhen he gets upset, I try to remember what it was like to be his age and relate at that level.\n</p><p>\nWhen he makes up stories, I enter his invented world.\nIf he says we’re cats in Paris, we’re cats in Paris.\nThe minotaur is chasing us?\nWe both run.\n</p><p>\nOf course I’m tempted to check my phone.\nMost of us have that addiction now.\nBut I ask myself, “What’s more important?” and leave it off.\n</p>\n<h3>\nBroadening his inputs\n</h3>\n<p>\nI want him to have a wide range of inputs into his senses.\n</p><p>\nWe go play in as many different forests, beaches, mountains, and towns as possible, touching and smelling everything we can.\n</p><p>\nI play very diverse music in the background.\nWhen we play at home, he’s listening to Persian traditional, Indian classical, ’60s jazz, <a href=\"https://en.wikipedia.org/wiki/Glitch_(music)\">glitch</a>, Bartok, Stevie Wonder (<a href=\"https://slate.com/cover_story/2016/12/the-greatest-creative-run-in-the-history-of-pop-music.html\">from ’72 to ’76</a>), lots of Bach, <a href=\"https://en.wikipedia.org/wiki/Bulgarian_State_Television_Female_Vocal_Choir\">Bulgarian choir</a>, or whatever.\n</p><p>\nWe’ve had season tickets to the <a href=\"https://www.nzso.co.nz/\">New Zealand Symphony Orchestra</a> since he was three, and never miss a concert.\nI took him to the opera <i><a href=\"https://en.wikipedia.org/wiki/Carmen\">Carmen</a></i>, and he was riveted from start to finish.\n</p><p>\nWe get a few new books from the library every week and read together for an hour every night.\n</p><p>\nWe watch a huge variety of movies, but always from start to finish without interruption, so he gets the full story arc. \nFor the big Disney blockbusters, we watch the Portuguese or Chinese translations.\n</p>\n<h3>\nAnd now, my point:\n</h3>\n<p>\nThe reason I’m finally writing about this is because I realized that <strong>I’m doing all these things for myself as much as for him.</strong>\n</p><p>\nBy cultivating his long attention span, I’m cultivating my own.\n</p><p>\nBy entering his world, I’m letting go of my own, like meditation.\n</p><p>\nBy broadening his inputs, I’m broadening my own.\n</p><p>\nI thought I was being selfless.\nBut actually, like most things we consider selfless, they benefit me as much as him.\n</p>\n<a href=\"https://sive.rs/images/horseswordbeach.jpg\"><img src=\"/images/horseswordbeach2.jpg\" /></a>\n<div>Photo of him at our favorite beach in <a href=\"https://en.wikipedia.org/wiki/Paekakariki\">Paekakariki</a>.</div>\n<p>\nP.S. You won’t find his name or face online.\nI don’t think it’s right to put someone online without their permission.\nHe’ll put himself online when he’s ready. \n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0f6b29081f2f3dd92f3efc51653dde8c11ccef368d785c045cb9d73864ec9995","category":"default"}