{"title":"Socii Dispatch 05","link":"https://blog.webb.page/2018-07-09-socii-dispatch-05.txt","date":1531094400000,"content":"<p>I guess this is turning into a bi-monthly update? Don't fret, the silence\ndoesn't mean there wasn't progress being made. Let's jump in.</p>\n<h2>Quick life update</h2>\n<p>I got a (remote) job! And a house! Kids are happy, wife is happy, so I'm\nhappy.</p>\n<h2>JSON Feed support</h2>\n<p>Every profile is now equipped with JSON Feed<a href=\"https://jsonfeed.org\">1</a> support! Created by Manton\nReece and Brent Simmons, JSON Feed aims to be the new RSS. To access your feed\n(or others), append <code>/feed</code> to a user's profile page. Here's an example:</p>\n<pre><code>https://hub.socii.network/Socii/feed\n</code></pre>\n<p>Your feed is now available for whatever you wish to use it for. Maybe you want\nto display your latest posts on your personal site? Have a customized\ndashboard? Put 'er there!</p>\n<p>Socii is a social network, yes, but not one that wants to keep you on it all\nthe time. Your data is yours.</p>\n<h2>GDPR</h2>\n<p>By now you've seen the emails and memes as a result of the passing of General\nData Protection Regulation (GDPR) in Europe. Long story short, it's a\ncollection of data protections passed into law for European citizens. This\nmeans, companies are required to protect data pertaining to any users from\nEurope and to also deliver or delete said data should the user request it.</p>\n<p>Unlike the major social networks here in America, I didn't opt to have two\nversions of privacy policies for users in Europe and those outside. EVERYONE\ndeserves to have their data protected, exported, and/or deleted at a whim. To\necho the words of Childish Gambino, \"this is America\".</p>\n<p>Now, GDPR isn't <em>perfect</em> but it's a step in the right direction. To that end,\nI've updated the policies<a href=\"https://socii.network/policies\">2</a> page to be more comprehensive about the data\nSocii collects, how that data is used, email addresses of the Data Controller\nand Data Controller officer, and so on. I dislike that it's so long though…I\nmay bring back the TL;DR version from before and have a toggle to see both.\nYeah, that's a great idea!</p>\n<h2>Notifications</h2>\n<p>This was a long time coming. When you favorite or respond to a post, the\nauthor will get a beautifully simple email stating such.</p>\n<p>The notifications tab on the hub is still empty for now but I <em>could not wait</em>\nto ship the workable part of this feature.</p>\n<p><code>@ mention</code> support for notifications will come shortly. This will pave the\nway for private messages as well.</p>\n<h2>Performance gains</h2>\n<p>Yes! FINALLY. You wanna know why loading of <code>hub.socii.network</code> was so slow? I\nwas literally loading…every…single…post before displaying the hub. Over time\nthe wait got progressively worse because there were more posts to load.</p>\n<p>Enough was enough and after I shipped notifications, I got to work on\nimplementing GraphQL-based pagination. I had this implemented <em>partially</em> for\nabout a month or so but other issues plagued me more than the slowness of the\nhub. Pagination is ALSO active on profile pages. It may not be perfect but\nit's close.</p>\n<p>A blog post to detail how to do pagination in GraphQL without Apollo, Prisma,\nor whatever magic framework is forthcoming. I've had developers attached to\nthe GraphQL project tell me that pagination is trivial<a href=\"https://github.com/howtographql/howtographql/issues/514\">3</a>, unimportant, or\neasy, both on GitHub and Slack. Or, that I NEED to use yet ANOTHER framework\nto achieve it.</p>\n<p>Good thing there are other places to find help. No matter how much I learn, I\nremember knowing a LOT less. I feel obligated to pass on the knowledge of dope\nthings. Stay tuned!</p>\n<h2>Low-hanging fruit and other changes</h2>\n<ul>\n<li>Email addresses can now have <code>+</code> and <code>.</code> characters, perfect for having\nmultiple accounts and using email aliases.</li>\n<li>When posts are deleted, favorite and reply counts are accurate.</li>\n<li>When a post with replies is deleted, the replies lose the reply icon</li>\n<li>Implementation of reposting is <em>canceled</em>, discussion here<a href=\"https://hub.socii.network/s/jfy2tm86000h10bk4i1epmp2\">4</a>.</li>\n<li>Message flasher (for lack of better description) has a reasonable z-index\nnow. No more covering navigation menus.</li>\n<li>Post preview button is now disabled when no text has been entered, bug\nreport here<a href=\"https://hub.socii.network/s/jgtl9k0n000wxobkq9a9u54k\">5</a>.</li>\n<li>New post modal now matches language with the button that triggers it, bug\nreport here<a href=\"https://hub.socii.network/s/jgtl9k0n000wxobkq9a9u54k\">5</a>.</li>\n<li>Visual issues regarding the Markdown help have been fixed.</li>\n<li>Increased character count for \"optimal display\".</li>\n<li>New post modal and reply box is now fully responsive.</li>\n<li>Got rid of as many \"magic numbers\" from the CSS as possible. This required\nsome refactoring.</li>\n<li>Refactored all my microservices and added tests. TESTS. Currently, they\ncheck for out-of-date dependencies and lints the code.</li>\n</ul>\n<h2>Things I've Learned</h2>\n<ol>\n<li>You will almost always hate your old code.</li>\n<li>Refactoring is fun. I already knew this but I like reminding myself. It's\nan opportunity to replace/improve functionality with less code.\nAMAZING. 🤩</li>\n<li>Everything can be distilled into simple concepts if you think long enough.</li>\n<li>Big Social is duplicitous.</li>\n</ol>\n<p>∴NetOpWibby<a href=\"https://hub.socii.network/NetOpWibby\">6</a>, out! 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"0f8e788a8e2a8d45d4551b83a3ee21b251f5d184da9b18f94750947b93d7de1b","category":"Sites"}