{"title":"Travelling just for the people","link":"https://sive.rs/travp","date":1675641600000,"content":"<p>\nWhen I was 21, I moved to New York City.\n</p><p>\nAn old friend travelled many hours and came to stay with me for a couple days.\nIt was his first time in New York.\n</p><p>\nI said, “Do you want to see the Statue of Liberty?  Empire State Building?  Central Park?  A Broadway show?”\n</p><p>\nHe said, “I don’t care what we do.  I just came to see you!”\n</p><p>\nI said, “Ha ha.  Very sweet, but no, seriously.  What would you like to do for the next couple days?”\n</p><p>\nHe said, “Dude.  I’m serious.  I really don’t care about any of that stuff.  I came here to see you, hang out with you, talk with you.  That’s honestly the only reason I’m here.  You don’t have to take me anywhere or show me anything.”\n</p><p>\n<strong>\nIt was one of the most touching moments in my life.\n</strong>\nSomeone spent hundreds of dollars and days of their life to travel to an exciting place, not to see the place, but just to see me.\n</p>…<p>\nMany years later, when I ran a music distribution company, I became wary of meeting people, because I (wrongly) thought that everyone wanted something from me.\nSo I started travelling secretly.\nI went to many countries without telling anyone and without meeting anyone.\nI would walk around and experience the landmarks, food, museums, and events, but barely speak unless necessary.\n</p><p>\nOne day, after a month in India, I decided to cautiously break my rule, since it was my last day before flying back to America, I thought even if someone wanted too much from me, I would escape the next day.\nSo I emailed a musician in my database that lived in Kolkata, and asked if he was free to meet up.\nHe came to my hotel and graciously walked me around Kolkata for most of the day, teaching me so much about his home town, so many insights into culture and life.\nAlso, people kept asking him for his autograph.\nThat was <a href=\"https://en.wikipedia.org/wiki/Amit_Chaudhuri\">Amit Chaudhuri</a>.\nI didn’t know he was a famous author.\n</p><p>\nWhen I think back to that month in India, <strong>I remember almost nothing but that conversation</strong>.\nLandmarks, food, museums, and events are a blur, but one <a href=\"https://sive.rs/led\">interesting conversation</a> can linger in the mind forever.\n</p><p>\nSometimes we connect with a place, but usually we connect with people.\n<strong>\nYet people connect us to a place.\n</strong>\n</p><p>\nSo, learning from my past mistakes, now <strong>my main purpose of travel is meeting people</strong>.\nWhen they offer to take me to the landmarks, I say, “I don’t care what we do.  I just came to see you!”\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"0fdff3e899096d2461633f5a2742be8fcca8d88f51403622b00ce26aee691f18","category":"Sites"}