{"title":"How to change or build your career","link":"https://sive.rs/career","date":1412553600000,"content":"<p>\nI get emails from many people wanting to change or build their career.\nI always recommend the best book on the subject: “<a href=\"https://sive.rs/book/SoGood\">So Good They Can’t Ignore You</a>” by Cal Newport.\nHere are a few of its best points:\n</p>\n<h3>\nForget passion and purpose\n</h3>\n<p>\nForget “follow your passion” or “find your true calling”.\nStop thinking like that.\nHere’s why:\n</p><p>\nWords like “passion” and “purpose” are dangerous because they sound huge and romantic.\nIf you think you haven’t found your passion yet, you’re probably <strong>expecting it to be overwhelming</strong> — to hit you like lightning.\n</p><p>\nLooking for your passion, purpose, or calling is an example of the <a href=\"https://sive.rs/mindset\">fixed mindset</a>.\nYou’re assuming that this is an inherent and unchanging thing inside of you, like trying to read your DNA or blood type.\nBut you won’t find passion and purpose there, because <strong>that’s not where those feelings come from.</strong>\n</p><p>\nPassion and purpose are <strong>emotions that come after expertise and experience.</strong>\nThe way to get them is to commit to <a href=\"https://sive.rs/book/Mastery\">the path of mastery</a>, get great at something, and do great work.\n</p><p>\nSo instead of looking for passion and purpose, just keep mastering whatever work you’ve started, becoming more and more valuable in your field.\nPassion and purpose will follow a great career.\n</p>\n<h3>\nGreat careers are only for the rare and valuable\n</h3>\n<p>\nThink of what makes a great career:\n</p>\n<ul>\n<li>\ngood pay\n</li>\n<li>\nroom to grow\n</li>\n<li>\nfreedom and control\n</li>\n<li>\npositive impact\n</li>\n<li>\nemotionally rewarding\n</li>\n</ul>\n<p>\nJobs like this are rare and valuable.\nA great career isn’t something you <strong>find</strong> — it’s something you <strong>earn</strong> when you’ve got <strong>rare and valuable skills to offer in return.</strong>\n</p><p>\nIn other words, you can only earn a great career by building your expertise and experience.\n</p>\n<h3>\nSolution: focus on the craft, not passion.\n</h3>\n<p>\nThe solution to this problem is what’s called “the craftman’s path” — the long-term path to mastery.\n</p><p>\nEveryone who became great at something has a similar story:\nFor years, they worked on their craft every day, even if they weren’t in the mood.\nAlways pushing, practicing, working, and improving.\n</p><p>\nIt doesn’t matter if you’re feeling passionate about it that day or even that month.\nYou keep working and keep improving.\n</p><p>\nIt doesn’t matter whether your work environment is ideal or you’re being wonderfully rewarded yet.\nYou keep working and keep improving.\n</p><p>\nYes it takes thousands of hours of practice, but that’s good news!\n<strong>It’s a clear path and it’s under your control</strong>, instead of dwelling on unanswerable questions like “What is my true calling?”\n</p><p>\nYou forget the self-centered concerns about your passion and purpose, and instead just keep improving and getting really damn good.\n</p><p>\nIt doesn’t matter if your current job isn’t perfect.\n<strong>You just keep improving</strong>, no matter where you are, <strong>becoming more and more valuable</strong>.\n</p><p>\nBy building your skills, experience, and value, you earn a great career.\n</p><p>\nBy building your skills, experience, and value, <strong>passion and purpose come to you</strong>.\n</p><p>\nBy building your skills, experience, and value, you are building your “career capital”.\n</p>\n<h3>\nCareer capital: use it to make a change\n</h3>\n<p>\n“Career capital” is a metaphor.\nThink of it like gold tokens you’re earning over years of building your expertise, experience, connections, and reputation.\n</p><p>\nThe important point is to <strong>remember how valuable it is</strong>.\n</p><p>\nWhen you want to make a change to your career, you spend this career capital you’ve earned.\n</p><p>\nBut if you’re really sick of your current field and want to switch to another field, <strong>don’t just quit and throw away all the career capital you’ve built up!</strong>\n</p><p>\n<strong>\nIf you’re thinking of quitting your job to follow your passion, please don’t miss this point!\n</strong>\n</p><p>\nThink of ways you can <strong>use the value you’ve built up</strong> to make the transition to another field.\n</p><p>\n<a href=\"https://sive.rs/tarzan\">Like Tarzan</a>, use your connections, reputation, experience, and expertise to <strong>transition</strong> into a better situation in the new field before leaving the old one.\n</p><p>\nRealize the career capital you’ve built up already, and don’t just throw it away.\n</p>\n<h3>\nStarting from scratch?\n</h3>\n<p>\nIf you’re starting from scratch anyway, jump into any growing field and start building your skills, expertise, connections, and reputation.\nPick a niche and dominate it.\n</p><p>\nIf you have no ideas, check out <a href=\"http://www.ycombinator.com/rfs/\">this list of what startup investors want to invest in</a>.\nAnd <a href=\"https://www.google.com/search?q=jwt+things+to+watch\">JWT’s “Things to Watch”</a> is always fun and inspiring.\n</p>\n<h3>\nRead “<a href=\"https://sive.rs/book/SoGood\">So Good They Can’t Ignore You</a>”\n</h3>\n<p>\nThe ideas here are just a little incomplete intro to an amazing book.\n</p><p>\n“<a href=\"https://sive.rs/book/SoGood\">So Good They Can’t Ignore You</a>” by <a href=\"http://calnewport.com/\">Cal Newport</a>, is the best I’ve ever read on the subject of building or changing your career.\n<a href=\"https://commoncog.com/blog/so-good-they-cant-ignore-you/\">Here is a great summary of it.</a>\n</p><p>\nI just searched my email out-box and found out that I’ve personally recommended it to people over a hundred times in the past two years.\n</p><p>\nIf this subject interests you at all, please <a href=\"https://sive.rs/book/SoGood\">get and read the full book</a>, not just my summary.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"10a932145ef57f764b56e9276e6149cd1656d80579eb52d78721fcb0812d0ae3","category":"Sites"}