{"title":"Substack Still Sucks","link":"https://kottke.org/24/09/substack-still-sucks","date":1727278977000,"content":"\n        <p>From <a href=\"https://www.platformer.news/leaving-substack-platformer-year-four/\">Casey Newton’s post looking back on Platformer’s fourth year</a>, your periodic reminder that Substack still sucks:</p>\n\n<blockquote><p>When we learned about the extent of far-right extremism, Hitler worship and Holocaust denial on Substack, you pressed us to investigate. And when we published our findings, <a href=\"https://www.platformer.news/why-platformer-is-leaving-substack/\">you overwhelmingly encouraged us</a> to find a new home on the web.</p>\n\n<p>During this time, I talked to several high-profile writers who collectively make millions of dollars writing on Substack. Their readers were also asking them to leave, too. In the end, almost none of them did. They bet that they could simply put their heads down and wait for the controversy to pass. And it worked!</p>\n\n<p><a href=\"https://theracket.news/p/substacks-nazi-problem-isnt-going-away\">Substack’s Nazi problem continues</a>, but the news cycle has moved on. I suspect it will swing back around eventually. But in the meantime, I’m proud that when Platformer was asked to actually live its values — to stand up for the idea that basic content moderation is good and necessary — we did.</p>\n\n<p>Having principles can be annoying and expensive. (And make you insufferable to talk to at parties.) But it beats the alternative.</p></blockquote>\n\n<p>Huge respect to Newton and the Platformer team for making the move from Substack even though it was inconvenient and painful.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Casey%20Newton\">Casey Newton</a> · <a href=\"https://kottke.org/tag/Platformer\">Platformer</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Substack\">Substack</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/09/substack-still-sucks\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"118e1b930d3cd7da80e74331464ca6739cf57b28a7e79010d385c8cf7b0febf8","category":"Sites"}