{"title":"I want to make a great big hypertextual internet epic – would you support me?","link":"https://chias.blog/2024/i-want-to-make-a-great-big-hypertextual-internet-epic-would-you-support-me/","date":1729582169000,"content":"<span><span>Reading Time: </span> <span>4</span> <span>minutes</span></span>\n<p>I’ve always dreamed of creating a great big piece of browser-born internet literature. Living somewhere between a poem, performance, landscape, durational artifact, protocol, ritual. I would write it, perform it, constantly update it, and exhibit it so that it may live many lives. The microtools I’d make to support its creation would become open-source, and spawn many workshops and talks out of it.</p>\n\n\n\n<figure><img width=\"1024\" height=\"351\" src=\"https://chias.blog/wp-content/uploads/image-204-1024x351.png\" srcset=\"https://chias.blog/wp-content/uploads/image-204-1024x351.png 1024w, https://chias.blog/wp-content/uploads/image-204-300x103.png 300w, https://chias.blog/wp-content/uploads/image-204-768x263.png 768w, https://chias.blog/wp-content/uploads/image-204-1536x527.png 1536w, https://chias.blog/wp-content/uploads/image-204-620x213.png 620w, https://chias.blog/wp-content/uploads/image-204.png 1784w\" /><figcaption>Performances from the past few months at <em>CultureHub</em> (New York, Oct 2024) and <em>Gray Area</em> (San Francisco, Sep 2024) </figcaption></figure>\n\n\n\n<p>Over the past year, I’ve been developing ‘internet ambient’ performances that live somewhere between poetry, net art, and durational performance… embodied live scoring, reading, and playings of a single or dozen net art pieces: like my <a href=\"https://www.youtube.com/watch?v=faGcK-FGHSI\">Screen Walk</a> or shots from my latest ongoing project, a <em>6 hour-long durational performance</em> supported by CultureHub, <a href=\"https://www.instagram.com/p/DBXP714SpkK/?img_index=1\">Himala</a>. <a href=\"https://bombmagazine.org/articles/2024/10/16/chia-amisola-by-meg-miller/\">Here is a lovely conversation that was just published on BOMB on my work, with Meg Miller.</a> <strong>I’d like to continue making an epic piece of work along these lines – nurturing new narratives on internet proximities, breaking the technical ceilings of our tools</strong>, <strong>and considering ‘hypertext’ as not just artifact, but genre, performance, and process.</strong></p>\n\n\n\n<p>In moving towards a more poetic web, I believe altering people’s perceptions of how we might <em>consume</em> a website is just as (if not more) important than building tools for creation. My work as a technologist has always been about thinking about the web’s potential for expressiveness and intimacy. This work is no different: the ambiences that emerge from what we construct <em>make</em> the environments</p>\n\n\n\n<figure><div>\n\n</div><figcaption><em>Screen Walk</em>, December 2023</figcaption></figure>\n\n\n\n<p><strong>Form</strong></p>\n\n\n\n<p>As the title suggests, I’d develop a hypertextual, narrative piece of work; where hypertext is ambiguously defined as something networked, sprawling, internodal, rhizomatic, and experimental in form. <a href=\"https://www.are.na/chia/on-hypertext-7fcknpsnb3c\">And I mean hypertextual</a> as playing with text, image, audio, interaction, time, and performance in many scopes and readings.</p>\n\n\n\n<p>I’m not straying too far from the form of work I’ve been developing over the past year, just approaching it more expansively…</p>\n\n\n\n<ul>\n<li><em>A published piece of work online</em>,<em> </em>of course – living on the screen</li>\n\n\n\n<li><em>Live performances</em> – with live sound, many computers, screens, and perhaps more collaborators</li>\n\n\n\n<li><em>Custom inst</em>allations<em> –</em> I’ve been interesting in fabricating and programming entire custom computers as sculpture/container for the work, with their own control schemes, displays, and makes. I’m quite new to hardware and have been experimenting with my collaborators – but I’d love to stretch budget towards prototyping these if possible.</li>\n\n\n\n<li><em>Performance-lectures on the themes</em> – talks that are also as performative as they are educational &amp; research-driven</li>\n</ul>\n\n\n\n<p><strong>Content</strong></p>\n\n\n\n<p>I’m honestly not sure. I’ve made many diaristic, personal narratives in the past and lately have been thinking about Filipino religion, populism, and mythologies. </p>\n\n\n\n<p>Thinking about ‘proximity’ in the most abstract sense will probably be my starting prompt. The project might fall under my umbrella project, <a href=\"https://whenwe.love/\">When We Love</a> which deals with ‘digital intimacy &amp; proximity’, but I feel that this will be more tonally differently.</p>\n\n\n\n<p><strong>References</strong></p>\n\n\n\n<p>I draw from slow cinema, religious rituals, experimental games, sound art practices, and many poets. I think about work from the domestic to the divine, like Lucy Ellmann’s <em>Ducks, Newburyport</em> to Frank Stanford’s <em>The Battlefield Where The Moon Says I Love You</em>, to Frank Bidart’s monologues and studies (my favorite is <em>The Fourth Hour of the Night</em>). I’m moved by the dialogue sound &amp; noise artists have with their forms, and think about pushing the boundaries of the operating system, browser, and website in the same ways. The movement &amp; immensity of works like Lav Diaz (especially <em>Evolution of a Filipino Family</em>), Jonas Mekas, My latest projects have had me thinking about the entwinement of religion &amp; computation, looking more towards the development of Filipino rituals and our struggles for identity. </p>\n\n\n\n<p>I’d be more than happy to chat about the media and philosophies I’m drawing from as I develop this work.</p>\n\n\n\n<p><strong>Why me?</strong></p>\n\n\n\n<p>I am an artist &amp; technologist who writes prolifically &amp; intensely. </p>\n\n\n\n<p>I work on interactivity on Figma by day. I graduated from Yale with a CS &amp; Art degree two years ago (and was awarded the top Arts  award), have won the <a href=\"https://www.lumenprize.com/2024-lumen-prize-winners\">Lumen prize</a> (the most prestigious digital arts award) for a piece I developed early last year, am a Forbes 30 Under 30 awardee, and exhibited internationally. I’m so infinitely lucky to have grown and be in dialogue with many of my heroes in the art &amp; technology space now… and I’ve only been ‘practicing’ formally for around two years. <a href=\"https://chia.design/CV\">Here’s a full CV</a> and my <a href=\"https://chia.design/\">index of work.</a></p>\n\n\n\n<p>For most of my life, my work has been self-published and done for free. I was born &amp; raised in the Philippines, and feel very intentionally situated in the <strong>third world experience of the internet</strong>, with work speaking to <strong>third world narratives</strong>. My work with <a href=\"https://developh.org/\">Developh</a> nurturing Filipino technologists in the Philippines best exemplifies this, where most recently I curated/programmed <a href=\"https://www.esquiremag.ph/culture/books-and-art/kakacompyuter-mo-yan-exhibit-space-63-a6901-20240904-lfrm?s=di8rd4u7oc2b8gktm4oso1frd1\">an exhibition</a> funding all artists… so I’m hoping to seek out a grant/patron/donor-esque relationship as I turn towards this work.</p>\n\n\n\n<p>tl;dr</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"966\" height=\"234\" src=\"https://chias.blog/wp-content/uploads/CleanShot-2024-10-21-at-23.07.49@2x.png\" srcset=\"https://chias.blog/wp-content/uploads/CleanShot-2024-10-21-at-23.07.49@2x.png 966w, https://chias.blog/wp-content/uploads/CleanShot-2024-10-21-at-23.07.49@2x-300x73.png 300w, https://chias.blog/wp-content/uploads/CleanShot-2024-10-21-at-23.07.49@2x-768x186.png 768w, https://chias.blog/wp-content/uploads/CleanShot-2024-10-21-at-23.07.49@2x-620x150.png 620w\" /></figure>\n\n\n\n<p><strong>I’m basically asking for some sort of grant, patronage, etc. to develop work. </strong>I’d like the privilege of stability, security, and also a supporter (in sharing with you updates, thoughts, and directions) to nurture something immense, expansive, and sprawling. If my words, experiments, and form resonate in any way – I hope you know that you won’t be disappointed.</p>\n\n\n\n<p>Before moving 100% into this grand newer project, I want to wrap up some KAKAKOMPYUTER MO YAN programming and continue developing mysteries and installations for Himala (or, you can stipulate your support to only go to the new project). Once those two larger pieces are wrapped up, I’ll focus more fully on the larger hypertext epic – just making smaller installation builds or weekend releases when I need another creative outlet.</p>\n\n\n\n<p><strong>If this is something you’re interested in supporting (in even some smaller amount), let me know – </strong><a href=\"mailto:chiamisola@gmail.com\">chiamisola@gmail.com</a>. </p>\n\n\n\n<p></p>\n\n\n\n<p>(This is a quick draft of an ask – will probably revisit this in the next week… if you’re reading this early, thank you.)</p>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"119cae5ab9d872d716bf7877f249d3e0510375581a68b904659337b57017f57d","category":"Sites"}