{"title":"Leon’s","link":"https://www.usv.com/writing/2024/11/leons/","date":1732195182000,"content":"<p>I have always been a big fan of breakfast, lunch and dinner business meetings. There is something about breaking bread over a meeting, or a glass of wine or beer or a cup of coffee. The ideal location is a place where others are doing the same thing so you can bump into friends, colleagues, and others regularly.</p>\n<p>For years, I would do my breakfast meetings at The Coffee Shop (now closed) in Union Square and my lunch meetings at Taralucci or Punch (now closed). I moved my regular breakfast spot to Maialino (now closed) in or around 2010 and most mornings I would grab one of the front tables there and see so many friends in the NYC startup sector coming and going.</p>\n<p>When we moved USV to the south side of Union Square in 2022, I started looking around for a place near our new office to do my breakfast and lunch meetings. I could not find anything that felt right.</p>\n<p>I noticed a beautiful space with dramatic high ceilings in the ground floor USV’s new office building at 817 Broadway and I asked our landlord about it. He told me that “we want something special in that space.” So I called my friends Nick Anderer and Natalie Johnson who own and operate Anton’s , our favorite restaurant in the West Village, and said “you should take this space and make a restaurant there.”</p>\n<p>The good news is they did exactly that. And last week they opened Leon’s , an all-day fine dining restaurant that features Italian cuisine with French and Egyptian accents.</p>\n<p>I have now had the pleasure of three dinners, three breakfasts, and one lunch at Leon’s in the last week and I have loved everything. They have a barista making coffees and a baker making pastries in the mornings to compliment a fantastic hot breakfast menu. The salads and sandwiches at lunch are perfect. And the dinner features an amazing array of appetizers to start and fantastic pasta and main courses. And the gelato and tahini cookies are just too good not to order to finish the meal.</p>\n<p>I plan to use Leon’s the way I used Mailino and before that The Coffee Shop and Taralucci. I hope the NYC startup sector in the Union Square area does the same and we can recreate the vibe we had going at those spots before the pandemic came along and messed things up.</p>\n<p>Leon’s is open every day of the week from 8am to 11pm. However, they will be closed on Mondays until December 16th so they can tweak a few things without impacting customers.</p>\n<p>I hope to bump into you all at Leon’s in the coming months and years. You can book a reservation here.</p>\n<p>I have always been a big fan of breakfast, lunch and dinner business meetings. There is something about breaking bread over a meeting, or a glass of wine or beer or a cup of coffee. The ideal location is a place where others are doing the same thing so you can bump into friends, colleagues, and others regularly. For years, I would do my breakfast meetings at The Coffee Shop (now closed) in Union Square and my lunch meetings at Taralucci or Punch (now closed). I moved my regular breakfast spot…</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/leons/\">Leon’s</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Zapier Bot","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"11e5bf6a99c38424e19350a7ed8eb2653d0f0d71b6281888814b3c0b3dc032cb","category":"Sites"}