{"title":"But We Had Music: Nick Cave Reads an Animated Poem about Black Holes, Eternity, and How to Bear Our Lives","link":"https://www.themarginalian.org/2024/04/06/but-we-had-music/","date":1712410251000,"content":"<p>How, knowing that <a href=\"https://www.themarginalian.org/2024/02/16/endling/\">even the universe is dying</a>, do we bear our lives?</p>\n<p>Most readily, through friendship, through connection, through co-creating the world we want to live in for the brief time we have together on this lonely, perfect planet. </p>\n<p>The seventh annual <a href=\"https://www.themarginalian.org/the-universe-in-verse/\"><em>Universe in Verse</em></a> — a many-hearted labor of love, celebrating the wonder of reality through science and poetry — occasioned a joyous collaboration with Australian musician and writer <a href=\"https://www.themarginalian.org/\">Nick Cave</a> and Brazilian artist and filmmaker <a href=\"https://danielbruson.com\">Daniel Bruson</a> on an animated poem reckoning with this central question of being alive. </p>\n<p></p>\n<blockquote><p><strong>BUT WE HAD MUSIC</strong><br />\n<em>by Maria Popova</em></p>\n<p>Right this minute<br />\nacross time zones and opinions people are<br />\nmaking plans<br />\nmaking meals<br />\nmaking promises and poems</p>\n<p>while</p>\n<p>at the center of our galaxy<br />\na black hole with the mass of four billion suns<br />\nscreams its open-mouth kiss<br />\n     of oblivion.</p>\n<p>Someday it will swallow<br />\nEuclid’s postulates and the <em>Goldberg Variations</em>,<br />\nswallow calculus and <em>Leaves of Grass</em>.</p>\n<p>I know this.</p>\n<p>And still<br />\nwhen the constellation of starlings<br />\nflickers across the evening sky,<br />\nit is     enough</p>\n<p>to stand here<br />\nfor an irrevocable minute<br />\n     agape with wonder. </p>\n<p>It is     eternity.</p></blockquote>\n<p>At 7PM EST on April 7, tune into <a href=\"https://www.themarginalian.org/the-universe-in-verse/\">the livestream</a> of the 2024 <em>Universe in Verse</em>, celebrating the science and wonder of eclipses, to hear Nick tell the ecliptic story of marrying the love of his life, alongside a constellation of other dazzling humans bringing to life the science of gravity and relativity, tides and black holes, the formation of the Moon and the chemistry of the Sun, through poems and stories that help us meet reality on its own terms and broaden the terms on which we meet ourselves and each other.</p>\n<p>Couple with Daniel Bruson’s breathtaking animation of former U.S. Poet Laureate Tracy K. Smith’s poem <a href=\"https://www.themarginalian.org/2022/02/11/universe-in-verse-animated-hubble/\">“My God, It’s Full of Stars”</a> from a previous season of <em>The Universe in Verse</em>, then revisit Nick Cave on <a href=\"https://www.themarginalian.org/2023/02/07/nick-cave-growing-older/\">the art of growing older</a> and <a href=\"https://www.themarginalian.org/2022/12/29/nick-cave-helplessness-power/\">the antidote to our existential helplessness</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"126acf428f50a140590c804a3a421c003b048e702b5197febbe75e947ad8695e","category":"default"}