{"title":"What it means to be resourceful","link":"https://sive.rs/res","date":1519344000000,"content":"<p>\nI was at a musicians’ gathering in Memphis.\nI met a lot of people complaining that their various forms of online distribution weren’t earning them as much as they’d hoped.\n</p><p>\nThen I met a musician who sold 8000 copies of his album himself.\nNo distributor.\nNo website.\nJust by himself.\n</p><p>\nI asked him how he did it.\nHe said, “<strong>I just slowly drove around the city every night, with the windows down, playing my music loud. When I saw someone digging it, I’d go talk with them. I’d sell almost everyone a copy — about 20 or 30 a night. Been doing this about a year. Sold 8000 so far.</strong>”\n</p><p>\nI love this story!\nIt’s so direct!\nIt hit me especially hard because all the musicians I’d met before him were complaining about how it’s impossible to make money anymore.\n</p><p>\nIt got me thinking about what it means to be resourceful.\n</p><p>\nThe succinct way to show it is to contrast two different mindsets.\nI’ll call them A and B.\n</p><p>\nA: “I spent $60,000 making this album.”\n<br />\nB: “I spent $60 making this album.”\n</p><p>\nA: “There are no good live music venues anymore!”\n<br />\nB: “I made us a new venue.”\n</p><p>\nA: “I’ve tried everything.”\n<br />\nB: “I found a book from the 1970s with some unique ideas I’m applying to our marketing.”\n</p><p>\nA: “I don’t have time to do it all!”\n<br />\nB: “Two of my fans help with promotion, one edits my videos, and one runs my website.”\n</p><p>\nA: “I’m not some Hollywood networking dude. I don’t have connections in the industry.”\n<br />\nB: “My barber knew the promoter’s wife, so it took some persistence, but now we’re playing at his festival.”\n</p><p>\nA: “They said we weren’t allowed to just show up.”\n<br />\nB: “We just showed up, and wouldn’t leave. Eventually they said OK.”\n</p><p>\nA: “We didn’t get the festival gig.”\n<br />\nB: “They rejected us, so we contacted every artist at the festival until we found one that insisted the promoter book us as their opening act.”\n</p><p>\nA: “There’s just no way!”\n<br />\nB: “I figured out a way.”\n</p><p>\n<strong>\nIt means being creative, rebellious, determined, and unstoppable.\n</strong>\n</p><p>\n<strong>\nIt means asking for help, but not waiting for help.\n</strong>\n</p>\n<img src=\"/images/res.jpg\" />\n<div>illustration ©2018 John Warner</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"139b67dae2d588554334384009b576cec9f9b3b46e22151c8228132e86e51f61","category":"Sites"}