{"title":"Watching Nintendo think out loud about radar and music","link":"https://interconnected.org/home/2024/11/01/nintendo","date":1730487540000,"content":"<div>\n<p>I love watching companies when they’re thinking out loud. Because it gets me thinking too (not necessarily in the same direction).</p>\n<p>Case in point: two new products from Nintendo.</p>\n<p>Watch <a href=\"https://www.youtube.com/watch?v=dMqWTkgDt6A\">Nintendo’s announcement video for Alarmo</a> <em>(YouTube),</em> their new shiny round red alarm clock with some fun features:</p>\n<blockquote>\n<p>Alarmo responds to your body’s movement with game sounds, so you can feel like you’re waking up in the game world itself.</p>\n</blockquote>\n<p>There’s a sequence where the person is rolling in bed, half asleep, and Mario coin sounds are rattling off. Subtitle: <em>\"[Super Mario Odyssey sounds continue]\"</em></p>\n<p>Oooookay. Love it. Super weird.</p>\n<p>Btw if two people are in bed then they <em>both</em> have to get up before Alarmo will silence.</p>\n<p>How does it work? WELL.</p>\n<blockquote>\n<p>Alarmo’s <u>millimeter-wave presence sensor</u> works with bed sizes ranging from twin to king…</p>\n<footer>– The Verge, <cite><a href=\"https://www.theverge.com/24266272/nintendo-alarmo-sound-clock-hands-on\">A closer look at Nintendo’s adorable Alarmo clock (2024)</a></cite></footer>\n</blockquote>\n<p>That presence sensor is mmWave radar, and this is cutting edge tech.</p>\n<p>Radar chips have applications in autonomous vehicles and robotics, but putting them in consumer electronics is <em>fascinating.</em> Radar is hard to interpret - it’s not a straightforward computer vision problem - but it can see through (non-conductive) walls, it can be used (in theory) to pick out gestures and eye blinks and breathing and heartbeats because it’s high resolution and building up a 3D scene, and it’s on a chip and doesn’t require a camera.</p>\n<p>Oh, and mmWave radar is low power – though interpreting the data requires serious compute. <a href=\"https://www.infineon.com/cms/en/product/sensor/radar-sensors/\">Here’s the Infineon site for their radar sensors.</a></p>\n<p>Like… what would you even do with mmWave radar?</p>\n<p>What novel interactions would be enabled?</p>\n<p>How would you, as a design team and as a company, develop sufficient <em>opinions</em> about how mmWave radar behaves in real-world environments and what you could do with it? And what is it like to integrate, and what is the supply chain like, and so on?</p>\n<p>If you wanted to learn enough to develop (say) a whole console and ecosystem around a brand new set of interactions enabled by a new technology, you’d probably start with something self-contained first.</p>\n<p>Like an alarm clock.</p>\n<hr />\n<p>I’m not so interested when companies make concept videos. Sure, that promotes internal and market alignment. But you’re not learning anything from at a product strategy level.</p>\n<p>I think, for really valuable <em>thinking out loud,</em> a company has to embark on a path that ticks every cell of a <a href=\"https://en.wikipedia.org/wiki/Business_Model_Canvas\">business model canvas</a>. It’s <a href=\"https://interconnected.org/home/2022/10/20/pathfinding\">design pathfinding</a> but scaled up a powers-of-10 level or two.</p>\n<p>That said, too much of this approach can be poisonous. Google is most notorious… <a href=\"https://killedbygoogle.com\">Killed by Google</a> catalogues products that must have taught Google an absolute ton <em>internally,</em> but users and customers feel somewhat burnt that they bought into something that was then shut down.</p>\n<p>Ideally you want something a product which is more self-contained.</p>\n<p><strong>Alarmo</strong> is in that wonderful Goldilocks zone.</p>\n<hr />\n<p>RELATED: the South Sudan coffee supply chain.</p>\n<p>I remember hearing Nespresso talk about making limited edition capsules with a blend of coffee from South Sudan. Released in 2015.</p>\n<p>South Sudan established as a country only in 2011.</p>\n<p>Between 2011 and 2015, Nespresso <a href=\"https://nestle-nespresso.com/news/Nespresso-Suluja-ti-South-Sudan-Second-Edition\">worked with South Sudanese coffee farmers to revive their country’s coffee industry</a>. Four years!</p>\n<p>So imagine what they had to work out… How to have communications channels and on-the-ground representatives to manage quality control, how to move money around, how to move <em>trucks</em> around, how import/export works with a brand new country, and so on.</p>\n<p>So it’s a cross between thinking and loud and building the right muscles.</p>\n<hr />\n<p>The second product from Nintendo, a new app:</p>\n<p>Here’s the <a href=\"https://www.youtube.com/watch?v=DQ5EeImWYaI\">Nintendo Music announcement</a> <em>(YouTube),</em> available on iOS and Android.</p>\n<p>So if you want to listen to the music from <em>Animal Crossing</em> or <em>The Legend of Zelda,</em> that’s where to go. (If you’re a Switch Online subscriber anyway, which regretfully I am not.)</p>\n<p>And then there’s this feature, which easily makes Nintendo Music as interesting as Alarmo:</p>\n<blockquote>\n<p><u>You can also extend the length of certain tracks.</u> By extending the length or looping a track, you can spend more time with a particular song.</p>\n</blockquote>\n<p>Wha.</p>\n<p>You can extend certain special tracks to 15, 30, or 60 minutes.</p>\n<p>I wonder, <em>I wonder</em> what the underlying technology is that enables this. What loops and samples are stored with what metadata; how is an exactly 60 minute track made with satisfying narrative progression?</p>\n<p>NOW.</p>\n<p>I’ve talked before about how the interplay of today’s music apps, ID3 tags, charts, the user interfaces, how people are paid… how all of it makes cements the 3 minute track. It’s self-reinforcing; systemically obdurate.</p>\n<p>But that captures such a narrow set of experiences with music.</p>\n<p>Such as… well, I’m sure you’ve listened to <a href=\"https://www.youtube.com/watch?v=jfKfPfyJRdk\">lofi hip hop radio</a> <em>(YouTube)</em> – <em>\"beats to relax/study to\"</em> by Lofi Girl, with her infinite book studying and Paris rooftops outside the window. <em>(It is such a missed opportunity for YouTube not to be leaning into their live streams.)</em></p>\n<p>It’s so good.</p>\n<p>I want Pomodoro music; music with a dramatic arc to take me through an evening hacking on a weird proto; music to hit that deadline in exactly 53 minutes; environmental music that is more like opening a <a href=\"https://interconnected.org/home/2023/05/26/windows\">sound window</a>.</p>\n<p>Video games provide the ideal material and technology for this alternative world, right?</p>\n<p>As previously discussed: <a href=\"https://interconnected.org/home/2020/04/28/long_music\">Video game soundtracks, and a format for adaptive long music</a> (2020).</p>\n<p>If anyone could create and popularise a new music format, maybe it’s Nintendo?</p>\n<p>Because these extrapolated tracks…</p>\n<p>Extrapolation is very <em>now.</em> I would love for us, culturally, to <a href=\"https://interconnected.org/home/2023/11/03/beatles\">lean into extrapolated art</a> (2023). Like, let’s figure out how to make silk purse art from sculpted AI slop.</p>\n<hr />\n<p>So I hope that’s what the folks at Nintendo are thinking about, the new interactions possible with mmWave radar chips and extrapolated music both.</p>\n<p>More organizations should explore and learn at this level.</p>\n<p>Because I love trying to read the tea leaves. And also the groundless speculation and imagination. All good fun.</p>\n<hr />\n<p>BONUS LINK:</p>\n<p><a href=\"https://www.youtube.com/watch?v=qKlJmUg5uZU\">A video of the orchestra recording Gusty Garden from Super Mario Galaxy</a> <em>(YouTube).</em></p>\n\n  <hr />\n\n\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/extrapolation\">extrapolation</a>\n\t(4), \n\t\n\t<a href=\"https://interconnected.org/home/tagged/sound-and-music\">sound-and-music</a>\n\t(17).\n\t\n\t</small></p>\n\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"13b178b894a9b6edb4f270f2c75aa8dee0145ff1e32968f2c32f1190c7636a04","category":"Sites"}