{"title":"Acemoglu, Johnson and Robinson Win Nobel Prize for Institutions and Prosperity","link":"https://feeds.feedblitz.com/~/906175745/0/marginalrevolution~Acemoglu-Johnson-and-Robinson-Win-Nobel-Prize-for-Institutions-and-Prosperity.html","date":1728902312000,"content":"<p>The Nobel prize goes to <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/people/faculty/daron-acemoglu\">Daron Acemoglu</a>, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://mitsloan.mit.edu/faculty/directory/simon-johnson\">Simon Johnson</a> and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://harris.uchicago.edu/directory/james-robinson\">James Robinson</a> for their work on institutions, prosperity, and economic growth. Here is a key piece summarizing their work: <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.nber.org/system/files/working_papers/w10481/w10481.pdf\">Institutions as a Fundamental Cause of Long-Run Growth</a>.</p>\r\n<blockquote><p>This paper develops the empirical and theoretical case that differences in economic institutions are the fundamental cause of differences in economic development. We first document the empirical importance of institutions by focusing on two “quasi-natural experiments” in history, the division of Korea into two parts with very different economic institutions and the colonization of much of the world by European powers starting in the fifteenth century. We then develop the basic outline of a framework for thinking about why economic institutions differ across countries. Economic institutions determine the incentives of and the constraints on economic actors, and shape economic outcomes. As such, they are social decisions, chosen for their consequences. Because different groups and individuals typically benefit from different economic institutions, there is generally a conflict over these social choices, ultimately resolved in favor of groups with greater political power. The distribution of political power in society is in turn determined by political institutions and the distribution of resources. Political institutions allocate de jure political power, while groups with greater economic might typically possess greater de facto political power…Economic institutions encouraging economic growth emerge when political institutions allocate power to groups with interests in broad-based property rights enforcement, when they create effective constraints on power-holders, and when there are relatively few rents to be captured by power-holders.</p></blockquote>\r\n<p>See this great <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://mru.org/courses/principles-economics-macroeconomics/north-korea-and-south-korea-institutions\">MRU video on Institutions for a quick overview</a>! Here from an interview with Acemoglu, is a slightly more pointed perspective. <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.minneapolisfed.org/article/2011/interview-with-daron-acemoglu\">Politics keeps people poor:</a></p>\r\n<blockquote><p>Why is it that certain different types of institutions stick?….it wouldn’t make sense, in terms of economic growth, to have a set of institutions that ban private property or create private property that is highly insecure, where I can encroach on your rights. But<em> politically</em>, it might make a lot of sense.</p>\r\n<p>If I have the political power, and I’m afraid of you becoming rich and challenging me politically, then it makes a lot of sense for me to create a set of institutions that don’t give you secure property rights. If I’m afraid of you starting new businesses and attracting my workers away from me, it makes a lot of sense for me to regulate you in such a way that it totally kills your ability to grow or undertake innovations.</p>\r\n<p>So, if I am really afraid of losing political power to you, that really brings me to the politics of institutions, where the logic is not so much the economic consequences, but the political consequences. This means that, say, when considering some reform, what most politicians and powerful elites in society really care about is not whether this reform will make the population at large better off, but whether it will make it easier or harder for them to cling to power.</p>\r\n<p>Those are the sort of issues that become first-order if you want to understand how these things work.</p></blockquote>\r\n<p>One interesting aspect of this year’s Nobel is that almost all of AJRs Nobel work is accessible to the public because it has come primarily through popular books rather than papers. <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/gp/product/0521671426/ref=dbs_a_def_rwt_bibl_vppi_i3/?tag=marginalrevol-20\">The Economic Origins of Dictatorship and Democracy</a>, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/gp/product/B0058Z4NR8/ref=dbs_a_def_rwt_hsch_vapi_taft_p1_i1/?tag=marginarlevol-20\">Why Nations Fail</a>, and the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/gp/product/0735224382/ref=dbs_a_def_rwt_bibl_vppi_i0/?tag=marginalrevol-20\">The Narrow Corridor</a> all by Acemoglu and Robinson and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/Power-Progress-Thousand-Year-Technology-Prosperity/dp/1541702549/ref=sr_1_3?tag=marginalrevol-20\">Power and Progress</a> by Acemoglu and Johnson are all very readable books aimed squarely at the general public. The books are in many ways deeper and more subtle than the academic work which might have triggered the broader ideas (such as the famous <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/files/4123\">Settler Mortality</a> paper). Many of the key papers such as <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://academic.oup.com/qje/article-abstract/117/4/1231/1875948\">Reversal of Fortune</a> are also very readable.</p>\r\n<p>This is not to say that the authors have not also made many technical contributions to economics, most especially Acemoglu. I think of <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://scholar.google.com/citations?user=l9Or8EMAAAAJ&amp;hl=en&amp;oi=ao\">Daron Acemoglu</a> (GS) as the Wilt Chamberlin of economics, an absolute monster of productivity who racks up the papers and the citations at nearly unprecedented rates. According to Google Scholar he has <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://scholar.google.com/citations?user=l9Or8EMAAAAJ&amp;hl=en&amp;oi=ao\">247,440 citations</a> and an H-index of 175, which means 175 papers each with more than 175 citations. Pause on that for a moment. Daron got his PhD in 1992 so that’s over 5 papers per year which would be tremendous by itself–but we are talking 5 path-breaking, highly-cited papers per year plus many others! (Of course, most written with excellent co-authors). In addition, he’s the author of a <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/Introduction-Modern-Economic-Growth-Acemoglu/dp/0691132925/ref=sr_1_3?crid=3L71N1DP5FTAZ&amp;keywords=daron+acemoglu&amp;qid=1570988487&amp;sprefix=daron+acem%2Caps%2C125&amp;sr=8-3\">massive textbook on economic growth</a>. <span>More than any other economist Daron has pushed the cutting-edge of technical economics and has also written books of deep scholarship still accessible to the public. In his overview of Daron’s work for the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://pubs.aeaweb.org/doi/pdfplus/10.1257/jep.21.1.191\">John Bates Clark medal</a> Robert Shimer wrote “he can write faster than I can digest his research.” I believe that is true for the profession as a whole. We are all catching-up to Daron Acemoglu.</span></p>\r\n<p>Indeed, in reading a book like <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/files/8135\">Why Nations Fail</a> and papers like <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/files/8135\">The Network Origins of Aggregate Fluctuations</a> (one of my favorite Acemoglu papers) and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/files/204\">The Uniqueness of Solutions for Nonlinear and Mixed Complementarity Problems</a> it’s difficult to believe they are co-authored by the same person. Acemoglu is as comfortable talking history, politics, and political economy as he is talking about the economics of recessions and abstruse mathematics.</p>\r\n<p>Here are Previous <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/?s=acemoglu\">MR posts</a> on Daron Acemoglu including this post on democracy where I find <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2019/07/is-democracy-doomed.html\">the effect of democracy on growth to be ho-hum</a>. Here is Maxwell Tabarrok on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.maximum-progress.com/p/contra-acemoglu-on-ai\">Acemoglu on AI</a>. Here is Conversations with Tyler <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/daron-acemoglu/\">with Acemoglu</a> and a separate conversation <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/simon-johnson/\">with Simon Johnson</a>.</p>\r\n<p>As noted, one of my favorite Acemoglu papers (with Carvalho, Ozdaglar, and Tahbaz-Salehi) is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/files/8135\">The Network Origins of Aggregate Fluctuations</a>. Conventional economics models the aggregate economy as if it were a single large firm. In fact, the economy is a network. An auto plants needs steel and oil to operate so fluctuations in the steel and oil industry will influence production in the auto industry. For a long time, the network nature of production has been ignored. In part because there are some situations in which a network can be modeled as if it were a single firm and in part because it’s just much easier to do the math that way. Acemoglu et al. show that aggregate fluctuations can be generated by sector fluctuations and that organization of the network cannot be ignored. This is a modern approach to real business cycles. See also my post on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2009/10/is-real-business-cycle-theory-dead.html\">Gabaix and granular fluctuations</a>).</p>\r\n<p>In recent work,<a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.aeaweb.org/articles?id=10.1257/jep.33.2.3\"> Acemoglu and Restrepo</a> have created a new way of modeling production functions which divides work into tasks, some of which are better performed by capital and others by labor. Technological change is not simply about increasing the productivity of labor or capital (modeled in standard economics as making one laborer today worth two of yesterday’s) but about changing which tasks can best be done by capital and which by labor. As a task moves from labor to capital the demand for labor falls but productivity increases which generates demand for other kinds of labor. In addition, as capital replaces labor in some tasks entirely new tasks may be created for which labor has a comparative advantage. A number of interesting points come out of this including the idea that what we have to fear most is not super-robots but mediocre-robots. A super-robot replaces labor but has an immense productivity advantage which generates wealth and demand for labor elsewhere. A mediocre-robot replaces the same labor but doesn’t have a huge productivity advantage. In an empirical breakdown, Acemoglu and Restrepo suggest that what has happened in the 1990s and especially since 2000 is mediocre-robots. As a result, there has been a decline in labor on net. Thus, Acemoglu is more negative than many economists on automation, at least as it has occurred recently. Acemoglu and Restrepo is some of the best recent work going beyond the old tired debates to reformulate how we think of production and to use that reformulation to tie those reformulations to what is actually happening in the economy.</p>\r\n<p>Solow thought of technical change as exogenous which is still the first-pass approach to thinking about technical change. Acemoglu in contrast focuses on price and market size. In particular, the larger the market the greater the incentive to invest in R&amp;D to serve that market (see also my <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.ted.com/talks/alex_tabarrok_foresees_economic_growth?language=en\">TED talk</a>). Thus, technical change will tend to be cumulative. A sector with a productivity improvement will grow which can make that sector even more remunerative for further technical advances (depending on elasticities). This matters a lot for <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/sites/default/files/publications/The%20Environment%20and%20Directed%20Technical%20Change.pdf\">environmental change</a> because it suggests that a relative small intervention today–including subsidizing research on clean technologies–can have a huge payoff in the future because by directing technical change in the right direction you make it easier to switch later on. (from <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.minneapolisfed.org/article/2011/interview-with-daron-acemoglu\">this interview</a>)</p>\r\n<blockquote><p>But let’s think of the logic of directed technical change with cumulative research. The <em>less</em> we do on green technology today, the less knowledge is accumulated in the green sector, so the <em>bigger</em> is the gap between fossil-fuel-based technology and energy, and the cleaner energy, so the<em> harder</em> it will be in the future to close that gap. With more proactive, decisive action today, we already start closing the gap, and we’re making it <em>easier</em> to deal with the problem in the future.</p></blockquote>\r\n<p>Simon Johnson has also written important books on banking and finance including <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/White-House-Burning-National-Matters/dp/0307947645/ref=sr_1_1?tag=marginalrevol-20\"><span>White House Burning: Our National Debt and Why It Matters to You</span></a> and that was before the big run up in American debt! James Robinson has written widely on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://voices.uchicago.edu/jamesrobinson/2022/10/19/african-political-institutions-and-the-impact-of-colonialism/\">African development and colonialism</a> and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://voices.uchicago.edu/jamesrobinson/2018/06/22/africas-dev/\">African development</a> more generally.</p>\r\n<p>Overall, I’d say that this is an award for political science and for popular economics in the very best sense of economics that matters. Go buy their books and read them!</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html\">Acemoglu, Johnson and Robinson Win Nobel Prize for Institutions and Prosperity</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/906175745/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/906175745/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/906175745/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/906175745/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/906175745/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/906175745/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comment-160822885\">In reply to Kieran.   It depends on how your define ...</a> <i>by Hazel Meade</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comment-160822883\">One thing that I had not known about Acemoglu, until looking at ...</a> <i>by mkt42</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comment-160822879\">In reply to Sure.   And this sort of stuff is why the dictators ...</a> <i>by Hazel Meade</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comment-160822877\">In reply to So Much For Subtlety.   So I think Alex really ...</a> <i>by Big Al</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comment-160822872\">In reply to Mark Z.   Isn't There a feedback effect with ...</a> <i>by Hazel Meade</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/acemoglu-johnson-and-robinson-win-nobel-for-institutions-and-prosperity.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-tom-tugendhat\">My excellent Conversation with Tom Tugendhat</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/the-missing-dockworkers.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-missing-dockworkers\">The Missing Dockworkers</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/that-was-then-this-is-now-49.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=that-was-then-this-is-now-49\">That was then, this is now…</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"13e7634a882a9afb47f80ff1acd0e2f8d42c75ca5b1251a8177497b07a80e47b","category":"Sites"}