{"title":"Supreme Court Rules That Presidents Have Absolute Immunity for &#8220;Core Constitutional Powers&#8221;","link":"https://kottke.org/24/07/supreme-court-rules-that-presidents-have-absolute-immunity-for-core-constitutional-powers","date":1719846850000,"content":"\n        <p>I don’t even know what to say <a href=\"https://www.theguardian.com/us-news/live/2024/jul/01/supreme-court-trump-immunity-claim-decision-updates\">about this</a>. From Justice Sotomayor’s dissent (<a href=\"https://www.supremecourt.gov/opinions/23pdf/23-939_e2pg.pdf\">starting on page 68</a>):</p>\n\n<blockquote><p>The President of the United States is the most powerful person in the country, and possibly the world. When he uses his official powers in any way, under the majority’s reasoning, he now will be insulated from criminal prosecution. Orders the Navy’s Seal Team 6 to assassinate a political rival? Immune. Organizes a military coup to hold onto power? Immune. Takes a bribe in exchange for a pardon? Immune. Immune, immune, immune.</p>\n\n<p>Let the President violate the law, let him exploit the trappings of his office for personal gain, let him use his official power for evil ends. Because if he knew that he may one day face liability for breaking the law, he might not be as bold and fearless as we would like him to be. That is the majority’s message today.</p>\n\n<p>Even if these nightmare scenarios never play out, and I pray they never do, the damage has been done. The relationship between the President and the people he serves has shifted irrevocably. In every use of official power, the President is now a king above the law.</p></blockquote>\n\n<p>And her closing:</p>\n\n<blockquote><p>Never in the history of our Republic has a President had reason to believe that he would be immune from criminal prosecution if he used the trappings of his office to violate the criminal law. Moving forward, however, all former Presidents will be cloaked in such immunity. If the occupant of that office misuses official power for personal gain, the criminal law that the rest of us must abide will not provide a backstop.</p>\n\n<p>With fear for our democracy, I dissent.</p></blockquote>\n\n<p>Jesus. <em>With fear for our democracy, I dissent.</em> I wish I knew what else to say or think about this, but Jesus.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Sonia%20Sotomayor\">Sonia Sotomayor</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"147aa4ae005227fea62ea7833806cf8675a23d6100fc89d51e1e79bb33923931","category":"default"}