{"title":"Did The Future Already Happen?","link":"https://kottke.org/24/01/did-the-future-already-happen","date":1706639695000,"content":"\n        <p></p>\n\n<p>Kurzgesagt’s latest video on the paradox of time is a bit more of a brain-bender than their usual videos. From <a href=\"https://sites.google.com/view/sources-what-is-time\">the accompanying sources document</a>:</p>\n\n<blockquote><p>This video summarizes in a narrative format two well-known theories about time: the so-called “block universe” and the “growing block”.</p>\n\n<p>The block universe is an old theory of time which appears to be an unavoidable consequence of Einstein’s theory of special relativity. In philosophical contexts, basically the same idea is known as “eternalism”. Simplified, this theory posits that, although not apparent to our human perception, both the past and the future exist in the same way as the present does, and are therefore as real as the present is: The past still exists and the future exists already. As a consequence, time doesn’t “flow” (even if it looks so to us) and things in the universe don’t “happen” - the universe just “is”, hence the name “block universe”.</p></blockquote>\n\n<p>But then: “Quantum stuff is ruining everything again.” And so we have the growing block theory:</p>\n\n<blockquote><p>The Evolving/Growing Block: A relatively new alternative to the classical block universe theory, which asserts that the past may still exist but the present doesn’t yet, and all that in a way that is still compatible with Einstein’s relativity.</p></blockquote>\n\n<p>And there are still other theories about how time works:</p>\n\n<blockquote><p>Some scientists think that the idea of “now” only makes sense near you, but not in the universe as a whole. Others think that time itself doesn’t even exist — that the whole concept is an illusion of our human  mind. And others think that time does exist, but that it’s not a fundamental feature of the universe. Rather, time may be something that emerges from a deeper level of reality, just like heat emerges from the motion of individual molecules or life emerges from the interactions of lifeless proteins.</p></blockquote>\n\n<p>Like I said, a brain-bender.</p>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Kurzgesagt\">Kurzgesagt</a> · <a href=\"https://kottke.org/tag/physics\">physics</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/time\">time</a> · <a href=\"https://kottke.org/tag/time%20travel\">time travel</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"14a9d3d7b856d3e73515e313ebdb050247255c97e9b3713990ddffb138d2fa47","category":"default"}