{"title":"Writing Online Is A Conversation","link":"https://www.usv.com/writing/2024/07/writing-online-is-a-conversation/","date":1720002898000,"content":"<p>The number one thing I hear from people who want to write online more is that they struggle to publish incomplete ideas and unpolished compositions.</p>\n<p>What I have learned from writing online regularly for over twenty years is that writing online is a conversation.</p>\n<p>What I mean by that is that you are not trying to publish complete ideas. You are engaging in a conversation with the world and you are a participant in that.</p>\n<p>Here’s an example from back in 2006:</p>\n<p>I was seeing a lot of startups using a business model where they gave their service away for free with hopes of converting some of the users to subscribers. I wanted to give that business model a name. So I wrote about it and asked the folks who were reading my posts to suggest some names.</p>\n<p>One reader suggested “freemium” and I loved it and wrote another post stating that we now have a name for that business model .</p>\n<p>That’s a conversation.</p>\n<p>Here’s another example:</p>\n<p>My colleague Grace wrote a post about the Fragmentation of Search back in February and we started getting calls and emails from founders working in the space. Five months later, we have committed to lead a round of financing in a company right in the sweet spot of that blog post.</p>\n<p>That’s a conversation.</p>\n<p>So to everyone out there who is struggling to polish their posts and make them perfect before hitting publish, I say “don’t bother”. Think about writing online like being at a cocktail party or a dinner. Think of it like a conversation starter or a witty reply that takes the conversation to the next level. Because that’s what writing online is. A conversation.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/writing-online-is-a-conversation/\">Writing Online Is A Conversation</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"14e1df8a1a40a5d6e89f732dc55ab7a74da8a3643cfab4c9fbea5e872610c93f","category":"default"}