{"title":"Why Yahoo bought Artifact’s leftovers","link":"https://om.co/2024/04/02/why-yahoo-bought-artifact-leftovers/","date":1712090868000,"content":"<p><em>TLDR: This is a smart move for Yahoo. It didn’t cost them much. I would say that this was cheaper than the “cheap and cheerful” category. Second, it gives <a href=\"https://www.yahooinc.com/press/yahoo-announces-the-acquisition-of-artifact-the-news-discovery-platform-created-by-instagram-cofounders-kevin-systrom-and-mike-krieger\">Yahoo News a chance to modernize</a>.</em></p>\n\n\n\n<p>**</p>\n\n\n\n<blockquote>\n<p>“A lot of organizations care deeply about news and personalized content and I think they’re looking around and saying ‘Wow, there’s this new wave of AI… maybe we should figure out what’s going on.’ Maybe that’s what I discounted originally.” <a target=\"_blank\" href=\"https://www.theverge.com/2024/4/2/24118436/yahoo-news-artifact-acquisition\">Kevin Systrom, Artifact’s co-founder</a>.</p>\n</blockquote>\n\n\n\n<p>The internet as we know it is not usable at human scale. Enter, AI.</p>\n\n\n\n<p>I’ve always maintained and written about the fact that we, as humans, are dealing with a growing amount of information and data, and we need machines to help make sense of that.</p>\n\n\n\n<p>We rely on algorithms to distill what is important from the trivial, whether monitoring social networks or scanning images on Instagram. They are deeply integrated into the very fabric of the modern Internet user’s habits.</p>\n\n\n\n<p>We all seek help from algorithms to figure out what we want, often without realizing it. In other words, it has become quite difficult to seek information through traditional methods such as visiting home pages or individual sources. We prefer information to be spoonfed to us. That explains the high demand for newsletters.</p>\n\n\n\n<p>Legacy services (like Yahoo) must realize that they must evolve beyond their traditional information systems, that were predominantly subject- or tag-based, to be relevant. They need information streams to be personalized. It is important to do so because that would allow them to hyper-target advertising, which is their primary revenue source.</p>\n\n\n\n<p>When the sources of information were much fewer and the information itself was not as excessive as today, it worked very well. With the current (and ever-growing) scale of information, machines have to be used to figure out what is <em>good</em> information, what is <em>worth surfacing</em>, and then offering a synopsis of it, and giving us humans little nudges.</p>\n\n\n\n<p>Yahoo is smart by ‘keeping up with the times.’ Also, likely, they didn’t pay a lot of money for it. Yahoo is owned by a PE firm — and the management is pretty savvy with investing their dollars.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"14f251d96e08e65a79f3e6b172bc8d9f21090d5ed0e472451a442896044c0e46","category":"default"}