{"title":"Art+Technology: Raphaela Vogel","link":"https://ghuneim.com/2024/02/01/arttechnology-raphaela-vogel/","date":1706811461000,"content":"<p><strong>In the Expanded Penalty Box: Did You Happen to See the Most Beautiful Fox?</strong></p>\n<p>January 11 – February 17, 2024  Petzel, NYC</p>\n<p>Petzel is pleased to present <em>In the Expanded Penalty Box: Did You Happen to See the Most Beautiful Fox?</em>, an interdisciplinary exhibition of new works by Berlin-based artist Raphaela Vogel, in which she unfolds her enigmatic form repertoire beyond aesthetic orthodoxies. The show marks Vogel’s first exhibition with the gallery, as well as her first solo exhibition in the US, and will be on view from January 11 to February 17, 2024, at Petzel’s Chelsea location at 520 West 25th Street.</p>\n<p>Through surrealistic and autobiographically composed environments, Vogel deals with power dynamics ranging from questions of gender to human-animal and machine relations. Here, phallic forms of spatial production and the urges of male voyeurism are confronted by Vogel’s highly subjective camera and occupation of space. Her installations and video collages often feature metal sounds, drones, field recordings, pop songs, and singing hooligans sampled from Vogel’s own cultural memory. The artist’s ambiguous play with received notions of architectural and artistic mastery is reflected in the employment of readymades associated with the public realm: steel girders, cars, urinals, or heraldic statues. These symbols of power are often paired with visceral white polyurethane sculptures and painterly stretched animal skins, transforming the virile rectangular predominant in architecture and painting into triangular bodily objects.</p>\n<p><em>In the Expanded Penalty Box: Did You Happen to See the Most Beautiful Fox?</em> interlocks new hallucinogenic video collages, sculptural monumentalism, and ritualistic paintings with questions of intersubjectivity, technogenesis, and a culture of remembrance. The center of the gallery is occupied by a retrofuturistic apparatus. This 360-degree 3D scanner functions as a panoptic confessional for exhibitionist self-monitoring where visitors can become masters and servants of themselves: a metaphorical penalty box of another kind. Once inside, in a fraction of a second, 70 single-lens reflex cameras capture every detail and angle of a body. But only for a fleeting moment do the scanned pictorial fractures of oneself pop up on a screen in order to vanish again without being stored in the digital ether.</p>\n<p><a href=\"https://www.petzel.com/exhibitions/raphaela-vogel\">Petzel</a></p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"151fe228b936bf4eea9d5c154bc50afda08b1631471974d5b15c6a67a81471a2","category":"default"}