{"title":"How Substack's follow feature betrays its original mission","link":"https://www.usermag.co/p/how-substacks-follow-feature-betrays","date":1730134663000,"content":"<div><figure><a target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg\"><div><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg\" width=\"1456\" height=\"763\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f6dad44-ddd1-48df-86a5-fc52e69975a0_1920x1006.jpeg 1456w\" /><div></div></div></a></figure></div><p>On Friday, Tyler Bainbridge, the founder of <em><a href=\"https://www.perfectlyimperfect.fyi/\">Perfectly Imperfect</a></em>, a popular recommendation newsletter, announced he was leaving Substack. He said that he was leaving in part over the platform's “follow” feature, which allows users to interact with each other within the Substack app without giving away their emails. </p><p>\"There’s been a huge push for newsletter writers to make use of Substack’s app-specific features such as Chat, Notes, and Live Video, which are great for generating followers, but not necessarily subscribers,\" Bainbridge <a href=\"https://www.perfectlyimperfect.fyi/p/were-leaving-substack\">wrote</a>. \"The problem is, you don’t own your followers, and you can’t export them along with your subscribers if you ever decide to move elsewhere.\"</p><p>Substack's whole appeal to creators is that their creative labor is worth something, and creators should own the fruits of that labor, namely the connections with their audience. Substack successfully differentiated itself from other platforms with this value proposition and attracted a vibrant array of talented creators as a result. With the follow button, however, Substack contradicts their core principle of creator ownership, instead recreating the very kind of walled garden their founders originally opposed.</p><p><a href=\"https://www.usermag.co/subscribe?\"><span>Subscribe now</span></a></p><p>This has frustrated some high-profile Substackers, who are concerned about Substack's introduction of more traditional social platform dynamics. Along with Bainbridge, Tech writer Casey Newton and online culture journalist Ryan Broderick both cited Substack's shift toward more social functionality as a factor in their decisions to exit the app. </p><p>The debate and frustration over the follow feature also comes amidst a larger shift in content delivery mechanisms across the internet and it shows the tensions between building features that benefit creators vs average users/consumers.</p><div><figure><a target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp\"><div><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp\" width=\"1456\" height=\"977\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F9f2d93b9-d46c-45bf-b1a0-7fed5f309ec5_1456x977.webp 1456w\" /><div></div></div></a><figcaption>Perfectly Imperfect’s Tyler Bainbridge</figcaption></figure></div><h3><strong>The evolution of the follow</strong></h3><p>The <em>follow</em> or <em>subscribe</em> button as we know it today—where users can opt into receiving updates from specific people or channels—was first introduced in 2005 with YouTube's subscribe button. As I wrote in my book,<em> <a href=\"https://www.extremelyonlinebook.com/\">Extremely Online</a></em>, which catalogs the rise of the content creator industry, the subscribe button was transformational. For the first time, users could follow someone they liked online without needing a reciprocal connection, a major departure from earlier social platforms like MySpace and Facebook, which required mutual opt-in. </p><p>A year later, in 2006, Twitter introduced its own follow button, where following wasn’t limited to content creators but could be applied to any user. This set the stage for the follower-based model of social media that dominated the 2010s. Soon, Instagram, Vine, Twitch, Facebook, and LinkedIn all allowed users to follow each other.</p><p>The follow button initially allowed creators to build a somewhat direct relationship with their audiences. Yes, the relationship was still mediated through a social app, but for a long time if you followed someone, you could generally count on seeing their content. </p><p><a href=\"https://www.usermag.co/subscribe?\"><span>Subscribe now</span></a></p><p>As Patreon co-founder Jack Conte explained in his <a href=\"https://www.youtube.com/watch?v=5zUndMfMInc\">most recent talk at SXSW</a>, \"The follow [was] not some handy feature of a social network. The follow is foundational architecture for human creativity and organization. It’s about the idea of a creator with a community of fans around them who want to see their future work. The concept of the follow – it's profound.\"</p><p>However, by the late 2010s, it was clear that the follower model of social media was broken. Not only is it a massive burden for users to manually seek out and follow or subscribe to others for updates, but most users also don't necessarily want to consume everything (or even most) of what someone they follow posts. </p><div></div><p>So, social media platforms began to lean into algorithmic discovery, harvesting user data to deliver a steady feed of engaging content tailored to a user's interests and consumption patterns. In nearly every way this offered a significantly better experience for the average user. </p><p>When TikTok took off after relaunching in the U.S. in 2018, it did so in large part because it was the first post-follower social platform. Sure, you can follow people on the app, but the primary way content is delivered is through a fully algorithmically programmed \"For You\" feed, in which the vast majority of content comes from users you don't follow.</p><p>But what was good for average users was not necessarily good for creators. As social apps shifted to algorithmic feeds, that platforms gained even more control over the relationship between the creator and their audience. Creators responded to this shift by attempting to push their audiences to platforms that allowed for unfiltered connection with their followers, like Patreon and Substack.</p><p>Substack, especially in the early days, positioned itself as anti-social media. It sought to allow writers and content creators the ability to develop an even deeper and unmediated relationship with those who enjoyed their work. </p><p>\"By favoring algorithmic recommendations of engaging content over relationships,\" Substack co-founder Hamish McKenzie <a href=\"https://x.com/hamishmckenzie/status/1554905529536786432\">posted in a 2022 Twitter thread</a>, \"[social networks] become 'recommendation networks'... A true community depends on unmediated relationships between members… On TikTok, Facebook etc, you don't own a direct relationship with your followers. But you <em>should</em>.\"</p><p><a href=\"https://www.usermag.co/subscribe?\"><span>Subscribe now</span></a></p><h3><strong>Substack’s follow fallout</strong></h3><p>Substack launched Notes <a href=\"https://on.substack.com/p/notes\">in April 2023</a>, positioning the product as a short-form method for writers to connect with their readers. The Notes feed, offers an experience akin to Twitter, was immediately popular. But it frustrated some users that, initially, in order to follow someone on Notes, you had to subscribe to their newsletter as well. </p><p>A few months later, in August 2023, Substack <a href=\"https://on.substack.com/p/follow\">introduced the \"follow\" button</a>. Newton said that he supported the button. He and most other users wanted a way to engage with certain people on the app without having to subscribe to their whole email newsletter. There are some people who post great Notes, for instance, but their newsletter covers topics some followers may not be interested in.</p><p>Notes also began to serve as a powerful discovery mechanism. In writing this piece I realized that nearly all of the newsletters I have recently subscribed to I've discovered via following someone first on Notes.</p><p>This is how Substack wanted things to work. Substack founder Hamish Mckenzie recently <a href=\"https://substack.com/@hamish/note/c-73634696\">said</a>, \"'A follow on Substack is a middle ground between 'I’m interested' and 'I’m committed.' A follow says to a publisher, 'I want to get to know you more, but I’m not yet ready to give you my email address.' A follower is not yet a fully signed up member of a publisher’s community.\"</p><div></div><p>But still, the introduction of the follow feature represents a fundamental shift in Substack’s value proposition. Now, a creator’s Substack audience is split within the platform between those who subscribe to their newsletter and those who solely follow their posts on Notes. Substack creators suddenly have two jobs: serving a dedicated base of newsletter subscribers and cultivating a broader audience within Substack's walled garden.</p><p>Several writers I spoke to told me they weren't sure if they should focus on growing their follower base on Notes (in the hopes that those followers eventually convert to their newsletter) or stay focused on directly promoting newsletter signups.</p><p>Bainbridge said that only 6% of Perfectly Imperfect’s total audience was comprised of followers rather than newsletter subscribers. However, Mikala Jamison, whose newsletter <em><a href=\"https://bodytype.substack.com/\">Body Type</a></em> covers body image discourse, <a href=\"https://substack.com/@bodytype/note/c-74064299\">posted</a> that 33% of her total audience was made up of followers. For some newsletter writers who joined Substack since the introduction of Notes, that number can be as high as 50%.</p><div></div><p>\"I am having an existential crisis because my subs are dropping like flies but my followers are growing exponentially,\" posted Martha Adams who publishes <a href=\"https://marthasmonthly.substack.com/\">Martha's Monthly</a>, a newsletter that reviews diverse and translated books from around the world. Martha said that she gained 150 followers in one day recently and lost 10 subscribers that same day. </p><p>\"Fluctuation is normal,\" she <a href=\"https://substack.com/profile/25300387-martha/note/c-74065971\">posted</a>, \"but it is starting to feel very weighted in one way.\" </p><p>Several smaller writers I spoke to said that they now feel pressure to create additional content specifically for followers on Notes, which has increased their workload and complicated their content strategies. They worry that, over time, these conflicting incentives could push writers to prioritize metrics beyond subscriber growth, making them more beholden to the app. </p><p>\"As a user of Notes, I enjoy the community and content,\" Bainbridge said, \"but as a writer I see it as a big step towards getting writers more dependent on Substack’s app, which will make it much harder to leave someday.\"</p><p>The follow button has also created some misunderstanding among users. Since launching <em>User Mag</em> in early October, I've had a couple people tell me that they're not receiving my emails. Upon investigation, I discovered that they were only following me. I had to explain that they need to actually subscribe to receive my newsletter in their inbox. </p><div></div><p>I'm not the only one experiencing this issue. \"Folks are conditioned to ‘follow’ and they don’t know that they need to subscribe to get your content directly,\" Janet Ridsdale, a newsletter writer, <a href=\"https://substack.com/profile/7194169-janet-ridsdale/note/c-72876746\">posted on Notes recently</a>.</p><p>It's worth acknowledging that you can still use Substack Notes to promote your newsletter even if you aren't publishing that newsletter on Substack any longer. Shifting your newsletter off Substack doesn't necessarily mean \"losing\" your followers, it just means, like any social app, you'll need to log into the platform to reach them.</p><p>Substack also does a lot to incentivize subscribes over follows within its app. It makes the subscribe button on user’s profiles big and orange, it includes a subscribe (not follow) button next to users’ posts on Notes, and when you click into a newsletter post highlighted within the Substack app you’re met with a subscribe icon.  </p><div></div><p>As other platforms have deprioritized, or in X's case <a href=\"https://www.theverge.com/2023/4/7/23674936/twitter-marking-substack-links-unsafe\">even banned</a>, Substack links, I personally like that the app has given me a new space to cultivate a lightweight audience and market my work to more people.</p><p>As McKenzie recently posted, \"For those who are worried about platform risk, the question shouldn’t be, 'Am I too dependent on Substack because it has networking features that bring me more subscribers?', but more, 'If I opt out of the Substack network, where else will I find leads for my subscriptions? Instagram? X? LinkedIn?' … those places aren’t actively trying to get you more Substack subscriptions. We are.\"</p><p>When I spoke to Substack CEO Chris Best about the issue, he emphasized that the follow feature drives growth. “The number one thing people always ask us for is like more discovery, and the Substack app is driving a tremendous amount of subscription discovery,” he said. </p><p>“As every other network erodes in different ways and makes it harder to promote your stuff,” he said, “The Substack app and feed is actually a place where your stuff is first class, where subscription is prioritized, where longform can travel. We can see from the numbers that it really is working.”</p><p>The main question for Substack, is whether they can arrive at a follower/subscriber paradigm that lives up to the values they espouse. While posting to Notes undeniably boosts newsletter discovery, the follow paradigm Substack currently employs still eschews the \"unmediated relationships\" that the company has claimed to prize.</p><p><a href=\"https://www.usermag.co/subscribe?\"><span>Subscribe now</span></a></p><h3><strong>Fixing the follow</strong></h3><p>It's undeniable that the follow feature and some of the other features being built into the Substack app, like live video, indicate an evolution in Substack’s identity. The platform has gone from a behind the scenes publishing tool to a full-fledged social app. But can a social platform ever grant autonomy and independence to creators?</p><p>Just as creators on YouTube, Instagram, and TikTok are at the mercy of shifting platform policies, monetization options, and algorithmic visibility, Substack could begin exerting more control over follower-based distribution. For writers who chose Substack specifically for its direct-to-subscriber model, this potential shift is disconcerting.</p><p>Best acknowledged that there was more education the company could do to help users understand the difference between a follow vs subscription. He also explained that the reason the company has invested so much into the app experience is to serve a wider range of creators. </p><p>“We're trying to make the Substack model work for lots of different creators,” he said. “If you want to make a podcast, if you want to make video, if you want to have a conversation, there should be a place where you can do all of that stuff and be able to actually make money, own your work and your audience.” </p><p>Still, on Patreon, becoming a free subscriber to a creator, grants that creator access to your email address. Substack \"follows\" could work similarly, where following a creator would share your direct contact information, but not automatically subscribe you to their newsletter. This way, if a creator wanted to leave Substack, they'd have the ability to let followers know where to find their content going forward.</p><p>Alternatively, Substack could embrace the federated model of social media, which platforms like Mastodon, Bluesky, and even Threads leverage. In so many ways, the Fediverse embodies the ideals that Substack was founded on: giving users a platform-agnostic connection to their audience, allowing for audience portability, eliminating top-down moderation, and putting users back in control of their online experience.</p><p>Best was open to all of these ideas. One solution he floated when we spoke was perhaps giving creators a one-time way to alert followers if they were moving off platform, launching a new newsletter, or needed to communicate something important. I think that’s a great idea and offers a middle ground that serves both the interests of creators and their followers.</p><p>As other platforms continue to dilute the connections between creators and their audiences, Substack has the opportunity to differentiate itself by leaning into direct, ownable connections. Fixing the follow would be a great step toward that mission. </p><div><div><div><p>User Mag is a reader-supported publication. To receive new posts and support my work, consider becoming a free or paid subscriber.</p></div><div><div></div><div></div></div></div></div><div><figure><a target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png\"><div><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png\" width=\"1407\" height=\"27\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fad731c0e-8e05-47b8-abe6-56e409603eaf_1407x27.png 1456w\" loading=\"lazy\" /><div></div></div></a></figure></div><p>What do you want to see more of from this newsletter? Let me know!</p><p><strong>For more great content <a href=\"https://www.instagram.com/taylorlorenz3.0/\">follow my meme page</a>, subscribe to <a href=\"https://www.youtube.com/taylorlorenz\">my YouTube channel</a>, and <a href=\"https://www.instagram.com/channel/AbZQPs8zLytuVxvh/\">join my Instagram broadcast channel</a> where I share links all week long.</strong></p><p><strong>Listen to my podcast Power User on Apple Podcasts:</strong></p><div></div><p><strong>Or follow Power User on Spotify:</strong></p><p><a href=\"https://www.usermag.co/p/the-woman-behind-the-viral-texas?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share&amp;token=eyJ1c2VyX2lkIjoxMTUzMDc5LCJwb3N0X2lkIjoxNTA1OTMxMjUsImlhdCI6MTcyOTcyMjg3OCwiZXhwIjoxNzMyMzE0ODc4LCJpc3MiOiJwdWItMzIzOCIsInN1YiI6InBvc3QtcmVhY3Rpb24ifQ.ddgUPVHk3Rd4mMzYAqDk4PzMRpLapQB5daoZVKwNBxo\"><span>Share</span></a></p><p></p><p> </p><p></p><p> </p>","author":"Taylor Lorenz","siteTitle":"usermag.co","siteHash":"95f273abc07d53f60c12a9877d5e701fc5d46103659afbdcd53f0429eec6280d","entryHash":"1607d1295189c689ab5b2c7e55dc6d6b86eec3df79fbbe943fcded6481eae955","category":"Sites"}