{"title":"Uber Appreciation","link":"https://www.usv.com/writing/2024/08/uber-appreciation/","date":1724361506000,"content":"<p>Earlier this week, I hopped in an Uber with my family to get to our Lisbon apartment rental, and I felt a profound appreciation for the company. We were in a foreign country, and with the tap of a button, I could summon a car to safely get us home. It was reliable and worked the exact same way it does when I’m home in NYC or traveling anywhere else for that matter.</p>\n<p>What Uber has accomplished over the past 15 years is nothing short of miraculous. I remember sitting outside TechCrunch Disrupt in San Francisco in 2010 when Travis pulled out his phone and showed Steve and me (and anyone else in a 2-mile radius who would pay attention) how he was calling a black car to pick him up. The app was clunky and the wait time was something like 20 minutes for a ride. Today I wait less than five minutes for a ride that is cheaper and safer than a taxi and available to me through the same app in virtually every city in the world. I don’t think I’ve witnessed another company do anything like that in my career.</p>\n<p>Farcaster Jared Hecht on Warpcast there is something magical about summoning an Uber in a foreign country and how it is always reliably there for you. it’s one of the greatest feats of startup building I’ve witnessed, a miraculously executed global-scale combination of software and physical infrastructure.</p>\n<p>The media did an exceptional job vilifying Uber during its rise, and as a result, its history is often associated with scandal. That’s a shame because there are many important and positive things to learn from the company. Three of them are presently top of mind as I reflect on it:</p>\n<p>Super outcomes require superhuman effort. Emil Michael , Uber’s chief business officer, has been a long-time friend of mine and was an advisor / mentor to both my companies. I watched him as he helped to build Uber from a company that had recently achieved product-market fit to a global behemoth. I’ve founded two companies and I’ve never worked as hard as he did when he built Uber. Absolute commitment to winning was the culture of the company.</p>\n<p>I think of the amount of effort Emil put into building Uber and how everyone else there from the top down bled for the company, and I am reminded that that is simply what’s required to build something iconic. People make mistakes along the way; they always have; they are just meaningfully more pronounced now because there is a 24/7 market for salacious sound bites and tweets. But as my family was safely being transported around a foreign city earlier this week, all I could think was that wouldn’t have been possible were it not for the Uber teams’ maniacal work ethic. I remember it being commonplace to vilify the company and its leadership for its intense work culture. It would have never worked without it.</p>\n<p>Another underappreciated aspect of Uber was its bold and innovative “capital as a moat” strategy , rapidly raising billions of dollars round after round. They were criticized for their lack of profitability and for using equity capital to block their competitors from markets and investor pools. They were deemed a capital-inefficient business that was never going to work. But they took that capital and built out physical infrastructure across the world in one decade in a way that had never been done before and at a speed that, in retrospect, seems unfathomable. Now it’s a $150B market cap and cash flow positive company that pioneered a bold and counterintuitive capital raising model currently employed by everyone involved in another transformative category, the LLM wars.</p>\n<p>Think for yourself, and don’t get swooped up by media narratives. Uber caught an infinite amount of flack as it was coming up. It was as if the world, particularly the media, was rooting for its downfall. During the moment, its hard-charging culture and agglomerate-all-the-cash strategy seemed like a recipe for disaster. At least that’s what the public narrative portrayed. But look at it now. It is almost certain that the global infrastructure Uber has built over the past 15 years would not exist were it not for the things that most people once lambasted about the company. Yes, absolutely Dara has done an exceptional job as CEO, shepherding the company as a public institution. But you don’t get to a place where you can hire a CEO like Dara without breaking some eggs along the way.</p>\n<p>It took an Uber ride in a foreign country to appreciate these things fully. It’s easy to sour on companies as they are growing for doing things differently and for making mistakes publicly. But you don’t go from nothing to iconic without trekking through many gray areas. It’s important not to rush to judgment when the narrative and public sentiment turn. We see this every day in national politics, and we also see it when startups and new technologies make their way into the zeitgeist. Sometimes, things that are different that ruffle our feathers end up being true superpowers. I’m trying to be more conscious of that.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/uber-appreciation/\">Uber Appreciation</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"1761ab538f683c5790af3b5428f0ddb081d1d4014b72fdeca2cc781fc05daf65","category":"Sites"}