{"title":"The Future of Writing: How AI Will Reshape Our Tools","link":"https://om.co/2024/07/02/from-wordperfect-to-perfect-word-with-ai/","date":1719955321000,"content":"<figure><img width=\"1024\" height=\"769\" src=\"https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1024&amp;h=769\" alt=\"fountain pen on black lined paper\" srcset=\"https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=300&amp;h=225 300w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1024&amp;h=768 1024w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=150&amp;h=112 150w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=768&amp;h=576 768w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1536&amp;h=1153 1536w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=2048&amp;h=1537 2048w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=256&amp;h=192 256w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=2000&amp;h=1500 2000w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=192&amp;h=144 192w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1100&amp;h=825 1100w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=232&amp;h=157 232w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=627&amp;h=416 627w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=560&amp;h=420 560w, https://images.unsplash.com/photo-1455390582262-044cdead277a?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTk5NTUzMDl8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1800&amp;h=1351 1800w\" /><figcaption>Photo by <a href=\"https://unsplash.com/@aaronburden\">Aaron Burden</a> on <a href=\"https://unsplash.com/?utm_source=on-my-om&amp;utm_medium=referral\">Unsplash</a> </figcaption></figure>\n\n\n\n<p>Earlier this morning while reading The Wall Street Journal, I learned that Bruce Bastian, co-creator of WordPerfect, the word-processing software, had died at 76. His life was consequential, <a href=\"https://www.wsj.com/tech/bruce-bastian-wordperfect-lgbtq-activist-dies-at-76-6da293f4?mod=hp_featst_pos5\">as his obituary so eloquently elaborate</a>s. I haven’t thought of WordPerfect for a long time. And probably neither have many others who think of Microsoft Word and Google Docs as “word processing” software. At least a few are thinking about what comes next.</p>\n\n\n\n<p>Writing might not have changed, but the tools we use to write and process words have. I learned to write on a wooden slate. I used to (and still do) use paper, pen, and ink to draft, craft, and create. There was a time when typewriters were my word processors. And when computers came along, my tools changed. My focus has been on the work, the words, and why I write— not how I write and where I write. That’s why I have been quick to embrace whatever tools and mediums that allow me to write and publish quickly.</p>\n\n\n\n<p>I started out using WordStar, but once I discovered WordPerfect, that became my go-to word processor when using MS-DOS on my computer. Microsoft was good at incorporating the best features of WordPerfect into Word. However, I liked the WordPerfect interface and its relative simplicity. Eventually, in an effort to keep up with Word, even WordPerfect lost its identity. Microsoft’s desktop domination and control of distribution meant that we all ended up using Word, just like Excel, Outlook, and everything else. And while I ended up using Microsoft Word all the time, I never quite loved it. It was bloated and kept getting bigger and slower. Even today, I’m not too thrilled to use it. This was the era of personal productivity, with minimal personalization. </p>\n\n\n\n<p>Things changed with the arrival of the web and the cloud. I remember using Writely, an online editor, and feeling the joy of writing with a nimble, fast, and modern word processing tool. It lacked many of Microsoft Word’s whiz-bang features. What made it special was the online collaboration. At the time, my company was completely remote — we didn’t have an office. All six of the first employees worked from their homes or favorite coffee shops. We knew the importance of being connected and collaborating in real time. Writely did it well. That was why it was so good. It was so good that Google <a href=\"https://om.co/gigaom/google-writely-in-talks/\" target=\"_blank\">bought the startup</a>, Upstartle, and put its team to work on Google Docs. The was the start of collaborative productivity. </p>\n\n\n\n<p>Over the years, even Google Docs has started suffering from feature creep, though it remains easy to use for collaboration. Microsoft was slow to shift to online collaboration — and nothing demonstrated that more than its productivity suite. It still does —no one will ever accuse Microsoft Office of being collaboration-friendly.</p>\n\n\n\n<p>With the arrival of mobile devices and app ecosystems, newer “word processors” emerged, doing a few things better. An editor for writing a blog post can be used to write an email or a school paper, though it’s not the best option. Apps allowed specialized word-processing tools to thrive — in an artisanal sort of way.</p>\n\n\n\n<p>Over the past two years, the world of word processors has started to shape-shift again, thanks to the emergence of large language models (LLMs) and generative AI. We are at the start of a new era, moving from passive, one-size-fits-all software to more proactive, personalized tools. No application will showcase this shift better than the software we use for writing. This will be era of personalized productivity &amp; personalized software. </p>\n\n\n\n<p>Chatbots, AI personal assistants and AI therapists get a lot of attention, both as tools and investments. They seem like such a big idea and a bigger opportunity. However, they are also forced to deal with too many things and often enter the world of abstract. “Word processing” software, I believe, will be a more appropriate playground because “generative AI” and other emerging AI technologies will have to deal with a more limited scope and, as such, can be made to excel at the task at hand.</p>\n\n\n\n<p>We are all used to features such as spell-checker, thesaurus, and even grammar correction in products like Word and Google Docs. Grammarly, an early machine learning tool, can be used for checking grammar on work documents, emails, and even tweets and internet comments.</p>\n\n\n\n<p>The GPT class of artificial intelligence creates an opportunity to personalize software and our experience, especially as the tools learn from our style. We can pick and choose personas that can be our librarian, editor, copy editor, or even a collaborator who can act as a sounding board for our writing. Let’s be clear — we are not there yet. The current class of software, despite all the progress, lacks the nous and nuance of humans.</p>\n\n\n\n<p>Furthermore, the software for creation will morph and shape-shift based on who is using it. Why? The needs of a lawyer writing a document differ from those of a journalist or a movie scriptwriter. The resources they need will require different models.</p>\n\n\n\n<p>A good example is Sudowrite, an AI tool that serves as a writing companion for fiction authors and television or movie scriptwriters. While it utilizes some of the common large language models, its effectiveness stems from the layer built on top of those models. Sudowrite excels at its intended purpose. It helps overcome the biggest challenge of the big LLMs — our collective inability to put their tremendous power to work as individuals.</p>\n\n\n\n<p>Why wouldn’t <a href=\"http://sudowrite.com\">Sudowrite</a>, or something like it, become an engine for a new kind of media entity? Whether it’s a book, movie, television show or game, emergent generative AI technologies will enable the idea of “choose your own adventure.” I made a strong case for this in my essay, <a href=\"https://om.co/2024/06/03/why-i-want-my-ai-tv/\" target=\"_blank\">“This is the future of media with AI.”</a> You should check it out!</p>\n\n\n\n<p>In the future, legacy data providers — LexisNexis, scientific journals, and others — might build models that plug into AI processors and become part of the creation flow, automatically bringing relevant information without manual retrieval. In the word-processing context, AI offers a way to eliminate the mechanical parts of creation.</p>\n\n\n\n<p>Just as the emergence of digital cable and the internet allowed fractionalization of attention and helped create multiple media entities, the emergence of AI is leading to nichefication of software — all based on what is needed by the end customer. This is far more exciting than worrying about the imminent arrival of AGI or the end of civilization.</p>\n\n\n\n<p>I think a lot about word processors because I am usually in one of them. When I read about the passing of WordPerfect’s co-creator Bastian, I decided to make a note of the news in my paper notebook — with my 100-year-old pen. In doing so, I started to think about the journey of tools I have used to create — from slate to AI.</p>\n\n\n\n<p>That stream of consciousness turned into five handwritten pages. I snapped photos of what I wrote, uploaded them to Claude 3.5 Sonnet (via Poe), and had it transcribe them. (On other occasions, I talk into the phone, saying what is on my mind or dictating an idea, and then let the phone transcribe it.)</p>\n\n\n\n<p>I copied and pasted that text — it was about 90% accurate — into <a href=\"http://lex.page\">Lex</a>, where I ran it through my custom prompts. It detected all the grammatical errors, pointed out the obvious repetitions, and offered suggestions for improving readability. I might have started with WordPerfect, but I might actually end up with the perfect words.</p>\n\n\n\n<p>Bruce Bastian, RIP!</p>\n\n\n\n<p><strong>PS: <a href=\"https://wepeterson.com/almostperfect/introduction/\">Almost Perfect</a> by W.E. Pete Peterson is a free-to-read book about the rise and fall of WordPerfect. There is a <a href=\"http://www.wordplace.com/ap/almostperfect.pdf\">PDF version as well</a>.  h/t <a href=\"https://www.threads.net/@chkuendig/post/C87f7ozqsNK\">Christian Kuendig</a></strong></p>\n\n\n\n<p>Disclosure: Lex.Page is backed by True Ventures, where I am partner emeritus. I am a small investor in Sudowrite, whose founders are friends. </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"18366877c65ceb89d6c15f820b57bc1b528bd300aba3cc08089267f2cd3f9dac","category":"default"}