{"title":"Farcaster will never scale","link":"https://blog.webb.page/2024-11-08-farcaster.txt","date":1731024000000,"content":"<p>I posted this to Farcaster yesterday<a href=\"https://warpcast.com/netopwibby.eth/0x82e95b81\">1</a>:</p>\n<hr />\n<p>I've unfollowed a handful of people, muted a few, and left a bunch of channels (I\nshould've did the channel thing a while ago).</p>\n<p>The great thing about crypto is that you're surrounded by a community of\ndreamers, builders, and creators building a brighter future because we've all\nidentified what's not working in society.</p>\n<p>So, to suddenly understand that a large swath of your peers gleefully celebrate\nan inept moron because he'll make the crypto casinos print money to the moon at\nthe expense of us all is…baffling.</p>\n<p>Like…the same people who understand how to write smart contracts and use\ncustodial wallets are the same ones who accept that the same people they mint\nfrom, laugh with, and build with will literally lose their rights, lives, and/or\nfamilies due to the incoming administration…and they're fine with that.</p>\n<p>Where's the humanity?</p>\n<p>\"Hahaha, money go brrr\" over everything? Seriously? SERIOUSLY.</p>\n<p>I've been black my whole life so I'm used to people smiling in my face and\ncursing my existence in the same breath. <em>yawn</em></p>\n<p>I let my guard down and assumed because I was in a smart space with bright people\nworking towards a brighter future for us all that we'd ALL be on the same page.\nIdk wtf y'all think anymore and nor do I care at this point.</p>\n<p>Farcaster is a neat experiment that had potential to work. Now I see it will\nnever work. You cannot be a network for everybody when you don't give a shit\nabout every body. Glazing and posturing for Daddy Elon when he don't even respect\nhis own kids is sick work.</p>\n<hr />\n<p>My good friend Brad Barrish shared an excellent blog post from Ken White<a href=\"https://www.popehat.com/p/and-yet-it-moves\">2</a> in\nresponse. As one commenter put it, it's the best post-mortem of the election that\nI've seen yet. Honestly, it's a must-read. Check it out, you'll thank me later.</p>\n<p>🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"18d99dbad94905ab1da4e6f4c0dea37ee185de5db1e490b462b87b2de390ed0e","category":"Sites"}