{"title":"A simple theory of which thinkers support the elites, or not","link":"https://feeds.feedblitz.com/~/903937811/0/marginalrevolution~A-simple-theory-of-which-thinkers-support-the-elites-or-not.html","date":1725337188000,"content":"<p>I don’t agree with this theory as stated, but it can be worth spelling such things out, if only to see their weaknesses, or perhaps some strengths at some of the more unusual or less likely margins.  Here goes:</p>\r\n<p>People, especially “thinkers,” like to believe they serve all sorts of noble purposes in the intellectual infrastructure.  But in reality their main effects are either to raise or lower the status of the elites in their society.</p>\r\n<p>Noam Chomsky, for instance, has lowered the status of American elites.  That is his net long-run effect, not that he drummed up sympathy for the Khmer Rouge.  A lot more people, for better or worse, are more skeptical of a bunch of things because of Chomsky.</p>\r\n<p>The New York Times, in contrast, works hard to raise the status of elites.  It tries especially hard to raise the status of Democratic elites, but still it is raising the status of elites for the most part.</p>\r\n<p>Most “heterodox” thinkers like to think they are encouraging a more nuanced understanding of when the elites are right and when they are wrong.  And indeed that is what some of their more perceptive readers take away.  But their overall important gross effect is typically to raise the status of elites.  They make the public discussion of issues better and more vibrant (one hopes).  And thus, if only in a longer run, the status of elites goes up.  Sorry buddy, I know that wasn’t exactly your goal!</p>\r\n<p>If you teach at a top or Ivy League school, your net effect is to raise the status of elites.  With the exception of a few such people who make horrible blunders and end up disgraced.  Or in fewer cases they may be accused of false charges.  Otherwise, the simple fact of “a smart, accomplished person affiliating with elite institutions” is the main message you are sending.</p>\r\n<p>In earlier media ecosystems, it was relatively difficult to act to permanently lower the status of elites.  It is in fact quite impressive that Chomsky managed this, and without (earlier) the aid of the internet.</p>\r\n<p>Today it is much easier to lower the status of elites, largely because of social media.  But even with that aid it is not as easy as you might think.  Very often you need the cooperation of elites themselves in showing their own blemishes to the public, whether they do this wittingly or not.  They do it plenty in fact, a’ la Martin Gurri.</p>\r\n<p>Libertarianism, as it has evolved at the institutional level, largely raises the status of elites.  It keeps the idea of liberty in the public conversation.  Libertarians, of course, may not intend this as their major effect, though of course they are glad to keep the liberty idea in circulation.  Some of the “obsessed with Covid lockdowns” libertarians, however, probably lower the status of elites.</p>\r\n<p>It is hard to lower the status of elites without lowering your own status as well.  It is not just that the elites will not like you, or may treat you and your PR harshly.  You also have to come across as quite negative, and furthermore some of the negativity you create for your targets will rub off on you, at least in the eyes of much of your audience.  Plus being too relentlessly critical, rather than constructive, tends to make people stupider.</p>\r\n<p>Just as many elections are in fact about “one thing,” so are very many intellectual discussions, namely whether elites should have higher or lower status.</p>\r\n<p>Rather than classifying thinkers as left-wing or right-wing, in this (false) hypothesis we should have the taxonomy of “raising the status of elites” vs. “lowering the status of elites.”  Can it be said that Richard Hanania is now in the former category?  Matt Stoller, however, is mostly lowering the status of elites.  So we can put them in opposite corners of the true political spectrum, though for reasons different from what you once might have expected.</p>\r\n<p>Which kind of intellectual would you rather be?  Which is more likely to contribute to a net gain in social trust?  To improve social welfare?</p>\r\n<p>If this post were in fact true, how should it induce you to change your behavior?  How about as a consumer of intellectual products?</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html\">A simple theory of which thinkers support the elites, or not</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/903937811/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/903937811/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/903937811/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/903937811/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/903937811/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/903937811/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comment-160807789\">In reply to Dino Sauron.   DS: “I wish that I lived in that ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comment-160807774\">In reply to PHinton.   “And the are forced by by elites who ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comment-160807747\">In reply to Who cares about the !Kung people of southern ...</a> <i>by Eric</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comment-160807737\">In reply to notRover.   It's not their fault the Republican ...</a> <i>by OutHere</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comment-160807703\">First, I think, you have to identify which elites are working ...</a> <i>by mort main</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/a-simple-theory-of-which-thinkers-support-the-elites-or-not.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/what-should-i-ask-musa-al-gharbi.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=what-should-i-ask-musa-al-gharbi\">What should I ask Musa al-Gharbi?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/john-arnold-on-economic-polarization.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=john-arnold-on-economic-polarization\">John Arnold on economic polarization</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/jon-haidt-on-causality-from-my-email.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=jon-haidt-on-causality-from-my-email\">Jon Haidt on causality (from my email)</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"1943097d5f964e03c3dd8d9e9630723c9cf84c36c0caa685271c07bdfb05350a","category":"Sites"}