{"title":"Storytelling","link":"https://www.usv.com/writing/2024/05/storytelling/","date":1715347404000,"content":"<p>Previously I wrote : “One of the most important skills founders must hone is their ability to tell a compelling story. Part of that story, if they plan or want to use venture capital as a tool to grow, is articulating how much money they want to raise and what they plan to do with that money.”</p>\n<p>Moving from entrepreneur to investor, I assumed that founders universally knew about the importance of storytelling. I took this for granted and was very wrong. Most of the time an introductory meeting is 30 minutes. That’s a huge chunk of time to leave a lasting impression, and it belongs to you. Seize it by telling the best story possible, and augment it with the best presentation you’ve ever made. I’m constantly shocked by how many people just want to shoot the shit, or act cute and coy and don’t use the time productively to either share what they’re building and why they’re building it or begin to develop a lasting relationship in a productive way.</p>\n<p>There are many pieces of a story that are important to communicate, and every story is different, but there are some obvious and important component parts that you should always get across either with or without a deck:</p>\n<p>Who are you? I like to know your personal background and story. It humanizes you as an entrepreneur.</p>\n<p>What are you building? Too many entrepreneurs struggle to crisply articulate what is it they’re building. When this happens I immediately shut down. Whether right or wrong, it’s my dealbreaker and I can’t compromise on it. Workshop this, get feedback, refine it, do whatever you need to do to nail this. Another great way to communicate this is to show and not tell. A quick one liner accompanied by a very simple product demo (ie don’t show me every feature, just enough to grasp what it is) is always helpful. Do not mess this part up. This may sound painfully obvious, but too many people do it wrong.</p>\n<p>Why are you building this? The why is the fire that fuels you for the decade to come. Express this with passion.</p>\n<p>How’s it going? What have you learned? What’s the data look like? How are the market and customers reacting to what you’re putting out there? This is a good time to demonstrate that you’re capable of synthesizing market feedback and doing something intelligent with it. What have you learned from the capital and time you’ve invested invested so far? I’ve always liked Frank Rotman’s framing of quality learnings per dollar spent.</p>\n<p>What’s the plan moving forward? What does the roadmap look like? How much capital do  you want to raise and what will you do and accomplish with it?</p>\n<p>And don’t forget to paint a picture of why this is so exciting and how this becomes big and important along the way.</p>\n<p>Some entrepreneurs are gifted storytellers. Others are not. But storytelling is a skill that can be learned and honed over time. Practice it repeatedly. Do it in front of a mirror. Nail the delivery of the most important lines. Record it and review the tapes like a professional sports team would to get better. Pace around the room by yourself endlessly rehearsing it out loud. Practice it with your cofounder for days on end. Laugh about it. Cry about it. Give each other high fives. Give each other a hug. Scream at each other. Get weird. Enjoy the process. Refine it. Get it to the place where you can enter a meeting, start presenting, completely black out, come to at the end of the presentation and know it was flawlessly delivered. It needs to be superb and capable of being delivered on autopilot.</p>\n<p>If you do not take this part of company building seriously then you are shooting yourself in the foot. Some companies strike gold and are in the right place at the right time and have captured lightning in a bottle and could keep their mouths shut and term sheets and job applications would be delivered to their doorstep. This is the exception and not the rule. I’ve never built one of these companies, and chances are you won’t either. Not because you’re not amazing, but because the odds are statistically near zero. So in lieu of getting absurdly lucky, you have your story. It’s your ammo for attracting capital and talent. Make sure you invest in it because it pays dividends.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/05/storytelling/\">Storytelling</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"1972ac3bb8cc74f3a4580e94db6c8335c6db423d9e2d11aa36867c0178e53e91","category":"default"}