{"title":"Reading the Bible start to finish","link":"https://sive.rs/bible","date":1674777600000,"content":"<p>\nI like going to the source.\nLike finding musicians’ influences, and getting to know that music too.\nSame with film, art, philosophy, and technology.\n</p><p>\nI also like doing what people I admire recommend.\nAnd a few people I really admire suggest we read the entire Bible.\n</p><p>\nSo to go to the source of western culture, and do what the wise people say, last year I read the <a href=\"https://en.wikipedia.org/wiki/Bible\">Bible</a>, start to finish.\nEvery sentence very thoroughly.\nIt took months.\nIt was frustrating, fascinating, and very enlightening.\n(I took a ton of <a href=\"https://sive.rs/book\">book notes</a> while reading, to help me remember everything, but I won’t be publishing them.)\n</p><p>\nIf you’re thinking of reading it all, I have two bits of advice:\n</p>\n<h3>\nSample many different translations.\n</h3>\n<p>\nI started with one called “<a href=\"https://archive.org/details/bibledesignedtob012390mbp/page/n5/mode/2up\">The Bible: Designed to be Read as Living Literature, the Old and the New Testaments in the King James Version</a>”.\nI assumed I needed to read the legendary <a href=\"https://en.wikipedia.org/wiki/King_James_Version\">King James version</a>, since that’s the one that influenced so much English literature.\nBut it was <em>so</em> tough to get through.\nAlmost every sentence took extra work to understand, even after two hundred pages.\nSome people love it, but just I didn’t.\nSo <em>huge</em> thanks to <a href=\"https://kk.org/\">Kevin Kelly</a>, who recommended I try other translations.\n</p><p>\nI bought four different versions, and spent a couple hours reading the same passages in each one.\n</p><ul>\n<li><a href=\"https://en.wikipedia.org/wiki/New_International_Version\">New International Version</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/New_Living_Translation\">New Living Translation</a></li>\n<li><a href=\"https://en.wikipedia.org/wiki/English_Standard_Version\">English Standard Version</a></li>\n<li>and <a href=\"https://en.wikipedia.org/wiki/The_Message_(Bible)\">The Message</a>.</li>\n</ul><p>\nI chose the <a href=\"https://en.wikipedia.org/wiki/New_Living_Translation\">New Living Translation</a>, and started from the beginning again.\nSome day I’ll read a very different version for a different experience.\n</p>\n<h3>\nWatch the <a href=\"https://bibleproject.com/explore/\">BibleProject videos</a>.\n</h3>\n<p>\nI didn’t discover these videos until after I was 500 pages in, often confused, and searched the web for explanations.\nI wish I would have watched them first because they were <strong>so helpful</strong>! \nSo well done.\nSo interesting, clearly explained, and visually captivating.\n</p><p>\nI highly recommend you:\n</p><ol><li>\nWatch an hour or two of their introduction videos at <a href=\"https://bibleproject.com/explore/\">BibleProject.com</a>.\n</li><li>\nPick a translation and begin reading.\n</li><li>\nBefore or after each chapter (actually book), go back and watch their <a href=\"https://bibleproject.com/explore/book-overviews/\">overview video for that book</a> to help understand it better.\n</li></ol><p>\nI ended up watching almost every video on their site, at least ten hours’ worth, and found it almost as enlightening as the reading itself.\nA friend who has never read the Bible (and doesn’t want to) watched a few hours with me, and found them fascinating too.\n</p><p>\nI’m really glad I did this huge project, and I’m curious to learn more.\n</p>\n<img src=\"/images/bibles.jpg\" alt=\"stack of bible versions\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"19f3716f1fd203f86f5a7385dfcfa314fd0b733ffc9a82883f25d1667b4318da","category":"default"}