{"title":"The Problem With Loving the Unborn","link":"https://kottke.org/24/02/the-problem-with-loving-the-unborn","date":1708969324000,"content":"\n        <p><a href=\"https://www.facebook.com/dave.barnhart/posts/10156549406811031\">This Facebook post from June 2018</a> by Dave Barnhart, a Methodist pastor, is worth quoting in full:</p>\n\n<blockquote><p>“The unborn” are a convenient group of people to advocate for. They never make demands of you; they are morally uncomplicated, unlike the incarcerated, addicted, or the chronically poor; they don’t resent your condescension or complain that you are not politically correct; unlike widows, they don’t ask you to question patriarchy; unlike orphans, they don’t need money, education, or childcare; unlike aliens, they don’t bring all that racial, cultural, and religious baggage that you dislike; they allow you to feel good about yourself without any work at creating or maintaining relationships; and when they are born, you can forget about them, because they cease to be unborn. It’s almost as if, by being born, they have died to you. You can love the unborn and advocate for them without substantially challenging your own wealth, power, or privilege, without re-imagining social structures, apologizing, or making reparations to anyone. They are, in short, the perfect people to love if you want to claim you love Jesus but actually dislike people who breathe.</p>\n\n<p>Prisoners? Immigrants? The sick? The poor? Widows? Orphans? All the groups that are specifically mentioned in the Bible? They all get thrown under the bus for the unborn.</p></blockquote>\n\n<p>(thx, caroline)</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/abortion\">abortion</a> · <a href=\"https://kottke.org/tag/Dave%20Barnhart\">Dave Barnhart</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/religion\">religion</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/the-problem-with-loving-the-unborn\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"1b81ff2cc934b3cee60b03513775e74491501f3932f82a0d43c4dd62140df31c","category":"default"}