{"title":"My excellent Conversation with Stephen Kotkin","link":"https://feeds.feedblitz.com/~/908946800/0/marginalrevolution~My-excellent-Conversation-with-Stephen-Kotkin.html","date":1733463857000,"content":"<p>It was so much fun we ran over and did about ninety minutes instead of the usual hour.  Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/stephen-kotkin/\" target=\"_blank\">the audio, video, and transcript</a>.  Here is part of the episode summary:</p>\r\n<blockquote><p>Tyler sat down with Stephen to discuss the state of Russian Buddhism today, how shamanism persists in modern Siberia, whether Siberia might ever break away from Russia, what happened to the science city Akademgorodok, why Soviet obsession with cybernetics wasn’t just a mistake, what life was really like in 1980s Magnitogorsk, how modernist urban planning failed there, why Prokofiev returned to the USSR in 1936, what Stalin actually understood about artistic genius, how Stalin’s Georgian background influenced him (or not), what Michel Foucault taught him about power, why he risked his tenure case to study Japanese, how his wife’s work as a curator opened his eyes to Korean folk art, how he’s progressing on the next Stalin volume, and much more.</p></blockquote>\r\n<p>And here is one excerpt:</p>\r\n<blockquote>\r\n<p><strong>COWEN: </strong>What did you learn from <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://plato.stanford.edu/entries/foucault/\" target=\"_blank\">Michel Foucault</a> about power, or indeed anything else?</p>\r\n<p><strong>KOTKIN: </strong>I was very lucky. I went to Berkeley for a PhD program in 1981. I finished in 1988, and then my first job was at Princeton University in 1989. In the middle of it, I went for French history, and I switched into Habsburg history, and then finally, I switched into Russian Soviet history. I started learning the Russian alphabet my third year of the PhD program when I was supposed to take my PhD exams, so it was a radical shift.</p>\r\n<p>Foucault — I met him because he came to Berkeley in the ’80s, just like <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://philosophynest.com/details-6560000-the-philosophy-of-perception---berkeley-to-derrida.html\" target=\"_blank\">Derrida</a> came, just like <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://plato.stanford.edu/entries/habermas/\" target=\"_blank\">Habermas</a> came, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.britannica.com/biography/Claude-Levi-Strauss\" target=\"_blank\">Claude Lévi-Strauss</a>, the anthropologist, came through. It was California. They were Europeans, and there was a wow factor for them. Foucault was also openly gay, and San Francisco’s gay culture was extraordinarily attractive to him. It was, unfortunately, the epoch of the AIDS epidemic.</p>\r\n<p>One time, I was at lunch with him, and he said to me, “Wouldn’t it be amazing if somebody applied my theories to Stalinism?” I’m sitting there, okay, I’m 23 years old. Imagine if you had traveled to Switzerland in the late 19th century, and you went up in those Engadin mountains, and you were at some café in the mountain air, and there’s this guy with a huge forehead and hair up in the air sitting there, and you went and introduced yourself. You said, “Hello, I’m Tyler,” and he said, “Hello, I’m Friedrich Nietzsche.” You would say, “Well, geez, this is interesting. I should have more conversations with you.”</p>\r\n<p>So, that’s the experience I had. I had read Foucault in seminar because it was very fashionable to do so, obviously, especially at Berkeley, especially in a culture that tilts one way politically, and I think you’ll guess which way that might be. But I didn’t understand what he said, so I went up to him as a naïf with this book, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://sociologiac.net/2024/03/20/madness-and-civilization-michel-foucault/\" target=\"_blank\"><em>Madness and Civilization</em></a><em>,</em> which we had been forced to read, and I started asking him questions. “What does this mean? What does this mean? What is this passage? This is indecipherable.”</p>\r\n<p>He patiently explained to the moron that I was what he was trying to say. It sounded much more interesting coming from him verbally, sitting just a few feet away, than it had on the page. I was lucky to become the class coordinator for his course at Berkeley. He gave these <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://foucault.info/parrhesia/\" target=\"_blank\">lectures about the problem of the truth-teller in Ancient Greece</a>.</p>\r\n<p>It was very far removed from . . . I had no classical training. Yes, I had Latin in high school because I went to Catholic school, and it was a required subject. I started as an altar boy with the Latin Mass, which quickly changed because of what happened at Vatican II. But no Greek, so it was completely Greek to me. Forgive me, that wasn’t planned that I was going to say that. It just happened spontaneously.</p>\r\n<p>Anyway, I just kept asking him more questions and invited him to go to things, and so we would have lunches and dinners. I introduced him to this place, Little Joe’s in Little Italy, part of San Francisco, which unfortunately is no longer there. It was quite a landmark back then, and then he would repair after dinner to the bathhouses in San Francisco by himself. I was not part of that. I’m neither openly nor closeted gay, so that was a different part of Foucault that I didn’t partake in, but others did.</p>\r\n<p>Anyway, I would ask him these things, and he would just explain stuff to me. I would say, “What’s happening in Poland?” This is the 1980s, and he would say things to me like, “The idea of civil society is the opiate of the intellectual class.” Everybody was completely enamored of the concept of civil society in the ’80s, especially via the Polish case, and so I would ask him to elucidate more. “What does that mean, and how does that work?”</p>\r\n<p>He told me once that class in France came from disease in Paris — that it wasn’t because of who was a factory worker, who wasn’t a factory worker, but it was your neighborhoods in Paris and who died from cholera and who didn’t die from cholera. A colleague of ours who was another fellow graduate in Berkeley ended up writing a dissertation using that aside, that throwaway line.</p>\r\n<p>I was able to ask him these questions about everything and anything. What he showed me — this is your question — what he showed me was how power works, not in terms of bureaucracy, not in terms of the large mechanisms of governance like a secret police, but how all of that is enforced and acted through daily life. In other words, the micro versions of power. It’s connected to the big structures, but it’s little people doing this. That’s why I said totalitarianism is using your agency to destroy your own agency.</p>\r\n<p>That means denouncing your neighbors, being encouraged to denounce your neighbors for heresies, and participating in that culture of denunciation, which loosens all social trust and social bonds and puts you in a situation of dependency on the state. You’re a gung-ho activist using your agency, and the next thing you know, you have no power whatsoever. So, those are the kinds of things that I could talk to him about.</p>\r\n<p>After he passed away from AIDS in the summer of 1984 — it was the AIDS epidemic, horrific. He passed away, and we had a memorial for him. I was still a PhD student, remember. I didn’t finish until ’88. There was this guy, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://booksandideas.net/Michel-de-Certeau\" target=\"_blank\">Michel de Certeau</a>, who wrote a tribute to Foucault in French that he was going to deliver at the event. It was called “The Laughter of Foucault.” I had these conversations with de Certeau about his analysis of Foucault and the pleasure of analytic work, which had been a hallmark of Foucault.</p>\r\n<p>De Certeau taught me a phrase called “the little tactics of the habitat,” which became one of the core ideas of my dissertation and then book, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://history.princeton.edu/about/publications/magnetic-mountain-stalinism-civilization\" target=\"_blank\"><em>Magnetic Mountain</em></a>, about this micropower stuff. Even though Foucault was gone, I was able to extend the beginning of the conversations with Foucault through de Certeau.</p>\r\n<p>I learned how power works in everyday life, and how the language that you use, and the practices like denunciation that you enact or partake in, help form those totalitarian structures, because the secret police are not there every minute of every day, so what’s in your head? How are you motivated? What type of behavior are you motivated for?</p>\r\n<p>We say, “Okay, what would Stalin do in this situation?” Many people approach their lives — they’ve never met Stalin; they’ll never meet Stalin — but they imagine what Stalin might do. That gets implanted in their way of thinking; it becomes second nature. I learned to discuss and analyze that through Foucault.</p>\r\n<p>I have to say, I didn’t share his analysis that Western society was imprisoning, that the daily life practices of free societies were a form of imprisonment in its own way. I never shared that view, so it wasn’t for me his analysis of the West that I liked. It was the analytical toolkit that I adapted from him to apply to actual totalitarianism in the Soviet case.</p>\r\n</blockquote>\r\n<p>Excellent throughout.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html\">My excellent Conversation with Stephen Kotkin</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/908946800/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/908946800/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/908946800/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/908946800/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/908946800/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/908946800/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comment-160843635\">In reply to Diogenes's Barrel.   Kotkin does share a lot of ...</a> <i>by Wilbur</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comment-160843595\">In reply to David R Henderson.   I interpreted that to mean ...</a> <i>by Moral Panic</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comment-160843575\">In reply to C.   What an interesting point,    “Something ...</a> <i>by Interested</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comment-160843563\">Really enjoyed it, thank you. I really like Kotkin's delivery ...</a> <i>by OutHere</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comment-160843555\">In reply to Diogenes's Barrel.   I didnt assume you were making ...</a> <i>by Ronan</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/my-excellent-conversation-with-stephen-kotkin.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/thanksgiving-lessons-2.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=thanksgiving-lessons-2\">Thanksgiving and the Lessons of Political Economy</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/the-nicholas-fox-weber-biography-of-mondrian.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-nicholas-fox-weber-biography-of-mondrian\">The Nicholas Fox Weber biography of Mondrian</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/assisted-dying-in-the-uk.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=assisted-dying-in-the-uk\">Assisted dying in the UK</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"1b8e435386d06a460e51cda39739f72a3fa30b1c3f9cefda3d0a776650e34513","category":"Sites"}