{"title":"Less Uniform Social Media Experiences","link":"https://kottke.org/24/11/less-uniform-social-media-experiences","date":1731963625000,"content":"\n        <p><a href=\"https://www.technologyreview.com/2024/11/18/1106960/the-rise-of-bluesky-and-the-splintering-of-social/\">In the MIT Technology Review</a>, Mat Honan makes two points about changes in the world of social media with both Bluesky and Threads seeing massive growth in November accelerated by the election and people leaving Twitter. The era of everyone having a uniform social media experience is ending. And that’s good.</p>\n\n<blockquote><p>The first is that tech and politics are just entirely enmeshed at this point. That’s due to the extreme extent to which tech has captured culture and the economy. Everything is a tech story now, including and especially politics. </p>\n\n<p>The second point is about what I see as a more long-term shift away from centralization. What’s more interesting to me than people fleeing a service because they don’t like its politics is the emergence of unique experiences and cultures across all three of these services, as well as other, smaller competitors.</p></blockquote>\n\n<p>I loved Twitter early on when it felt like everyone was building their own communities, and then it stopped feeling like that, and then it got worse and worse. For the most part, it seems like my better friends from Twitter went to Threads, but I can’t really figure out the vibe over there, which is annoying because I’m too old to make new friends. I’m on Bluesky and like it very much. One of the more helpful features is letting individual users create their own Starter Packs, so if you want to, for example <a href=\"https://go.bsky.app/Ho6dCSc\">follow a community of Carly Rae Jepsen fans</a>, you can do that really easily because I made a starter pack for you.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Bluesky\">Bluesky</a> · <a href=\"https://kottke.org/tag/Mat%20Honan\">Mat Honan</a> · <a href=\"https://kottke.org/tag/social%20media\">social media</a> · <a href=\"https://kottke.org/tag/Twitter\">Twitter</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/11/less-uniform-social-media-experiences\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"1bb9f7a3992ff1e682379d3ae13b2ed621a7d2538ea211472c97fcd3e43d9c3e","category":"Sites"}