{"title":"Powerful Pockets of Internet","link":"https://www.usv.com/writing/2024/05/powerful-pockets-of-internet/","date":1715280700000,"content":"<p>I’ve been spending time thinking about how web3 will influence the future of social networks and consumer applications. There are three core areas that are most exciting to me: public social networks, private social networks (eg the real-life communities that exist in messaging applications), and marketplaces. An emergent onchain internet architecture, characterized by protocols, open graphs, and composability, is giving builders another crack at reinventing these categories. I plan to write a series of posts highlighting how these different areas may evolve over time, beginning with public social networks.</p>\n<p>Last year Steve Martocci and I were talking about the future of social networks. We are both obsessed with self-directed healthcare , and we observed that so much of the bottoms-up dialogue that happens in the space occurs in subreddits, and it has reached a tipping point where it deserves its own place on the internet to call home.</p>\n<p>This is a theme that will come to define the future of social networks over the next decade. Over the past 10 years, social networks have become less social and more broadcast. I’ve written about it in WTF is Social Media? The playgrounds we used to call our homes have turned into large horizontal media distribution channels and have lost their sense of intimacy. As a result, relationships – both based on real-life connections and around interests – have been pushed to the edge. They have found their home in group chats within messaging applications and in subreddits.</p>\n<p>The time has come for these networks to inhabit new spaces that can deliver richer functionality, better UX, and a variety of different business models that benefit both application developers and network participants. I have been particularly interested in how subreddits can be siphoned off the mothership and turn into thriving networks of their own. There is no reason why a message board should be the universal form factor for social networks. We have seen instances of this happening from communities on Discord to sites like Patients Like Me .</p>\n<p>Last week I attended Farcon , a sufficiently decentralized conference organized by people, mainly Ted (not lasso) , who are active participants in the Farcaster community. It was small (roughly 500 attendees), but filled to the brim with energy that was reminiscent of SXSW from 2009-2011. Everyone there was eager to experiment with new products, learn from the people using their products, and support the ecosystem. It felt like a very special moment in time and in ten years I think we will look back on that event as a tipping point for web3 social.</p>\n<p>Dan and Varun (Farcaster founders) kicked off the conference and they discussed their strategy for growing the Farcaster protocol to 1m+ DAU. One of the pillars of the strategy that they call “cozy corners” rhymes with the idea of giving flourishing subreddits a place to call their own on the internet. Dan alluded to the notion that subreddits with millions of active users can and should actually be their own freestanding networks and businesses on the internet.</p>\n<p>Farcaster Dan Romero on Warpcast Recap of @v and my talk from FarCon</p>\n<p>The path to 1 million daily active users:</p>\n<p>1. Grow with crypto</p>\n<p>2. Create cozy corners</p>\n<p>3. Make more legos https://imagedelivery.net/BXluQx4ige9GuW0Ia56BHw/06b65c8b-9be6-4367-2191-63748aa78a00/original</p>\n<p>This deeply resonated with me. “Creating cozy corners” is an endearing turn of phrase, but there are powerful pockets of the internet that pack a punch and will emerge as independent social networks of their own. Channels on farcaster may very well be the thing that enables the rapid acceleration of this trend, which we can think of as the unbundling of Reddit.</p>\n<p>Channels are the perfect conduit for this because as they become decentralized and protocolized, channel creators can spin them off into their own client. They can build their own UX around them. They can monetize them through a variety of different mechanisms. Maybe participants will need to pay a one-time fee to be able to post to the network. This could improve the quality of content and dialogue. Perhaps those that can’t afford to pay will have different paths to post, like volunteering to be a moderator. Each network can have its own programmatic reputation system. Maybe it’s interoperable with other channels/networks. Perhaps everyone needs to subscribe to the channel using STP . Each network may have its own native economy and token used for tipping and payments. Maybe network creators can economically participate in minting fees from the channel as a native monetization mechanism. Maybe every channel participant is also an owner and can accumulate more ownership over time based on a transparent set of rules and dividends are distributed regularly. Maybe users can collectively determine that their posts and various contributions to the network can be sold as data to train an open source AI model and they’re each individually and proportionally compensated.</p>\n<p>The canvas is wide open. Composability, openness, tokens, reputation, and native web3 monetization models – both existing ones and ones to be invented – along with a whole host of other onchain primitives will come to define emergent social networks. Web3 is opening the aperture to an entirely new UX and business model paradigm and we are going to enter a new age of many smaller but thriving social networks, each special and unique in different ways yet built atop shared infrastructure and information.</p>\n<p>I believe this decade will be very special and I feel lucky to be here for it.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/05/powerful-pockets-of-internet/\">Powerful Pockets of Internet</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"1bf0f122955e7ee91e560406da746f84747f56f99452ac06a08e621b79271308","category":"default"}