{"title":"The Piggyback Bootstrap","link":"https://www.usv.com/writing/2024/09/the-piggyback-bootstrap/","date":1726595827000,"content":"<p>There’s a saying that first-time founders focus on product and second-time founders focus on distribution. It’s impossible to build a business if you can’t distribute your product, and getting people to buy or use the thing you’re building is make or break.</p>\n<p>Networked products and marketplaces are very difficult to get off the ground. They suffer chicken and egg problems. Social networks aren’t useful unless others are on them, and marketplaces aren’t interesting to sellers unless there are buyers, and vice versa. Usually, getting supply, whether that is content or something to sell, is meaningfully easier than finding demand.</p>\n<p>Almost every modern network has scaled demand and kickstarted its growth flywheel by piggybacking off of someone else’s network. They will start by creating some new form of shareable media (and sometimes it’s a brand new structural format like a tweet), and then find ways to syndicate that content or make it easily shareable across other networks.</p>\n<p>Twitter did this by making tweets easily shareable and embeddable in the Facebook feed. Everyone starting seeing new tweets on Facebook with the twitter logo floating around everywhere. It created demand for the content on this brand new platform. Then tumblr and Instagram followed the same playbook and started to syndicate their user’s content on these networks. Then came TikTok, and they had even more networks to piggyback on. In every one of these instances, the new platform made it extremely easy for users to share their content on networks where they already had a following.</p>\n<p>Marketplaces have used the same strategy. Airbnb famously created listings on Craigslist for all of their home inventory in the early days. Bountycaster is building a headless marketplace that can post listings on Farcaster and other networks. Etsy’s sellers would post listings of their wares everywhere and anywhere on the internet in the early days. In all these instances, there’s an incentive for both the platform and its early users to share broadly.</p>\n<p>Sometimes networks can grow by bootstrapping in the physical world. When we started GroupMe we partnered with music festivals so attendees would use the product at large events like Coachella and Bonnaroo. We would even walk around some music festivals and hand out flyers.</p>\n<p>“do things that don’t scale” like handing out flyers When Foursquare first emerged restaurants and bars would showcase “check-in” stickers on their windows and the A-frames they stood up on city sidewalks to incentivize foot traffic.</p>\n<p>And Facebook famously piggybacked on top of college networks.</p>\n<p>In some ways, it’s safer to piggyback on top of analog networks than it is digital ones. Unless a security guard prevents you from physically being somewhere, it’s a permissionless way to grow. While digital networks offer meaningfully better distribution and faster scale, there is always a gatekeeper that will likely shut you down one day (unless it’s a crypto network or open protocol like Farcaster).</p>\n<p>Facebook famously throttled Twitter, Twitter and Facebook throttled Instagram, and everyone cut off TikTok. Networks don’t like when other networks grow on top of them, especially when they have the same business models of competing for eyeballs or other types of demand (eg housing listings). These networks are becoming more closed and increasingly neurotic about this – Elon Musk deliberately supresses tweets with links in them. This means that the piggyback bootstrap is usually a moment in time arbitrage opportunity of sorts. It should be used as an important early growth tactic to kickstart a flywheel, but not an ongoing dependency. Plan to be cut off entirely, so wisely make the most of your window of opportunity.</p>\n<p>As AI tools facilitate entirely new types of media and as new marketplace models emerge, entrepreneurs should be deliberate about what their piggyback opportunities look like. They’ll likely require a level of unprecedented creativity – you’ll need new ways to hack existing networks. It’s something I’m thinking about, and I encourage anyone building something in consumer to come to the table with some crafty ideas.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/the-piggyback-bootstrap/\">The Piggyback Bootstrap</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"1c1ab187e368e770ede3bef5427ec38ce086232984ef533423a9aa975b37e37f","category":"Sites"}