{"title":"A tiny idea comes to life","link":"https://bradbarrish.com/2024/02/06/a-tiny-idea-comes-to-life/","date":1707266101000,"content":"<p>I went back and forth about whether this was something worth posting on my main blog or on the microblog, but as I started writing on the <a href=\"https://micro.bradbarrish.com\">microblog</a>, it became clear I had a few more things to say. So, here we are.</p>\n\n\n\n<p>In the wake of Twitter, one of the things on which I’ve found myself reflecting is the value of contribution when it comes to social networks. It’s generally accepted that the vast majority of users of any social network are passive consumers. This is commonly referred to as the <a href=\"https://en.wikipedia.org/wiki/1%25_rule\">1% rule</a>. As if one needed <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC10284842/\">research</a> to validate it, passive social network consumption is linked to depression and negative emotions overall, which seems to create a vicious cycle and here we are.  </p>\n\n\n\n<p><a href=\"https://warpcast.com/~/invite-page/16066?id=5b576a51\">Farcaster</a> (invite link) has become my social network of choice, at least for the time being. Because it’s a permissionless, decentralized social network, it’s a magnet for lots of annoying (to me) crypto people. If I hadn’t met some great people before it started really taking off recently, I probably would not have stuck around long, but I’m glad I did. Like any social network, it’s so much easier just to lurk. You have to make a conscious effort to contribute and not just be another reply guy. Farcaster makes this easier than many other networks due to its usage of channels. </p>\n\n\n\n<p>One of my favorite channels is <a href=\"https://warpcast.com/~/channel/vip\">/vip</a>, which is short for Very Internet Person, which I most definitely identify with. Over the weekend, I had an idea, especially given the number of new users, to create an OPML file (thank you, <a href=\"https://en.wikipedia.org/wiki/Dave_Winer\">Dave Winer</a>) that could serve as a recommended list of feeds that anyone can use with a feed reader of their choice.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"780\" height=\"387\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/cast-image.jpg?resize=780%2C387&amp;ssl=1\" /></figure>\n\n\n\n<p>So <a href=\"https://github.com/riotgoools/viprss\">elle created a repo on Github</a> with some great feeds, I forked it, added some more and voila! As if that weren’t cool enough, elle also created <a href=\"https://rss.veryinter.net/sites/all\">a nifty little web reader</a> that pulls from the OPML.</p>\n\n\n\n<p>Contributing to social networks should be little things done over a long period of time. This post took longer to write than it did to set everything up, but it’s fun making things, especially with the intention of introducing people to things that might contribute even further to a community.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"1c6003334388babbc76edb93cb96710f65a7a09aa860b6dc647e020b1849d107","category":"default"}