{"title":"The Great Blind Spot of Science and the Art of Asking the Complex Question the Only Answer to Which Is Life","link":"https://www.themarginalian.org/2024/11/04/sara-imani-walker-life/","date":1730740633000,"content":"<p><a href=\"https://www.amazon.com/Life-No-One-Knows-Emergence/dp/0593191897/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"483\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?fit=320%2C483&amp;ssl=1\" alt=\"The Great Blind Spot of Science and the Art of Asking the Complex Question the Only Answer to Which Is Life\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?w=993&amp;ssl=1 993w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?resize=320%2C483&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?resize=600%2C906&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?resize=240%2C363&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/saraimariwalker_life.jpg?resize=768%2C1160&amp;ssl=1 768w\" /></a></p><p>“Real isn’t how you are made… It’s a thing that happens to you,” says the Skin Horse — a stuffed toy brought to life by a child’s love — in <a href=\"https://www.themarginalian.org/2015/02/23/the-velveteen-rabbit-komako-sakai/\"><em>The Velveteen Rabbit</em></a>. Great children’s books are <a href=\"https://www.themorgan.org/programs/maria-popova-sophie-blackall-children’s-books-philosophy-living\">works of philosophy in disguise</a>; this is a fundamental question: In a reality of matter, what makes life alive? A generation later, the Ukrainian Jewish writer Vasily Grossman <a href=\"https://www.themarginalian.org/2024/07/30/vasily-grossman-life-and-fate/\">answered</a> with a deeply original proposition: that life is best defined as freedom, that freedom is the boundary between inanimate matter and animacy. </p>\n<p>To me, freedom is the boundary condition where matter reaches for meaning — life, after all, is the only component of the universe free to comprehend the rest. And yet all of our technologies of thought have so far failed to discern what life actually is, how it emerged from non-life, and what to look for when we are looking for it in our laboratories and in the great unfolding experiment that is the universe itself. We have sequenced the human genome and discovered the “God particle,” yet genetics and particle physics have found no common language for communicating and harmonizing their respective discoveries to address the complex question the single answer to which is life.</p>\n<figure><a href=\"https://society6.com/product/pillars-of-creation-eagle-nebula-in-infrared-nasaesa-hubble-space-telescope_print?sku=s6-22845835p4a1v1?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=680%2C638&amp;ssl=1\" width=\"680\" height=\"638\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?w=1280&amp;ssl=1 1280w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=320%2C300&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=600%2C563&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=240%2C225&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=768%2C720&amp;ssl=1 768w\" /></a><figcaption>Pillars of Creation, Eagle Nebula, Messier 16. Infrared photograph. NASA / Hubble Space Telescope. (Available as <a href=\"https://society6.com/product/pillars-of-creation-eagle-nebula-in-infrared-nasaesa-hubble-space-telescope_print?sku=s6-22845835p4a1v1?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>A century ago, the philosopher Simone Weil admonished against this fragmentation of the problem of reality into parochial questions addressed by disjointed scientific disciplines — “villages” of thought, she called them — each too blinded by its own axioms to make headway on illuminating the whole. “The villagers seldom leave the village,” she <a href=\"https://www.themarginalian.org/2015/06/24/simone-weil-on-science-necessity-and-the-love-of-god/\">wrote</a>. Watching her mathematician brother — the number theory pioneer André Weil — try to reduce the problem of reality to his own science, watching the founding fathers of quantum mechanics do the same, she lamented: “The state of science at a given moment is nothing else but… the average opinion of the village of scientists [who] affirm what they believe they ought to affirm.” </p>\n<p>An epoch later, the villages have drifted so far apart as to grow foreign to each other. Gravitational waves, radioactivity, and DNA belong to the same reality — the reality that made life possible — and yet cosmology, chemistry, and biology are too mute to each other to make sense of the deeper meaning behind their respective discoveries. We are still left wondering how reality happens unto life and how life becomes reality. </p>\n<figure><a href=\"https://www.themarginalian.org/2015/02/23/the-velveteen-rabbit-komako-sakai/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/02/velveteenrabbit_sakai2.jpg\" /></a><figcaption>Art by Komako Sakai for <a href=\"https://www.themarginalian.org/2015/02/23/the-velveteen-rabbit-komako-sakai/\">a modern Japanese interpretation of <em>The Velveteen Rabbit</em></a></figcaption></figure>\n<p>Astrobiologist Sara Imari Walker takes up these complex and abiding questions in <a href=\"https://www.amazon.com/Life-No-One-Knows-Emergence/dp/0593191897/?tag=braipick-20\" target=\"_blank\"><strong><em>Life as No One Knows It: The Physics of Life’s Emergence</em></strong></a> (<a href=\"https://search.worldcat.org/title/1409397766\" target=\"_blank\"><em>public library</em></a>). </p>\n<p>Trained as a theoretical physicist and disenchanted with her discipline’s insistence that life is a conceptually banal scientific problem subservient to the fundamentals of space, time, energy, and matter, she holds modern physics accountable for providing “a fundamental description of a universe devoid of life” — that is, a description of the universe that negates the very existence of its describers, we who are very much alive. She writes:</p>\n<blockquote><p>We cannot see ourselves clearly because we have not built a theory of physics yet that treats observers as inside the universe they are describing.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=680%2C753&amp;ssl=1\" width=\"680\" height=\"753\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=240%2C266&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=320%2C354&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=768%2C850&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=600%2C664&amp;ssl=1 600w\" /></a><figcaption>Plate from <a href=\"https://www.themarginalian.org/2021/02/16/thomas-wright-original-theory/\"><em>An Original Theory or New Hypothesis of the Universe</em></a> by Thomas Wright, 1750. (Available as <a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>In this quest to understand ourselves and the universe that made us, she argues, the vitalists of the eighteenth century — who believed that a concrete non-physical element, a “vital spark,” grants life its aliveness — were no more misguided than the modern materialists who believe that life — that poetry, that whale song, that love — is just a property of physical matter. Reckoning with a colleague’s startling remark that “life does not exist,” she considers the deeper logic beneath this koan-like formulation of the great scientific blind spot of our time:</p>\n<blockquote><p>What modern science has taught us is that life is not a property of matter… There is no magic transition point where a molecule or collection of molecules is suddenly “living.” Life is the vaporware of chemistry: a property so obvious in our day-to-day experience — that we are living — is nonexistent when you look at our parts. If life is not a property of matter, and material things are what exist, then life does not exist.</p></blockquote>\n<p>(And of course, none of it had to exist at all. Life seems to be the imperative of the unnecessary. Long before modern physics, Darwin marveled at how, on this planet shaped by unfeeling forces and moved by fixed laws, “from so simple a beginning endless forms most beautiful and most wonderful have been and are being evolved.” Here was a biologist trained as a geologist shining a sidewise gleam on a cosmological question — a rare vagabond between the villages of science, from a time before they had become separate continents of thought.)</p>\n<p>At the heart of the book is the rigorous, passionate insistence that we need a softer and more elastic explanatory membrane between the three hard problems of reality: the hard problem of consciousness (rooted in the mystery of <a href=\"https://www.themarginalian.org/2017/05/25/christof-koch-consciousness-qualia/\">qualia</a>, that inarticulable essence of what it feels like to be oneself, the felt interiority of being alive in a particular embodiment and enmindment), the hard problem of matter (the fact that everything observable arises from the interaction of particles and forces), and the hard problem of life (sculpted of <a href=\"https://www.themarginalian.org/2016/09/02/it-from-bit-wheeler/\">information and an observer of information</a>). Sara writes:</p>\n<blockquote><p>Cast in this way, all three hard problems become one more fundamental problem we cannot seem to avoid any more than we can seem to answer it: Why do some things exist (or experience existence) and not others? It is perhaps the most perplexing question of our existence that anything should exist at all. And if something exists, then why not everything?</p></blockquote>\n<p>By contracting the pinhole of our scrutiny to the question of life, she intimates, we might be able to begin extrapolating an answer to this largest of questions — something that calls not only for new principles but for a new theory of physics and a dismantling of disciplinary boundaries. A century after Weil, Sara points to the same paradox standing between the life of science and the science of life in our own time:</p>\n<blockquote><p>We don’t yet have a general understanding of the category of things that we should group together and call “life.” Therefore either our categorization is wrong or life is not something to be categorized.</p>\n<p>[…]</p>\n<p>We cannot always see this clearly because of the arbitrary boundaries we set between the current classification of disciplines we think are needed to solve the problem, which are based on paradigms not suited for solving what life is.</p></blockquote>\n<figure><a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=680%2C920&amp;ssl=1\" width=\"680\" height=\"920\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?w=733&amp;ssl=1 733w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=240%2C325&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=320%2C433&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=600%2C812&amp;ssl=1 600w\" /></a><figcaption>Anatomy of a bird by French artist <a href=\"https://www.themarginalian.org/2019/11/29/paul-sougy/\">Paul Sougy</a>. (Available <a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\">as a print</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>Observing that “the boundary between the phenomena we want to think of as life and not life is fuzzy at best and may not exist at all,” she considers the present state of our disciplinary parochialism: </p>\n<blockquote><p>Biologists approach the problem by defining life in terms of observed features of life on Earth, which is not especially useful when you’re looking for life’s origins or for life elsewhere in the universe. Astrobiologists need guiding principles to inform how they conduct their search, but they, too, end up being overly anthropocentric in their reasoning: their search is most often directed at signs of life that would indicate biology exactly as we observe it here on Earth. Chemists either think life does not exist or that it is all chemistry (probably these are equivalent views). Computer scientists tend to focus too much on the software — the information processing and replicative abilities of life — and not enough on the hardware, i.e., the fact that life is a physical system that emerges from chemistry, and that the properties of chemistry literally matter. Physicists tend to focus too much on the physical — life is about thermodynamics and flows of energy and matter — and miss the informational and evolutionary aspects that seem to be the most distinctive features of the things we want to call life. Philosophers focus too much on the need for a definition or the flaws of providing one, and not enough on how we can move as a community beyond the definitional phase into a new paradigm.<br />\nNature does not share these boundaries between disciplines. They are artifacts of our human conception of nature, our need to classify things, and historical contingencies in how our understanding of the reality around us has evolved over the last few centuries. That is, they are the product of paradigms established in the past. We are in part pre-paradigmatic in understanding life as a general phenomenon in the universe because there is no defined discipline that can fully accommodate the intellectual discussion that needs to be had about what life is.</p></blockquote>\n<figure><a href=\"https://society6.com/product/let-god-be-the-lights-in-the-firmament-of-heaven-and-divide-the-day-by-francisco-de-holanda-1573_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?resize=680%2C994&amp;ssl=1\" width=\"680\" height=\"994\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?w=900&amp;ssl=1 900w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?resize=320%2C468&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?resize=600%2C877&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?resize=240%2C351&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda.jpg?resize=768%2C1123&amp;ssl=1 768w\" /></a><figcaption>1573 painting by the Portuguese artist Francisco de Holanda, a student of Michelangelo’s. (Available as <a href=\"https://society6.com/product/let-god-be-the-lights-in-the-firmament-of-heaven-and-divide-the-day-by-francisco-de-holanda-1573_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/let-god-be-the-lights-in-the-firmament-of-heaven-and-divide-the-day-by-francisco-de-holanda-1573_cards/?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>The solution to the unsolved problem of life, she argues, may not be one of new evidence but one of new explanation, just as we watched the planets move for eons before we discerned the laws of their motion to concede a heliocentric universe. Without a clear explanatory model for life here on Earth, she argues, we might never be able to detect life on other worlds — the central task of her own science. With an eye to <a href=\"https://www.themarginalian.org/2024/05/24/the-light-eaters/\">how the new science of plant intelligence deepens the mystery of what a mind is</a>, Sara considers what kindred blind spots may be afflicting astrobiology:</p>\n<blockquote><p>Plants are just one example that makes clear how the boundary of our imagination does not even intersect with what it is to be among the other multicellular life that surrounds us on this planet. </p>\n<p>If we cannot even shift our reference frame enough to understand what it is like to be other inhabitants of our own planet, how could we possibly imagine the truly alien? “Truly alien” here should be understood as other life that does not share any ancestry with our own: that is, that has an entirely unique history with an independent origin. There are no aliens on Earth because as far as we know, all the life we have encountered shares a common history. Even artificial intelligences — sometimes described as alien, are not alien; they are trained on human data, which is itself the product of nearly four billion years of evolution on Earth. AI is as much a part of life on Earth as any of the biological organisms that have evolved here.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/11/02/art-of-crying-pepita-sandwich/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/artofcrying11.jpg\" /></a><figcaption>Art by Pepita Sandwich from <a href=\"https://www.themarginalian.org/2024/11/02/art-of-crying-pepita-sandwich/\"><em>The Art of Crying</em></a></figcaption></figure>\n<p>A century and a half after the Victorian visionary Samuel Butler presaged the emergence of a new <a href=\"https://www.themarginalian.org/2022/09/15/samuel-butler-darwin-among-the-machines-erewhon/\">“mechanical kingdom”</a> extending the kingdoms of biological life into our machines, Sara argues that our mechanical and algorithmic creations may not only alter the definition of life but help illuminate its origins:</p>\n<blockquote><p>The emergence of a technosphere may be precisely what is required for a biosphere to solve its own origins and therefore to discover others like it. To make this transition and make first contact, it may be critical to where we sit now in time that we recognize how thinking technologies are the next major transition in the planetary evolution of life on Earth. It is what we might expect as societies scale up and become more complex, just as life simpler than us has done in the past. The functional capabilities of a society have their deepest roots in ancient life, a lineage of information that propagates through physical materials. Just as a cell might evolve along a specific lineage into a multicellular structure (something that’s not inevitable but has happened independently on Earth at least twenty-five times), the emergence of artificial intelligences and planetary-scale data and computation can be seen as an evolutionary progression — a biosphere becoming a technosphere.</p></blockquote>\n<p>“Wherever life can grow, it will. It will sprout out, and do the best it can,” Gwendolyn Brooks wrote in <a href=\"https://www.themarginalian.org/2017/04/19/gwendolyn-brooks-advice-winnie/\">one of her finest, least known poems</a>. A proper understanding of life, Sara argues, must account for that fact — for the tenacity with which life not only continues to exist despite the infinitely greater odds of nonexistence (which anchored Richard Dawkins’s wonderful counterintuitive insistence on <a href=\"https://www.themarginalian.org/2021/07/25/richard-dawkins-death/\">the luckiness of death</a>) but continues to exist in its particularity despite the infinitely many other possible configurations. She writes:</p>\n<blockquote><p>If we are ever to understand what life really is, we need to recognize that among the unimaginably large number of things that could exist, or even the smaller subset of ones that we can imagine, only an infinitesimal fraction ever will. Things come into existence when and where it is possible to — and what we call life is the mechanism for making specific things possible when the possibility space is too large for the universe to ever explore all of it.</p></blockquote>\n<p>Out of this arises a crucial distinction between life and being alive (highlighted in the biological fact that <a href=\"https://www.themarginalian.org/2020/10/21/turing-natural-wonders/\">most of you is dead</a>). Nearly a century after cybernetics pioneer Norbert Wiener made the then-radical assertion that <a href=\"https://www.themarginalian.org/2018/06/15/the-human-use-of-human-beings-norbert-wiener/\">“we are not stuff that abides, but patterns that perpetuate themselves,”</a> Sara adds:</p>\n<blockquote><p>DNA cannot exist unless there is a physical system (e.g., a cell) with memory of the steps to assemble it. All objects that require information to specify their existence constitute “life.” Life is the high-dimensional combinatorial space of what is possible for our universe to build that can be selected to exist as finite, distinguishable physical objects. Being “alive,” by contrast, is the trajectories traced through that possibility space. The objects that life is made of and that it constructs exist along causal chains extended in time; these lineages of information propagating through matter are what it is to be “alive.” Lineages can assemble individual objects, like a computer, a cup, a cellular membrane, or you in this very instant, but it is the temporally extended structure that is alive. Even over your lifetime you are alive because you are constantly reconstructing yourself — what persists is the informational pattern over time, not the matter.</p>\n<p>[…]</p>\n<p>The fundamental unit of life is not the cell, nor the individual, but the lineage of information propagating across space and time. The branching pattern at the tips of this structure is what is alive now, and it is what is constructing the future on this planet.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/03/01/alan-turing-morphogenesis-diagrams/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/turing_morphogenesis.jpg\" /></a><figcaption>One of computing pioneer Alan Turing’s <a href=\"https://www.themarginalian.org/2016/03/01/alan-turing-morphogenesis-diagrams/\">little-known diagrams of morphogenesis</a></figcaption></figure>\n<p>In the remainder of <a href=\"https://www.amazon.com/Life-No-One-Knows-Emergence/dp/0593191897/?tag=braipick-20\" target=\"_blank\"><strong><em>Life as No One Knows It</em></strong></a>, Sara goes on to explore assembly theory — a new framework for understanding the complexity of living organisms by discerning the minimal number of steps required to assemble them from the most fundamental building blocks — as a possible solution to the abiding problem of what we are. Complement it with pioneering biologist Ernest Everett Just — one of the first scientists to consider this question holistically — on <a href=\"https://www.themarginalian.org/2023/12/25/ernest-everett-just-life-time/\">what makes life alive</a>, then revisit Meghan O’Gieblyn on <a href=\"https://www.themarginalian.org/2023/03/02/god-human-animal-machine/\">our search for meaning in the age of AI</a> and Alan Turing’s favorite boyhood book about <a href=\"https://www.themarginalian.org/2020/10/21/turing-natural-wonders/\">the strange science of how alive you really are</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"1d33fc87e53c9513b52bb791daa6becde344406544ac97769c4de00b6204d4ec","category":"Sites"}