{"title":"Inside the Trump Plan for 2025","link":"https://kottke.org/24/07/inside-the-trump-plan-for-2025","date":1721315421000,"content":"\n        <p>In a well-researched piece for the New Yorker, <a href=\"https://www.newyorker.com/magazine/2024/07/22/inside-the-trump-plan-for-2025\">Jonathan Blitzer writes about the “network of well-funded far-right activists” who are making plans for Trump’s second term</a>. It’s more than just Project 2025 and the Heritage Foundation — and as his first term showed, it’s not necessarily about what Trump himself wants, it’s that the chaos that surrounds him creates opportunities for these ultra-conservatives to wreck havoc on the freedoms enjoyed by Americans.</p>\n\n<p>I can’t which of the plans in these three excerpts is most terrifying:</p>\n\n<blockquote><p>Stephen Miller, at America First Legal, has been devising plans to enact a nationwide crackdown on immigration, just as he had hoped to carry out on a vast scale in the first Trump term. The impediment then was operational: a lack of personnel to make arrests, a shortage of space to detain people, resistance from Democratic officials at the state and local levels. Miller has since vowed to increase deportations by a factor of ten, to a million people a year, according to the Times. The President would have to deputize federal troops to carry out the job, because there wouldn’t be enough agents at the Department of Homeland Security to do it. The government would need to build large internment camps, and, in the event that Congress refused to appropriate the money required, the President would have to divert funds from the military.</p></blockquote>\n\n<blockquote><p>The person close to C.P.I. considered himself a denizen of the far-right wing of the Republican Party, yet some of the ideas under discussion among those working on Project 2025 genuinely scared him. One of them was what he described to me as “all this talk, still, about bombing Mexico and taking military action in Mexico.” This had apparently come up before, during the first Trump term, in conversations about curbing the country’s drug cartels. The President had been mollified but never dissuaded. According to Mike Pompeo, his former Secretary of State, Trump once asked, “How would we do if we went to war with Mexico?”</p></blockquote>\n\n<blockquote><p>Those close to Trump are also anticipating large protests if he wins in November. His first term was essentially bookended by demonstrations, from the Women’s March and rallies against the Muslim ban to the mass movement that took to the streets after the murder of George Floyd, in the summer of 2020. Jeffrey Clark and others have been working on plans to impose a version of the Insurrection Act that would allow the President to dispatch troops to serve as a national police force. Invoking the act would allow Trump to arrest protesters, the person told me. Trump came close to doing this in the final months of his term, in response to the Black Lives Matter protests, but he was blocked by his Secretary of Defense and the chairman of the Joint Chiefs of Staff.</p></blockquote>\n\n<p>You don’t even need to be a scholar of authoritarianism to recognize where this is going — it’s not like they are <a href=\"https://bsky.app/profile/gravelinfluencer.bsky.social/post/3kxkmi5smbv26\">being secretive about it</a>.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mass-deport.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/mass-deport.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mass-deport.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"730\" alt=\"a sea of white people, mostly women, holding signs at the 2024 RNC that say 'mass deportations now!'\" /></p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Jonathan%20Blitzer\">Jonathan Blitzer</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Project%202025\">Project 2025</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"1d34fb36e94a94398d4bee7a9c61f4a1b15cae51e7a8b2127287111000b9f2d0","category":"default"}