{"title":"Experiments in music and life","link":"https://sive.rs/eml","date":1573084800000,"content":"<p>\nOne approach to music is to do whatever you want.\nAbsolutely anything goes.\nBut to me, that’s too free.\nIt’s anti-inspiring because having infinite options is overwhelming.\n</p><p>\nAnother approach to music is to follow tradition.\nYou stay within the guidelines of a genre or style.\nBut to me, that’s too strict and sad.\nIt was someone else’s innovation.\nTo imitate it now with rules and recipes is just nostalgia.\nIt’s uninspired and dishonest.\n</p><p>\nSo my favorite approach to music is in-between.\n<strong>\nYou make up your own rules, and apply them to a piece of music.\n</strong>\nYou know what this is called?\nAn experiment!\n</p><ul><li>\nExperiment with limitations.\nWrite a piece using only two instruments and five notes.\nWrite a lyric using only nouns and no verbs.\n</li><li>\nExperiment with textures.\nRecord an arrangement using only children’s toys or samples of birds.\n</li><li>\nExperiment with density.\nWrite a piece featuring fifty instruments.\nThen do a solo piece using only your left hand.\n</li></ul><p>\nI loved learning and applying specific techniques.\nLike I’d learn a certain way of developing a melody, then go write melodies using that method.\nI’d learn about re-harmonizing — where you keep the same melody but change the chords underneath, completely changing the mood — then I’d go apply that to all of my songs.\nTechniques to build tension.\nTechniques to change time.\n</p><p>\n<strong>\nWith each new thing I learn, I have to try it, and make something.\n</strong>\nIt might not even sound good, but that’s OK.\nThe goal was just to see what happens, so there’s no way to fail.\nIt’s all just fertilizer for future creations.\n</p>\n…\n<p>\nI’m not an active musician anymore, but now I find that <strong>the way I approached music is the way I approach life.</strong>\n</p><p>\nAfter I sold my company and life was a blank slate, I found that having too much freedom was overwhelming.\n</p><p>\nBut I’m not going to buy into an -ism and follow a set of ancient rules.\n</p><p>\nSo instead I do experiments.\n<strong>\nI make up rules, and apply them to my life for a while.\n</strong>\nLike…\n</p><ul><li>\nExperiment with limitations, fear, detachment, or my definition of home.\n</li><li>\nExperiment with fame, boundaries, expanding, quitting, or my self-image.\n</li><li>\nExperiment with vulnerability, commitment, saying yes, or saying no.\n</li></ul><p>\nI usually try the opposite of whatever I did before.\n</p><p>\nI still love learning and applying specific techniques.\nTechniques for conversation.\nTechniques to stretch time.\nI’m glad I know how to re-harmonize because there are melodies in my past I can’t change, but I can change the thoughts underneath.\n</p><p>\n<strong>\nWith each new thing I learn, I have to try it.\n</strong>\nIt might not even feel good, but that’s what experimenting is about.\nThe goal is still to see what happens, so there’s no way to fail.\n</p>\n<img src=\"/images/dandelion.jpg\" alt=\"dandelion\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"1db7492c1e7b415a4077abda9b5e1f481514229cc15f389aba68fede44ef03ba","category":"default"}