{"title":"Travel (Tech) Notes, Delhi Edition","link":"https://om.co/2024/02/15/travel-tech-notes-delhi-edition/","date":1708037152000,"content":"<p>I have been away visiting my parents in Delhi, India. I went not only to check in on their health, but also to get a chance to celebrate their sixty years together, along with my siblings. It was a short, packed trip. I got to spend time not only with my parents and my siblings, but also with cousins, nephews and nieces. Even my non-familial interactions were limited to a few coffees with some old friends. I didn’t do much, even in terms of photography, though I did make copious notes in my travel journal.</p>\n\n\n\n<p>Every time I visit India, and Delhi (my original home), I find the place different. Maybe because I live in a relatively calm small city like San Francisco, a metropolis like Delhi feels like a throbbing vein of a tense fighter — bigger, busier, more chaotic, heaving with even more humanity. Honking is the real first language of the country. I wonder if during winter locals play the game of Smog, Fog or Both. And yet everything is the same, even if it is not. And so it shall be.</p>\n\n\n\n<p>On the flight back, I was flipping through the journal. I noticed that I had jotted down some “technology” focused observations. They are worth sharing with you, the readers.</p>\n\n\n\n<span></span>\n\n\n\n<h3>“REELS” NATION</h3>\n\n\n\n<p>India banned TikTok. And that has turned out to be a boon for Instagram’s Reels. Reels are short 90-second or less videos that were introduced by Instagram-parent Meta to fight off the TikTok tsunami. Indians, accounting for the largest number of users of Meta’s visual social platform, make up (327 million) as a percentage. It<a href=\"https://www.demandsage.com/instagram-reel-statistics/\" target=\"_blank\"> isn’t a surprise</a> that India has the biggest user base for the Instagram reels feature — and more than a third of them are below the age of 34.<br /><br />I could see this play out on every street corner. Whether it was in the malls of South Delhi, outside movie theaters or on the boulevards of the aging Connaught Place, you could see young people making “content.” A young lady, a couple of young gentlemen using their smartphones — mostly Android — as cameras, and quickly editing it all to be uploaded to Instagram — or YouTube Shorts! It shouldn’t come as any surprise — this is a country that thrives on Bollywood, so everyone knows how to emote, imitate, shimmy and shake.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://economictimes.indiatimes.com/tech/technology/shorts-vs-reels-the-battle-for-dominance-in-digital-content-landscape/articleshow/107191605.cms?from=mdr\">A report</a> in The Economic Times pointed out that YouTube has 518 million monthly active users (MAUs) in India compared with Instagram’s 244 million, according to Comscore in September 2023. That said, any kid I talked to, who was shooting videos, said they are all into Reels!</p>\n\n\n\n<hr />\n\n\n\n<figure><img loading=\"lazy\" width=\"768\" height=\"1024\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-768x1024.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-768x1024.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-225x300.jpg 225w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-1152x1536.jpg 1152w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-1536x2048.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-144x192.jpg 144w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-1100x1467.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-420x560.jpg 420w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-1800x2400.jpg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/IMG_0549-scaled.jpg 1920w\" /></figure>\n\n\n\n<h3>THAT’S SOME CHEAP FIBER (BROADBAND)</h3>\n\n\n\n<p>More than a decade ago, after pulling some strings, I managed to get broadband connection at my parent’s place — it wasn’t the fastest, but it was enough for me to do “Internet” things and remain connected to the office back in San Francisco. That feels so long ago — because this time around, things are different. Things are so competitive — my parents neighborhood there are five broadband providers including state-owned telco, AirTel, and Jio.</p>\n\n\n\n<p>No surprise my parents pay $10 for a 500 Mbps connection, as long as they buy their “cable bundle” and phone service from the same provider. For about $35-a-month gets you a 1Gbps fiber connection. Wow, that is half of what I pay to Google Fiber in San Francisco for the same speed. It is clear we are paying way too much for broadband in the US.</p>\n\n\n\n<p>Given cheap fiber broadband, and even cheaper mobile broadband, it not a surprise that Indians are starting to dominate the usage numbers on popular Internet services such as YouTube, Instagram, Meta and even Twitter.</p>\n\n\n\n<hr />\n\n\n\n<h3>PM MODI THE INFLUENCER-IN-CHIEF</h3>\n\n\n\n<p>No one understands the power of connectivity like India’s influencer-in-chief — Prime Minister Narendra Modi. The man is everywhere on the network. He (and his political party) totally knows how to use the digital medium to shape public. A <a target=\"_blank\" href=\"https://restofworld.org/2024/narendra-modi-youtube-influencer/\">recent article described</a> him as “the country’s most influential social media influencer.”</p>\n\n\n\n<p>The rise of digital technology and the explosion of data consumption in India have created a new kind of voter dynamic. 73-year-old Modi understands the power of these numbers. Modi has reshaped the political messaging landscape and changed the rules of the game in Indian elections. He makes every politician, Indian or otherwise, look like a rank amateur.</p>\n\n\n\n<p>It has been a very deliberate and well-thought strategy. Back in 2016, I was having dinner with a friend when a young man queried me about social engagement and other topics. I learned at dinner that he worked with Modi’s party on social media issues. It was clear that they were playing a whole different game.</p>\n\n\n\n<p>Modi’s influencer-in-chief is also omni-channel, digital as he might be. He was everywhere in the city of Delhi: posters, billboards and even on the backs of every growing army of EV rickshaws.</p>\n\n\n\n<hr />\n\n\n\n<h3>DIGITAL PAYMENT NATION</h3>\n\n\n\n<p>For me, India has always been the cash-first economy. I really needed to go to the CitiBank’s international branch to withdraw cash. Not anymore. On this trip, the only time I really used cash was to offer gratuity at coffee shops or to the hotel staff. Otherwise, it was tap-and-go. I really appreciated Apple Pay, though I couldn’t use Amex and had to switch to the Mastercard.</p>\n\n\n\n<p>I am amazed by the pervasiveness of Paytm, especially with the small businesses. And that is why I find their current troubles astounding — and perhaps this leads to them becoming part of a more traditional player.</p>\n\n\n\n<p><em>Related Reading</em>: <a target=\"_blank\" href=\"https://frontline.thehindu.com/economy/india-fintech-vijay-shekhar-sharma-paytm-crisis-highlights-regulatory-issues-industry-challenges/article67845110.ece\">What broke Paytm?</a></p>\n\n\n\n<hr />\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-1024x768.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-1024x768.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-300x225.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-768x576.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-1536x1152.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-2048x1536.jpg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-2000x1500.jpg 2000w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-192x144.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-1100x825.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-560x420.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/02/P0000105-1800x1350.jpg 1800w\" /></figure>\n\n\n\n<ul>\n<li>Self-driving cars are a non-starter in India. The traffic is such a mess that a Waymo wouldn’t even be able to move — its sensors would be blocked all the time. And if that wasn’t enough, they will (proverbial) blow the fuse due to overuse. This has been the only constant, despite new roads, flyovers, more lanes, and even toll-chargers.</li>\n\n\n\n<li>In ten years, I won’t be surprised if EV’s become major part of the transportation infrastructure in major Indian cities, especially highly-polluted places like Delhi.</li>\n\n\n\n<li>If you end up in India, you are better off buying a local data SIM or using one of the eSIM services like Ubigi or GigSky. 10GB for $25 is good. You don’t need to use local phone service — just use WhatsApp to call anywhere and anyone. Between iMessage and WhatsApp — I never touched the telco network.</li>\n\n\n\n<li>If you want good coffee, check out Blue Tokai. It is a chain modeled after Blue Bottle of San Francisco. They make a better pour over than their inspiration. The milky drinks like cappuccino and latte are exceptional.</li>\n\n\n\n<li>Singh is King. Burger King, that is!</li>\n</ul>\n\n\n\n<p><em>February 15, 2024, San Francisco</em></p>\n\n\n\n<p><em>All that said, I am delighted to be re-united with my Vision Pro! </em></p>\n\n\n\n<p><em> </em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"1fb7f780176bc6816ff02b01cfd3914a417435d421eb3d34cc11a81763153d94","category":"default"}