{"title":"Mediaeater Digest Vol.30, No.181","link":"https://ghuneim.com/2024/06/29/mediaeater-digest-vol-30-no-181/","date":1719662127000,"content":"<p><a href=\"https://www.ft.com/content/c63dae2b-b0d5-4b27-a718-2cce165097b9\"><span>The AI we could have had</span></a><span> (ft) But the rebels at the lab thought this kind of automation was the antithesis of true responsiveness. They saw human relations, art and identity as open-ended, always-evolving ecologies that could not be reduced to the thermostat’s simplistic model of optimisation. Can one really pinpoint the “right” cinema, music or loved one in the same way as the right temperature of a room? Today’s TV, music and dating apps seem to think so. The Boston contrarians did not.</span></p>\n<p><a href=\"https://www.goldmansachs.com/intelligence/pages/gs-research/gen-ai-too-much-spend-too-little-benefit/report.pdf\"><span>Gen AI: too much spend, too little benefit?</span></a><span> (goldmansachs) “Given the focus and architecture of generative AI technology today… truly transformative changes won’t happen quickly and few—if any—will likely occur within the next 10 years.”</span></p>\n<p><a href=\"https://www.nytimes.com/2024/06/28/arts/ai-voice-scarlett-johansson.html\"><span>The Voices of A.I. Are Telling Us a Lot</span></a><span> (nyt) Even as the technology advances, stubborn stereotypes about women are re-encoded again and again – When Sky disappeared, ChatGPT users took to the company’s forums to complain. Some bristled at their chatbots defaulting to Juniper, who sounded to them like a “librarian” or a “Kindergarten teacher” — a feminine voice that conformed to the wrong gender stereotypes. They wanted to dial up a new woman with a different personality.</span><i><span> As one user put it: “We need another female.”</span></i><span> </span></p>\n<p><a href=\"https://dachunkai.github.io/evtexture.github.io/\"><span>EvTexture: Event-driven Texture Enhancement for Video Super-Resolution</span></a><span> (github)This allows for gradual refinement of texture regions across multiple iterations, leading to more accurate and rich high-resolut ion details</span></p>\n<p><a href=\"https://stackdiary.com/microsoft-ai-ceo-says-web-content-is-freeware/\"><span>Mustafa Suleyman’s statements about copyright and AI</span></a><span>  (stackdiary) He noted that content on the open web has traditionally been considered fair use, allowing anyone to copy, recreate, or reproduce it unless explicitly restricted. </span></p>\n<p><a href=\"https://www.wired.com/story/quora-chatbot-poe-download-paywalled-articles/\"><span>Quora-owned AI chatbot platform Poe</span></a> (wired)<span> is providing users with downloadable HTML files of paywalled articles from outlets including NYT, Forbes, and The Atlantic    </span></p>\n<p><a href=\"https://www.theverge.com/2024/6/27/24187405/perplexity-ai-twitter-lie-plagiarism\"><span>Perplexity’s grand theft AI</span></a><span> But Perplexity has taken it a step further with its Pages product, which creates a summary “report” based on those primary sources. It’s not just quoting a sentence or two to directly answer a user’s question — it’s creating an entire aggregated article, and it’s accurate in the sense that it is actively plagiarizing the sources it uses.</span></p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"1fd570db44b8637a0db71b34300c4cab80200905a1eeefa0fc6b582f07ba228a","category":"default"}