{"title":"Doing Less","link":"https://www.usv.com/writing/2024/10/doing-less/","date":1728224969000,"content":"<p>It’s such a cliche to say that “less is more” but it’s so often the case.</p>\n<p>We often advise companies we’re talking to to raise less money than they otherwise might. Raising less now typically means less dilution. It can also mean more focus. Often times, raising too much means spending too much, or growing the team faster than makes sense, ultimately slowing things down.</p>\n<p>Often times doing less means accomplishing more. What I mean by this is: doing something “perfectly” or “bigly” or whatever, often adds pressure, which can often lead to accomplishing less. This is the “perfect as the enemy of good” version of more. I most often see this expressed in forms like, we are encouraging our analysts at USV to write blog posts or develop internal decks/memos more quickly with less pressure, to get them out in the world and get feedback. My partner Jared encapsulates this week in Shitty First Drafts . This is also the theory behind Minimum Viable Products (MVPs). Often times, waiting to do more results in accomplishing less (and feeling worse along the way).</p>\n<p>More stuff also means more responsibility. More pressure, more weight, more cost, etc etc. I’m definitely not a Marie Kondo minimalist, but I do understand this point of view. While I love stuff, I also like to pack light.</p>\n<p>Doing less has the important result of keeping things moving. Doing less more often is better than doing more less often, because it generates momentum. For example, for the past week, I’ve been picking up acorns in my back yard, in 3 minute bursts when I have a moment. I’ve collected hundreds of acorns, and it has felt like basically no work.</p>\n<p>I’m writing this now mostly as a reminder to myself about how much I value this overall approach.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/doing-less/\">Doing Less</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"20022bbf3964e844687a1e09c87db5a7fbeb8da2853b8d770f9220fdf12ed5c9","category":"Sites"}