{"title":"The degrees of slowness","link":"https://chias.blog/2023/the-degrees-of-slowness/","date":1673234535000,"content":"<span><span>Reading Time: </span> <span>16</span> <span>minutes</span></span>\n<p>( Or how my heart has been feeling incapacitatingly full &amp; bursting even when I am still, or how the pleasures of slowness are pleasures for a reason, or how self-actualization in a vacuum is a sordid proposal, or how everywhere I go I keep finding myself and I can’t stop walking because I’d like to keep meeting them, or how when you tell me to go slow I still have to keep running )</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p></p>\n\n\n\n<p>I often think about who I am. More embarrassingly and more precisely, I’ve been thinking about what people know of it. The generous interpretation of this is that I’m trying to live life more legibly—endeared by treating it as a prompt, an invitation. We are all just pieces of each other. What belies me are the source of the conditions that indulge me in this taking, conscious or not. When I think about who I am, I wonder what is the self that I work towards. Who am I but my relations to others? All this life is about other people.</p>\n\n\n\n<p>When I invoke legibility, I attempt to separate this from simplification. I divorce legibility from the act of reduction and palatability—there is still all of me, symbolic and lived, just poured out so that anyone can know it if they choose. I think this permeates most of my philosophy around being and finding: I like personal, intimate blogs more than newsletters because of the act of intentionality needed to continue returning, and how I’ve dwelled here for six years without feeling the need to look for metrics so much that I’m surprised when people comment or worse (in the most loving way possible), people mention what I write in real life. Maybe the simple comparison would be a handwritten piece of complex text, where the contents themselves are largely unaltered, simply written so that I author stories that others can read if they choose. I find that this makes it so that I can actually read myself, too.</p>\n\n\n\n<p>I have been pacing around my apartment and haven’t been sleeping. I wake up after thirty minutes or an hour if I’m lucky, my heart pounding infinitely. When I run this feeling escalates, but the sweat provides reason for it. I walk to the beach and I feel like I am walking to the end of my life. Since I was in college I’d be being, sometimes just reading, and then I’d collapse. This happened again a few times this week. I probably need to stop myself. But when I am still, I am still running.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://chias.blog/wp-content/uploads/image-184-1024x768.png\" srcset=\"https://chias.blog/wp-content/uploads/image-184-1024x768.png 1024w, https://chias.blog/wp-content/uploads/image-184-300x225.png 300w, https://chias.blog/wp-content/uploads/image-184-768x576.png 768w, https://chias.blog/wp-content/uploads/image-184-620x465.png 620w, https://chias.blog/wp-content/uploads/image-184.png 1280w\" /><figcaption><a href=\"http://chia.pics/flowers.html\">selections from chia.pics/flowers.html</a></figcaption></figure>\n\n\n\n<p>I appreciate the heart of the sentiment of slowness and stillness, but hurt at how even that is often a privilege.</p>\n\n\n\n<p>I suppose this all boils down to what we ourselves define as treading, and to what environments we are walking on, and how everyone’s slowness looks different.</p>\n\n\n\n<p>When I think about myself I think about the pace in which I live my life. When I am, I am running.<br />When I become myself, I often take time to withdraw and more clearly — without the expectation of others — I work to find what exactly of me I have become. Seeing, like <a href=\"https://chias.blog/2022/naming-ambient-art/\">hearing</a>, like the feeling of interdependency and interconnectedness, is a more involved act than many think. A simple exercise I do is to clearly recall and name what I saw immediately after waking up, which is often not the ceiling. When we look, there is an entire environment and the periphery, and then the conscious choice of noticing. The noticing is the most potent part of this action—what makes us human, what gives us agency, what allows us to perceive so that we can intuit. Familiar, grounded seeing is an attentiveness to an entire picture, to its details, and then the naming of its history. Seeing is a challenge, initially bounded by what we know, and oftentimes what we deem as worth knowing.</p>\n\n\n\n<p>I wake up, name what I see, and remember that I am part of the world, that my world intersects with many others. <a href=\"https://monoskop.org/images/9/9e/Berger_John_Ways_of_Seeing.pdf\">“Soon after we can see, we are aware that we can also be seen.”</a></p>\n\n\n\n<p>“Actual ‘self-invention’ — if we are measuring it in range of expressivity — appears more like self-dissolution,” Rob Horning <a href=\"https://thenewinquiry.com/blog/social-media-is-not-self-expression/\">writes</a>. When I become myself every moment, when I contend that every moment known or not does “permanently alter my brain chemistry”, actually, I become more interested in the act of naming. Or realizing. Or knowing. These are all the same things. What I get most from others are behaviors and patterns and the vocabulary, irreplaceable toolkits to mend and piece this life for what it is. I appreciate that the ‘arbitrary’ constellations we recognize <a href=\"https://en.wikipedia.org/wiki/IAU_designated_constellations\">have been continued on from the earliest recorded histories.</a> I live with a name that I did not give myself, somehow still having made it my own. I choose the words. I am the author of this life. “We’re born into social life and shaped by it; self-discovery may thus entail a destruction of social bonds, not a sounding of them.”</p>\n\n\n\n<p>This is why I am restless when I am most confused, and found that the answer to self-identity was to continue constructing it until it could come to me — whatever activity I trusted this construction to be occurring in — and whatever that construction was my complete decision, and an unquestionable part of my self-making. Sometimes I was just waiting until I deemed the self worthy of naming, where my form of patience was allowing this temporary ambiguity. Naming is never a finalizing act, of course, it is simply a vessel to evolve and become. Even a named object remembers the time it was nameless. I grow attached to naming things that are fleeting, names that are not unique, continuing their lineages. Sometimes other people give me the words for myself, tells me about the history I am part of that I did not know I was partaking in. This is when I feel most connected. This lets it be so that everybody shapes me but nobody tells me what I am until I declare it so.</p>\n\n\n\n<p>Imagine if it were not already the sense that lets you take in my words. If the limits of what we can see are often constrained by our imaginaries and experiences, then it becomes that ‘seeing’ is one of the most important methods to living. We define nearly all of our waking moments by when we begin actively sensing, and more dramatically when that sensibility is absent.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://chias.blog/wp-content/uploads/image-185-1024x768.png\" srcset=\"https://chias.blog/wp-content/uploads/image-185-1024x768.png 1024w, https://chias.blog/wp-content/uploads/image-185-300x225.png 300w, https://chias.blog/wp-content/uploads/image-185-768x576.png 768w, https://chias.blog/wp-content/uploads/image-185-620x465.png 620w, https://chias.blog/wp-content/uploads/image-185.png 1280w\" /></figure>\n\n\n\n<p>Seeing is undeniably tethered to my practice of self-construction. Seeing does not replace becoming, but it is an integral part of it. Seeing is an active, involved act that accompanies self-construction. Seeing necessitates movement. <a href=\"https://www.moussemagazine.it/magazine/walking-act-seeing-act-reading-act-walking-hendrik-folkerts-2020/\">Walking Is an act of seeing is an  an act of walking.</a></p>\n\n\n\n<p>Everywhere I go, I just keep finding myself. I want to keep finding myself so I keep going. </p>\n\n\n\n<p>One of my closest art professors at Yale shared with me the recommendation letter he wrote me back in April, and in my absence last month I reread it for the first time since he first sent it. “…In class their freshman year Chia was quiet and reserved, and at first I did not notice them, then we had a critique and their work broke the computer, literally. They turned in a project that forced the computer to shut down and restart in the middle of our critique as a meditation on the digital medium and as an expressive gesture that undermined the interface itself as a way to highlight the fragility of digital experience. <em>You don’t notice Chia because they demand to be noticed, you notice them because they are impossible to ignore.</em>“</p>\n\n\n\n<p>Most of my asking for witnessing might have come in a seeming overcompensation for an invisibility. At its core, my self-preservation is a radical act against a world that has kept erasing me. <a href=\"https://internetprincess.substack.com/p/standing-on-the-shoulders-of-complex\">I am not blogging for the people who will read it after I die,</a> I write to know myself and what I think and what I had journeyed to <em>until</em> I die. I write because the world has become noisy &amp; polluted, and when the most beautiful thing we can do is to attend to each other, that this is best done when we present the invitation to do so; that I trust in myself, and maybe even other people, to filter through and deem what is important beyond what is in our periphery. This is maybe the magic of agency, the biggest lesson from wading through any dark place: I can choose what is important, I can choose what I believe, I can choose what I see. To do this, you must first see everything. I try so hard to be in a way that is unquestionable.</p>\n\n\n\n<p>Naming is not a linear or generous act; maybe I described it as so. It comes hungrily, when my soul pangs for a sense of purpose, or a clarity of desire and self. It comes arbitrarily, in surprise and in embarrassing relief that I had already become who I wanted to be so long ago, being so irrational and headstrong in my own judgment of self, to everyone’s derision. It comes when the things unnamed now demand names, where the ordinary have become everything, where rhythm and structure have ceded to the undeniable tangibility of presence. </p>\n\n\n\n<p>When I live I am in your field of view, and whether I am truly seen is a choice not always conscious. It’s difficult to engage in something you <em>see</em> but do not name or know, and sometimes people make the choice to further seek—and many times they don’t. But what can you see if it’s not observable, especially of something for the first time? To even begin being present with others, I’ve learned that I must move, be apparent. To be seen we must first be near each other.</p>\n\n\n\n<p>When seeing accompanies self-construction, we are always moving: with our eyes, our senses, our body, within the environment in which we choose to realize ourselves. <a href=\"https://www.versobooks.com/books/1865-a-philosophy-of-walking\" target=\"_blank\">When you are walking, nothing really moves</a>. Frederic Gos believes that slowness is less the opposite speed and more of a regularity of paces and uniformity, painting pictures of still landscapes and mountains becoming almost embodied within us instead of us drawing nearer. This is pretty, but I am dwelling in a world that to have me, needs me in motion. Before I am slow I must be seen. When I go slow I am laboring to be there. Sometimes I am told that brutality and exertion are the most abundant, true forms of provision; this is why I falter to thinking that when I suffer I feel most like myself, that when the heart is pounding it continues to feel like the right direction—even if I might very well be killing myself. Sometimes and often lately I am told that presence is enough, being is enough. What if the body is still dying either way. What if to meet myself I have to get someplace first. What if to put one foot in front of the other means that I chose to act on the desire of motion. This is why when I go so fast I also feel most alive. </p>\n\n\n\n<p>When I find myself, I’ve often run into myself.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://chias.blog/wp-content/uploads/image-186-1024x768.png\" srcset=\"https://chias.blog/wp-content/uploads/image-186-1024x768.png 1024w, https://chias.blog/wp-content/uploads/image-186-300x225.png 300w, https://chias.blog/wp-content/uploads/image-186-768x576.png 768w, https://chias.blog/wp-content/uploads/image-186-620x465.png 620w, https://chias.blog/wp-content/uploads/image-186.png 1280w\" /></figure>\n\n\n\n<p>My main gripe with slowness is that to be in the observable universe, or to continue staying in this very room, I must always be walking. Next to others, my walking looks more like running. I’m preoccupied with my relations to other people because I do not have the luxury of total isolation and divorce from others; my choice is to live a life in deep devotion to the communities that have brought me to where I am—that taught me the language, and my lived reality is that I am literally geographically bound and physically restrained based on systems not my own. Next to others, my slowness looks like slowness but is fatiguing me deeply—simply because our paces are different. I forgive myself not just for my tire but for the conditions the world has put me under to even continue being in this space—continuously working, mending, attending, to continue having what I have. In many cases, staying still often looks like walking. To many historically marginalized people, walking often looks like running. </p>\n\n\n\n<p>Less ambiguously, I’m living with the realization that there is no quick victory to the life path I have. It’s been no secret that to get to where others are, I’ve had to do things at an inhuman pace often unkind to me; I knew this since I was seventeen years old, thinking of getting out of my country. What I didn’t know was that this put me on a path that I couldn’t quickly get out of, tethered to so many worlds old and new, indebted to many others and to myself by choice. What I didn’t know was that I would feel soulfully incompatible with most people no matter what intersecting hobbies or beliefs we had because of the sheer magnitude of effort needed to get there that often underscored every interaction, let alone with how few people were interested in knowing this.  What I didn’t know was that I would be mispronouncing every other word in conversation with people who laugh and then ask me for how I get to where I am in life, or who have to see the fruits of this running to even want to attend. That I would still be teaching kids who pay full tuition at an Ivy League school—when all I wanted to do was to take this precious time back to people who could use a computer to take their family out of poverty, not just multiply their already six figure spending. I learned to play the game so well that not only do people ask me why my English is so good—they ask me what part of California I’m from. That I would have to think more seriously about my time, what routes I am laying for people, and who I want this journey to be retraceable for. That everyone’s time is precious, and I don’t even know how many years I’ll have in this country, and I don’t even have anybody in this country. What I didn’t know was that this was the beginning of running for a lifetime.</p>\n\n\n\n<p>I’m exhausted by the idea that it is only in slowness and stillness that you can pay attention to the world. While deep resonance and perception has helped me become interested in the development of ambiences and ecosystems, more precisely the environments in which we all be, I am more interested in how the constant construction of these worlds and the paving of paths to even begin running on make you the deepest attendant to everything around you. The extracted quarries and the jagged stones are mine. I show pictures of the place where I grew up, sometimes the most mundane roads in my country, and others ask me if they’re really real. What deeper inhabiting can I do when something has come out of myself, and in return I can run with familiarity. I go deep into motion because I sense everything around me, because I have made them. I get sick reciting anecdotes because sometimes it feels less like universalities that others can respond to and more like snippets of entertainment. I am comfortable not stopping because I know where I might be heading. I don’t stay still because stillness in a world that keeps taking looks like running. When I’m running and most embodied, everything is inhabiting me.</p>\n\n\n\n<p>I can go slow to you when I’m running and it’s not beautiful. I am seeing the same world dancing and I myself am there too. I am in motion to see what you see. When my ancestors went slow there was something still brutal in their conditions. Slowness is a gift that we hand off to the people of the next generation, and more tangibly the very people around us. We carry burdens for one another to let the road be lighter, we pave paths for each other as an act of I love you. Instead of erasing the need to be in motion, we can simply attend to that need and look closely at how the treading looks for one another. We dream of journeys that are kinder to the ones we love. We trust that it the human desire to be alive often comes with some form of moving; that to see the skies we still need to look up, and to connect to nature we must allow ourselves to eat, and that there is no one who doesn’t want slowness—the question is in the world that we have designed for them that allows them to even be presently still.</p>\n\n\n\n<p>All this to say that when it looks like slowness or ease, it took a forever to get here. There’s privilege that I manufacture for myself (if I can even call it that, from nothing); the effort behind the pace in which I go something I’m spending my life finetuning. </p>\n\n\n\n<p>This standard of obscuring labor and effort that permeates our everyday accompanied with the performative indulgence and praise of ‘stillness’ is only breeding more inequity &amp; social resentment rather than tackling the roots of why we all cannot just rest. Even moving beyond the commodification of rest as bubble baths and lit candles, I think for instance: the access to nature and the oceans become a far privilege for the urban population of Manila, many of whom actually immigrants from the provinces where this rural environment was once their norm—abandoning these environments to better meet needs because there is more to life that we want to picture and give. While we can fantasize that the next generation might realize that all they want is to return to this quiet stillness, the frequent reality is that unlike many American brands of lifestyle inflation and downsizing into the woods—we worked to rid ourselves of a complacency masked as stillness because our fundamental needs deprived us, because we wanted to continue seeing alternative realities. When I say that life could’ve been easy: I didn’t have to move here, I discount all that I learned and all that my privilege can now bring me back home—and most of all, the perspectives I’ve developed from my dwelling, no matter the suffering, that have given me the capacity to pave more paths for those. I want it easier for the next. I want the option to dream to be present until there is nothing more that we long for. Underneath the dinner parties that are quiet displays of wealth and ‘if you know, you know’ signals or signals that you have the very luxury of living near the people you love—or the privileged aestheticizing their participation in activities &amp; spaces more for the commons, like pop stars posing next to tricycles. These now pose as tiny mockeries for what are now impossibilities for other people, or an obscene way of relating when these moments are staged &amp; your lived truth is far more comfortable. I consider how all my friends and loved ones all separated from each other because the environment in which we could live together was hostile and cruel, and when we were together it was always just reinventing it until finding alternatives was a necessary. I talk about this state of rest in so many senses: not just the obvious anti-capitalist attitude towards work, but the ways we perform being and attend to each other, and mostly the acts of dissolution and dissonance that aid to us better educating ourselves and seeing alternative imaginaries.</p>\n\n\n\n<p>For many people, the best life that all these platitudes towards rest point towards is only possible because we are working towards it. Indeed, if we look at slowness as a state of contentment and being—then we should consider what it means for different bodies to even be idle. Our roads are all differently carved, and the desire for maintenance or rest cannot be simplified. Oftentimes the true ‘action’ of stopping writes people out of histories, discards their needs, placates them in the negligence of the present. I feel angry, excluded—when we forget that ‘stillness’ for some people means being forgotten, when the state of our ‘stillness’ is one where we must be in motion, because the same actions towards ‘stillness’ would place you comfortably in your place, while mine would put me in oppressive, hostile environments. I want my nothingness to be violent, but when I am nothing the world is violent to me. I want us to trust in rest as a future that we can share in; more than my inability to rest as a signal that I’ve failed or succumbed to a system—when there has been nothing done to help me escape the very system that takes the form of rest away from me. I want to know that this is a failing of the world and not of own.<br />I think about how even thinking about myself is a privilege when I sometimes go so hungry that I can’t feel anything the way I’ve ignore my body—so much until I can’t feel hunger anymore. I think about how I’ve abstracted beauty into the process because it is the truest promise that I can give myself. I think about how I can only name this frustration today because of everything that has taught myself it: from the spaces that have carved me, the people who have impressed on me, and the body that craved a true understanding. I want people to be open about how we are trying as hard as we can, actually, and to empathize in the labor of that trying rather than dictate how hard we should each try. It sometimes takes so much effort to look up and simply see the sky.</p>\n\n\n\n<p>I can’t imagine how much more difficult this is for people who are less able than me, and for all those who lack the small privileges I had to get to where I am. I know we are all exhausted. I know that no matter how tired we are, we can still continue to carry the world for others—the simple human act of making this existence lighter, more worth it, worth seeing.</p>\n\n\n\n<p>When I want to be still with you I am running. Let me do this because I want to be with you. Instead of telling me to stop, tell me how I can run better. Tell me what’s ahead.</p>\n\n\n\n<p>I get that thing about knowing people: it feels like a shortcut. I don’t think about this solely in terms of the cursory ‘connections’ talk, but it might be the most familiar way to measure it. I think about this emotionally: I build this future for other people more than myself, I keep treading best when I know that if I were ever to falter I would not stop—that someone else will help carry me along the way. We can do so much for each other. Just as we live in a world where we can give the next generation the gift of taking it a bit more slowly. Just as this journey doesn’t have to be for our own self.</p>\n\n\n\n<p>I want the picturesque rest, don’t get me wrong. I want to listen deeply every day and never think about capital, name the flowers around me, and indulge in myself and reap all I have become. I want the coffee shops and the woods and the retreat from everything and to have the time to pray, if prayer was a thing for me. But I am always becoming myself and I am always laboring to get there. And there is so much of this world that I cannot see if I am not moving towards it—because nothing has been given to me, and even the act of naming is entwined with becoming and the naming is a privilege that I am still giving to myself against a complacency of exploitation, repression, hostility. I see all the beauty around me, of what I can name and am still learning to name, and still these moments make me think about how much more there is to do when others do not have the privilege of moving at my pace from the violent ground that took them. When I talk about getting somewhere with you I’m mostly talking about how so many others can’t even get to where I am.</p>\n\n\n\n<p>What are the answers here? To rewire a world where someone else can walk slowly; to acknowledge the pace in which others are going more conscientiously, more interest in histories &amp; paths than pure outcomes to truly know a story; to realize that how we name what we live in is a futile act if we are not seeing wholly, if we do not know who made it or what it is here for. Oftentimes, the clearer answer is to be okay with not climbing nor maintaining pace, even, to rewind and fall back to one more manageable—but what if that isn’t an option? What if I trust that the world is something I continuously make—and risk it without that participation. I’m not interested in you meeting my pace or experiencing its very beginning: we run because we want a better world, and empathy doesn’t come in unnecessary suffering—what if sharing in the struggle was rooted in a tangible optimism instead?</p>\n\n\n\n<p>What if my desire is precious because I was born into a world that wouldn’t even allow it for me? And what if you chose to honor it instead of looking at it as self-inflicted wound? What if these desires were born out of necessity as I was born into a world that was designed to turn and leave me and my people behind? What if all the selves I want to become and all the paths I take constantly have me colliding while the spiritualists and the privileged mangled the only way I’ve ever known to carve my sense of identity and save myself, deeming it as a failure. What if we recognized desire was inseparable from being, and instead of marking a place to stop, we can more radically realize that we can always want better for one another. </p>\n\n\n\n<p>Or another alternative: to continue building towards a place where we can finally go and rest. To trust that my investment in systems and in people will eventually carry me and let me not have to leave behind a life—instead welcoming me in so that I can finally count the breaths I take. We pay attention to each other as we do the path, in hopes of not only meeting each other at the end — but walking alongside each other. When it comes to it I’ll show you who I have become. </p>\n\n\n\n<p>Perhaps my ancestors’ wildest dream was to stop dreaming<a href=\"https://twitter.com/hotemogf/status/1541637365915164672\">.</a></p>\n\n\n\n<p></p>\n\n\n\n<p></p>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"209a0ce7a5223013f9761b7d4313f7944ea0188d479e0cbd12a7a463a2ef1ed3","category":"Sites"}