{"title":"Love Anyway","link":"https://www.themarginalian.org/2024/03/22/love-anyway/","date":1711143177000,"content":"<p>You know that the price of life is death, that the price of love is loss, and still you watch the golden afternoon light fall on a face you love, knowing that the light will soon fade, knowing that the loving face too will one day fade to indifference or bone, and you love anyway — because life is transient but possible, because love alone bridges the impossible and the eternal. </p>\n<p>I think about this and a passage from Louise Erdrich’s 2005 novel <a href=\"https://www.amazon.com/Painted-Drum-Novel-Louise-Erdrich/dp/0060515104/?tag=braipick-20\" target=\"_blank\"><strong><em>The Painted Drum</em></strong></a> (<a href=\"https://search.worldcat.org/title/71443987\" target=\"_blank\"><em>public library</em></a>) flits across the sky of my mind:</p>\n<blockquote><p>Life will break you. Nobody can protect you from that, and living alone won’t either, for solitude will also break you with its yearning. You have to love. You have to feel. It is the reason you are here on earth. You are here to risk your heart. You are here to be swallowed up. And when it happens that you are broken, or betrayed, or left, or hurt, or death brushes near, let yourself sit by an apple tree and listen to the apples falling all around you in heaps, wasting their sweetness. Tell yourself that you tasted as many as you could.</p></blockquote>\n<p>This, of course, is what life evolved to be — an aria of affirmation rising like luminous steam from the cold dark silence of an indifferent cosmos that <a href=\"https://www.themarginalian.org/2024/02/16/endling/\">will one day swallow all of it</a>. Every living thing is its singer and its steward — something the poetic paleontologist Loren Eiseley captures with uncommon poignancy in his 1957 essay “The Judgment of the Birds,” found in his altogether magnificent posthumous collection <a href=\"https://www.amazon.com/Star-Thrower-Loren-Eiseley/dp/0156849097/?tag=braipick-20\" target=\"_blank\"><strong><em>The Star Thrower</em></strong></a> (<a href=\"https://search.worldcat.org/title/754773610\" target=\"_blank\"><em>public library</em></a>). </p>\n<figure><a href=\"https://www.themarginalian.org/2019/06/17/the-lost-words-macfarlane-morris/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/raven_JackieMorris.jpg?resize=521%2C700&amp;ssl=1\" width=\"521\" height=\"700\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/raven_JackieMorris.jpg?w=521&amp;ssl=1 521w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/raven_JackieMorris.jpg?resize=320%2C430&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/raven_JackieMorris.jpg?resize=240%2C322&amp;ssl=1 240w\" /></a><figcaption>Raven by Jackie Morris from <a href=\"https://www.themarginalian.org/2019/06/17/the-lost-words-macfarlane-morris/\"><em>The Lost Words</em></a> by Robert Macfarlane</figcaption></figure>\n<p>Eiseley recounts resting beneath a tree after a day of trekking through fern and pine needles collecting fossils, dozing off in the warm sunlight, then being suddenly awakened by a great commotion to see “an enormous raven with a red and squirming nestling in his beak” perching on a crooked branch above. He writes:</p>\n<blockquote><p>Into the glade fluttered small birds of half a dozen varieties drawn by the anguished outcries of the tiny parents. No one dared to attack the raven. But they cried there in some instinctive common misery, the bereaved and the unbereaved. The glade filled with their soft rustling and their cries. They fluttered as though to point their wings at the murderer. There was a dim intangible ethic he had violated, that they knew. He was a bird of death. And he, the murderer, the black bird at the heart of life, sat on there, glistening in the common light, formidable, unmoving, unperturbed, untouchable. The sighing died. It was then I saw the judgment. It was the judgment of life against death. I will never see it again so forcefully presented. I will never hear it again in notes so tragically prolonged. For in the midst of protest, they forgot the violence. There, in that clearing, the crystal note of a song sparrow lifted hesitantly in the hush. And finally, after painful fluttering, another took the song, and then another, the song passing from one bird to another, doubtfully at first, as though some evil thing were being slowly forgotten. Till suddenly they took heart and sang from many throats joyously together as birds are known to sing. They sang because life is sweet and sunlight beautiful. They sang under the brooding shadow of the raven. In simple truth they had forgotten the raven, for they were the singers of life, and not of death.</p></blockquote>\n<p>Couple with Hannah Arendt on <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">love and how to live with the fundamental fear of loss</a>, then revisit Loren Eiseley on <a href=\"https://www.themarginalian.org/2024/02/03/loren-eiseley-birds/\">the warblers and the wonder of being</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"216e2011a5d1de5e478031f7dc33c71c9544c522f8a25c84bc20cfac659b6bb6","category":"default"}