{"title":"DHS / AI and open-source technology","link":"https://ghuneim.com/2024/04/27/dhs-and-open-source/","date":1714228787000,"content":"<p>Over 20 Technology and Critical Infrastructure Executives, Civil Rights Leaders, Academics, and Policymakers Join New DHS Artificial Intelligence Safety and Security Board to Advance AI’s Responsible Development and Deployment (DHS April26, 2024)</p>\n<p>The executives break down like this…</p>\n<p>Software and hardware companies: Sam Altman, CEO, OpenAI; Dario Amodei, CEO and Co-Founder, Anthropic; <span>Jensen Huang, President and CEO, NVIDIA; Arvind Krishna, Chairman and CEO, IBM; Fei-Fei Li, Ph.D., Co-Director, Stanford Human-centered Artificial Intelligence Institute;</span> Satya Nadella, Chairman and CEO, Microsoft; Shantanu Narayen, Chair and CEO, Adobe; Sundar Pichai, CEO, Alphabet; Adam Selipsky, CEO, Amazon Web Services; Dr. Lisa Su, Chair and CEO, Advanced Micro Devices (AMD)</p>\n<p>Critical infrastructure operators: Ed Bastian, CEO, Delta Air Lines; Vicki Hollub, President and CEO, Occidental Petroleum</p>\n<p>Public officials: Bruce Harrell, Mayor of Seattle, Washington; Chair, Technology and Innovation Committee, United States Conference of Mayors; Wes Moore, Governor of Maryland</p>\n<p>Civil rights community: <span>Rumman Chowdhury, Ph.D., CEO, Humane Intelligence; Alexandra Reeve Givens, President and CEO, Center for Democracy and Technology;</span> Maya Wiley, President and CEO, The Leadership Conference on Civil and Human Rights</p>\n<p>Academia: Fei-Fei Li, Ph.D., Co-Director, Stanford Human-centered Artificial Intelligence Institute; Nicol Turner Lee, Ph.D., Senior Fellow and Director of the Center for Technology Innovation, Brookings Institution</p>\n<p>What’s missing is OPEN-SOURCE representatives.  They seemed to be aligned with using open-source technology , In March (24) DHS announced they would be using open source software as part of their pilot programs announced:</p>\n<p>Transform Security Investigative Processes, Unlock Data-Driven Insights, and Improve Mission Outcomes – HSI’s pilot project will strengthen their investigative processes by introducing a LLM-based system designed to enhance the efficiency and accuracy of summaries investigators rely upon. The LLM-based system will <strong>leverage open-source technologie</strong>s to allow investigators to more quickly summarize and search for contextually relevant information within investigative reports. The pilot could lead to increases in detection of fentanyl-related networks, aid in identification of perpetrators and victims of child exploitation crimes, and surface key patterns and trends that could further HSI’s vital work.</p>\n<p><a href=\"https://www.dhs.gov/news/2024/04/26/over-20-technology-and-critical-infrastructure-executives-civil-rights-leaders\">DHS AI Roadmap</a></p>\n<p><a href=\"https://hackmd.io/@opensourceinitiative/osaid-0-0-8\">opensourceinitiative/osaid-0-0-8</a></p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"2241a244b8cb64ffedd0ccbd835343d56a93e265b50045f07efb626c023873c8","category":"default"}