{"title":"Considerate book pricing","link":"https://sive.rs/bp","date":1635292800000,"content":"<p>\nI love having <a href=\"https://sivers.com/\">my own store</a> so I can make things the way I think they should be.\n</p><p>\nFor example, I disagree with the usual pricing of books.\nIf I buy a book in one format, it doesn’t seem fair to pay full price to get it in another format.\nThat would be paying twice for the same content.\n</p><p>\nLet’s separate these two things:\n</p>\n<ol><li>\n<strong>Contents</strong>: the words in a book\n</li><li>\n<strong>Delivery</strong>: the ways to get the words into your brain: paper, audio, PDF, HTML, etc.\n</li></ol>\n<p>\nWhat we really want is to <strong>buy the contents, not delivery</strong>.\n</p><p>\nWith so many different devices now, it seems fair that if you buy the contents of a book, it should include all formats of delivery.\nEPUB, MP3, Kindle, M4B, PDF, HTML, or whatever new formats may come in the future.\n</p><p>\nToday you want to read silently by the fire.\nTomorrow you want to listen while you drive.\nIn ten years, you want to read it again on your new device.\n<strong>\nThis should all be included when you buy a book.\n</strong>\n</p><p>\nI love this idea.\nIt’s almost perfect.\nIt has just one problem:\n<strong>\nPaper costs money.\n</strong>\nSo I can’t just include it for free.\n</p><p>\nBut following this philosophy, it’s not right to charge full price for each paper book, because that would mean paying repeatedly for the contents!\n</p><p>\nSo here’s the solution I came up with:\n</p>\n<ul><li>\n<strong>Contents</strong> of my book: $15\n</li><li>\n<strong>Delivery</strong> of all digital formats: FREE\n</li><li>\n<strong>Paper?</strong> Just cover its cost: $4 each (+ postage)\n</li></ul>\n<p>\nI like this.\n<strong>\nIt means you never pay for the contents twice.\n</strong>\nIt works out well for many different scenarios:\n</p>\n<ul><li>\nAll digital formats: $15\n</li><li>\nFirst paper book: $19\n</li><li>\nPaper books after you’ve bought the contents: $4 each\n</li><li>\nLoved the ebook, and now want to buy 20 paper copies for your friends?\nJust $4 each, so <strong>$80 total for 20 hardcover books</strong>.\n</li></ul>\n<p>\nIt’s worked out well.\nPeople are buying many hardcover copies as gifts.\nA few people have bought over 500 copies each to give to clients or members of their organization.\n</p><p>\nThe only downside of creative pricing is it requires a little explanation.\nLike anything unusual.\n</p>\n<hr />\n<p>\n<strong>\nLog in to <a href=\"https://sivers.com/\">sivers.com</a> to get my books. ☺\n</strong>\n</p><p>\nSee <a href=\"https://sive.rs/pp\">my previous article on pricing philosophy</a> for more thoughts on <strong>creative pricing</strong>.\n</p><p>\nRead “<a href=\"https://sive.rs/ayw4\">Make a dream come true</a>” for more thoughts on <strong>making things the way they should be</strong>.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"22aae6b43a66ac8479312777972803371dfb3db590946a20f4a5876a05802538","category":"default"}