{"title":"How to Comment on Social Media","link":"https://kottke.org/24/02/how-to-comment-on-social-media","date":1707328517000,"content":"\n        <p>Rebecca Solnit with a cheeky &amp; hilarious piece on <a href=\"https://lithub.com/rebecca-solnit-how-to-comment-on-social-media/\">How to Comment on Social Media.</a></p>\n\n<blockquote><p>1) Do not read the whole original post or what it links to, which will dilute the purity of your response and reduce your chances of rebuking the poster for not mentioning anything they might’ve mentioned/written a book on/devoted their life to. Listening/reading delays your reaction time, and as with other sports, speed is of the essence.</p>\n\n<p>7) If you’re a man and that O.P. is a woman, her facts are feelings and your feelings are facts, and those forty-seven increasingly lengthy responses you fired off were clearly a rational reaction. If she reacted negatively to them, do not forget to rebuke her for being emotional.</p></blockquote>\n\n<p>I hate to say it, but the reason I am <a href=\"https://kottke.org/24/02/0043927-bluesky-is-opening-up-to\">not enjoying</a> Mastodon so much these days is because I see stuff like this on there regularly:</p>\n\n<blockquote><p>9) Which is why the person who said, or rather typed, offhandedly “people should bike more” really means all people need to bike everywhere under all circumstances and is callously indifferent to people who: live in Siberia and can’t bike through -40 blizzards; are physically unable to cycle; can’t afford bikes; and let us not forget those who have bicycle-related trauma. Which is why anyone who could say “people should bike more” is a fascist who needs crushing.</p></blockquote>\n\n<p>🎯</p>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/how%20to\">how to</a> · <a href=\"https://kottke.org/tag/Rebecca%20Solnit\">Rebecca Solnit</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/how-to-comment-on-social-media\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"2335bce6a90cc25149e1194170b91b4c8b2890ca33d0b7a51dfd8c414d8ac690","category":"default"}