{"title":"Black Privilege review","link":"https://blog.webb.page/2017-05-06-black-privilege-review.txt","date":1494028800000,"content":"<p>Charlamagne Tha God is a radio personality of a nationally syndicated show\ncalled \"The Breakfast Club\" on Power 105.1. He's not well-liked by most people,\nespecially the people he's interviewed and has disagreements with — this is\nbecause he speaks his mind. He doesn't like your latest album? He'll tell you.\nAre you embroiled in controversy? He'll ask about it. Basically, he asks the\nquestions or says the things many listeners want to ask or are thinking. I\ncount myself as one of his fans.</p>\n<p>When Charlamagne mentioned he was writing a book, I knew I had to check it\nbecause…<em>who the hell would give this man a book deal</em> (Touchstone Books<a href=\"http://www.simonandschusterpublishing.com/touchstone\">1</a>,\napparently)?</p>\n<p>While reading, I found myself nodding in agreement when he arrived at the\nconclusion of a life lesson or when he realized he had to change his thought\nprocess. I also couldn't help noticing similarities in our lives. We loved\ngetting those Pizza Hut coupons for free personal pizzas when we read lots of\nbooks in elementary school. Music was a means of both inspiration and escape in\nour teens. We never finished college. Despite that, we've been able to succeed.</p>\n<p>I was reminded that I used to live out my \"hood dreams\" vicariously through\nartists like Clipse<a href=\"https://en.wikipedia.org/wiki/Clipse\">2</a>. While glamorizing the gangsta life, they also rapped\nabout the obvious downsides. This was at a time when my peers listened to\nJay Z<a href=\"https://en.wikipedia.org/wiki/Jay_Z\">3</a>, The Lox<a href=\"https://en.wikipedia.org/wiki/The_Lox\">4</a>, Dipset<a href=\"https://en.wikipedia.org/wiki/The_Diplomats\">5</a>, &amp;c. I was almost exclusively Neptunes<a href=\"https://en.wikipedia.org/wiki/The_Neptunes\">6</a> and\nWill Smith. Yes, <em>I know</em>. I was clowned for liking Big Willie's music\nthroughout all of middle and high school.</p>\n<p>Anyhoo, if you're an aspiring radio host or anyone aspiring to do anything\nreally, I highly recommend this book. The full title is \"Black Privilege:\nOpportunity Comes to Those Who Create It<a href=\"http://amzn.to/2qMSdIo\">7</a>\". 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"24730bbb154f4c766f75b7b7bed4693259c9ac8d843dd30a989aeb6ff7a7bf8b","category":"Sites"}