{"title":"Scuba, panic, empathy","link":"https://sive.rs/dive","date":1658793600000,"content":"<p>\nI used to scoff at those people who had panic attacks.\n“The cake is late! Oh no! I’m freaking out! I can’t breathe!”\nRidiculous.\nHysterical.\nOver-reacting.\n</p><p>\nI was <a href=\"https://www.dive.is/dive-courses/padi-beginner-dive-courses\">learning scuba diving</a>, and went on my first practice dive.\nWhile I was 15 meters underwater, I felt a sudden need to get out of there.\nMy heart raced.\nAlarms in my brain.\nMy body filled with terror.\nI raced up to the surface and pulled off my mask.\n</p><p>\n<a href=\"https://www.dive.is/about-us/dive-is-behind-the-scenes/our-people/tobias-klose\">The instructor</a> came up, so I told him, “I need to go. I hate this. I’ll just wait on the shore.”\nHe calmly looked at me for a few seconds and said, “Here. Wait. Look around. See that mountain? What a nice day. Everything is OK. You’re safe. Let’s just relax here together.”\nIt worked.\nAfter a while, I felt better, and finished our dive.\n</p><p>\nLater I realized I had a panic attack.\nThis messed with my self-identity.\nI thought only weak, dramatic, hysterical people did that.\n<strong>\nBut now I had, and it was involuntary.\n</strong>\nHmm.\n</p><p>\nThe next day, I went on my first real <a href=\"https://www.dive.is/diving-snorkeling-tours/diving-day-tours/silfra-diving-day-tour\">dive</a> with a group of ten tourists, including a German couple that bragged about how many dives they had done.\nUnderwater, I felt no fear — just joy.\n</p><p>\nDown deep at 20 meters, I saw the German girl, and gave her the hand signal for “OK?” — a common diver courtesy.\nShe replied back with the hand signal for “NOT OK! SOMETHING WRONG!”, and gave me a panicked look.\nHer boyfriend was not around.\nI followed the training I had just learned, and brought her slowly to the surface.\n</p><p>\nShe pulled off her mask and said, in a panic, “I hate this. Too cold. Too much. No no. I need to go now.”\nI recognized this!\nThis was exactly how I had felt the day before.\nI remembered how my instructor had calmed me down, so <strong>I imitated my instructor exactly</strong>.\nI said, “Here. Wait. Look around. See that mountain? What a nice day. Everything is OK. You’re safe. Let’s just relax here together.”\nAfter a while, her boyfriend arrived, so I went back to my dive.\n</p><p>\nThose two days taught me two kinds of empathy.\n</p><p>\nYou might categorize a type of person that’s so unlike you — a type of person that you will never ever be.\nDepressed.\nDisabled.\nFat.\nDivorced.\nBankrupt.\nHomeless.\nAddict.\nBut these categories are usually involuntary.\nDon’t judge.\n<strong>\nSome day, they might be you.\n</strong>\n</p><p>\nYou might also categorize another type of person that you think you will never be.\nRescuer.\nLeader.\nAthlete.\nBoss.\nMillionaire.\nEven these categories can be involuntary — someone just responding to a situation.\nBut <strong>you can deliberately step into a role through imitation</strong>.\n</p><p>\nWe’re not so different.                                               \n</p>\n<img src=\"/images/dive.jpg\" alt=\"Iceland Silfra underwater\" />\n<div>(Note: originally posted 2021-11-17, then rewritten, simplified, on 2022-07-26.)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"248146413807a0f4fa0b52ae39377b6e75d50e1d9ec30a0fbe749f899464dcaa","category":"Sites"}