{"title":"your website is not a brochure","link":"https://keningzhu.com/journal/your-website-is-not-a-brochure","date":1724339280000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/12-your-website-is-not-a-brochure/id1731169431?i=1000666225231\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/5myUWsdE0JYXzZMECQpHdH?si=6cc551c709664f87\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>why your website doesn’t have to be a brochure that compartmentalizes your infinite self — into three glossy pages. I’ll put these two frameworks side by side: “website as brochure” vs. “website as a digital garden-home-world”, and explore: </p><ul><li><p>why we feel pressured to turn ourselves into brochures </p></li><li><p>the ethos and intention to sell / show / prove / substantiate — versus the intention to exist, inhabit, and be </p></li><li><p>how brochure-like websites compartmentalize and limit the self into a marketing “niche” </p></li><li><p>on building a nourishing garden-world to hold the multi-dimensional, expansive creative self — and invites visitors to linger </p></li><li><p>why building a rich digital world to share your creative wealth is the key to inviting in prosperity </p></li></ul><p><strong><br />additional resources</strong></p><p><a href=\"https://keningzhu.com/house-on-the-webs/\" target=\"_blank\">house on the webs course</a></p><p><a href=\"https://keningzhu.com/journal/elements-of-a-digital-world\" target=\"_blank\">infinite possibilities for a digital world</a></p><p><a href=\"https://keningzhu.com/journal/how-to-world-build-a-cyclical-guide\" target=\"_blank\">how to build a world: a cyclical guide </a></p><p><a href=\"https://keningzhu.com/journal/world-building-is-wealth-building\" target=\"_blank\">why world-building is wealth-building</a></p><p><a href=\"https://keningzhu.com/journal/the-internet-i-long-to-visit-build-and-inhabit\" target=\"_blank\">the internet i long to visit, inhabit, and build </a></p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/24a8c2dd-2880-4244-85a6-16db9cb3fe73/ep_11._8-15.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <p></p><h1>introduction</h1><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening, and I'll be your guide.</p><p>In this week's episode, I want to guide you to radically reimagine the possibilities of what a website can be as a digital home to inhabit with your full creative self.</p><p>I have written a lot on my philosophy of what I call <a href=\"https://keningzhu.com/worldbuilding\">digital world building</a>.</p><p>And I teach a course on this called <a href=\"https://keningzhu.com/house-on-the-webs\">House on the Webs</a>.</p><p>But in this episode, I want to zoom out by comparing this web philosophy to the status quo of what our mainstream culture thinks that websites are.</p><p>And I'm calling this the website as brochure.</p><p>Part of the reason for this metaphor is that many platforms want us to believe that the website is obsolete, just as a brochure seems totally obsolete in this digital age, whereas the real action appears to be on these platforms.</p><p>I've unpacked a bit about how this is not the case in a previous episode, but today I'll explore how thinking of a website as a home, a garden, or a world is radically different from a website as brochure.</p><p>And we'll explore this through five key areas, ethos, intention, structure, feeling, and outcome.</p><p>So a caveat before we begin.</p><p>As always, there's so many infinite paths on this road and building a website as a world is only one way.</p><p>By no means am I saying that if your website looks like a brochure, that it's somehow insufficient.</p><p>On the contrary, it's probably more efficient and in the short run in our society, because it is the status quo, it is what is expected.</p><p>But if your soul is calling you to create and be and express something more, consider this episode an invitation, because this episode and this podcast is about anything but the status quo.</p><p>It's about imagining a new vision for our future.</p><p></p><h1>the pressure to make brochures</h1><p>First question, why do we feel the pressure to build websites as brochures?</p><p>I will propose two reasons.</p><p>Number one, because it's the way it's always been done.</p><p>These are the examples that we see on the wider internet.</p><p>And when we look around in our specific industries.</p><p>Reason number two, because we think that if we don't do it, we're jeopardizing our potential to attract clients, customers, sell things, in other words, to make a living and sustain our material lives.</p><p>I think just being aware of these two reasons and the underlying fears is powerful in itself, powerful enough to make a shift.</p><p>And here's my response to these reasons.</p><p>Number one, we don't have to look like everyone else.</p><p>To look like everyone else might feel safe in the moment, but I believe it's such a compromise of our authenticity and cutting our own wings of what we could be if we were to be authentically ourselves.</p><p>We're here to reimagine new possibilities for our own lives through the internet and for a new world at large.</p><p>Number two, if you build a nourishing digital environment that people wanna spend time in and invite them to go on deeper journeys and pathways with you, then you don't even have to sell, at least not in the same way your digital world will sell itself.</p><p>So let's dive into these five elements.</p><p></p><h1>#1 - ethos</h1><p>In a website as brochure, the ethos is all about the means to an end.</p><p>It's very much goal-oriented, results-driven and focused on product, as in how can I get a user from point A to point B in as few clicks as possible?</p><p>How can I make this sell or boost the conversion rate?</p><p>I've had a marketing guru tell me that if my website doesn't grab attention in three seconds, then it's somehow insufficient.</p><p>This kind of pressure to be attention grabbing already makes me feel stressed even thinking about it.</p><p>As a result, we feel pressure to give value propositions and to speak to pain points and to pull out our marketing guns to create a sense of urgency and pressure.</p><p>And on the internet, this manifests as things like testimonials or a countdown timer for sales or 30 people just bought this five seconds ago.</p><p>You can feel the ethos of this space to serve as a bridge to sell something.</p><p>In a website as world, the moment you enter, you get this innate sense that the creator made it for themselves.</p><p>That even if you weren't here clicking around, this place would still exist.</p><p>Therefore, you stumbling upon it, discovering it, it feels like a gift, like wandering into a cafe hidden on a side street or a secret garden.</p><p>It feels more like an experience, a feeling, an environment, a place.</p><p>Instead of driving you to buy something, a website as world offers you a series of pathways and portals.</p><p>It doesn't make demands of you.</p><p>Instead, it offers you different kinds of choose your own adventure experiences and invites you to wander.</p><p></p><h1>#2 - intention</h1><p>In a website as brochure, the intention is to show, to prove, to legitimize, credentialize, substantiate.</p><p>For example, on the homepage you might have featured in and then a gazillion logos of famous publications or institutions to give it social validation.</p><p>The intention is to convince, to persuade, to build trust, to market to, and to sell.</p><p>You get a sense that it was written or created for a specific target audience and trying to see if you are that target audience.</p><p>In a website as world, the intention is simply to exist, to be unapologetically itself, to express, and to take a stand for, ethos, values, beliefs, truth, beauty.</p><p>A world is a nourishing, self-replenishing, generous, giving kind of place.</p><p>It's a place that you wanna spend time in, a place you want to return to again and again.</p><p>It asks nothing of you and it feels almost like a refuge or a sanctuary or like a home of someone that you know where their kettle is still on and the fireplace is warm.</p><p></p><h1>#2 - Structure</h1><p>Now let's talk about the structure.</p><p>In a website as brochure, on the homepage, you might have an intro, social validation, social proof, opt-in, a freebie.</p><p>You might have an about page that functions more like a resume or a bio, and then a portfolio page, like a gallery or showroom or testimonials.</p><p>Then you'll have the offerings page where there's the cell, and a blog page, if it exists, might serve a function similar to content marketing.</p><p>The design priority in this kind of structure is to collect traffic and to convert.</p><p>In a website as world, you have the same elements but presented in a completely different way.</p><p>In your homepage, you'll have a first expression and impression of identity and pathways to explore and get lost in.</p><p>And perhaps those pathways will lead to services or offerings or your blog, but it's presented with a different energy without trying to persuade or convert or convince.</p><p>And then you'll have an ecosystem of those winding paths and gardens to get lost in, or maybe it'll feel more like a collection, like a cabinet of curiosities or a personal library.</p><p>This part of the ecosystem is the living world that the creator is tending to, and in the form of their creations or curations or gifts.</p><p>And then you'll have offerings, which are journeys and pathways for deeper engagement.</p><p>And last, you'll have the about page, which actually I think is not as important because rather than functioning as a resume of sorts, on a website as world, the about page is only to provide a bit of context because the rest of the world, if it's clear in its identity, will speak for itself.</p><p>The design priority is to express and to invite you to linger.</p><p>In internet terms, you could call this kind of space extremely sticky, but not sticky in a sort of obnoxious pop-up buttons trying to beg you to stay kind of way, sticky as in rich, full of feasts, and it invites you to linger and explore as hospitality.</p><p></p><h1>#3 - Feeling</h1><p>Now let's explore the feeling.</p><p>In a website as brochure, the website will feel very linear and boxy, there's a certain kind of structure of a hero section and then a three column and then a two column.</p><p>All in all, it feels flat.</p><p>Like it doesn't go very deep unless maybe there's a paywall and it feels static as if the website was created a year ago, two years ago, three years ago, but it hasn't really changed that much.</p><p>It's not a living space.</p><p>There's also a sense of compartmentalization as if it's a sort of filing cabinet or a cabinet of drawers dividing the self or the entity into different parts.</p><p>In a website as world or a website as home, you get a sense of depth and rabbit holes like your Alice in Wonderland falling through spaces and places.</p><p>There's a sense of aliveness, ongoingness, evolution and experimentation.</p><p>There's potential for surprises everywhere.</p><p>There's a sense of mystery and because it is multi-form, multi-genre, because it is fluid, this website as world defies form and fixedness.</p><p>It lives in a fluidity of practice and process.</p><p>Maybe you're like, this sounds great, but how do I make money?</p><p>How do I build an audience?</p><p>How do I be an artist on the internet and build a business on the internet when I have a website as world?</p><p>So let's unpack this with the last element.</p><p></p><h1>#5 - Outcome</h1><p>That is, what is the outcome?</p><p>I wanna say that a website as brochure is extremely efficient in that it works.</p><p>As a way to show and convey and as a marketing tool, it's definitely better than nothing.</p><p>But the effect of it is kind of like, let me put this up so that it's a nice storefront.</p><p>And then when I have a little bit more resources, maybe let me upgrade the storefront and make it a bit more shiny, polish the branding a bit and make sure that my visitors have something nice to see to give them a good first impression.</p><p>In a website as brochure, you can try to optimize for each element.</p><p>You can try to attract better leads into your storefront or website and figure out what aspect of your store you need to tweak to get them to buy something or download something or give you their email address.</p><p>This works.</p><p>And I think for artists, the analogy I would use is not a storefront, but instead a gallery, putting your best work at the front of the gallery and then a receptionist or a place where you can be contacted to hire you or to buy a painting.</p><p>This method is efficient and you're able to build a website and forget about it.</p><p>I think whether you're an individual building website or a business, it does a couple of things.</p><p>Number one, it compartmentalizes the self and your creative expressions in its structure and ethos forcing you to claim a sort of niche.</p><p>And when you apply the marketing mindset, you ultimately contain yourself into value propositions and speak to a specific target audience.</p><p>But if you're someone who wants more, who wonders what else is possible, let me explore the outcome of a website as world.</p><p>So I'll start with the non-material outcomes for the self and the creative soul, which I think in our capitalist world, we don't value enough anyways.</p><p></p><h1>the multi-faceted, multi-dimensional self </h1><p>When you build a website as home, it becomes a space to hold the multifaceted, multidimensional self.</p><p>It allows that person to take up space and to continue to expand into greater and greater evolution into distilling your uniqueness, your essence.</p><p>It becomes a vessel for unhindered creative flow, a place to collect your inspiration and process.</p><p>It becomes a place to value yourself and to value your work through the public practice of sharing it through accumulating your gifts and insights and offerings.</p><p>Now let's talk about how it relates to building a business or finding success.</p><p>First, I think is reframing the idea of building an audience or building a customer base into growing a thriving ecosystem.</p><p>As a gift first and foremost to yourself and then to whoever stumbles upon it.</p><p>Because if you're able to cultivate a garden that you find beautiful, that replenishes you, that offers you sanctuary and beauty, then it will definitely offer the same thing to others.</p><p></p><h1>your world is your wealth </h1><p>My proposition is that when you are in the practice of being uncompromisingly yourself in full expression of your multidimensional creativity, that is the key, the secret to building and manifesting material wealth.</p><p>Why is that?</p><p>Because instead of applying a marketing template or a strategy or following some 10-step plan, you have to figure out how to create in a way that is aligned with your energy.</p><p>It gives you the space to offer gifts that only you can offer, whether or not that's paid or a garden open to the public.</p><p>You practice giving with generosity.</p><p>And I see this form of giving and creating as very different than content marketing because the purpose is expression, not conversion into a marketing funnel.</p><p>Ultimately, you tend to and nurture your ecosystem and then your ecosystem builds these relationships one person at a time with the guests who visit.</p><p>It's not about trying to capture them, convert them and sell to them.</p><p>It's about nourishing them, offering them a space where they want to spend time in.</p><p>Your relationship to your world and your creations in your world becomes the most precious practice.</p><p>And those relationships that you cultivate through your world are a natural byproduct.</p><p>Through giving your creative wealth to this website as world, you're opening yourself to receive wealth in return.</p><p>Your world becomes your wealth.</p><p>And again, the word wealth I use in all dimensions, mentally, creatively, spiritually and financially.</p><p></p><h1>closing thoughts </h1><p>In closing this episode, I'll leave you with this.</p><p>When you choose to build a website as a world and as home and abandon the idea of website as brochure, you move from a space of displaying, improving and convincing to inhabiting.</p><p>What you inhabit is your own creativity and authenticity.</p><p>In that space, you become a singular voice in the universe because only you can sound like you.</p><p>You sink deeper into the practice of expressing the gifts, the insights, the visions that only you have to offer.</p><p>And you trust through that inhabitation, through those forms of hospitality and inviting them and guiding them along the path you're able to create prosperity for yourself and for others.</p><p>It is by no means easy or fast or efficient, but it is a way of being on the internet that nourishes the soul and bridges the gap of making art and making money.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"24d47b8ad68c6a6c84b479f4b7646a41201e2960d7a46731ed28d893e623bcb2","category":"Sites"}