{"title":"Understanding Singapore","link":"https://sive.rs/sg14","date":1390262400000,"content":"<p>\nWhen I tell people I live in Singapore, the most common misunderstandings I hear are:\n</p>\n<ul><li>\n“How can you live in that sterile squeaky-clean police state?”\n</li><li>\n“Isn’t that where they cane people for chewing gum?”\n</li><li>\n“Disneyland with a death penalty! Haha!”\n</li><li>\n“What part of China is that in?”\n</li></ul>\n<p>\nI’m not surprised when people misunderstand Singapore, because it requires a little explanation.\n</p>\n<h4>\nFirst — some important context:\n</h4>\n<p>\nSingapore is an island so small you can drive around the whole country in two hours.\n</p><p>\nIn 1819, it was set up by the British as a tax-free trading port, instantly attracting business from the entire region.\nSo it’s always had a mix of Malay, Indian, and Chinese people, though the majority are Chinese.\n</p><p>\nIt quickly became an anything-goes town, with opium, prostitution and gambling, run by secret societies.\nIts nickname was “Sin-Galore”.\n</p><p>\nIn 1963, Singapore became a part of Malaysia.\nBut racial tensions between the Malay and Chinese populations led to ongoing race riots.\nSo in 1965, Singapore was kicked out of Malaysia, making it suddenly (and reluctantly) an independent country.\n</p><p>\nSince Singapore had no natural resources, no local industry, and was geographically vulnerable, few people believed it would survive.\n</p><p>\nBut being a do-or-die survival situation, the government and people of Singapore got <strong>extremely focused, pragmatic, and competitive</strong> to do whatever it takes to make this tiny island thrive against the odds.\n</p><p>\nTheir main survival strategy was to focus on making Singapore an ideal place for big business — attracting multinational corporations to set up their Asian headquarters here.\n</p><p>\nAll these historical ingredients are important for the rest of this explanation to make sense.\n</p>\n<h4>\nWhy so clean?\n</h4>\n<p>\nBecause Singapore is so small, keeping it clean is a manageable job.\n(You can’t easily clean India or China.)\n</p><p>\nBut really <strong>the cleanliness is marketing</strong>.\nWhat better way to prove to multinational corporations that Singapore is a stable, trustable, and efficient place to set up your headquarters?\nIt’s no coincidence that the highway leading from the airport to downtown has the most perfectly manicured landscape.\nFirst impressions matter to visiting CEOs.\n</p><p>\nIt’s why the country’s leaders all wear white.\nIt’s a show of incorruptibility — a metaphor for being orderly and transparent with attention to detail.\nGetting to know Singapore’s government is like looking under the hood of a Ferrari.\nIt’s incredibly well-designed and well-run.\n</p><p>\n<strong>\nSingapore is always selling itself to the world.\n</strong>\nThe chairman of the government’s Economic Development Board told his colleagues, “We are in the hospitality business.”\nThe government works hard to stay competitive on every international measure.\nAny time there are international rankings comparing countries, you’ll find Singapore near the top of the list.\nExcept for free speech, but I’ll cover that next.\n</p><p>\nLastly: why no chewing gum?\nPurely pragmatic.\nIt was gumming up the subway system, causing delays, and was too hard to clean off surfaces, so the sale of it was banned.\nKeeping the country clean and running smoothly was more important.\n</p><p>\nSo that’s why Singapore has an international reputation for being so clean.\nIt’s brilliant marketing — visual proof of the order and cleanliness you can expect if you set up your business or banking here.\n</p>\n<h4>\nWhy so strict?\n</h4>\n<p>\nThree reasons: transformation, size, and marketing.\n</p><p>\nFirst: transformation.\nTo quickly turn Singapore from “Sin-Galore” to being the Switzerland of Asia would require great strategy and strict, uncompromising execution of that strategy.\nWe’re used to seeing this in corporations, like Jack Welch at GE or Steve Jobs returning to Apple, but it’s surprising to see it carried out successfully in a government.\n(Many say Singapore is more like a corporation than a country.)\n</p><p>\nAnd it worked!\nIn one generation, Singapore went through a dramatic increase in the standard of living.\nIn one generation, this tiny dot went from being broke to being one of the richest countries in the world, without any natural resources, purely by strict execution of a great strategy.\n</p><p>\nIts lack of corruption was an important ingredient in its success.\nIn a region where political corruption is rampant, Singapore is the only country that severely punishes corruption.\nIt regularly ranks as one of the least corrupt countries in the world.\n</p><p>\nNext: size.\nSingapore’s UN representative once said, “America is like an aircraft carrier.\nIf you jump up and down, it’s not going to shake.\nSingapore is like a canoe.\nIf you jump up and down, it will sink.\nIf you lose stability in Singapore, you lose everything.”\n</p><p>\nLastly: marketing.\nWhen an American teenager vandalized 18 cars in Singapore, he was sentenced to jail and caning.\nThis turned into an international incident, with Bill Clinton asking Singapore not to prosecute him.\nBut as a government official said, “It was a way of demonstrating that Singapore was prepared to stand up against the mighty America.”\n</p><p>\nTo me, that’s brilliant marketing.\nA memorable way for a country to prove to the world that they obey the rule of law, without exception, and don’t waive the laws for special requests from powerful people.\nI think this kind of approach makes corporate leaders more likely to do their business and banking in Singapore.\n</p><p>\nAll that said, you could argue that Singapore is not so strict — less strict than Switzerland or California — because it’s a <em>laissez-faire</em> “do what you want” approach where life and business are not regulated for most of us in the middle.\nOnly the behavior that clearly hurts others or society is punished.\nEveryone else gets to live in an incredibly safe, crime-and-corruption-free place.\n</p>\n<h4>\nSo very pragmatic\n</h4>\n<p>\nThe common thread behind everything here is pragmatism.\nThe country’s leadership consistently makes rational choices to improve the strength and profitability of Singapore.\n<strong>\nIt’s pragmatic, not dogmatic.\n</strong>\nIt’s not that the leaders of Singapore hate chewing gum or are neat freaks.\nThese were just rational decisions to do what was best for the country at that time.\nThe prime minister has a degree in Computer Science, as does the deputy prime minister.\nThis is a country run by engineers and economists.\n</p><p>\nSo it’s important to know that these things are changing fast.\nThe government is constantly but conservatively re-assessing its stance on everything, to keep up with the times.\nThe last few years have seen a huge move towards more democracy and free speech, with the theater and arts scene blossoming because of it.\n</p><p>\nSingapore’s #1 enemy is complacency.\nNow that Singapore is one of the most successful countries in the world, the top priority is to keep that competitive edge.\nThis “keep on your toes” message is constantly communicated at all levels — a reminder to never assume that things will stay this good.\nKeep pushing.\nStay on top.\nDon’t let your guard down.\nAlways be competitive.\n</p><p>\nSingapore was founded on the ideals of the Age of Enlightenment — the age of reason and rationality — and its founder built those lofty ideals into its blueprint.\nSo to understand Singapore, you need to understand that it’s always been designed top-down, from the beginning, to realize these rational ideals.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"24fd198156ba073ae38ae1f4d5d64ea8acc4e64cfa07e693c10e3ff32b2a5e36","category":"default"}