{"title":"I’ve moved from New Zealand to Oxford England","link":"https://sive.rs/ox1","date":1552003200000,"content":"<p>\nI rarely cry, but I cried a lot last month, leaving New Zealand.\nI’ve never loved and felt so connected to a place before.\nIt wasn’t simple sadness that made me cry, but overflowing appreciation.\nI’d been feeling it for years, almost every day, amazed at not just the nature but the people and way of life.\nKnowing I was leaving made me re-play all my memories from my last six years.\nMost of that time spent <a href=\"https://sive.rs/pa\">playing in the wilderness with my kid</a>.\nThe memories are so overwhelmingly wonderful that seeing them all together like that made me sob with appreciation.\nThey’ve been the happiest years of my life.\nLeaving felt like tearing a child from its mother.\n</p><p>\nSo why did I leave?\n</p><p>\nI believe <a href=\"https://sive.rs/mfg\">moving is good</a> for the mind.\nI like seeing the world from different perspectives.\nI usually get where I’m going by leaving where I’ve been.\n</p><p>\nI’ve been on a semi-sabbatical for the last six years, and ready to make a change.\nI felt like being in the middle of things again, but a different middle than before.\n</p><p>\nI’ve never really lived in Europe.\nI have a list of places in Europe that I’m curious to get to know — places I’ve learned about but have never visited.\nThe list has 51 places on it already.\n</p><p>\nMunich would have been a more practical travel hub, but Oxford has a <a href=\"https://www.buzzfeed.com/alanwhite/43-reasons-living-in-oxford-ruins-you-for-life\">wonderful charm</a> to it.\nA <a href=\"https://sive.rs/dj\">search of my diary</a> showed I’ve been thinking about moving to Oxford since 2007.\nWhenever I visited, it always felt just right.\nSo I finally did it.\nI moved to Oxford England a month ago today, with everything I own in three suitcases.\n(My kid had another two suitcases, and one of them was just Lego.)\nI plan to stay here for a year or so.\n</p><p>\nOscar Wilde:<i>\n“Oxford still remains the most beautiful thing in England, and nowhere else are life and art so exquisitely blended, so perfectly made one.”\n</i></p><p>\nHenry James:<i>\n“Oxford lends sweetness to labor and dignity to leisure.”\n</i></p>\n<p>\nUPDATE: I loved living in Oxford, but <strong>I moved back to New Zealand in July 2020.</strong>\n</p>\n<img src=\"/images/ox1.jpg\" alt=\"Oxford UK\" />\n<div>Oxford photo by <a href=\"https://www.flickr.com/photos/tejvan/5506664311/\">Tejvan Pettinger</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"2527bb5e61145305352dcd6b83965a39b8736f07a444d31a33c3dacb9f26a4e8","category":"default"}