{"title":"Filtered for rats and global consciousness","link":"https://interconnected.org/home/2024/12/06/filtered","date":1733518560000,"content":"<div>\n<h3>1.</h3>\n<p><a href=\"https://www.theatlantic.com/business/archive/2014/10/the-artist-who-trained-rats-to-trade-in-foreign-exchange-markets/381456/\">The Artist Who Trained Rats to Trade in Foreign-Exchange Markets</a> (2014), <em>The Atlantic.</em></p>\n<p>The artist Michael Marcovici bred rats to predict currency prices.</p>\n<blockquote>\n<p>To do this, he converted price fluctuations into a series of notes played on a piano-if a price went up, the next note was higher-and then left it up to the rat to predict the tone of the note that followed. With some prodding, the rats began forecasting price changes, and Marcovici says that they were outperforming human traders after a few months of training.</p>\n</blockquote>\n<p>They should try this at business school:</p>\n<blockquote>\n<p>Correct picks were rewarded with food, and incorrect picks were punished with minor shocks.</p>\n</blockquote>\n<p>Also this:</p>\n<blockquote>\n<p>After trials with about 1,000 piano tracks, Marcovici was left with four “really gifted traders,” which he then cross-bred to produce a generation that outperformed their progenitors.</p>\n</blockquote>\n<p>Selective breeding for precognition would be an achievement.</p>\n<h3>2.</h3>\n<p>The <a href=\"https://languagelog.ldc.upenn.edu/nll/?p=61749\">Salish Wool Dog</a> was a breed of dog, now extinct, <em>\"raised for thousands of years for its wool.\"</em></p>\n<p>A “sheep-dog.” One of the last remaining sheep-dogs died in 1859. Confusingly it was called Mutton.</p>\n<p>Anyway the dogs were kept by the Coast Salish people of the Pacific Northwest and this comment in that post caught my eye:</p>\n<blockquote>\n<p>It is said that the trance state that the spinner (usually a woman) entered into by watching the designs on the whorl blur as the spindle revolved allowed her to create textiles imbued with magical powers.</p>\n<p>Years ago I came across an ancient Greek term that translated as something like “divination through the act of spinning” that was also associated with the drop spindle.</p>\n</blockquote>\n<p>Spinning as a portal to divination!</p>\n<p>I’d like to learn more about that. If anybody knows what it is called?</p>\n<h3>3.</h3>\n<p><a href=\"https://www.tumblr.com/degenerate-perturbation/740420060784558080\">Here’s a great tumblr post about spinning</a>: <em>\" I’ve had a hard time articulating to people just how fundamental spinning used to be in people’s lives, and how eerie it is that it’s vanished so entirely.\"</em></p>\n<blockquote>\n<p>it’s a bit like if in the future all food was made by machine, and people forgot what farming and cooking were. Not just that they forgot how to do it; they had <em>never heard of it.</em></p>\n<p>When they use phrases like “spinning yarns” for telling stories or “heckling a performer”…</p>\n</blockquote>\n<p>Wikipedia: <a href=\"https://en.wikipedia.org/wiki/Heckler\">To heckle was to tease or comb out flax or hemp fibres.</a></p>\n<p>I wonder what transcendental states and what world knowledge we can no longer access, now spinning is no longer part of everyday life.</p>\n<h3>4.</h3>\n<p>The <a href=\"https://noosphere.princeton.edu\">Global Consciousness Project</a> is a parapsychology project that uses a network of continuously active random number generators to detect fluctuations in, uh, the global vibe field I guess.</p>\n<p>It’s been running since 1999 or so.</p>\n<blockquote>\n<p>When human consciousness becomes coherent, the behavior of random systems may change. Random number generators (RNGs) based on quantum tunneling produce completely unpredictable sequences of zeroes and ones. But when a great event synchronizes the feelings of millions of people, our network of RNGs becomes subtly structured.</p>\n</blockquote>\n<p>i.e. very very slightly - but detectably - <em>less random.</em></p>\n<p>For example, here’s <a href=\"https://noosphere.princeton.edu/data/eggsummary/2024/summary-2024-12-05.html\">today’s data</a> - although it won’t mean much without processing. The project claims to have seen correlations in the random number generators <a href=\"https://noosphere.princeton.edu/results.html#alldata\">at the time of many major events</a>.</p>\n<p>ALSO:</p>\n<p>The project has a webpage named <a href=\"https://noosphere.princeton.edu/music.html\">Music Interlude</a> where they discuss using sound to interpret the data. Many examples given.</p>\n<p>Get the precog rats on it.</p>\n\n  <hr />\n\n\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/filtered-for\">filtered-for</a>\n\t(111).\n\t\n\t</small></p>\n\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"253d1a1b194482ba7bda152109f66765f3254270648f6edbf910a1f53b38ce49","category":"Sites"}