{"title":"Misinformation is fun","link":"https://www.garbageday.email/p/misinformation-fun","date":1710182012000,"content":"<div><div><p><i>I am very, very, very excited to say that today’s whole issue was edited by the fabulous </i><a href=\"https://twitter.com/bijanstephen?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\"><i>Bijan Stephen</i></a><i>. Let me know what you think!</i></p><hr /><h2>Alright, I'm A Kate Middleton Truther Now</h2><p>According to my WhatsApp messages, I first noticed the conspiracy theory that Kate Middleton was missing on February 29th. That's when I started texting friends of mine in the British press something like \"yo what's the deal with Kate Middleton?\" </p><p>The hashtag #WhereIsKate had started circulating online a few days prior, and by that point large news organizations in the US <a href=\"https://www.nbcnews.com/news/kate-middleton-online-conspiracy-theories-memes-rcna141027?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">were beginning</a> to pick up the story. Though I wouldn't say it was a proper conspiracy theory. More a tangled knot of memes traveling around the web. The AI Glasgow Willy Wonka event had just happened (remember that?) and King Charles had been diagnosed with cancer, which put some real energy behind the hashtag. The idea being that Prince William was going to divorce Middleton before he took the throne <span><i>or</i></span> that Middleton had been kidnapped by The Unknown. My vote is on the second one.</p><p>Then, a week ago, a celebrity news agency called Blackgrid <a href=\"https://pagesix.com/2024/03/04/royal-family/kate-middleton-seen-for-first-time-in-2-months-after-undergoing-surgery/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">snapped</a> a couple grainy photos of Middleton driving with her mom near Windsor Castle. Which only made matters worse, launching thousands of posts about a Middleton body double.</p><p>I think it's fair to say that a large section of the internet saw an opportunity to give Middleton a taste of the <a href=\"https://www.nbcnews.com/news/us-news/meghan-markle-recounts-cruel-bullying-experienced-pregnant-rcna142622?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">same online harassment</a> that Meghan Markle has received pretty much constantly over the years. Also, to add to the noise, one user on X <a href=\"https://twitter.com/roastmalone_/status/1762586081814544434?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">realized</a> that Middleton had been \"missing\" for roughly the same amount of time it typically takes to recover from Brazilian butt lift surgery. Which seemed pretty irrefutable.</p><p>But still, most of this could be easily explained by the official line from the Palace. Middleton had abdominal surgery in mid-January and was still recovering. Also, I think the body double conspiracy theorists made all of this feel a little too crazy, and a lot of normal people were losing interest. That is, until yesterday.</p><p>Middleton's Instagram <a href=\"https://www.instagram.com/p/C4U_IqTNaqU/?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">posted</a> a photo of her with her three children, with a pretty boring caption: \"Thank you for your kind wishes and continued support over the last two months. Wishing everyone a Happy Mother’s Day.\" (It was British Mother's Day yesterday.)</p><p>The photo is undeniably weird. Two of the kids are doing a strange crossed finger thing, Middleton's jacket zipper disappears into her jacket, she isn't wearing a wedding ring, her daughter's sweater continues into her hand, the color of their clothes has clearly been altered, and the reflection on the window doesn't make sense. Just to name a few things. And people immediately <a href=\"https://twitter.com/TruthSignalUK/status/1766832190636089616?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">noticed</a>!</p><p>Even more surprising, however, was that the Photoshop — and it is Photoshop, not AI — was egregious enough for several large news agencies to place a <a href=\"https://twitter.com/chrisshipitv/status/1766946121396453454?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">kill order</a> on the photo. If you've never heard the term before, it's a <a href=\"https://twitter.com/tenilleclarke1/status/1766966430480707782?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">very big deal</a> and means the photos cannot be used in any editorial capacity. As far as I'm aware, it has never happened to a photo from Kensington Palace before. Typically, they send out press materials and outlets just use them. Because that's how things work when you're an entire country's landlord.</p><p>Middleton <a href=\"https://twitter.com/KensingtonRoyal/status/1767135566645092616?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">released</a> a statement this morning on X, writing that she \"experimented\" with editing and apologized for the confusion. I'm not even going to touch this, but I simply do not believe that Middleton sits down at a computer and edits her own photos on Photoshop. Or even knows the login for her Instagram account. </p><p>As my friend (and very good royal reporter) Ellie Hall <a href=\"https://www.niemanlab.org/2024/03/this-is-just-weird-buzzfeed-news-former-royals-reporter-on-kate-middleton-palace-press-and-distrust-in-the-media/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">told </a><i><a href=\"https://www.niemanlab.org/2024/03/this-is-just-weird-buzzfeed-news-former-royals-reporter-on-kate-middleton-palace-press-and-distrust-in-the-media/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">Nieman Lab</a></i> last week, Kensington Palace does not officially respond to online speculation. Which makes sense. Why would they need to? Americans, in particular, tend to treat royals like celebrities — and younger royals certainly lean into this to pick up lucrative do-nothing deals with Netflix and Spotify — but unlike traditional celebrities they don't actually need publicity. In fact, as Hall told <span><i>Nieman Lab</i></span>, the main function of the royal household's various small, siloed press teams is actually to screw with each other. </p><p>\"If Prince Harry is to be believed, there is constant infighting, one-upping, and leaking that goes on behind the scenes — staffers for one member of the royal family will give damaging or untrue stories about another member to the press to make their employer look better,\" Hall said. </p><p>But that’s less titillating than the online speculation, which again, the palace is not responding to. There, I thought the most satisfying explanation for the photo came from a TikTok user named <a href=\"https://www.tiktok.com/@allynaston/video/7344921409816251678?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">Allyn Aston</a>. She was able to find photos from November 2023 which show Middleton and her children wearing almost identical outfits to what they're wearing in the Mother's Day Instagram photo, except in different colors. There's <a href=\"https://twitter.com/rubynaldrett/status/1767184942859997400?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">another theory</a> going around that Middleton's face was taken from a <span><i>Vogue</i></span> cover from a few years ago. </p><p>I don't totally buy all of the #WhereIsKate conspiracy theories. I think she's probably just on medical rest and her PR team is scrambling to contain a problem they're too posh to fully understand or care about. But it <span><i>also</i></span> doesn't really matter because the truth just gets in the way now. </p><p>Misinformation is fun. This is something that's never really addressed by the rotating cast of reporters, researchers, and other types of content cops that get trotted out on the news to scold people for sharing dangerous memes. Most people's experience with misinformation isn't true crime-obsessed Instagram moms looking for zip ties in Target parking lots or insurrectionist QAnon shamans. It's just entertainment now. Like obsessing over whether or not Charli XCX just made a video throwing shade at Camila Cabello (she def did lol). You read and share this stuff because it's salacious and exciting and funny. And no amount of media literacy or whatever is going to make it not funny to speculate about a literal princess getting a BBL and hiding it to protect her reputation.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/768c8bf7-3da3-4f2b-826a-1c57529affda/Town_Crier.jpg?t=1710179851\" /></div><p>Looking to see politics, business, sports, food, entertainment and science a little differently? Subscribe to <a href=\"https://thetowncrier.beehiiv.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">The Town Crier</a> for hard-hitting, fact-driven journalism like:</p><ul><li><p>Biden Administration Assembles Task Force to Liberate President’s Hand From a Pickle Jar</p></li><li><p>Disturbing: 100% of 29-Year-Olds Diagnosed With Turning 30</p></li><li><p>Millennial Congressmen Propose Blowing on Bottom of America Then Putting It Back In</p></li></ul><p>And more . . . all for FREE! Suck it, inflation! But don’t just take our word for it, listen to what Arnold Schwarzenegger had this to say about The Town Crier: “Ahhahggfuiaegyruoafdagfhdakfvdyabgaoylfdhuaud SUBSCRIBE NOW!”</p><p>Truly powerful stuff. </p><p><b><a href=\"https://thetowncrier.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">Click to subscribe</a></b><b>.</b></p><hr /><h2>I’m Playing A Live Show Later This Month</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/97fe27c0-fe79-4cc5-8e23-0f09f2112c14/Screenshot_2024-03-11_at_2.00.24_PM.png?t=1710180051\" /></div><p>It’s on March 23rd at the new Knitting Factory in New York City. I’m opening for Tanlines. It’ll be a mix of music, “standup,” and random beats of internet ephemera. It’s gonna be rad. <b><a href=\"https://www.ticketweb.com/event/tanlines-garbage-day-live-knitting-factory-at-baker-falls-tickets/13395763?pl=kftour&amp;REFID=clientsitewp&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">You can grab tickets for it here</a></b><b>.</b></p><hr /><h2>The Chocolate Covered Strawberries Of TikTok</h2><p><span><i>—by Adam Bumas</i></span></p><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@pr4yforgabs?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\"> @pr4yforgabs </a><p>#fy #foryou #strawberry #chocolate #chocolatecoveredstrawberries </p></section></blockquote><p>I’ve learned a lot from doing Garbage Intelligence reports for nearly a year (this month's dropped over the weekend), but probably the biggest revelation is how rarely people see the most popular thing on any given app. The obvious reason is how hard the data is to find in the first place. TikTok, for example, <a href=\"https://www.nytimes.com/2024/01/08/business/media/tiktok-data-tool-israel-hamas-war.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">completely closed off</a> most of its public analytics tools a couple months ago. Only journalists and/or data wonks (like me!) even noticed.</p><p>The thing is, the only time you see people caring about these numbers is when they can be used as ammunition in an ongoing fandom battle. That can look like anything from stans fighting to get their faves to number one on trending, to liking <a href=\"https://en.wikipedia.org/wiki/Instagram_egg?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">a photo of an egg</a> on Instagram to stick it to Kylie Jenner.</p><p>Last month, I saw a version of this on TikTok that was suffused with that platform’s specific brand of weirdness. A video of <a href=\"https://www.tiktok.com/@pr4yforgabs/video/7332187682480590112?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">chocolate-covered strawberries</a> got big leading up to Valentine’s Day, and soon the community mobilized to try and make it the most popular video on the platform. Much like the egg, it’s being mass-liked to dethrone Bella Poarch, a TikTok musician who <a href=\"https://www.tiktok.com/@bellapoarch/video/6862153058223197445?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">made silly faces</a> in 2020 and has gotten over 64 million likes for it.</p><p>As of this writing, the strawberries haven’t beaten her, and I don’t think they will. Even so, the two videos show you a lot about how TikTok works. Both of them were piggybacking off songs that were already massively trendy, carefully sync motion to music like <a href=\"https://en.wikipedia.org/wiki/Mickey_Mousing?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">a 1930s cartoon</a>, and require zero thought or engagement to enjoy.</p><p>It's useful data, but it only highlights the rest of our ignorance: TikTok is big enough that it's defending its right to exist in the USA, and we still aren't certain what it means, exactly, to get popular on the platform. Looking at the strawberries, part of the problem is how much bigger trends are than individual videos — a <a href=\"https://www.tiktok.com/t/ZPR3EKc5s/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">bunch</a> of <a href=\"https://www.tiktok.com/@eyoorenii/video/7331104738127400225?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">copycat</a> videos have gotten nearly as popular as the original, since people aren't looking closely enough to tell the difference. </p><p>The simplicity is another part of the problem. These videos are aimed too directly at our lizard brain — the part that could go for a huge bowl of something sweet and colorful right about now — to interrogate too deeply.</p><hr /><h2>A Good Post</h2><blockquote><p></p><p>Cillian Murphy winning the Oscar as <br />the royal family rapidly declines in  numbers, territory, relevance, public favor, hair? This is the Irish revenge my granny promised that I would see in my lifetime…</p><p></p><a href=\"https://twitter.com/superkeara/status/1767026985010626581?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\"><p> — Keara Sullivan (@superkeara) <br /> Mar 11, 2024 </p></a></blockquote><hr /><h2>Crypto's Getting Weird Again</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6ffeaad4-cdc8-4a4b-bad0-3ebe4a2a593d/Screenshot_2024-03-11_at_2.08.50_PM.png?t=1710180550\" /><div><span><p>(<a href=\"https://twitter.com/allnick/status/1765816673649488013?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">X.com/allnick</a>)</p></span></div></div><p>Bitcoin's at an all time high. Meme coins are up too. And we've already got our first main character of the bull market. A crypto trader and podcast host named Nick O'Neill posted a photo of himself on some kind of \"yacht\" in Miami with the caption, \"This is who you’re trading against.\" And he was mercilessly dunked on for it, of course. Thankfully for us, O’Neill has proceeded to double and triple down on it, like any good crypto trader who’s made a bad bet.</p><p>First he <a href=\"https://twitter.com/allnick/status/1766130964395348018?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">posted</a> a video from his big empty ugly house. Then he <a href=\"https://twitter.com/allnick/status/1766608423112597578?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">posted</a> a video of himself holding what he claimed was a $5,000 bottle of champagne — which was given a community note revealing it was a $85 bottle of Tattinger. He then <a href=\"https://twitter.com/allnick/status/1766899864439337380?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">posted</a> a video saying he has a chauffeur or whatever. Oh yeah, and his catchphrase is \"choose rich.\" Perfect.</p><p>Finally, he <a href=\"https://twitter.com/allnick/status/1766838767652860318?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">got another</a> community note revealing that his total liquidity is around $225,000. So now he's saying the whole thing was satire and he was just joking. It's all really good shit. </p><hr /><h2>What Happens If ByteDance Actually Sells TikTok?</h2><p>I do not think that ByteDance would divest TikTok to keep it operating in the US if a ban actually happened. But I do think playing out what would happen if it did is useful, if only to game out how Gen Z's favorite app might end up pulling culture down with it if it's sold off. And, interestingly enough, our best examples to point to here would be Myspace, Tumblr, and Twitter/X, in that order. </p><p>Let’s start with Myspace. It was bought by News Corp. in 2005 for half a billion dollars and actually kept growing. News Corp. owned Myspace during what many would argue was its biggest years. But its new corporate owner couldn't keep up with Facebook's competition, pivoted the wrong ways, and by 2008, the site was already dying. These days it exists as a bunch of old user data being bought and sold by various corporate owners. </p><p>Tumblr has cycled through a series of new owners, starting with Yahoo! In 2013, which famously banned porn, failed to launch a proper ad business, and eventually sold it to Wordpress-owner Automattic — which is now selling user data to Midjourney. And, finally, we all know what's happened to Twitter over the last year. It's become Elon Musk's personal plaything. <span><i>Forbes</i></span> <a href=\"https://www.forbes.com/sites/antoniopequenoiv/2024/03/06/usage-of-elon-musks-x-dropped-30percent-in-the-last-year-study-suggests/?sh=2a6c608d974f&amp;utm_source=www.garbageday.email&amp;utm_medium=referral&amp;utm_campaign=the-new-york-times-is-a-tech-platform-now\" target=\"_blank\">recently reported</a> its user activity is down almost a third in the last 12 months. And it's also using Twitter data to train Musk's stupid Grok AI thing.</p><p>So which way would TikTok go? Well, <span><i>The Wall Street Journal </i></span><a href=\"https://www.wsj.com/tech/why-the-new-effort-to-ban-tiktok-caught-fire-with-lawmakers-7cd3f980?st=jnjw9hqtrb8mfct&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">is reporting</a> that former Activision CEO Bobby Kotick is trying to buy TikTok, and that he’s approached OpenAI CEO Sam Altman as a potential partner. Which makes me think it could be a little from each column. I think it's likely that TikTok wouldn't be able to maneuver through the incredibly competitive short video market with a new owner, and the mention of Altman there seems to hint at a deep bench of Silicon Valley leaders salivating at the idea of harvesting TikTok data to power various AI models.</p><p>Of course, all of this might not happen and ByteDance might just pull out of the US. Which means TikTok videos would become a thing Europeans upload to Instagram. Excited to see how this one turns out!</p><hr /><h2>Yaoi Made It To International Women's Day</h2><blockquote><p></p><p>« Love Shuttle » à Matignon, grâce à Noémie de <span>@blAddictbyNao</span>, lauréate du concours « 101 entrepreneures » ! 😂 Franchement, bien joué Nono, respect ! 🙌</p><p></p><a href=\"https://twitter.com/YaoiCast/status/1766384607753109758?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\"><p> — Nico (Yaoi Cast) (@YaoiCast) <br /> Mar 9, 2024 </p></a></blockquote><p>Gabriel Attal, the prime minister of France, posted a photo on X for International Women's Day <a href=\"https://abcnews.go.com/International/wireStory/international-womens-day-celebration-call-action-beware-flowers-107875242?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">following</a> a historic vote in the country last week that  made abortion a constitutional right. The photo was taken on the steps of Hotel Matignon, the prime minister's residence, and users online quickly noticed a woman in the front row holding a very interesting book. Look, I’m going to assume Garbage Day readers know what yaoi is, but if you don’t, just make sure you don’t look it up at work.</p><p>The woman, Noémie Coplo, is the editor of a French publishing company called Nao Studio Publishing. She confirmed on X and on Facebook that the book, which is titled <i>Love Shuttle</i>, is their first release and that they wanted to celebrate.</p><p>\"Since the beginning of Nao Studio Publishing I have a goal, to make things move and to move mindsets forward,\" she <a href=\"https://www.facebook.com/permalink.php?story_fbid=pfbid02TvhNNY2TZ5KsehqH7ZDPiGKAmugHVUvui5zfrEtskdEcp17DZht71KhokKqF45ZRl&amp;id=61552261936686&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">wrote</a>. \"Listening, bringing a community together, helping to fight discrimination, homophobia and beyond.\"</p><p>You simply love to see it.</p><hr /><div><h2><span><b>Think About Supporting Garbage Day!</b></span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\"><span> Upgrade </span></a></div><hr /></div><h2><b>Some Stray Links</b></h2><ul><li><p><a href=\"https://www.polygon.com/24093254/activision-qa-600-workers-union-microsoft?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">\"600 Activision QA workers unionize, Microsoft voluntarily recognizes\"</a></p></li><li><p><a href=\"https://flaminghydra.com/there-should-be-newspapers-that-we-work-at-where-we-do-this/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">\"There should be newspapers that we work at where we do this\"</a></p></li></ul><hr /><p>P.S. here's <a href=\"https://twitter.com/adelchien/status/1766868772697325708?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=misinformation-is-fun\" target=\"_blank\">le kebab à facettes</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=3b787a48-7a6c-4e80-b809-817ab24b3787&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"255d2c562edbf8ff7b4b4313f0634eb0d43257c56c1c8152fb2a92e5c96c3119","category":"default"}