{"title":"Loving what I used to hate","link":"https://sive.rs/hate","date":1400371200000,"content":"<p>\nBe careful when you say you like or dislike something, because you could change your mind soon.\n</p><p>\nThe first time I heard Tom Waits’s music, when he was a guest on <i>David Letterman</i>, I thought it was so horrible that it must be a joke.\nEven years later, when I heard him again, I hated his music passionately.\nBut then I heard his cover version of the Cole Porter song “It’s All Right With Me”, and loved it.\nSo I got his album <i>Rain Dogs</i> and fell in love with it, then the rest of his music, too.\nThe funny thing is, on YouTube I found his old performance of my new favorite song, then realized it was that same appearance on David Letterman that I’d hated so much before.\n</p><p>\nI had no prejudice against Indonesia at first.\nI was running cdbaby.com out of my bedroom in New York, selling CDs to the world.\nI started getting huge orders from Indonesia, shipping thousands of dollars’ worth of CDs there.\nThen after a few months, the banks told me those were fraudulent orders placed with stolen credit cards, and they took all the money back.\nI cursed Indonesia as a “nation of thieves” and blocked all Indonesian orders on my site.\n</p><p>\nTen years later I was living in Singapore and was invited to speak at TEDxJakarta.\nI listened to twenty Indonesian speakers telling their stories and showing their amazing work.\nIt was so heart-warming and endearing.\nI spent a week in the home of my new Indonesian friends and fell in love with the people there.\nAfterwards I remembered I used to hate Indonesia.\nBut experience erases prejudice.\n</p><p>\nSame thing with weightlifting.\nFor decades I mocked it as the mindless activity of dumb vain jocks.\nThen I kept reading scientific research showing that it’s one of the best things you can do for your health.\nSo I tried it and have loved it ever since.\n</p><p>\nOf course there are examples going the other way, too: food and music I used to like as a teenager but don’t like anymore.\n</p><p>\nI have to smile, thinking about what my former self would say.\nBut the former self is not always right.\nWe shouldn’t preserve our first opinions as if they reflect our pure, untarnished, true nature.\nThey’re often just the result of inexperience or a temporary phase.\n<strong>\nOld opinions shouldn’t define who we are in the future.\n</strong>\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"259367a512fb2be8b9f47f8d0ab8b5293fca5d8f28d5a6631d0a9b7747cd2fa9","category":"default"}