{"title":"Seeking inspiration?","link":"https://sive.rs/io","date":1365897600000,"content":"<p>\nThe word “inspiration” usually means “something that mentally stimulates you.”\n</p><p>\nBut “inspiration” also means to <a href=\"https://en.wiktionary.org/wiki/inspiration\">breathe in</a>.\n</p><p>\nThe meanings poetically combine when you think of yourself breathing in thoughts, filling your body with ideas.\n<strong>\nBut don’t forget to breathe out.\n</strong>\n</p><p>\nPeople surf the web, reading pithy articles, looking for inspiration.\nPeople listen to hours of podcasts, looking for inspiration.\nMusicians, writers, artists, and everyone else, all scouring the world for inspiration.\n</p><p>\nBreathing in, and in, and in, and in.\n</p><p>\nYet most of them aren’t feeling inspired enough.\nThey’re looking for more, thinking that something else out there will truly inspire them.\n</p><p>\nWant to know why?\n<strong>\nBecause nothing is truly inspiring unless you apply it to your work.\n</strong>\n<em>\n(“work” meaning your life’s output, whether creative, business, or personal).\n</em>\n</p><p>\nIn other words, your work, itself, is the inspiration.\n</p><p>\nYou may hear something or see something that gives you a new idea.\nBut it’s only when you stop and think of your work through this new perspective, that you actually jump up and go turn the idea into reality.\nThat’s the real inspiration that everyone is looking for.\n</p><p>\n<strong>\nInspiration is not receiving information.\nInspiration is applying what you’ve received.\n</strong>\n</p><p>\nPeople think that if they keep reading articles, browsing books, listening to talks, or meeting people, they’re going to suddenly get inspired.\nBut constantly seeking inspiration is anti-inspiring.\nYou have to pause the input and focus on your output.\n</p><p>\nFor every bit of inspiration you take in, use it and amplify it by applying it to your work.\nThen you’ll finally feel the inspiration you’ve been looking for.\n</p><p>\nBreathe in.\nBreathe out.\nBreathe in.\nBreathe out.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"26614ed13e5d5e3a09094a1e0dda3887fbfefc567f9e095c0ac5558ce941de6e","category":"default"}