{"title":"Travel without a phone","link":"https://sive.rs/tp1","date":1569196800000,"content":"<p>\nThe first time, it was an accident.\n</p><p>\nI’d always wanted to go to Korea.\nI was so excited.\nI set out to explore and forgot my phone in the hotel.\n</p><p>\nI walked around Seoul for twelve hours that day and experienced so many wonderful things.\nI remember them all vividly now, years later, but I have no photos of it.\n</p><p>\n<strong>\nIt was a relief to not document everything.\n</strong>\nI appreciated everything as a one-step process instead of a two-step process.\nI could just feel amazed, instead of feel amazed <em>and</em> hold up my camera to record it.\nBesides, how often do I look at those photos later, anyway?\nI find it more useful to refer to <a href=\"https://sive.rs/dj\">my journal of how I felt</a>, instead of what I saw.\n</p><p>\nA few times, GPS could have helped, but because I didn’t have it, I had to go ask strangers for directions.\nGetting lost led me down some great little back roads I never would have found if I was following the map.\n</p><p>\nSo now I intentionally travel without a phone.\n</p><p>\nI feel free and untethered.\nA break from connection.\n</p><p>\nWhere you are is partially defined by where you are not.\nWhen you’re somewhere, you’re not somewhere else.\nBut when you use your phone, you’re everywhere.\nYou keep in touch with friends.\nYou hear what’s going on at home.\nYou see the screen exactly as you do anywhere else.\n</p><p>\nIt’s wonderful to be cut off from everywhere else — to be more fully only there.\n</p><p>\nAnd it’s so nice to not know the time or where I am.\nClocks and maps are useful inventions, but I see a moment better without them.\n</p><p>\n<strong>\nI appreciate a moment more when I know I’ll never see it again.\n</strong>\nI remember that day in Seoul better than I remember most photo-filled travels.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"2740f6f564a3018ca00de7ba4ea278477d844fc00f0f2d66994b086070ef046d","category":"default"}