{"title":"Parker or Driver?","link":"https://kottke.org/24/07/parker-or-driver","date":1722283385000,"content":"\n        <p>I am reading <a href=\"https://www.amazon.com/exec/obidos/ASIN/0593190262/ref=nosim/0sil8\">All Fours</a> by Miranda July right now and it hooked me right out of the gate. <a href=\"https://granta.com/all-fours/\">Granta published a excerpt of the book back in April</a> – you can use it as a barometer for whether you’d like to try the whole thing.</p>\n\n<blockquote><p>I came into the house my usual way, like a thief. I turned the lock slowly and shut the door with the handle all the way to the left to avoid the click of the lock. Took off my shoes. Rolled my feet from heel to toe, which is how ninjas walk so silently. I was often two or three hours late because I had trouble admitting that I was planning to talk to Jordi for five hours. But how could it be any shorter, given that it was my one chance a week to be myself? My heart was pounding as I tiptoed through the living room. I know the quietest way to wash up, too: picking up and putting down the cup and face wash with this technique where you pretend each thing is heavier than it is. Imagine the cup is made of brick, so that as you put it down you’re also lifting it up, resisting its weight — the opposite of this would be just dropping it, letting gravity put it down. When I walk past Harris’s bedroom I think <em>glide, glide, glide</em>.</p></blockquote>\n\n<p>See also Edith’s diary comics: <a href=\"https://kottke.org/24/07/reading-miranda-julys-all-fours\">Reading Miranda July’s All Fours</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/All%20Fours\">All Fours</a> · <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Miranda%20July\">Miranda July</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/07/parker-or-driver\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"2762e7477a7a896c9c37d23e1fb9f17882e6b8e8b6c216dab711b5baeb5e520a","category":"default"}