{"title":"Benefits of a daily diary and topic journals","link":"https://sive.rs/dj","date":1548633600000,"content":"<p>\nYou know those people whose lives are transformed by meditation or yoga or something like that?\n</p><p>\nFor me, it’s writing in my diary and journals.\nIt’s made all the difference in the world for my learning, reflecting, and peace of mind.\n</p><p>\nAfter 20+ years of doing this, here’s what I do and recommend:\n</p>\n<h3>\nA daily diary\n</h3>\n<p>\nIf digital, use only plain text.\nIt’s a standard format not owned by any company.\nIt will be readable in 50 years on devices we haven’t even imagined yet.\nDon’t use formats that can only be read by one program, because that program won’t be around in 50 years.\nDon’t use the cloud, unless you’re also going to download it weekly and back it up in plain text outside that cloud.\n(Companies shut down. Clouds disappear. Think long-term.)\n</p><p>\n<strong>\nEvery day at some point, just open up this diary, write today’s date, then start writing.\n</strong>\nWrite what you did today, and how you are feeling, even if it seems boring.\n</p><p>\nIt works best as a nightly routine.\nJust take a few minutes and write at least a few sentences.\nIf you have time, write down everything on your mind.\nClear it all out.\nBut if you miss a night, make time the next morning to write about the previous day.\n</p><p>\nThis is important because years from now you might be looking back, wondering if you were as happy or as sad as you remember during this time.\nSo don’t only write the drama or dilemmas.\nInclude the daily facts of life.\n</p><p>\nWe so often make big decisions in life based on predictions of how we think we’ll feel in the future, or what we’ll want.\nYour past self is your best indicator of how you actually felt in similar situations.\nSo it helps to have an accurate picture of your past.\n</p><p>\nYou can’t trust distant memories, but you can trust your daily diary.\nIt’s the best indicator to your future self (and maybe descendants) of what was really going on in your life at this time.\n</p><p>\nIf you’re feeling you don’t have the time or it’s not interesting enough, remember:\n<strong>\nYou’re doing this for your future self.\n</strong>\nFuture you will want to look back at this time in your life, and find out what you were actually doing, day-to-day, and how you really felt back then.\nIt will help you make better decisions.\n</p><p>\nJust put aside a few minutes to write what you did and how you felt today.\n</p>\n<h3>\n“Thoughts On” journals\n</h3>\n<p>\nThere are certain subjects in your life you think about a lot.\nPeople, places, hobbies, health, plans, finances. \n</p><p>\n<strong>\nFor each subject that you might have ongoing thoughts about, start a separate “Thoughts On” journal.\n</strong>\nWhenever you have some thoughts on this subject, open up that file, write today’s date, then start writing.\n</p><p>\nTo give you an example, here are my “Thoughts On” journals as of today:\n</p>\n<ul>\n<li>\nAccounting\n</li>\n<li>\nAddiction\n</li>\n<li>\nAirports\n</li>\n<li>\nAlcohol\n</li>\n<li>\nAmbition\n</li>\n<li>\nAnimation\n</li>\n<li>\nAppDevelopment\n</li>\n<li>\nArtist\n</li>\n<li>\nAssistant\n</li>\n<li>\nBeingSocial\n</li>\n<li>\nBlog\n</li>\n<li>\nBookNotes\n</li>\n<li>\nBookPublishing\n</li>\n<li>\nCalendar\n</li>\n<li>\nCarla\n</li>\n<li>\nChanges\n</li>\n<li>\nChess\n</li>\n<li>\nChinese\n</li>\n<li>\nCities\n</li>\n<li>\nComedy\n</li>\n<li>\nComparing\n</li>\n<li>\nComputers\n</li>\n<li>\nConferences\n</li>\n<li>\nCountries\n</li>\n<li>\nDance\n</li>\n<li>\nDog\n</li>\n<li>\nEntrepreneur\n</li>\n<li>\nErika\n</li>\n<li>\nEurope\n</li>\n<li>\nEventStrategy\n</li>\n<li>\nExpat\n</li>\n<li>\nExploreExpand\n</li>\n<li>\nFame\n</li>\n<li>\nFan\n</li>\n<li>\nFriends\n</li>\n<li>\nGoals\n</li>\n<li>\nGratification\n</li>\n<li>\nHabits\n</li>\n<li>\nHome\n</li>\n<li>\nIdealMe\n</li>\n<li>\nImage\n</li>\n<li>\nInfrastructure\n</li>\n<li>\nIntense\n</li>\n<li>\nInterviews\n</li>\n<li>\nInvesting\n</li>\n<li>\nIreland\n</li>\n<li>\nKissing\n</li>\n<li>\nLanguageLearning\n</li>\n<li>\nLateralThinking\n</li>\n<li>\nLifeAlgorithms\n</li>\n<li>\nMakeIdeas\n</li>\n<li>\nManners\n</li>\n<li>\nMobileAppDev\n</li>\n<li>\nMoney\n</li>\n<li>\nMusic\n</li>\n<li>\nMyPeople\n</li>\n<li>\nNeed\n</li>\n<li>\nNewZealand\n</li>\n<li>\nNoise\n</li>\n<li>\nOS\n</li>\n<li>\nOxford\n</li>\n<li>\nParenting\n</li>\n<li>\nPhone\n</li>\n<li>\nPhoneNumbers\n</li>\n<li>\nPlaces\n</li>\n<li>\nPlan\n</li>\n<li>\nPoor\n</li>\n<li>\nPortugal\n</li>\n<li>\nPotential\n</li>\n<li>\nProgramming\n</li>\n<li>\nPublicMe\n</li>\n<li>\nRV\n</li>\n<li>\nRegrets\n</li>\n<li>\nRelationship\n</li>\n<li>\nRenting\n</li>\n<li>\nRomance\n</li>\n<li>\nRoutine\n</li>\n<li>\nSecrets\n</li>\n<li>\nSex\n</li>\n<li>\nSingapore\n</li>\n<li>\nSkills2Learn\n</li>\n<li>\nSocial\n</li>\n<li>\nSolitude\n</li>\n<li>\nSongwriting\n</li>\n<li>\nSpeaking\n</li>\n<li>\nStrength\n</li>\n<li>\nSurprise\n</li>\n<li>\nTeachers\n</li>\n<li>\nTech\n</li>\n<li>\nThinkingSelf\n</li>\n<li>\nThrifty\n</li>\n<li>\nTravel\n</li>\n<li>\nVirtualReality\n</li>\n<li>\nVision\n</li>\n<li>\nWebsite\n</li>\n<li>\nWorthDoing\n</li>\n<li>\nWriter\n</li>\n</ul>\n<p>\nI find it so useful to keep my thoughts on each subject together, because I can see my past thoughts and current thoughts in one place.\nI can see how my thoughts on this subject have evolved or keep repeating.\nSometimes I think I have a new thought on a subject, so I open up the file and write it down, then afterwards I see I had that same thought a year ago and had forgotten about it.\n<strong>\nIf you care about your thoughts, keep them.\n</strong>\n</p><p>\nThey can be tiny.\nLike you see I have one on airports.\nI don’t have many thoughts on airports.\nI don’t fly that much.\nBut I found that once or twice a year, when waiting at the gate, I had thoughts on the subject, so I’d open that file and start writing.\n</p><p>\nI’ve considered making one for every musician, album, book, or film that’s had an impact on me, that I’d like to think more about.\nWhy not?\nI admire the way that a good critic puts in hours of reflection on each piece, thinking deeper about something they’ve just taken in.\n</p><p>\nI especially like my “Regrets” journal.\nWhenever I do something I regret, I write it down there, noting why I regret it, what I wish I would have done instead, and how I hope to prevent this in the future.\n</p>\n<h3>\nAsk yourself questions, then question your answers.\n</h3>\n<p>\nWhether in your daily diary, or the “Thoughts On” journals, I find the single most useful thing has been using it as a place to ask myself questions, and answer them.\n</p><p>\nIf I’m planning on doing something, I ask myself what I hope to get out of it, why, and whether there are other ways to get what I want.\n</p><p>\nWhen I’m feeling conflicted, especially, I’ll ask myself a bunch of questions to work through my feelings, looking for the source of the conflict, then ask myself more questions around the clash in values, and work through other alternate ways I’d like things to be.\n</p><p>\n<strong>\nI answer with my initial thought first, but then question it afterwards with skepticism, and consider different perspectives.\n</strong>\nI hear this is similar to <a href=\"https://en.wikipedia.org/wiki/Cognitive_behavioral_therapy\">cognitive behavioral therapy</a> — and I’ve been meaning to learn more about that.\nBut whatever you call it, I think it’s been the single most important thing to my intellectual and emotional development.\n</p><p>\nAlmost all the thoughts I have on any subject are the result of writing in my diary and journals, then questioning myself and working through alternate ways of thinking about it, and finally returning to the subject days or months later with a clear head and updated thoughts, seeing how they’ve changed or not over time.\n</p><p>\nI hope it helps you too.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"283abc87a758c40b30accda0bfdbd7491eca299a13ba8d5a78f559ad87cda13a","category":"Sites"}