{"title":"Vitalik: An Ethereum Story","link":"https://www.usv.com/writing/2024/09/vitalik-an-ethereum-story-3/","date":1726850035000,"content":"<p>When you think of founders who have been massively successful in bringing new and novel technologies and companies to market, you don’t normally think of a nomad who has been living out of a single backpack for over a decade. You don’t think of someone who talks like a modern-day Peter Kropotkin . You don’t think of someone who walks through life with a childlike wonder for bugs, plants, and animals.</p>\n<p>But that is exactly who Vitalik Buterin is.</p>\n<p>I had the pleasure of attending the premier of Vitalik: An Ethereum Story on Wednesday night at the Angelika Film Center in NYC.</p>\n<p>This film is nominally about the Ethereum blockchain and developer ecosystem. But it is actually an opportunity to spend just under ninety minutes with Vitalik learning about him and how he lives, thinks, and how he became who he is.</p>\n<p>I have been in and around the blockchain sector for almost fifteen years. I am a fan and a holder of Bitcoin. I am a fan and a holder of Solana. I am a fan and a holder of Ethereum. I am a fan and a holder of many other protocols, tokens, and communities. I am all in on all of this.</p>\n<p>But I will say that Vitalik has a special place in my head and heart. He doesn’t just talk a good game. He lives his beliefs and leads from there. He is a very special human. And this film does a great job of showcasing that.</p>\n<p>This film was funded by an Ethereum crowdfund on Mirror.xyz and is now being streamed onchain at ethereumfilm.xyz . If you want to stream it, you go there , mint an NFT for $20, and can stream it on your computer or on your TV if you connect an HDMI cable or airplay to AppleTV. The proceeds of the NFT sales will go towards getting a distribution deal with a major streamer so that this film can reach the general public.</p>\n<p>Here’s a trailer if you want to try before you buy:</p>\n<p>I think the general public needs to know about Vitalik. The narrative around crypto, blockchains, and web3 is mostly about speculation and scamming. Vitalik is the opposite of all of that and his story can help the mainstream understand this sector and the potential of it.</p>\n<p>So if you want to meet a very special human being, take some time this weekend and stream Vitalik: An Ethereum story. I hope you enjoy it as much as I did.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/vitalik-an-ethereum-story-3/\">Vitalik: An Ethereum Story</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"28c0d20a3078230f85bbe156d5cc6bda1864e42a646b94b4f431f0116a19dc31","category":"Sites"}