{"title":"Big Bite Hot Dog Sparkling Water from 7-Eleven","link":"https://kottke.org/24/03/big-bite-hot-dog-sparkling-water-from-7-eleven","date":1711552698000,"content":"\n        <p>I get furious every spring there isn’t an iced tea soda because I just want to try it once even though I know it would probably be terrible and we have chocolate milk soda and I can’t get iced tea soda? It’s madness is what it is. </p>\n\n<p>The lack of iced tea soda is only an aside to the main news of this post, offered as preamble, because <a href=\"https://www.chewboom.com/2024/03/27/7-eleven-unveils-new-big-bite-hot-dog-sparkling-water/\">you can’t really just jump into something like hot dog seltzer water without some sort of sweetener,</a> some sort of softening the ground ahead of the news, an amuse bouche if you will. </p>\n\n<p>I’m pretty angry about this because it’s probably an April Fools joke announced early and corporations fucking lie all the time, but the least they could do is not pre-announce an April Fools joke. Now that April Fools has been coopted by try-hard brands, uh, trying too hard, a really good and cool thing for a brand to do would be to announce something what seems like a joke on April Fools and then actually deliver. No more phony bologna. If the Big Bite Hot Dog Sparkling Water is not a figment of commercial japery, if it is not a form of incorporated jackassery, if it actually exists on April 2nd, I’ll <s>eat my hat</s> drink one.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/hotdogseltzer.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/hotdogseltzer.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/hotdogseltzer.jpg 1200w\" loading=\"lazy\" width=\"678\" height=\"381\" alt=\"hotdogseltzer.jpg\" /> </p>\n\n<blockquote><p>The Big Bite Hot Dog Sparkling Water promises to encapsulate the essence of the iconic 7-Eleven hot dog experience, complete with the flavors of ketchup and mustard. This innovative beverage aims to transform the traditional pairing of hot dogs and sodas, allowing consumers to enjoy the essence of their favorite snack in a refreshing bubbly form.</p></blockquote>\n\n<p>(via <a href=\"https://bsky.app/profile/kdzwierzynski.bsky.social/post/3koonefykky2t\">@kdzwierzynski.bsky.social</a>)</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/hot%20dogs\">hot dogs</a> · <a href=\"https://kottke.org/tag/seltzer\">seltzer</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/big-bite-hot-dog-sparkling-water-from-7-eleven\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"28e7785fa058119e833c300fcda8649acf01653a8c97bee993bea7327bf03057","category":"default"}