{"title":"How to Triumph Over the Challenges of the Creative Life: Audubon’s Antidote to Despair","link":"https://www.themarginalian.org/2024/09/25/audubon-hardship/","date":1727278054000,"content":"<p>We move through the world as surfaces shimmering with the visibilia of our accomplishments, the undertow of our suffering invisible to passers-by. The selective collective memory we call history contributes to this willful blindness, obscuring the tremendous personal cost behind some of humanity’s most triumphant achievements — the <a href=\"https://www.themarginalian.org/2016/10/27/lise-meitner/\">great discoveries</a>, the <a href=\"https://www.themarginalian.org/2022/05/17/beethoven-ode-to-joy/\">great symphonies</a>, the <a href=\"https://www.themarginalian.org/2017/01/27/rachel-carson-silent-spring-dorothy-freeman/\">great paradigm shifts</a>. This is not to say that suffering is a prerequisite for greatness — I don’t subscribe to <a href=\"https://www.themarginalian.org/2017/09/14/elizabeth-barrett-browning-art-suffering/\">the dangerous myth of the tortured genius</a>. But because the engine of all creative energy is connection, suffering can serve as a mighty instrument of unselfing, of contacting that place where the spirit meets the bone of being, that common core of human experience. “It is only through the gates of suffering, either mental or physical,” a gifted young poet who wouldn’t live past 30 <a href=\"https://www.themarginalian.org/2022/08/11/anne-reeve-aldrich-emily-dickinson/\">wrote to Emily Dickinson</a>, “that we can pass into that tender sympathy with the griefs of all of mankind which it ought to be the ideal of every soul to attain.” People of uncommon creative vision have often touched the soul of humanity not because of their suffering but through it. Perhaps the supreme mark of greatness is leaving something of substance and sweetness in the mouth of the world despite the bitter disappointments and heartbreaks you suffer. (I wrote <a href=\"https://www.themarginalian.org/2018/11/01/figuring/\"><em>Figuring</em></a> largely as an ode to seven such people.) </p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Wood-ChestedWarblers.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-chestnut-sided-wood-warbler-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-chestnut-sided-wood-warbler-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p><a href=\"https://www.themarginalian.org/tag/john-james-audubon/\">John James Audubon</a> (April 26, 1785–January 27, 1851) was eighteen when he arrived alone in America with a fake passport, fleeing conscription in Napoleon’s army. Born Jean-Jacques Rabin, he was the illegitimate son of a French plantation owner and a Creole mother who had died in a slave rebellion when he was a small boy. The love of birds that had buoyed him through a lonely childhood became the guiding passion of his new life. Despite having only rudimentary portraiture training, he taught himself to draw nature and set out “to complete a collection not only valuable to the scientific class, but pleasing to every person.” He winced at his first attempts — “My pencil gave birth to a family of cripples.” — but her persisted. Every year, he would burn entire batches of bird drawings that didn’t satisfy him and start all over, often spending fourteen continuous hours on a single bird.</p>\n<p>All the while, struggling to support his family, he tried his hand at various businesses — indigo, a saw mill, a steamer — all ending catastrophically, costing him more than he had put in. Accepting that he had no gift for business, Audubon leaned on his creative gifts: He gave dance lessons, drew portraits in black chalk for $5 each, wrote to President Monroe in the hope of getting an appointment as artist and naturalist on a government expedition. (He never heard back.) </p>\n<p>The hardships kept coming. While traveling down the Mississippi, a bottle of gunpowder exploded in his chest, damaging 200 of his bird drawings. He had left another 200 in storage with a friend, only to discover upon his return that “a pair of Norway rats had taken possession of the whole, and reared a young family among gnawed bits of paper, which but a month previous, represented nearly one thousand inhabitants of the air!”</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=680%2C1007&amp;ssl=1\" width=\"680\" height=\"1007\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=320%2C474&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=600%2C889&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=240%2C355&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=768%2C1137&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_Japanese_TheMarginalian.jpg?resize=1037%2C1536&amp;ssl=1 1037w\" /><figcaption>19th-century Japanese woodblock depicting Audubon’s discovery of the rat-savaged drawings.</figcaption></figure>\n<p>Despite the biochemical blessing of a bright disposition, Audubon felt at times that his spirit would break from the weight of disappointment, and yet his passion for the work buoyed him, saved him. From the fortunate platform of his old age, he would look back on one especially dispiriting period early in the project:</p>\n<blockquote><p>The world was with me as a blank, and my heart was sorely heavy, for scarcely had I enough to keep my dear ones alive; and yet through these dark ways I was being led to the development of the talents I loved, and which have brought so much enjoyment to us all.</p></blockquote>\n<p>Throughout the struggle, Audubon kept at his vision. He worked tirelessly, with fiery passion bordering on possession. In the <a href=\"https://www.amazon.com/Audubon-His-Journals-Labrador/dp/1523644095/?tag=braipick-20\" target=\"_blank\">journal</a> later edited by his grand-daughter Maria, he writes during on particularly flaming stretch in the autumn of 1829:</p>\n<blockquote><p>I wish I had eight pairs of hands… still I am delighted at what I have accumulated in drawings this season. Forty-two drawings in four months, eleven large, eleven middle size, and twenty-two small, comprising ninety-five birds, from Eagles downwards, with plants, nests, flowers, and sixty different kinds of eggs. I live alone, see scarcely any one, besides those belonging to the house where I lodge. I rise long before day and work till nightfall, when I take a walk, and to bed.\n</p></blockquote>\n<p>When he pitched his book of birds to publishers, he got only rejections. And so, like Whitman would a quarter century later, Audubon decided to self-publish his magnum opus, relying on subscribers, asking for a pledge of $1,000 for the full body of work. It took him four years to complete the first volume, by which point he had lost more than a third of his subscribers. </p>\n<figure><a href=\"https://society6.com/product/bird-divinations-chestnut-sided-wood-warbler-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=680%2C1114&amp;ssl=1\" width=\"680\" height=\"1114\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=320%2C524&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=600%2C983&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=240%2C393&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=768%2C1258&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/SummerRedBird_suffering.jpg?resize=938%2C1536&amp;ssl=1 938w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-chestnut-sided-wood-warbler-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-summer-red-bird-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>America, too unrefined in its art and too young in its science, did not seem ready for him. So Audubon headed to Europe in search of subscribers, painting the ship’s cabins to pay his passage, drawing portraits of a shoemaker and his wife to acquire proper shoes. The trip was his wife’s idea. While his friends thought him a madman to keep laboring at something doomed to failure, Lucy’s encouragement sustained him. “My wife determined that my genius should prevail, and that my final success as an ornithologist should be triumphant,” he would later reflect. </p>\n<p>An American born in England, Lucy had helped Jean-Jacques become John James not only on paper but in his mastery of the new language that eventually made him one of the most lyrical nature writers humanity has produced, writing about birds the way he felt about them: with reverence, tenderness, and poetic ardor. </p>\n<p>To assist with the publication of her husband’s work, Lucy began teaching — tirelessly, taking on more and more students, until she was earning a staggering $3,000 per year: more than $100,000 today. An epoch before Arthur Rackham <a href=\"https://www.themarginalian.org/2016/02/01/arthur-rackham-alice-in-wonderland/\">revolutionized the business of book art with his <em>Alice in Wonderland</em> illustrations</a>, printing books with text and color images was an expensive and laborious process. By the time Audubon completed his <em>Birds of America</em>, the final work — an immense four-volume “Double Elephant Folio” — had cost him $115,640 to print: more than $2,000,000 today. It had taken him fourteen years. “Few enterprises, involving such labour and expense, have ever been carried through against such odds,” the great naturalist <a href=\"https://www.themarginalian.org/tag/john-burroughs/\">John Burroughs</a> exulted in his short and splendid <a href=\"https://www.amazon.com/John-James-Audubon-Burroughs/dp/1499648014/?tag=braipick-20\" target=\"_blank\">biography of Audubon</a>. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?resize=680%2C883&amp;ssl=1\" width=\"680\" height=\"883\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?w=800&amp;ssl=1 800w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?resize=320%2C416&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?resize=600%2C779&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?resize=240%2C312&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Audubon_JohnSyme.jpg?resize=768%2C997&amp;ssl=1 768w\" /><figcaption>John James Audubon by John Syme (White House Historical Association)</figcaption></figure>\n<p>Adding his voice to the chorus of beloved writers who <a href=\"https://www.themarginalian.org/2020/06/14/nature-depression/\">salved their suffering with nature</a> and those who <a href=\"https://www.themarginalian.org/2024/07/16/solitude/\">found solace in solitude</a>, Audubon looks back on what saved him in those challenging years:</p>\n<blockquote><p>One of the most extraordinary things among all these adverse circumstances was that I never for a day gave up listening to the songs of our birds, or watching their peculiar habits, or delineating them in the best way that I could; nay, during my deepest troubles I frequently would wrench myself from the persons around me, and retire to some secluded part of our noble forests; and many a time, at the sound of the wood-thrush’s melodies have I fallen on my knees, and there prayed earnestly to our God.</p>\n<p>This never failed to bring me the most valuable of thoughts and always comfort, and, strange as it may seem to you, it was often necessary for me to exert my will, and compel myself to return to my fellow-beings.</p></blockquote>\n<p>In the end, every artist’s art is their coping mechanism for the soul-aches of living, and what we make of our creative potential is largely a matter of how we bear our suffering, of learning to save ourselves by finding and feeding those things that most reliably nourish our strength and our sanity — friendships and forests, song and sea, and above all the tug of wonder.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"28f877483607166bdd80dbbaa73ac1a4b986882fcb9d229b431f68be44fc2488","category":"Sites"}