{"title":"America's various horrible uncles","link":"https://www.garbageday.email/p/america-s-various-horrible-uncles","date":1729111393000,"content":"<div><div><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/030ec099-8396-495a-8910-2948c3e68750/pwcaroline.png?t=1729109681\" /></div><p>Sorry today’s issue is so late. There was a big bug preventing me from logging in, but it seems to be fixed now. I always try and hit that beautiful post-lunch nexus where you don’t want to work but want to look like you’re working. Anyways, first up, there’s a Panic World out today. It’s with Caroline Calloway and it’s all about the long history of the women the internet loves to hate. We recorded it before the hurricane, in case you’re wondering. It was a great conversation and you can find it on all podcast apps. <b><a href=\"https://podcasts.apple.com/us/podcast/panic-world/id1740187810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Here’s a link if you need one!</a></b></p><hr /><h2>Disinfo Just Not Hitting The Way It Used To fr fr</h2><p>One of the most interesting things about this election is how limp right-wing disinformation has felt. The biggest op of the summer was the racist swarm around Haitian immigrants in Springfield, Ohio, and even with a big debate night signal boost from former President Donald Trump, it still never really reached the point where it felt like real people actually believed it. Nor did it ever fully connect back to the election. The most it really amounted to, at least on a national level, was a series of debunks and <a href=\"https://www.tiktok.com/@mda_27/video/7414597345213484331?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">a TikTok dance</a> dunking on Trump for ranting about it. (Though, it did lead to some genuinely <a href=\"https://apnews.com/article/springfield-ohio-haitian-immigrants-threats-key-details-7594bae869fb05dc6f106098409418cc?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">very scary activity</a> on the ground in Springfield.)</p><p>And I have a few theories as to why the Republicans aren't successfully jamming up the works this time around. The first is that the mainstream media just isn't playing ball this time. Is it because the media has gotten institutionally smarter about giving these stories oxygen? Is it because industry-wide layoffs have gutted newsrooms across the country and now there's just fewer reporters to throw at stupid shit editors saw on Twitter/X? Is it because cable news audiences are literally dying off? Is it because Facebook has gotten rid of news content? Who knows, but things have changed in that regard.</p><p>Another big reason right-wing disinfo is not hitting the way it used to is because conservatives are still clearly reeling from being totally caught off guard by the JD Vance couch meme. It was the first time, maybe ever, that their own tactics were successfully turned against them in such a big way and I think it made a lot of Republican strategists really scared actually. It also made them extremely desperate. Which is why they immediately tried to spin up a story about Gov. Tim Walz drinking <a href=\"https://www.snopes.com/fact-check/walz-horse-semen-stomach-false/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">horse semen</a> as a counter. And that brings us to, probably, the most important reason none of this is working like it once did. </p><p>After living a decade-plus inside their own filter bubble, most right-wing influencers have lost touch with reality in a profound way. The last real place they could influence some kind of political middle ground was Twitter and their favorite billionaire turned it into 4chan. Meanwhile, every other digital space has finally given up and is, like in the case of Instagram, <a href=\"https://www.washingtonpost.com/technology/2024/10/16/instagram-limits-political-content-shadowban-election-posts/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">quite literally</a> disappearing political content. They just don't want to deal with it anymore. And it turns out if you don't have at least one foot in the real world, you aren't very good at crafting a psyop. Which is why you probably haven't even heard about the newest right-wing disinfo campaign.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/83b36882-7390-4f9c-a680-ad2f4ac26e9c/Screenshot_2024-10-16_at_4.22.08_PM.png?t=1729110150\" /><div><span><p>(Even the Community Notes are cooking him.)</p></span></div></div><p>Over the weekend, an X user going by @DocNetyoutube <a href=\"https://x.com/search?q=from%3A%40DocNetyoutube+Tim+Walz+Post&amp;src=typed_query&amp;f=live&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">started sharing</a> a series of \"reports\" that Walz \"groomed\" a male student at an Indigo Girls concert in the 90s. And even though @DocNetyoutube's posts <a href=\"https://x.com/Cancelcloco/status/1845844051255496965?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">are filtering up</a> into some right-wing videos, they have been <a href=\"https://x.com/agentself99b/status/1845600169078731259?s=46&amp;t=o1v3EY9BAOX9j9yUovQCKg&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">thoroughly debunked</a>. The emails that @DocNetyoutube is sharing screenshots of aren't formatted correctly and you can even see his cursor in one of the screenshots. </p><p>@DocNetyoutube's allegations are part of a wider \"<a href=\"https://x.com/MithaLaw/status/1845691261136580743?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Walz is a groomer</a>\" narrative conservatives across the web are pushing right now. A narrative that, as <a href=\"https://www.newsguardrealitycheck.com/p/unverified-grooming-accusation-against?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">NewsGuard reported</a>, is almost definitely being amplified by Russian chaos agents. And as <span><i>Mother Jones</i></span> <a href=\"https://www.motherjones.com/politics/2024/10/a-maga-conspiracist-is-trying-to-launch-a-lurid-lie-about-tim-walz-and-its-working/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">reported</a>, however, the Walz groomer conspiracy did manage to get picked up by several Google News chum sites. Which really only further illustrates the issue here.</p><p>The online pathways that the right wing have relied on since 2015 to, not just win elections, but shape America's national discourse are gone. And it's almost entirely because pathologically annoying conservatives pushed everyone else out. All of the viral energy around Walz might turn into something that America's various horrible uncles might ramble about incoherently at the Thanksgiving table in a few weeks — if Harris wins, I guess — but unless a Republican operative Mr. Magoo's themselves into a real scoop about Walz's past, none of this is really going to move the needle. Which actually leaves us in a curious spot 19 days out from the election. In fact, <i><a href=\"https://www.rollingstone.com/politics/politics-features/trump-elon-musk-republicans-super-pac-election-2024-1235134877/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Rolling Stone</a></i><a href=\"https://www.rollingstone.com/politics/politics-features/trump-elon-musk-republicans-super-pac-election-2024-1235134877/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\"> reported</a> this week that Trump's team has grown frustrated with how badly the Elon Musk-led America PAC is doing in battleground states. Largely because of its focus on X and a lack of boots on the ground irl. Which is compounded by Trump<a href=\"https://www.thedailybeast.com/donald-trump-cancels-mainstream-tv-interview-on-cnbcs-squawk-box?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\"> pulling out</a> of buzzy TV interviews. And so, without coherent digital spaces to influence — or manipulate — the election and a right wing that’s still completely obsessed with stupid online garbage, it's quite possible that we're just… going to have an election. Sorta like we used to.</p><p>I assume something deranged will happen the minute after I hit publish on this. But one can always hope.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/77af9055-e657-4fb2-bee6-bf3630668113/data.png?t=1729109667\" /></div><p><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Delete your personal data</a></p><p>Spam, scams, and fraud start with your personal data being sold. Data brokers are profiting from your home address, SSN, phone number, and other personal information that doesn’t belong to them. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Incogni scrubs your personal info</a> from the web. Simple as. It takes 3 minutes to set up, tackles 180+ data brokers and people-search sites, and there’s a 30-day money back guarantee. Protect your data, your time, and your sanity. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Get Incogni today and never look back</a>.</p><p><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Use code DAYDEAL today for a 55% annual plan discount →</a></p><hr /><h2>One Week Until Garbage Day Live!!!!!</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/42b406ca-1e20-4c55-bdd6-7b3169da7ba4/ELECTION_POSTER_new.png?t=1729109940\" /></div><p>Wahooooo!!! One week until Garbage Day Live at the Bell House in Brooklyn. We’ve got great guests. A lot of fun surprises. Maybe even a special merch thing??? Make sure to grab your tickets now! <a href=\"https://concerts.livenation.com/garbage-day-presents-america-the-final-brooklyn-new-york-10-23-2024/event/3000613921D757CA?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">You can do that by heading here</a>. See you next week!!! By the way, if you’ve ever been on the fence about coming out to a show, I don’t have any more lined up for the rest of the year. So now’s the time!</p><hr /><h2><span>Some Good French Content</span></h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@tatatopsecret?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\"> @tatatopsecret </a><p></p></section></blockquote><hr /><h2>An AI Made A Conference Speaker's Photo More Sexual</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/f156e3d3-9fcb-4516-9621-f202bbac27fe/Screenshot_2024-10-16_at_4.15.21_PM.png?t=1729109738\" /><div><span><p>(<a href=\"https://x.com/elizlaraki/status/1846252781851890026?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">x.com/elizlaraki</a>)</p></span></div></div><p>Elizabeth Laraki, a design partner at Electric Capital, shared a story on X this week about how her speaker photo, when shared on social, looked slightly different than it did when she provided it to the conference she was attending. Laraki contacted the conference and discovered that their social media manager fed it into an AI and it basically invented a hint of a bra underneath her clothes.</p><p>We've <a href=\"https://www.pbs.org/newshour/science/study-shows-ai-image-generators-are-being-trained-on-explicit-photos-of-children?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">known for a while</a> that many popular image generators are trained on pornographic material, as well as child sexual abuse material. We also know that generators have all sorts of biases built into them and will over-sexualize photos of women and certain races. So this is not a huge surprise.</p><p>But the thing that I find the most interesting here is that what happened to Laraki was because the conference's social media manager wanted to better format her photo to share on social platforms. I've tried to articulate this point a few different ways over the years, but I've never been quite satisfied with it. I am continually amazed at how much of the supposed utility of generative AI is based around solving completely made up problems created by social platforms. Can't post words online anymore because a platform like Instagram wants an image? They can make you one. Can edit your image to fit the aspect ratio that the platform currently wants? AI can do it. Now the platform wants video because it's decided video is worth more to advertisers? The AI can spit out a video. It's all totally arbitrary. Just bots being forced to make content to please other bots.</p><hr /><h2>It Is Time To, Once Again, Ask, What Is Threads?</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/dcf381ad-b440-41b5-bd05-3c58cf400666/Screenshot_2024-10-16_at_4.16.28_PM.png?t=1729109801\" /><div><span><p>(Please, Daddy Zucc, get this demon out of my feed.)</p></span></div></div><p>Threads, a website Meta created specifically for <span><i>Business Insider</i></span> reporter Katie Notopoulos, apparently, rolled out an update that currently shows if a user is online. A little green circle next to their name, like if they were on AIM or something. It is, quite possibly, the most confounding product update Threads has made so far. Which really says something because the platform already feels like a bunch of Meta leftovers strung together.</p><p>But now, they've got this little live button. Which clearly must mean <span><i>something</i></span>, right? Like it must imply some kind of use case. Threads head Adam Mosseri <a href=\"https://www.threads.net/@mosseri/post/DBJwcFby-41?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">wrote</a>, \"We hope that knowing when your people are online makes it easier to have conversations.\" Which is funny because a “I’m online” button is something that no other platform like Threads has ever needed to get people to talk to each other. Usually they just do it because using the site is fun. Also, apparently, not even the creators Meta <a href=\"https://www.engadget.com/social-media/creators-getting-paid-to-post-on-threads-dont-understand-its-algorithm-either-065736099.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">is paying to use the site</a> know how it works or what they're supposed to do with it.</p><hr /><h2>Twitch's Stinkiest Man Was Suspended</h2><p>Zack Hoyt is a streamer that goes by the name Asmongold and is someone I spend a lot of time and energy trying to never look at or think about. He just had one of his accounts temporarily suspended from Twitch after going on a <a href=\"https://www.pcgamer.com/hardware/streaming/asmongold-suspended-from-twitch-following-racist-tirade-about-palestinians/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">lengthy genocidal rant</a> about Palestinians. </p><p>If you've never encountered Asmongold, he's a borderline hoarder that goes live from a <a href=\"https://thesportsrush.com/streamer-news-story-behind-asmongolds-room/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">roach-infested bedroom</a> whose teeth <a href=\"https://www.reddit.com/r/LivestreamFail/comments/hfog2f/asmongolds_teeth_rotting_live_on_stream/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">were literally rotting</a> on stream at one point. He is, also, unfortunately, extremely popular with a certain kind of guy. I assume other guys whose teeth are falling out of their heads. </p><p>Hoyt has addressed the ban, however, and his apology video is a lot more nuanced than you might expect. \"I’ve been slowly devolving into the most mean-spirited, just, I don't even know what the word is for it, rude, nasty, callous psychopathic version of myself,\" he <a href=\"https://www.reddit.com/r/youtubedrama/comments/1g53knj/asmongold_explains_himself/?rdt=54351&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">says in the video</a>. \"A lot of my friends have told me.\"</p><p>As <span><i>Kotaku</i></span>'s Alyssa Mercante <a href=\"https://x.com/alyssa_merc/status/1846600931615330738?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">pointed out</a>, this is a known pattern for gamers like Hoyt, who all seem to start getting sucked into their own feedback loop. \"This is a pattern. This has happened before with men and the internet. It's not a coincidence,\" Mercante wrote. Unfortunately, Hoyt's audience <a href=\"https://x.com/airbagged/status/1846599896993800529?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">is not taking it</a> nearly as well.</p><hr /><h2>A Random French Guy Might Be Driving Up Trump's Polymarket Position</h2><p>There is an account on Polymarket, the crypto-powered online prediction market, called Fredi9999 that currently has a $26 million bet on Trump winning the election next month. There have been rumors swirling for weeks about who Fredi9999 is and whether or not they're part of <a href=\"https://www.benzinga.com/markets/cryptocurrency/24/10/41363075/26m-bet-on-trumps-election-victory-fuels-speculation-of-coordinated-activity-on-polymarket?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">a concerted effort</a> to manipulate Polymarket's US election market.</p><p>An X user named @Domahhhh has been working with other users to try and unmask Fredi9999 and it seems like he's gotten pretty close. You can read <a href=\"https://x.com/Domahhhh/status/1846597997507092901?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">his whole post</a> here, but the gist is that Fredi9999 is likely French, possibly a degenerate gambler, also possibly part of a financial scam, and they don’t think Vice President Kamala Harris can win Pennsylvania.</p><hr /><h2><span>A Fascinating Discussion About </span><span><i>Magic: The Gathering</i></span></h2><blockquote><p></p><p></p><p></p><a href=\"https://twitter.com/stephenasmith/status/1846215856394547202?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\"><p> — Stephen A Smith (@stephenasmith) <br /> 3:45 PM • Oct 15, 2024 </p></a></blockquote><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.theguardian.com/world/2024/oct/16/revealed-international-race-science-network-secretly-funded-by-us-tech-boss?CMP=twt_gu&amp;utm_source=Twitter&amp;utm_medium#Echobox=1729083918\" target=\"_blank\">The Adult FriendFinder guy was funding an international race science network</a></p></li><li><p><a href=\"https://sherwood.news/culture/fortnite-epic-games-sensation-what-is-next/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Everything is </a><i><a href=\"https://sherwood.news/culture/fortnite-epic-games-sensation-what-is-next/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">Fortnite</a></i><a href=\"https://sherwood.news/culture/fortnite-epic-games-sensation-what-is-next/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\"> now</a> (Adam and I wrote this one!)</p></li><li><p><a href=\"https://www.wired.com/story/jd-vance-adviser-posted-drug-use-reddit-cocaine-gas-station-heroin/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">\"JD Vance Adviser Posted on Reddit for Years About Use of Cocaine, ‘Gas Station Heroin,’ Other Drugs\"</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://x.com/samsykesswears/status/1845857319214588378?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-s-various-horrible-uncles\" target=\"_blank\">a waffle</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=6064775b-63b8-4ce3-824c-c63a142cc9e6&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"292a9d5d17e6552aaed18068ca6048117afdcc381487fd3fe6477efde5f9fe18","category":"Sites"}