{"title":"Blowing off work to play","link":"https://sive.rs/hooky","date":1570320000000,"content":"<p>\nWhat do you call it when you skip school or work for a day, to do whatever you want instead?\nIn America, we call it playing hooky.\nIn England, we call it skiving.\n(Got another word for it?)\n</p><p>\nSome of my best, most productive, and enjoyable days have been while playing hooky.\n</p><p>\nI think it’s a healthy practice, to occasionally blow off a previous commitment, and do whatever you want instead.\nIt’s a great reminder that you’re the boss of your life.\n</p><p>\nBut it’s interesting how productive I am on those days.\n</p><p>\nWhen I think back about the times in my life where I got the most done, created the most, or had a major breakthrough in some aspect of my life, it was often <strong>while I was supposed to be doing something else.</strong>\n</p><p>\nFor example:\nI’d sign up for a three-day conference, show up to registration, decide I don’t want to go, then sit in my hotel room, uninterrupted, and get some great work done for three days.\n</p><p>\nThis has happened multiple times.\nI really should stop signing up for conferences!\n</p><p>\nOr…\n<strong>\nCould we use this as an effective productivity technique?\n</strong>\n</p>\n<ol><li>\nSign up for something — a time commitment.\n</li><li>\nPut aside the time to do it.\n</li><li>\nWhen the day comes, feel the tension between what you said you would do, and what you really want to do.\n</li><li>\nBlow it off, and do what you really want instead.\n</li></ol>\n<p>\nMaybe the productivity comes from the fact that the time has already been put aside, so I suddenly have free time to do what I really wanted.\n</p><p>\nBut I suspect that when I feel that tension between the obligation and desire, it amplifies the difference, and makes it clear to me how badly I want to do this other thing.\nThen that amplified desire leads me to be more intense and focused in my actions.\n</p>\n<img src=\"/images/boyrunning.png\" alt=\"boy running\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"29a70215174f37d11ee862b0ae753ff23a411ae9085df515fa04f2f4294bc346","category":"Sites"}