{"title":"Shitty First Drafts","link":"https://www.usv.com/writing/2024/07/shitty-first-drafts/","date":1720620502000,"content":"<p>Several years ago, I read Bird by Bird by Anne Lamott. She writes about a concept called “shitty first drafts ” that has stuck with me ever since:</p>\n<p>Almost all good writing begins with terrible first efforts. You need to start somewhere. Start by getting something — anything — down on paper. A friend of mine says that the first draft is the down draft — you just get it down. The second draft is the up draft — you fix it up. You try to say what you have to say more accurately. And the third draft is the dental draft, where you check every tooth, to see if it’s loose or cramped or decayed, or even, God help us, healthy.</p>\n<p>To me, shitty first drafts is a mindset. It’s about getting ideas on the page and out of your system, however convoluted or unintelligible they may be. It’s a release of whatever pent up energy and thoughts and ideas you’ve had stewing. And it’s about not judging yourself when you put the words on the page. They’re not intended to be perfect or poetic. They’re just there to be the first step on the journey or the first rotation of the snowball rolling down the hill.</p>\n<p>I like this because it’s not just about writing. This mentality is applicable to many different things. Building and shipping products is one of them. Perfect is the enemy of good. Most of the time, you just need to start and ship and see what happens. 99% of the time you won’t get it right the first time so just get it out there and revise, revise, revise.</p>\n<p>Farcaster Jared Hecht on Warpcast All I know is ship early and often. Never seen it work any other way in consumer. https://warpcast.com/woj.eth/0x31b576ae</p>\n<p>This blog post is a shitty first draft. I’ve thought about and talked about this idea at least ten times in the past several months, and it’s time to get it out of my system. It’s a cathartic process.</p>\n<p>Anything that requires creativity is well suited to a shitty first draft. The more shitty first drafts, the merrier.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/shitty-first-drafts/\">Shitty First Drafts</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"29d0615c06fb4cf7fa0adc37736d8592e49ef8d118b841521f27abd369444706","category":"default"}