{"title":"Grace Paley on the Countercultural Courage of Imagining Other Lives","link":"https://www.themarginalian.org/2024/08/01/grace-paley-imagination/","date":1722532932000,"content":"<p><a href=\"https://www.amazon.com/Grace-Paley-Reader-Stories-Essays/dp/0374537410/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?fit=320%2C480&amp;ssl=1\" alt=\"Grace Paley on the Countercultural Courage of Imagining Other Lives\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?w=1000&amp;ssl=1 1000w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?resize=240%2C360&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/gracepaleyreader.jpg?resize=768%2C1152&amp;ssl=1 768w\" /></a></p><p>“Love is the extremely difficult realisation that something other than oneself is real,” Iris Murdoch wrote in her superb investigation of <a href=\"https://www.themarginalian.org/2022/01/08/iris-murdoch-the-sublime-and-the-good/\">the parallels between art and morality</a>. There could be no such realization without imagination, which is our only instrument for fathoming what it is like to be somebody else — that most difficult triumph of unselfing. It is only through the imagination that we are capable of empathy — in fact, the modern sense of the word <em>empathy</em> <a href=\"https://www.themarginalian.org/2016/12/14/you-must-change-rilke-rodin-empathy/\">came into use</a> just over a century ago as a way of describing the imaginative act of projecting oneself into a work of art.</p>\n<p>We are living in a strange time, a time tyrannized by a moral fashion forbidding that vital act of imagining lives radically different from our own, narrowing the permissible locus of creativity and conversation to tighter and tighter self-similarity — censure that defeats the very project of fathoming otherness in order to, in Audre Lorde’s <a href=\"https://www.themarginalian.org/2018/04/02/audre-lorde-burst-of-light-kinship-difference/\">lovely words</a>, “use each other’s differences in our common battles for a livable future.”</p>\n<p>Three decades ago, at the dawn of this tyrannical regime that continually mistakes self-righteousness for morality and enslaves the soul in servitude to identity, the poet, essayist, teacher, and political activist <strong>Grace Paley</strong> (December 11, 1922–August 22, 2007) issued a sonorous wakeup call it is not too late to hear.</p>\n<figure><a href=\"http://www.amazon.com/Just-As-Thought-Grace-Paley/dp/0374525854/?tag=braipick=20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/gracepaley.jpg?w=680&amp;ssl=1\" /></a><figcaption>Grace Paley</figcaption></figure>\n<p>Addressing other members of the Teachers &amp; Writers Collaborative she had co-founded in the 1960s, Paley — who believed that “it is the poet’s responsibility to speak truth to power” and “to learn the truth from the powerless” — offers a sentiment of astonishing relevance to our own cultural moment:</p>\n<blockquote><p>We need our imaginations to understand what is happening to other people around us, to try to understand the lives of others. I know there’s a certain political view that you musn’t write about anyone except yourself, your own exact people. Of course it’s very hard for anyone to know who their exact people are, anyway. But that’s limiting. The idea of writing from the head or from the view or the experience of other people, of another people, of another life, or even of just the people across the street or next door, is probably one of the most important acts of the imagination that you can try and that can be useful to the world.</p></blockquote>\n<p>Born just after women became citizens, having lived through and taken part in the early Civil Rights movement, having just traveled to Vietnam in her seventies to meet with and learn from Vietnamese writers, she observes:</p>\n<blockquote><p>We’re living in a time when the different peoples in this country are being heard from, for the first time. I’m happy to have lived into this period when we hear the voices of Native Americans — twenty or twenty-five years ago you didn’t even know they were writing, apart from token publication. That was the general condition of American literature at that time. The voices of African-American men and women, the voices of women of all colors, Asian women, Asian men, all these people — <em>this is our country</em> — and we’re living at a time when we can hear the voices of all these people.</p></blockquote>\n<figure><a href=\"https://society6.com/product/bird-divinations-eagle-owl-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=680%2C1074&amp;ssl=1\" width=\"680\" height=\"1074\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=320%2C506&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=600%2C948&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=240%2C379&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=768%2C1213&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/EagleOwl_majesty1.jpg?resize=972%2C1536&amp;ssl=1 972w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-eagle-owl-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-eagle-owl-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Audubon Society.)</figcaption></figure>\n<p>With an eye to the complaints of “people without imagination” who look to these tectonic shifts and “say with that denigrating tone, <em>multiculturalism</em> or <em>diversity</em> or <em>political correctness</em>,” she adds:</p>\n<blockquote><p>They use those words to try to shut all of us up. This is what the imagination means to me: to know that this multiplicity of voices is a wonderful fact and that we’re lucky, especially the young people, to be living here at this time. My imagination tells me that if we let this present political climate defeat us, my children and my grandchildren will be in terrible trouble.</p></blockquote>\n<p>Complement with James Baldwin on <a href=\"https://www.themarginalian.org/2016/11/11/james-baldwin-shakespeare-language-poetry/\">how Shakespeare found poetry in other lives</a>, then revisit Grace Paley on <a href=\"https://www.themarginalian.org/2015/09/03/grace-paley-aging/\">the art of getting older</a> — one of the loveliest things I have ever read. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"2a27b79f8fea99927ba9cc07fc829d1f8dc6e8e8a3e4ce8ad2d0a0a2a796f956","category":"default"}