{"title":"Cool tools to boost your browser","link":"https://om.co/2024/02/07/tools-to-boost-your-browser/","date":1707355202000,"content":"<p>I gave up on Google’s Chrome a long time ago and switched to Brave before it started getting flak for doing questionable things. Then Josh Miller, the co-founder of The Browser Company (whom I met during his Branch.com days), offered me a chance to try out <a href=\"https://arc.net\">Arc, </a>their new, clean, and refreshing take on a Chromium-based browser. I couldn’t resist.</p>\n\n\n\n<p>Since then, I’ve been using <a href=\"https://arc.net\">Arc</a> (initially as a beta) as one of my two go-to browsers, alongside Safari. Most Chrome extensions work seamlessly with Arc — minus what I like to call the ‘Google Chrome Crud’. Essentially, you’re not missing out on much, and you end up with a much smoother experience.</p>\n\n\n\n<p>My good buddy (and Foursquare co-founder) Naveen Selvadurai recently threw some “extension” suggestions my way that are definitely worth adding to your Arc setup. I’ve already decked out my browser with them.</p>\n\n\n\n<blockquote>\n<ul>\n<li><a href=\"https://www.raycast.com/\">Raycast</a> – I went hunting for a faster replacement to Spotlight (besides being sluggish, it never seems to match the search term to the thing I want). I found this via <a href=\"https://twitter.com/mikekarnj\">@mikekarnj</a>‘s newsletter and I am loving it so far. Extensible via scripts and extensions, and super fast too. I can’t believe it’s free (before I found this one, I went looking for open-source versions).</li>\n\n\n\n<li><a href=\"https://rectangleapp.com/\">Rectangle</a> – A free, open-source window manager to replace my old one.</li>\n\n\n\n<li><a href=\"https://underpassapp.com/tweaks/\">Tweaks for Twitter</a> – A Chrome extension that gives you a cleaner Twitter web view.</li>\n\n\n\n<li><a href=\"https://simpl.fyi/\">Simplify</a> – A Chrome extension (worth paying for, if you ask me) that gives you a cleaner, faster Gmail. Designed by <a href=\"https://twitter.com/leggett\">@leggett</a> who worked on Google Inbox.</li>\n\n\n\n<li><a href=\"https://vimium.github.io/\">Vimium</a> – A Chrome extension that bring vim keybindings to the browser so you can do things like search and jump to links without your hands leaving the keyboard.</li>\n</ul>\n<cite><a href=\"https://naveen.blog/2024/02/cool-tools-3/\">Cool tools</a></cite></blockquote>\n\n\n\n<p><em>February 8, 2024. New Delhi.</em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"2ac6a6eb9d69ad7dbfa1066adfe72028e0901f2aeac3f05f302f6406b9de4b3b","category":"default"}