{"title":"Anything You Want — third edition for 2022","link":"https://sive.rs/a3","date":1661385600000,"content":"<p>\nIn 2011, I got a phone call from a number I didn’t recognize.\n</p><p>\n“Hello?”\n</p><p>\n“Derek. It’s Seth Godin.”\n</p><p>\n“Wow! Hi Seth!”\n</p><p>\n“I’m starting a new publishing company, so I want you to write a book.  Short, like a manifesto.  Will you do it?”\n</p><p>\n“Uh, sure!”\n</p><p>\n“Great.  I look forward to it.”\n</p><p>\n“Thanks!”\n</p><p>\nOver the next eleven days, I wrote the lessons I’d learned from starting, growing, and selling my company.\nHe liked it, named it “<a href=\"https://sive.rs/a\">Anything You Want</a>”, and a few weeks later it was for sale.\nMy first book.\nSimple as that.\n</p><p>\nTo me, it was no big deal - just <a href=\"https://sive.rs/obvious\">telling my tale</a>.\nBut a lot of small business owners said my book helped them remember their purpose, and get re-excited about their business.\n</p><p>\nPenguin bought Seth’s publishing company and re-released my book on Penguin Portfolio.\nBut I wanted to self-publish.\n</p><p>\nI want to own the rights to my books so I can do what I want with them: give them away, let people <a href=\"https://sive.rs/fp\">translate them</a>, or sell them how I like.\nI’m thinking long-term.\nI’ve got many books to come, and I want them to be a matching set.\n<strong>\nSo I bought back the rights from Penguin.\n</strong></p><p>\nI improved many chapters in “Anything You Want”, and <strong>added eight new chapters</strong> that were missing — points that people kept asking about over my last ten years of talking about this book — better explanations — better stories.\n</p><p>\nThen I gave it <a href=\"https://sive.rs/a\">a new cover</a> to match all of my other books.\n(White, to represent its innocent naïveté.)\nI recorded the <strong>new audiobook</strong>, better than before.\n</p><p>\nAnd now, <strong>it’s finally available, in its third and final edition, directly from me</strong>.\n</p><p>\n“<a href=\"https://sive.rs/a\">ANYTHING YOU WANT: 40 lessons for a new kind of entrepreneur</a>”\n</p><p><strong>\nGet it at <a href=\"https://sivers.com/\">sivers.com</a>.\n</strong></p><p>\nThere are only 5000 limited-edition linen hardcovers printed, so get that version while they last.\nEven if you already read it, consider getting this as the permanent edition.\n</p><p>\nThe first copy is $19, which is <a href=\"https://sive.rs/bp\">$15 for the content, and $4 for the paper itself</a>.\n<strong>\nAll future copies cost only the price of the paper: $4.\n</strong>\nPaper books include all digital formats for free.\nAs before, I’m <a href=\"https://sive.rs/250k\">giving all profits to charity</a>.\n</p>\n<a href=\"https://sive.rs/a\"><img src=\"/images/DerekSivers-cover-AnythingYouWant-400x640.jpg\" alt=\"book cover of Anything You Want\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"2af5c94ccbfdcd217cc521b6e5451b15bcd025d3f13ec5519b8ee44806be8e32","category":"Sites"}