{"title":"My excellent Conversation with Tom Tugendhat","link":"https://feeds.feedblitz.com/~/905974121/0/marginalrevolution~My-excellent-Conversation-with-Tom-Tugendhat.html","date":1728536367000,"content":"<p>Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/tom-tugendhat/\" target=\"_blank\">the audio, video, and transcript</a>.  Here is the episode summary:</p>\r\n<blockquote><p>Tom Tugendhat has served as a Member of Parliament since 2015, holding roles such as Security Minister and chair of the Foreign Affairs Select Committee. Before entering Parliament, Tom served in in Iraq and Afghanistan. He also worked for the Foreign Office, helped establish the National Security Council of Afghanistan, and served as military assistant and principal adviser to the Chief of the Defense Staff.</p>\r\n<p>Tyler and Tom examine the evolving landscape of governance and leadership in the UK today, touching on the challenges of managing London under the UK’s centralized system, why England remains economically unbalanced, his most controversial view on London’s architecture, whether YIMBYism in England can succeed, the unique politics and history of Kent, whether the system of private schools needs reform, his pick for the greatest unselected prime minister, whether Brexit revealed a defect in the parliamentary system, whether the House of Lords should be abolished, why the British monarchy continues to captivate the world, devolution in Scotland and Northern Ireland, how learning Arabic in Yemen affected his life trajectory, his read on the Middle East and Russia, the Tom Tugendhat production function, his pitch for why a talented young person should work in the British Civil Service, and more.</p></blockquote>\r\n<p>And here is an excerpt:</p>\r\n<blockquote>\r\n<p><strong>COWEN: </strong>Okay. First question, what is your favorite walk around London, and what does it show about the city that outsiders might not understand?</p>\r\n<p><strong>TUGENDHAT: </strong>Oh, my favorite walk is down the river. A lot of people walk down the river. One of the best things about walking down the river in London is, first of all, it shows two things. One, that London is actually an incredibly private place. You can be completely on your own in the center of one of the biggest cities in the world within seconds, just by walking down the river. Very often, even in the middle of the day, there’s nobody there. You walk past things that are just extraordinary. You walk past a customs house. It’s not used anymore, but it was the customs house for 300, 400, 500 years. You walk past, obviously, the Tower of London. You walk past Tower Bridge. You walk past many things like that.</p>\r\n<p>Actually, you’re walking past a lot of modern London as well, and you see the reality of London, which is — the truth is, London isn’t a single city. It’s many, many different villages, all cobbled together in various different ways. I think outsiders miss the fact that there’s a real intimacy to London that you miss if all you’re doing is you’re going on the Tube, or if you’re going on the bus. If you walk down that river, you see a very, very different kind of London. You see real communities and real smaller communities.</p>\r\n</blockquote>\r\n<p>And:</p>\r\n<blockquote>\r\n<p><strong>COWEN: </strong>Can the British system of government in its current parliamentary form — how well can that work without broadly liberal individualistic foundations in public opinion?</p>\r\n<p><strong>TUGENDHAT: </strong>I think it works extremely well at ensuring that truly liberal foundations are maintained. I mean that not in the American sense; I mean in a genuine, the old liberal tradition that emerges from the UK in the 1700s, 1800s, where freedom of thought, freedom of assembly, the right to own property, and all those principles that then became embedded in various different constitutions around the world, including your own. I think it does very well at doing that because it forces you, our system forces you, into partnership. There are 650 people who you have to work with in some way in Parliament over the next four or five years.</p>\r\n<p>And there’s four of us currently going for leadership at the Conservative Party. There’s one reason why, despite the fact that we’re competing almost in a US primary system, the way in which we are dealing with each other is very different, is because we’re all going to have to work together for the next four years. Whoever wins is going to have to work with the other three, and the idea that you can simply ignore each other isn’t true. There’s only 121 of us Conservative MPs in Parliament, and what this system forces on us is the need to deal with each other in a way that you have to deal with somebody if you’re going to deal with them tomorrow. I think that’s one of the reasons why the British political system has endured because it forces you to remember that there’s a long-term interest, not an immediate one, not just a short-term one.</p>\r\n</blockquote>\r\n<p>Recommended, highly intelligent throughout, including on China, Russia, and Yemen.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html\">My excellent Conversation with Tom Tugendhat</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/905974121/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/905974121/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/905974121/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/905974121/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/905974121/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/905974121/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comment-160821587\">In reply to Karl Pooper.   What specific ways have the Tories ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comment-160821584\">In reply to pnow.   Well, look, if job retention fails relative ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comment-160821567\">In reply to Blo.   They already did.. for actions by the IRA ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comment-160821549\">In reply to Terry richards.   Vance is by far the creepiest of ...</a> <i>by Peter Akuleyev</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comment-160821516\">In reply to dearieme.   Two topics notably absent from the ...</a> <i>by Anti-Gnostic</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/northern-ireland-fact-of-the-day.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=northern-ireland-fact-of-the-day\">Northern Ireland fact of the day</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/a-country-run-by-schoolteachers.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=a-country-run-by-schoolteachers\">A country run by schoolteachers?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/the-case-why-culture-is-not-stuck.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-case-why-culture-is-not-stuck\">The case why culture is not stuck</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"2b4001b91abc5417e5080c4b5bda673d647a6bdc693307957be44189c7a2938d","category":"Sites"}