{"title":"Washington Square Park Online","link":"https://www.usv.com/writing/2024/12/washington-square-park-online/","date":1733224139000,"content":"<p>When I was a kid I played competitive chess through most of middle school. My parents used to take me around the country to play tournaments. One of the trips I remember most fondly was when my mom, who was remarkably supportive and patient, took me and two of my friends to NYC for a couple of days for a tournament in the area. We hit up all the iconic chess spots like the Village Chess Shop and Washington Square Park. It was epic</p>\n<p>At the time my friends and I were somewhere between 10-12 years old. We sat down in the southwest corner of Washington Square at the permanent stone chess tables. There, a group of expert chess players play people speed chess for money. Spectators gather around and form crowds observing exciting games. They banter. Trash is talked abundantly. The energy is high and the stakes are low (think $2-5 per game). It is straight out of Searching for Bobby Fischer (or vice versa, really). That day we hustled the hustlers, and I’ve been going back ever since.</p>\n<p>There’s an adrenaline rush I get playing low-stakes speed chess in the park. I play speed chess every day on chess.com . But what I’ve always wanted is a product that replicates the feeling of playing chess at Washington Square Park. I want low-stakes games (on crypto rails of course) for players and spectators. I want them to be publicly accessible. I want virtual crowds. I want the analog buzz delivered digitally. And I think there is a massive global market for this, especially when you couple it with other games like backgammon, mahjong, and more. I love the idea of very deliberately trying to reproduce the feelings we get from physical spaces online, but with their own digitally native twist.</p>\n<p>When I was a kid I played competitive chess through most of middle school. My parents used to take me around the country to play tournaments. One of the trips I remember most fondly was when my mom, who was remarkably supportive and patient, took me and two of my friends to NYC for a couple of days for a tournament in the area. We hit up all the iconic chess spots like the Village Chess Shop and Washington Square Park. It was epic At the time my friends and I were somewhere between 10-12 year…</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/12/washington-square-park-online/\">Washington Square Park Online</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"2b5cd2e9296bb47ae936d40ed78478416a665fe67765479cdd17d36387c07c8a","category":"Sites"}