{"title":"Nobel-Winning Poet Joseph Brodsky on the Remedy for Existential Boredom","link":"https://www.themarginalian.org/2024/06/28/brodsky-boredom/","date":1719580578000,"content":"<h3>“Try to stay passionate, leave your cool to constellations. Passion, above all, is a remedy against boredom. Another one, of course, is pain… passion’s frequent aftermath.”</h3>\n<hr />\n<p><a href=\"http://www.amazon.com/Grief-Reason-Essays-Joseph-Brodsky/dp/0374525099/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2013/11/brodsky_griefandreason1.jpg?w=680&amp;ssl=1\" /></a>Time is the most private place, and the loneliest — an interior chamber entirely inaccessible to another consciousness, no matter how proximate in space. In time, we are always alone — for time is <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">the substance we are made of</a>, but each of us is a sealed vial. </p>\n<p>Our first great encounter with the interiority of time is the childhood experience of boredom — an experience that never leaves us, though we come to mask it with our adult addiction to productivity, with the strobe light of pleasure. </p>\n<p>Boredom is time laid bare, hollowed of meaning, blank as death. It is there, in this restlessness to do, in this urgency to live, that we first understand mortality. It is there we first begin to realize, in Annie Dillard’s immortal words, that <a href=\"https://www.themarginalian.org/2013/06/07/annie-dillard-the-writing-life-1/\">“how we spend our days is, of course, how we spend our lives.”</a> Boredom is the menacing sense that we are not spending our lives — our lives are spending us.</p>\n<p>The other day I watched an immense queue at the airport security line, people of every kind and every age, uniformly anod at their smartphones. In this age of ready relief from practical boredom, it is easy to forget the existential boredom pulsating beneath our lives. But, paradoxically, it is that other, deeper boredom that fires us with the yearning for meaning, for filling our sliver of allotted time with aliveness — this is why <a href=\"https://www.themarginalian.org/2015/03/16/boredom/\">some of humanity’s greatest minds have stood in defense of boredom</a>.</p>\n<p>In the summer of 1989, two years after he won the Nobel Prize in Literature and two decades after he fled the Soviet dictatorship with the help of W.H. Auden, the great Russian poet and essayist <strong>Joseph Brodsky</strong> (May 24, 1940–January 28, 1996) addressed the graduating class of Dartmouth College with a magnificent speech later adapted into an essay and published in the posthumous collection <a href=\"http://www.amazon.com/Grief-Reason-Essays-Joseph-Brodsky/dp/0374525099/?tag=braipick-20\" target=\"_blank\"><strong><em>On Grief and Reason: Essays</em></strong></a> (<a href=\"http://www.worldcat.org/title/on-grief-and-reason-essays/oclc/30154601&amp;referer=brief_results\" target=\"_blank\"><em>public library</em></a>) under the title “In Praise of Boredom.”</p>\n<figure><a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/atthedropofacat1.jpg\" /></a><figcaption>Art by Violeta Lópiz for <a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><em>At the Drop of a Cat</em></a></figcaption></figure>\n<p>Boredom haunts the basic structure of human life: Although our habits and patterns, which hinge on repetition, <a href=\"https://www.themarginalian.org/2015/02/20/mary-oliver-long-life-habit/\">give shape to our days</a>, they can also become a prison as the vitalizing rhythm of repetition ossifies into monotonous repetitiveness. Brodsky observes:</p>\n<blockquote><p>Everything that displays a pattern is pregnant with boredom.</p>\n<p>[…]</p>\n<p>You’ll be bored with your work, your friends, your spouses, your lovers, the view from your window, the furniture or wallpaper in your room, your thoughts, yourselves. Accordingly, you’ll try to devise ways to escape. Apart from the self-gratifying gadgets… you may take up changing jobs, residence, company, country, climate… You may lump all these together; and for a while, that may work. Until the day, of course, when you wake up in your bedroom amid a new family and a different wallpaper, in a different state and climate… yet with the same stale feeling toward the light of day pouring in through your window. You’ll put on your loafers only to discover they’re lacking bootstraps to lift yourself out of what your recognize. Depending on your temperament or the age you are at, you will either panic or resign yourself to the familiarity of the sensation; or else you’ll go through the rigmarole of change once more.</p></blockquote>\n<p>Drawing on Robert Frost’s famous line “the best way out is always through,” Brodsky offers the only true remedy for boredom:</p>\n<blockquote><p>When hit by boredom, go for it. Let yourself be crushed by it; submerge, hit bottom. In general, with things unpleasant, the rule is, the sooner you hit bottom, the faster you surface.</p></blockquote>\n<p>This total surrender to boredom opens a portal of perspective. Out of its blankness surges a sudden fount of meaning. Brodsky writes:</p>\n<blockquote><p>Boredom is your window on time, on those properties of it one tends to ignore to the likely peril of one’s mental equilibrium. In short, it is your window on time’s infinity, which is to say, on your insignificance in it.</p>\n<p>[…]</p>\n<p>Boredom is an invasion of time into your set of values. It puts your existence into its perspective, the net result of which is precision and humility. The former, it must be noted, breeds the latter. The more you learn about your own size, the more humble and compassionate you become to your likes, to that dust aswirl in a sunbeam or already immobile atop your table. Ah, how much life went into those flecks! Not from your point of view but from theirs. You are to them what time is to you; that’s why they look so small.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/12/beforeigrewup1.jpg\" /></a><figcaption>Art by Giuliano Cucco from <a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><em>Before I Grew Up</em></a></figcaption></figure>\n<p>In consonance with philosopher Martha Nussbaum’s insight that <a href=\"https://www.themarginalian.org/2012/10/12/martha-nussbaum-take-my-advice/\">“a creature without any needs would never have reasons for fear, or grief, or hope, or anger”</a> — for what is boredom if not the howl of need, the need for significance — Brodsky adds:</p>\n<blockquote><p>You are insignificant because you are finite. Yet the more finite a thing is, the more it is charged with life, emotions, joy, fears, compassion. For infinity is not terribly lively, not terribly emotional. Your boredom, at least, tells you that much. Because your boredom is the boredom of infinity.</p>\n<p>[…]</p>\n<p>So try to stay passionate, leave your cool to constellations. Passion, above all, is a remedy against boredom. Another one, of course, is pain… passion’s frequent aftermath… When you hurt, you know that at least you haven’t been deceived (by your body or by your psyche). By the same token, what’s good about boredom, about anguish and the sense of the meaninglessness of your own, of everything else’s existence, is that it is not a deception.</p>\n<p>[…]</p>\n<p>Try to embrace, or let yourself be embraced by, boredom and anguish, which anyhow are larger than you. No doubt you’ll find that bosom smothering, yet try to endure it as long as you can, and then some more. Above all, don’t think you’ve goofed somewhere along the line, don’t try to retrace your steps to correct the error. No, as the poet said, “Believe your pain.” This awful bear hug is no mistake. Nothing that disturbs you is. Remember all along that there is no embrace in this world that won’t finally unclasp.</p></blockquote>\n<figure><a href=\"https://society6.com/product/i-will-confront-these-shows-of-the-day-and-night_framed-print?sku=s6-8968158p21a12v52a13v54?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i1.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass19.jpg?resize=768%2C973&amp;ssl=1\" width=\"1200\" height=\"1558\" /></a><figcaption>Illustration by Margaret C. Cook for a <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">rare 1913 edition of <em>Leaves of Grass</em></a>. (Available <a href=\"https://society6.com/product/i-will-confront-these-shows-of-the-day-and-night_framed-print?sku=s6-8968158p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>With an eye to this inevitability of change, brutal and sanctifying, <a href=\"https://www.themarginalian.org/2024/06/05/on-wanting-to-change-adam-phillips/\">rife with ambivalence</a>, he adds:</p>\n<blockquote><p>What lies ahead is a remarkable but wearisome journey [on a] runaway train. No one can tell you what lies ahead, least of all those who remain behind. One thing, however, they can assure you of is that it’s not a round trip. Try, therefore, to derive some comfort form the notion that no matter how unpalatable this or that station may turn out to be, the train doesn’t stop there for good. Therefore, you are never stuck — not even when you feel you are; for this place today becomes your past… receding for you, for that train is in constant motion. It will be receding for you even when you feel that you are stuck. So… look at it with all the tenderness you can muster, for you are looking at your past.</p></blockquote>\n<p>Complement with Barry Lopez on <a href=\"https://www.themarginalian.org/2022/09/18/barry-lopez-place-loneliness/\">the cure for our existential loneliness</a>, Susan Sontag on <a href=\"https://www.themarginalian.org/2012/10/26/susan-sontag-on-boredom/\">the creative purpose of boredom</a>, and Bertrand Russell on <a href=\"https://www.themarginalian.org/2015/01/21/bertrand-russell-boredom-conquest-of-happiness/\">the vital role of “fruitful monotony” in a full life</a>, then revisit Brodsky on <a href=\"https://www.themarginalian.org/2016/10/25/joseph-brodsky-evil-williams-college-commencement/\">the greatest antidote to evil</a> and <a href=\"https://www.themarginalian.org/2013/12/18/joseph-brodsky-speech-at-the-stadium-commencement/\">the six rules of a good life</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"2cebffe065e5d5dde9b48462e34e2d7d71b52b4b651fbd9043d72ca2fe9c0c92","category":"default"}