{"title":"Time and the Soul: Philosopher Jacob Needleman on Our Search for Meaning","link":"https://www.themarginalian.org/2024/01/30/time-and-the-soul-needleman/","date":1706663319000,"content":"<h3>“The real significance of our problem with time… is a crisis of meaning… The root of our modern problem with time is neither technological, sociological, economic nor psychological. It is metaphysical. It is a question of the meaning of human life itself.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Time-Soul-Where-Meaningful-Gone/dp/1459626796/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"448\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?fit=320%2C448&amp;ssl=1\" alt=\"Time and the Soul: Philosopher Jacob Needleman on Our Search for Meaning\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?w=857&amp;ssl=1 857w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?resize=320%2C448&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?resize=600%2C840&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?resize=240%2C336&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/timesoul_needlman.jpg?resize=768%2C1075&amp;ssl=1 768w\" /></a></p><p>“The eternal problem of the human being is how to structure his waking hours,” the psychiatrist Eric Berne observed in his <a href=\"https://www.themarginalian.org/2022/07/12/eric-berne-games-people-play/\">uncommonly insightful model of human relationships</a> a generation after Borges insisted that <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">time is the substance we are made of</a>. It is the elementary particle of presence and the fundamental unit of attention — the two most precious resources we have, out of which every meaningful experiences is welded. To give a practice your time is an act of devotion. To give a person your time is a supreme act of love — for, as <a href=\"https://www.themarginalian.org/2020/12/01/thich-nhat-hanh-fear-love/\">Thich Nhat Hanh wrote</a>, “when you love someone, the best thing you can offer that person is your presence.”</p>\n<p>It is no wonder, then, that in a culture of accelerating urgency and <a href=\"https://www.themarginalian.org/2021/12/20/four-thousand-weeks-oliver-burkeman/\">suffocating time-anxiety</a>, we feel syphoned of the substance of our lives.</p>\n<figure><a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=680%2C728&amp;ssl=1\" width=\"680\" height=\"728\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=320%2C342&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=600%2C642&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=240%2C257&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=768%2C822&amp;ssl=1 768w\" /></a><figcaption><em>Discus chronologicus</em> — an 18th-century German depiction of time. (Available as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_wall-clock?curator=brainpicker\" target=\"_blank\">a wall clock</a>.)</figcaption></figure>\n<p>How to break free from that cultural tyranny and reconnect with this deepest metaphysical dimension of aliveness is what philosopher <strong>Jacob Needleman</strong> (October 6, 1934–November 28, 2022) explores in his timelessly wonderful 1998 book <a href=\"https://www.amazon.com/Time-Soul-Where-Meaningful-Gone/dp/1459626796/?tag=braipick-20\" target=\"_blank\"><strong><em>Time and the Soul</em></strong></a> (<a href=\"https://search.worldcat.org/title/754773610\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>With an eye to Wordsworth’s immortal indictment of our compulsive haste — “The world is too much with us; late and soon, / Getting and spending, we lay waste our powers” — Needleman frames the basic paradox of our relationship to time:</p>\n<blockquote><p>The question of our relationship to time is both a mystery and a problem. It calls to us from the deepest recesses of the human heart. And it bedevils us on all the surfaces of our everyday life. At the deeper levels, in front of the <em>mystery</em> of time, we are mortal beings solemnly aware of our finitude — longing, perhaps, for that in ourselves which partakes of the eternal. But at the surface levels of ourselves, in front of the <em>problem</em> of time, we are like frantic puppets trying to manage the influences of the past, the threats and promises of the future and the tense demands of the ever-diminishing present moment. The mystery of time has the power to call us quietly back to ourselves and toward our essential freedom and humanness. The problem of time, on the other hand, agitates us and “lays waste our powers.”</p></blockquote>\n<p>Writing in 1997, he diagnoses a new epidemic of “time-poverty” that has only deepened in the decades since:</p>\n<blockquote><p>We began to realize, dimly at first, that we were no longer living our lives. We began to see that our lives were living us. And we began to suspect that our relationship to time had become so toxic precisely because we had forgotten how to bring to our day-to-day lives the essential question of who and what a human being is and is meant to be.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\"><img loading=\"lazy\" src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass17.jpg\" width=\"1200\" height=\"1543\" /></a><figcaption>Art by Margaret C. Cook from <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a rare 1913 edition</a> of Walt Whitman’s <em>Leaves of Grass</em>. (Available <a href=\"https://society6.com/product/thoughts-silent-thoughts-of-time-and-space-and-death_framed-print?sku=s6-8967472p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>Needleman — who went on to probe <a href=\"https://www.themarginalian.org/2016/10/12/i-am-not-i-jacob-needleman/\">the mystery of what makes us who we are</a> in his final book — considers “what it means to allow the mystery of time to irrigate our parched and driven lives” and offers a path to liberation from the problem of time, a portal into its mystery:</p>\n<blockquote><p>The pathology of our relationship to time can be healed only as we allow ourselves to be penetrated by the mystery of what we are beneath the surface of ourselves — by striving, that is, to remember our Selves.</p>\n<p>[…]</p>\n<p>The ego, the false self, [is] the root of all the evil that enters the earth and destroys human life, and with it, of course, the reality of time, the reality of lived presence. The ego lives only in the future and the past; it has no present moment; it is always hurrying or dreaming.</p></blockquote>\n<p>In consonance with the neuropsychological fact that <a href=\"https://www.themarginalian.org/2023/05/10/iain-mcgilchrist-the-matter-with-things/\">attention is our only lens on reality</a>, he weighs this fundament of our humanity against the absent-minded mechanization of our lives:</p>\n<blockquote><p>The essential element to recognize is how much of what we call “progress” is accompanied by and measured by the fact that human beings need less and less conscious attention to perform their activities and lead their lives. The real power of the faculty of attention… is one of the indispensable and most central measures of humanness. </p>\n<p>[…]</p>\n<p>In the world as in oneself, everything depends of the <em>presence</em> of humanness — in oneself it depends on the presence, even if only to a relative degree, of the Self, the real I am — and in the life of the world it depends on the presence of people who have and can manifest this capacity to be, or even only who wish for it and who come together to learn from each other and to help each other for that purpose.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/01/14/the-fairy-tale-tree/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/thefairytaletree16.jpg\" /></a><figcaption>Art by Stanislav Kolíbal from <a href=\"https://www.themarginalian.org/2024/01/14/the-fairy-tale-tree/\"><em>The Fairy Tale Tree</em></a>, 1961</figcaption></figure>\n<p>This attrition of presence, he observes, is maiming not only our individual inner lives but the inner life of humanity as we have come to mistake the <em>right away</em> of immediacy for the <em>now</em> of presence. Two millennia after Seneca devised his cautionary taxonomy of <a href=\"https://www.themarginalian.org/2019/04/17/seneca-letter-1-time/\">time saved, spent, and wasted</a>, we have invented innumerable tools and technologies to save time but find ourselves wasting it more helplessly than ever. We can only save ourselves, Needleman intimates, by recalibrating our relationship to time, which is fundamentally our relationship to the self and to the meaning of human life. He writes:</p>\n<blockquote><p>The real significance of our problem with time… is a crisis of meaning… The root of our modern problem with time is neither technological, sociological, economic nor psychological. It is metaphysical. It is a question of the meaning of human life itself.</p></blockquote>\n<p>At the center of our self-defeating challenge is an unexamined premise: We have framed time as a problem — the problem of how to structure and manage our lives — when it is best regarded as a question. (A problem is a judgment and all judgment is a straitjacket of understanding; a question is an invitation to wonder, which is the antipode of judgment.) </p>\n<p>Needleman writes:</p>\n<blockquote><p>Such great questions cannot be answered with the part of the mind that solves problems. They need to be deeply felt and experienced long, long before they can begin to be answered. We need to feel the question of time much more deeply and simply than we do. We agitate about the problem of time, but we seldom feel what it means.</p></blockquote>\n<p>This is largely due to the general sublimation of feeling — the disconnect from our creaturely sensorium — in an age of disembodied technos. A century and a half after the Victorian visionary Samuel Butler <a href=\"https://www.themarginalian.org/2022/09/15/samuel-butler-darwin-among-the-machines-erewhon/\">cautioned against our enslavement by intelligent machines</a>, Needleman writes:</p>\n<blockquote><p>The time of machines is not our own time. Human time is always… the time of a being or of beings who can in truth say <em>I</em>. In other cultures, perhaps less alienated from the teachings of wisdom, mankind lived in closer relationship to biological time, the pulses and rhythms of nature, the sun and the moon, the tides, the seasons, the light and darkness, all the measures and meters of the music of the earth and the skies. But even this time, this more natural time, is not in itself human time. Human time is always the time of the consciousness that says and means <em>I, I am</em>… To live in accordance with nature’s time is to allow the nature that is within us to beat with more synchronous rhythms — the body’s tempo, the tempos of organic love and fear and tenderness and anger; and the tempos and rhythms of the mind that searches, that needs to guide and receive the action of the senses, to plan and manage and to remember the gods, the greater forces… To live with these tempos and times more in harmony is to live in the time of earth and nature and to be a more ready receptacle for the consciousness that can truly say <em>I am</em>.</p></blockquote>\n<figure><a href=\"https://society6.com/product/spring-moon-at-ninomiya-beach-by-hasui-kawase-1931_print?sku=s6-19564891p4a1v46?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=680%2C1014&amp;ssl=1\" width=\"680\" height=\"1014\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=320%2C477&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=600%2C895&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=240%2C358&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=768%2C1146&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/hasuikawase1.jpg?resize=1030%2C1536&amp;ssl=1 1030w\" /></a><figcaption><em>Spring Moon at Ninomiya Beach</em>, 1931 — one of Hasui Kawase’s <a href=\"https://www.themarginalian.org/2021/03/22/hasui-kawase-prints/\">stunning vintage Japanese woodblocks</a>. (Available <a href=\"https://society6.com/product/spring-moon-at-ninomiya-beach-by-hasui-kawase-1931_print?sku=s6-19564891p4a1v46?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>While biological time is still not entirely human time — it still unfolds on the material level of existence and not on the level of meaning — it is infinitely closer to human time than mechanical time, meted out by the hollow pulse-beat of the tools to which we have relinquished the management of meaning. An epoch before AI came to mediate and menace our reach for meaning, Needlman adds:</p>\n<blockquote><p>By governing our own inner world through mechanical, computer time, we are running one part of our nature with a time and a tempo so far removed from the time of our body and our feeling that there is less and less possibility of these central parts of ourselves coming into relationship. And only in the relationship, the actual harmonic contact, between the main sources of perception and energy in ourselves can there be a medium through which the authentic self can appear and act in us.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/Time-Soul-Where-Meaningful-Gone/dp/1459626796/?tag=braipick-20\" target=\"_blank\"><strong><em>Time and the Soul</em></strong></a>, Needlman sets out “to uncover the link between our pathology of time and the eternal mystery of what a human being is meant to be in the universal scheme of things.” Complement it with Oliver Burkeman, writing an epoch of technology later, on <a href=\"https://www.themarginalian.org/2021/12/20/four-thousand-weeks-oliver-burkeman/\">escaping the time-anxious trap of efficiency</a> and Ursula K. Le Guin’s lovely <a href=\"https://www.themarginalian.org/2018/04/23/ursula-k-le-guin-hymn-to-time-janna-levin/\">“Hymn to Time,”</a> then revisit <a href=\"https://www.themarginalian.org/2021/08/28/alan-lightman-einsteins-dreams/\"><em>Einstein’s Dreams</em></a> — physicist Alan Lightman’s poetic exploration of time and the antidote to our existential anxiety. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"2d118e62672b51784283f34c1c30201e546675fa005b7e0af4f79e5f290ff09b","category":"default"}