{"title":"Project 2025: The Minority Rule by Extremists","link":"https://kottke.org/24/07/project-2025-the-minority-rule-by-extremists","date":1721245237000,"content":"\n        <p>I’ve been waiting, sitting at my desk with hands tented, for historian Heather Cox Richardson to write about Project 2025 and just now I found out that <a href=\"https://heathercoxrichardson.substack.com/p/march-17-2024\">she did so back in March</a>, because of course.</p>\n\n<blockquote><p>In almost 1,000 pages, the document explains what these policies mean for ordinary Americans. Restoring the family and protecting children means making “family authority, formation, and cohesion” a top priority and using “government power…to restore the American family.” That, the document says, means eliminating any words associated with sexual orientation or gender identity, gender, abortion, reproductive health, or reproductive rights from any government rule, regulation, or law. Any reference to transgenderism is “pornography” and must be banned.</p>\n\n<p>The overturning of the 1973 Roe v. Wade decision recognizing the right to abortion must be gratefully celebrated, the document says, but the Dobbs v. Jackson Women’s Health Organization decision accomplishing that end “is just the beginning.”</p>\n\n<p>Dismantling the administrative state in this document starts from the premise that “people are policy.” Frustrated because nonpartisan civil employees thwarted much of Trump’s agenda in his first term, the authors of Project 2025 call for firing much of the current government workforce-about 2 million people work for the U.S. government-and replacing it with loyalists who will carry out a right-wing president’s demands.</p>\n\n<p>On Friday, journalist Daniel Miller noted that purging the civil service is a hallmark of dictators, whose loyalists then take over media, education, courts, and the military. In a powerful essay today, scholar of authoritarianism Timothy Snyder explained that with the government firmly in the hands of a dictator’s loyalists, “things like water or schools or Social Security checks” depend on your declaration of loyalty, and there is no recourse. “You cannot escape to the bar or the bowling alley, since everything you say is monitored,” and “[e]ven courageous people restrain themselves to protect their children.”</p></blockquote>\n\n<p>It’s worth reading in full. I wish Richardson did better at citing her sources than an unordered list of links at the end of each article (and also, I wish she weren’t on Substack), so here’s <a href=\"https://twitter.com/DanielMillerEsq/status/1768743319117381897\">the Daniel Miller note</a> from the excerpt above:</p>\n\n<blockquote><p>You know who else purged the civil service: Orbán, Erdoğan, Chávez, Milosevic, Ayatollah Khomeini, Pinochet… There was also this guy in Germany in 1933 who purged the civil service months after taking power.</p></blockquote>\n\n<p>And here’s <a href=\"https://snyder.substack.com/p/the-strongman-fantasy\">Timothy Snyder on dictators and declarations of loyalty</a>:</p>\n\n<blockquote><p>The new bureaucrats will have no sense of accountability. Basic government functions will break down. Citizens who want access will learn to pay bribes. Bureaucrats in office thanks to patronage will be corrupt, and citizens will be desperate. Quickly the corruption becomes normal, even unquestioned.</p>\n\n<p>As the fantasy of strongman rule fades into everyday dictatorship, people realize that they need things like water or schools or Social Security checks. Insofar as such goods are available under a dictatorship, they come with a moral as well as a financial price. When you go to a government office, you will be expected to declare your personal loyalty to the strongman.</p>\n\n<p>If you have a complaint about these practices, too bad. Americans are litigious people, and many of us assume that we can go to the police or sue. But when you vote a strong man in, you vote out the rule of law. In court, only loyalism and wealth will matter. Americans who do not fear the police will learn to do so. Those who wear the uniform must either resign or become the enforcers of the whims of one man.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Daniel%20Miller\">Daniel Miller</a> · <a href=\"https://kottke.org/tag/Heather%20Cox%20Richardson\">Heather Cox Richardson</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Project%202025\">Project 2025</a> · <a href=\"https://kottke.org/tag/Timothy%20Snyder\">Timothy Snyder</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"2d2256694c6269a1c875cb55c726581f6766aa9fcfe85dc1e2cc2daa6493b6e2","category":"default"}