{"title":"Meta-considerate","link":"https://sive.rs/metac","date":1570060800000,"content":"<p>\nMy friend has a huge crush on someone.\n</p><p>\nHe showers her with attention and appreciation.\nHe remembers her preferences, and constantly gives her thoughtful gifts.\n</p><p>\nHe thinks he’s being considerate, but he’s actually being inconsiderate.\nMeta-inconsiderate.\n</p><p>\nBy holding her up on a pedestal — by making it clear that he looks up to her — he’s making her look down on him.\n</p><p>\nPeople want a romantic partner that’s a “catch” — someone almost out of their league.\nWe want a good deal.\nWe want to win someone.\n</p><p>\nBy chasing her relentlessly, he’s denying her the pleasure of desire.\n</p><p>\nHe’s not letting her dance.\nSince he keeps pushing forward, there’s nowhere for her to go but backward.\nHe’s not letting her come to him.\n</p><p>\n<strong>\nBeing superficially considerate can be deeply inconsiderate.\n</strong>\nDoing the opposite is often ultimately more considerate.\nI call it meta-considerate.\n</p>\n<h3>\nMeta-considerate by contrast:\n</h3>\n<p>\nIt’s considerate to not bore my friends with my problems.\nBut it’s meta-considerate to tell them my problems, to let them feel needed and helpful, to let them know they’re safe to do the same.\n</p><p>\nIt’s considerate to greet someone with a smile.\nBut it’s meta-considerate to not smile until they’ve said something, so they can feel that smile was sincerely for them, not presented to just anyone.\n</p><p>\nIt’s considerate to tell a white lie.\nBut it’s meta-considerate to tell the uncomfortable truth.\n</p>\n<h3>\nMore meta-considerate examples:\n</h3>\n<ul><li>\nThe jazz club hidden behind an unmarked door.\n</li><li>\nThe meticulous craftsman that has a 9-month waiting list because he custom-makes every order himself.\n</li><li>\nMusicians like Miles Davis, Joni Mitchell, and Bob Dylan, that gave nothing but the music, and didn’t ask for your love.\n</li><li>\nBeing silent in conversation, to let your friend fill the space and share more.\n</li></ul>\n<p>\n<strong>\nOur shallow wants and deeper needs are often <a href=\"https://sive.rs/opposite\">opposite</a>.\n</strong>\n</p>\n<img src=\"/images/metapedestal.jpg\" alt=\"pedestal\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"2dc840cda7b104a6a20977a11554662c5acc8b063aeb6bfc48e345b030d8b73d","category":"default"}