{"title":"To question is to consider, not cancel","link":"https://sive.rs/qcc","date":1731715200000,"content":"<p>\nTomorrow you have plans to go to an event with a friend.\nYou made the plans a month ago.\nYou ask your friend, “Do you still want to go?”\n</p><p>\nYour friend says, “What? You don’t want to? Then forget it. I’ll ask someone else!”\n</p><p>\nYou say, “Wait! I never said I don’t want to! Just asking.”\n</p><p>\n<strong>\nSome people hear questions as disinclinations.\n</strong>\nYou say, “Why are we going?”\nThey hear, “I don’t want to go.”\n</p><p>\nMaybe they grew up around people who are indirect, and use questions to communicate cancellation.\n<strong>\nBut questioning is necessary for creative exploration of ideas.\n</strong>\n</p><p>\nI <a href=\"https://www.youtube.com/watch?v=-Fuuh7lyX-g\">publicly said</a> that I’m enjoying building a house, questioning everything about it.\nWhat are walls for?\nDo we need a kitchen?\nWhat’s the purpose of a roof?\nSome people heard those questions as denials, and said I’m being stupid and should just go camping.\n</p><p>\n<strong>\nWe question to consider why things are the way they are.\n</strong>\nWe see if old reasons apply to a new situation.\nMaybe they do.\nBut maybe there’s a better way.\n</p><p>\nMaybe your friend says, “Yes I really want to attend that event, with or without you.”\nBut maybe your friend says, “Yes because I really miss talking with you.”\nIn that case, the event would be a noisy distraction, and you’d have a better time going somewhere quiet to talk.\nBut you’d never know if you don’t ask.\nAnd you’d never ask if you mistake questions for cancellations.\n</p><p>\n<strong>\nDoubting is not denying.\n</strong>\nAsking is not aversion.\nQuestioning is just part of considering.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"2dcaa03ab8a2bf26458cfef0b8026feafba5cea74134362dc5babc5d3a8c333d","category":"Sites"}