{"title":"The only thing we can talk now about is celebrities","link":"https://www.garbageday.email/p/the-only-thing-we-can-talk-now-about","date":1702928472000,"content":"<div><div><h2>My X Feed Is Currently Just Two Posts</h2><p>I’m still on X, unfortunately. I was lurking on 4chan fairly regularly up until around 2014 and then was still using it for work basically up until the pandemic. So while X’s standards are sliding very fast, I think it’s still a useful app from an academic standpoint. Also, Threads, even though it’s a lot less of a mess, is not fun. It is simply not a place that I want to look at on the weekends.</p><p>And tbh watching X die has been fascinating, when it’s not nauseating. Though, trying to divine the weird changes Elon Musk is making to the site has been difficult. The app’s “For You” feed feels different than it did even two months ago — and I’m not the only one <a href=\"https://twitter.com/amasad/status/1734068129666654373?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">to notice that</a>. Though, the question is whether it’s the algorithm that’s changed or if it’s just that users figured out how to game it better.</p><p>When you make the decision to algorithmically sort and monetize your social network, you also enter into a permanent adversarial relationship with your users. They will try and game it and your new job is to prevent that. Some platforms like YouTube or TikTok take a light touch, while others like Facebook are much more draconian. Musk, as far as I can tell, does not realize this yet — or just doesn’t care. I never know if he’s doing something because he’s stupid or because he’s lazy.</p><p>But regardless of which it is, it has resulted in two posts completely taking over my X feed this weekend. To the point where there was basically no other content on my app other than quote posts of these two posts. As of this morning, I’d say it accounts for over 80% of my feed. And, interestingly enough, they’re both from the same account.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/aa38e513-10b6-49df-bc25-4d3326bdeee8/44db1d9f-076f-490b-a4da-a238dd09a7b4_2444x1304.png?t=1705691559\" /></div><p>The posts come from a user named <a href=\"https://twitter.com/lovechazelle?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">@lovechazelle</a>, who has around 3,000 followers. No one I know follows them and, from what I can tell, they aren’t running any kind of scam. They have a Letterboxd profile, but not a particularly big one. In other words, they’re just a stan account, specifically for the director Damien Chazelle.</p><p>I have a few theories as to how this happened. First, they’re exactly what X’s algorithm prioritizes. Back in February, I did an experiment with X’s then-new algorithm that worked <a href=\"https://www.garbageday.email/p/i-remembered-how-awful-it-is-to-go?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">way too well</a>. Even though dials seem to have been adjusted since, X’s For You page still consistently rewards not just quote posts, but quote posts of already viral content, along with videos and replies from Verified users. And @lovechazelle’s posts check all of those boxes. </p><p>It’s also very possible that the shrinking of X — and the team that runs it — has reached a point where there are only a handful of truly engaged-with posts now. Tumblr felt like this around 2018 and 2019, as did Myspace towards the end. But I also think the subject matter is important. I don’t think it’s an accident both posts require users sharing old videos of celebrities. It’s one of the few things we can all still talk about together.</p><p>In lieu of any big 2024 predictions post, I’ll drop my main one here: The most important story in both tech and politics going into 2024 (an election year, mind you) will be the lack of cultural consensus in America. After almost 15 years of platforms semi-reliably tracking our national conversation — or at least giving the illusion that they were — we’re now beginning to realize they don’t. We already can’t figure out if something’s really trending or not or what caused it to trend if it is. But we now live in a world where our media and political apparatuses require that kind of information to function. The loudest and oftentimes most influential parts of American society have been looking at what’s online and repackaging it back to us for a decade and now that trick doesn’t work anymore.</p><p>What I’ve been struggling to fit into this framework has been the explosive monocultural moments that are happening simultaneously amid this shift — figures like Taylor Swift and MrBeast and memes like Barbenheimer or Skibidi Toilets. Long time readers know one of my worst impulses is creating a Grand Unified Theory Of Everything and then spending all of my time agonizing over why it’s probably wrong.</p><p>But as I <a href=\"https://www.garbageday.email/i/139695617/there-actually-were-a-lot-of-memes-this-year?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">wrote last week</a>, I think what we’re actually seeing is the middle of the attention economy disappear. The space where viral animals, random videos, silly trends, and bizarre subcultures used to inhabit. Those things aren’t gone, really, but they aren’t turning into national level discourses as often anymore. I’ve been following Jeremiah Johnson’s <a href=\"https://twitter.com/JeremiahDJohns/status/1736060420278947969?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">annual Worst Tweets bracket</a> this week and I’ll confess I hadn’t actually seen a fair amount of them and my job is literally to stare at this stuff all day. It also seems fitting that the Worst Tweet this year was a <a href=\"https://twitter.com/JeremiahDJohns/status/1736740163789676909?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">Very Bad Tweet</a> about the conflict in Israel and Palestine, which was an undeniably monolithic story from this year, regardless of how politically divisive it’s been.</p><p>On our new <a href=\"https://www.garbageday.email/p/is-the-web-actually-evaporating?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">vapor web</a>, conversations are glomming together. We’re reaching out in the dark looking for ways to still communicate and it turns out there isn’t much. And this is especially apparent on websites like X that are, well, objectively more poorly run than others. And this was also true during the era of peak 4chan. The rot of the larger internet is always most visible on sites with the lowest standards.</p><hr /><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/a1b97555-2c9f-4d88-8fc4-d65e474246ad/e468734a-9c8d-41b6-b0b0-61a0d19e3b82_2200x96.png?t=1705691560\" /></div><h2>Reality Shows Don’t, And Shouldn’t, Have Nine-Month Seasons</h2><p><i>—by Adam Bumas</i></p><div></div><p>This was shared in the Garbage Day Discord by user Alyx, along with a lot of other videos from TikTokers who are currently taking the Ultimate World Cruise. The ship set sail from Miami on December 10th and is set to last until next September. Accounts posting regular videos from the cruise are becoming the center of a nascent fandom after only a week.</p><p>So far, that fandom is mostly powered by the excitement of discovery. All the most popular TikToks are devoted to the ludicrous scale of amenities and logistics a nine-month cruise needs. For instance, anyone who gets pregnant on board the ship needs to <a href=\"https://www.tiktok.com/@little_rat_brain/video/7313033346609663275?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">leave at 23 weeks</a>. That kind of content won’t hold interest for long without something more dramatic and constantly developing and a lot of creators are beginning to tease juicier content.</p><p>I can't remember seeing this specific kind of anticipation before: TikTokers who aren’t on the ship are <a href=\"https://www.tiktok.com/@nchimad/video/7312669677451300138?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">setting themselves up</a> as commentators, making Bingo cards of possible dramatic moments, and describing the cruise as “<a href=\"https://www.tiktok.com/@whimsysoul/video/7312900858126060842?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">a nine-month TikTok reality show</a>”.</p><p>But reality shows don’t have nine-month seasons. Cultural cycles are so fast, especially on TikTok, that I think the novelty will wear off, even if the passengers start deliberately engineering drama. The only thing I could see keeping me checking for daily updates is if they get stuck in the Suez Canal. Or maybe a <i>Lord Of The Flies</i> situation?</p><p><i>Want to join the Garbage Day Discord? Hit the green button below to find out more!</i></p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\"><span> Subscribe now </span></a></div><hr /><h2>Garbage Wrapped</h2><p>In years past, I’ve done a big independent audit of all my posts for the year. There were always problems with the data, but it was useful when I was still figuring out what worked and what didn’t for Garbage Day. This year, I’m going to use Substack’s own rankings instead, which seem to use an aggregate of a bunch of different metrics, including estimated revenue and open rate. And according to my dashboard, my top five posts this year were:</p><ol><li><p><a href=\"https://www.garbageday.email/p/the-algorithmic-anti-culture-of-scale?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">The algorithmic anti-culture of scale</a> (89.3k views, 360 new signups, 48% open rate)</p></li><li><p><a href=\"https://www.garbageday.email/p/tiktok-teens-arent-stanning-osama?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">TikTok teens aren't stanning Osama bin Laden</a> (77.3k views, 127 new signups, 45% open rate)</p></li><li><p><a href=\"https://www.garbageday.email/p/i-remembered-how-awful-it-is-to-go?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">I remembered how awful it is to go viral</a> (86.1k views, 335 new signups, 50% open rate)</p></li><li><p><a href=\"https://www.garbageday.email/p/this-is-what-an-unmoderated-internet?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">This is what an unmoderated internet looks like</a> (76.6k views, 88 new signups, 46% open rate)</p></li><li><p><a href=\"https://www.garbageday.email/p/the-metaverse-is-cooked?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">The metaverse is cooked</a> (79.1k views, 104 new signups, 51% open rate)</p></li></ol><p>The biggest takeaway is that big swings on something topical do really well for me. It’s impossible to pump out a newsletter like one of these every week, but it’s nice to know I have a niche. It’s also nice to know that these posts are fairly evenly distributed across the year because I’m constantly terrified I’ll have peaked and not realize it.</p><p>In terms of other interesting stats from my dashboard, my yearly subscriber retention rate was 74%. I try not to look at my churn, but I feel like that number is a good one. My biggest US audience segment is in California and second-largest is New York. My biggest audience outside of the US is the UK. And, finally, I thought my top traffic sources were interesting:</p><ul><li><p>Email: 5.1 million views</p></li><li><p>Direct: 617k views</p></li><li><p>Substack app: 303k views</p></li><li><p>Twitter/X: 83k views</p></li><li><p>Google: 64k views</p></li></ul><p>A few years ago, I wondered if email would end up becoming a secondary traffic source for me, but there’s absolutely no contest. That said, my open rate has slid this year, but it’s possibly just a side effect of scale. I gained just under 30,000 readers this year, ending the year at 67,344 readers, so my previous average of 45-47% has slid towards 42-44%. If it dips below 30, I’ll probably have a nervous breakdown.</p><hr /><h2>The Ponytail Bluetooth Guy Knows He’s Going Viral, Doesn’t Care</h2><div></div><p>Podcaster @TheWapplehouse reached out to someone who knows our mysterious hero irl and they <a href=\"https://twitter.com/thewapplehouse/status/1736412666862706889?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">revealed</a> that he’s aware that his TikTok video has blown up and is mainly just happy that everyone realizes he clearly won the debate.</p><p>My favorite take on the video was from X user @maiamindel, <a href=\"https://twitter.com/maiamindel/status/1735845161735708948?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">who wrote</a>, “Tiktok conservatives are like dodos or kakapos, they have grown fat and complacent due to facing no real threats. If Reddit atheists, their natural predators, end up descending on them... it doesn't look pretty.”</p><hr /><h2>Everyone’s Being Very Normal About The AI Girlfriend App</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/58e644ee-51ed-4cb0-998e-959153d0a735/f24beb93-5f88-462a-b5bd-ca1b17d92bbe_909x683.png?t=1705691561\" /></div><p>Digi is a new AI chatbot that is making a lot of AI guys have weird meltdowns right now. One prominent voice in the AI space <a href=\"https://twitter.com/rokomijic/status/1736253278327828765?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">even said</a> the creators should go to jail for making it. And I’ve seen more than a few accounts say that this will eliminate whole <a href=\"https://twitter.com/growing_daniel/status/1735820366319366238?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">bloodlines</a>, the assumption being that weird men will fall in love with these chatbots and never procreate. I would argue that if you’re the kind of person to fall in love with a chatbot you probably weren’t going to procreate anyways.</p><p>But you’ve got to remember that for a lot of AI accelerationists, taking like this is part of the marketing. So let’s see what this thing actually is.</p><p>One of the lead devs on the project is Andrew Young, who previously worked with disgraced <i>Rick &amp; Morty</i> co-creator Justin Roiland on an<a href=\"https://www.theblock.co/post/131497/rick-and-morty-co-creator-collaborates-with-paradigm-on-nft-research-project?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\"> NFT marketplace</a> (lmao). Young also wrote a couple lengthy threads about Digi as it went viral over the weekend. In <a href=\"https://twitter.com/andyohlbaum/status/1735786035878207961?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">one thread</a>, he even admits that this chatbot is supposed to look like a Pixar character and that they worked with Pixar artists to design it. I probably wouldn’t admit that!!</p><p>And in a <a href=\"https://twitter.com/andyohlbaum/status/1736106150268195297?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">follow up thread</a>, Young admitted that the demo is actually extremely misleading. The AI isn’t nearly as smooth and the voice is pretty wonky. Oh, also, the avatars look like absolute shit inside the app. But, of course, you can join the Discord to stay on the hype train.</p><hr /><h2>This TikTok Is Breaking My Brain</h2><div></div><hr /><h2>We May Have Our First Real AR Trend Since <i>Pokémon Go</i></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/479f5a33-1037-461d-8396-07259c2259ae/1be3e433-abde-4094-a155-d964fdbd8e9c_2072x1510.png?t=1705691562\" /></div><p>Internet culture writer Jules Terpak had a <a href=\"https://twitter.com/julesterpak/status/1736175363804279217?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">great post</a> recently highlighting a bunch of TikToks that are taking part in a new trend where you fake out viewers by revealing you’ve actually been filming the video the whole time on a pair of Meta’s new Ray-Ban smart glasses.</p><p>And in the thread under Terpak’s post, social media consultant Rachel Karten <a href=\"https://twitter.com/milkkarten/status/1736176825951494608?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">wrote</a>, “I can’t stop thinking about how this trend might be the thing to make smart glasses mainstream/cool/relevant.” Which is true. This might be it!</p><p>We’re basically one big trend away from smart glasses catching on and I hope they do! I also hope they don’t end with just camera glasses and we actually get something with a workable HUD display. Would this create all kinds of new problems with society and only further ingrain the decentralized panopticon we live in? Sure, but I think it’d be cool and I’m tired of looking at my phone all the time.</p><hr /><h2>Ziwe’s George Santos Interview Is Up</h2><p>There are, of course, all kinds of ethical issues around platforming George Santos, but, also, if anyone’s going to do this and do this well, it’s Ziwe. And she does.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.nytimes.com/interactive/2023/12/17/world/asia/myanmar-cyber-scam.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">“7 Months Inside an Online Scam Labor Camp”</a></p></li><li><p><a href=\"https://www.theatlantic.com/technology/archive/2023/12/internet-information-trends-virality-tracking/676888/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">“Nobody Knows What’s Happening Online Anymore”</a></p></li><li><p><a href=\"https://www.404media.co/facebook-is-being-overrun-with-stolen-ai-generated-images-that-people-think-are-real/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">“Facebook Is Being Overrun With Stolen, AI-Generated Images That People Think Are Real”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://twitter.com/akanaphenix/status/1736488120923701504?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-only-thing-we-can-talk-now-about-is-celebrities\" target=\"_blank\">thread that will make you feel very old</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=cec7cbea-ada7-44b7-84b1-56d905c6262a&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"2ec88009f18abd9ffa4947bd55f69e7664b375d1d0d06223fbd46191b88caa7f","category":"default"}