{"title":"&#8220;A Vote for Donald Trump Is a Vote for School Shootings and Measles&#8221;","link":"https://kottke.org/24/10/a-vote-for-donald-trump-is-a-vote-for-school-shootings-and-measles","date":1730209609000,"content":"\n        <p>One of the best media endorsements of this election cycle comes from EIC Nilay Patel of The Verge, <a href=\"https://www.theverge.com/24282022/kamala-harris-endorsement-presidential-election-2024\">who absolutely pulls no punches in describing Donald Trump and his by-now very familiar patterns and desires</a>.</p>\n\n<blockquote><p>Trump simply cannot use the tools of democracy to run the country on our behalf. His brain does not work that way, even when it appears to be working. He is too selfish, too stupid, too cognitively impaired, too fucked in the head by social media — too whatever. He just can’t do it. He will make our collective action problems worse because he doesn’t even know what kind of problems they are. There is a reason he loves dictators and that all his biggest ideas involve forcing people to do things at the barrel of a gun: mass deportations, arresting his critics, sending the military into American cities to quell protests. He is unable to imagine a world where people cooperate for any reason other than the threat of violence, and so violence has become an inextricable part of his movement.</p></blockquote>\n\n<p>I love Patel’s use of the <a href=\"https://en.wikipedia.org/wiki/Collective_action_problem\">collective action problem</a> to frame his argument. From earlier in the piece:</p>\n\n<blockquote><p>Collective action problem is the term political scientists use to describe any situation where a large group of people would do better for themselves if they worked together, but it’s easier for everyone to pursue their own interests. The essential work of every government is making laws that balance the tradeoffs between shared benefits and acceptable restrictions on individual or corporate freedoms to solve this dilemma, and the reason people hate the government is that not being able to do whatever you want all the time is a huge bummer. Speed limits help make our neighborhoods safer, but they also mean you aren’t supposed to put the hammer down and peel out at every stoplight, which isn’t any fun at all.</p></blockquote>\n\n<p>I also thought this was a really interesting observation regarding the challenge facing Democrats (of fitting moderate conservatives, the far-left, and everyone else who isn’t in favor of authoritarianism under the same tent):</p>\n\n<blockquote><p>Trump and the MAGA movement have stripped the Republican Party of the ability to govern democratically, so that process has moved inside the Harris coalition.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Kamala%20Harris\">Kamala Harris</a> · <a href=\"https://kottke.org/tag/Nilay%20Patel\">Nilay Patel</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"2ff9eee2e0e8acc16323820c7f4961b4017ae48d259417d9ec56b0df884a673b","category":"Sites"}