{"title":"Prisons We Choose to Live Inside: Doris Lessing on Redeeming Humanity","link":"https://www.themarginalian.org/2024/11/11/doris-lessing-massey-lectures/","date":1731354554000,"content":"<p><a href=\"https://www.amazon.com/Prisons-We-Choose-Live-Inside/dp/0060390778/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"514\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?fit=320%2C514&amp;ssl=1\" alt=\"Prisons We Choose to Live Inside: Doris Lessing on Redeeming Humanity\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?w=933&amp;ssl=1 933w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?resize=320%2C514&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?resize=600%2C965&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?resize=240%2C386&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/dorislessing_massey.jpg?resize=768%2C1235&amp;ssl=1 768w\" /></a></p><p>This is the history of the world: revolutionaries turning into tyrants, leaders who claim to stand with the masses turning the individuals within them on each other, stirring certainties and self-righteousness to distract from the uncomfortable unknowns, from the great open question of what makes us and keeps us human, and human together. </p>\n<p>This is also the history of the world: artists — those <a href=\"https://www.themarginalian.org/2024/11/06/transition/\">lighthouses of the spirit</a> — speaking truth to power, placing imagination ahead of ideology, the soul above the self, <a href=\"https://www.themarginalian.org/2019/10/21/iris-murdoch-unselfing/\">unselfing</a> us into seeing each other, into remembering, as James Baldwin told Margaret Mead in <a href=\"https://www.themarginalian.org/2015/03/19/a-rap-on-race-margaret-mead-and-james-baldwin/\">their epochal conversation</a>, that “we are still each other’s only hope.”</p>\n<p>Born in Iran months after the end of the First World War and raised by farming parents in present-day Zimbabwe, <strong>Doris Lessing</strong> (October 22, 1919–November 17, 2013) was still a girl when she sensed something deeply wrong with the unquestioned colonial system of her world, with the oppression that was the axis of that world. By the time she was a young woman — a time when our urge to rebel against the broken system is fiery but we don’t yet have the tools to rebel intelligently, don’t yet know the right questions to ask in order to tell whether the answer we are holding up as an alternative is any better or worse — she rebelled by embracing Communism as “an interesting manifestation of popular will.” Working by that point as a telephone operator in England, she joined the Communist Party. “It was a conversion, apparently sudden, and total (though short-lived),” she would later recall. “Communism was in fact a germ or virus that had already been at work in me for a long time… because of my rejection of the repressive and unjust society of old white-dominated Africa.” It didn’t take her long to see the cracks in Communism. She left the party, discovered Sufism, grew fascinated with the nascent field of of behavioral psychology and its revelatory, often disquieting findings about the inner workings of the mind, of its formidable powers to act and its immense vulnerabilities to being acted upon. But she found no ready-made answer to the problem of social harmony.</p>\n<p><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_TheMarginalian.jpg?resize=680%2C510&amp;ssl=1\" width=\"680\" height=\"510\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_TheMarginalian.jpg?w=757&amp;ssl=1 757w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_TheMarginalian.jpg?resize=320%2C240&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_TheMarginalian.jpg?resize=600%2C450&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_TheMarginalian.jpg?resize=240%2C180&amp;ssl=1 240w\" /></p>\n<p>And so, in that way artists have of complaining by creating, she devoted her life — almost a century of life, a century of world wars and violent uprisings, of changes unimaginable to her parents — to asking the difficult, clarifying questions that help us better understand what makes us human, how we allow ourselves to dehumanize others, and what it takes to cohere, as individuals and as societies. At 87, she became the oldest person to receive the Nobel Prize, awarded her for writing that “with scepticism, fire and visionary power has subjected a divided civilisation to scrutiny.”</p>\n<p>In 1985, months after I was born under Bulgaria’s Communist dictatorship, Doris Lessing delivered Canada’s esteemed annual Massey Lectures, later adapted into a series of short essays under the haunting title <a href=\"https://www.amazon.com/Prisons-We-Choose-Live-Inside/dp/0060390778/?tag=braipick-20\" target=\"_blank\"><strong><em>Prisons We Choose to Live Inside</em></strong></a> (<a href=\"https://search.worldcat.org/title/74384615\" target=\"_blank\"><em>public library</em></a>) — a searching look at how it is that “we (the human race) are now in possession of a great deal of hard information about ourselves, but we do not use it to improve our institutions and therefore our lives,” lensed through a lucid faith that we have all the power, urgency, and dignity we need to choose otherwise, to use what we have learned about the worst of our nature to nurture and magnify the best of our nature, to figure out “how we behave so that we control the society and the society does not control us.”  </p>\n<figure><a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=680%2C453&amp;ssl=1\" width=\"680\" height=\"453\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?w=2560&amp;ssl=1 2560w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=320%2C213&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=600%2C399&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=240%2C160&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=768%2C511&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=1536%2C1022&amp;ssl=1 1536w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?resize=2048%2C1363&amp;ssl=1 2048w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/LittlePrince_Morgan-scaled.jpg?w=1360&amp;ssl=1 1360w\" /></a><figcaption>One of Antoine de Saint Exupéry’s <a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\">original watercolors for <em>The Little Prince</em></a>. (Morgan Library &amp; Museum)</figcaption></figure>\n<p>In a sentiment Rebecca Solnit would echo three decades later in her modern classic <a href=\"https://www.themarginalian.org/2016/03/16/rebecca-solnit-hope-in-the-dark-2/\"><em>Hope in the Dark</em></a>, Lessing writes:</p>\n<blockquote><p>This is a time when it is frightening to be alive, when it is hard to think of human beings as rational creatures. Everywhere we look we see brutality, stupidity, until it seems that there is nothing else to be seen but that — a descent into barbarism, everywhere, which we are unable to check. But I think that while it is true there is a general worsening, it is precisely because things are so frightening we become hypnotized, and do not notice — or if we notice, belittle — equally strong forces on the other side, the forces, in short, of reason, sanity and civilization.</p></blockquote>\n<p>To be realistic about our own nature, Lessing argues, requires attentiveness to both of these strands — the destructive and the creative. This is the cosmic mirror Maya Angelou held up to humanity in her <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">stunning space-bound poem</a>, urging us to “learn that we are neither devils nor divines.” An epoch before her, Bertrand Russell — also a Nobel laureate in Literature, though trained as a scientist — <a href=\"https://www.themarginalian.org/2013/02/21/education-and-the-good-life-bertrand-russell/\">reckoned with our twin capacities</a> to define them in elemental terms — “We construct when we increase the potential energy of the system in which we are interested, and we destroy when we diminish the potential energy.” — and in existential terms: “Construction and destruction alike satisfy the will to power, but construction is more difficult as a rule, and therefore gives more satisfaction to the person who can achieve it.” </p>\n<p>Our sanity, Lessing observes, lies in “our capacity to be detached and unflattering about ourselves” — and in the understanding that our selves are not islanded in time but lineages of beliefs and tendencies with roots much longer than our lifetimes, not sovereign but contiguous with all the other selves that occupy the particular patch of spacetime we have been born into. It is vital, she insists, that we examine ourselves — our selves, and the constellation of selves that is our given society — from various elsewheres. </p>\n<figure><a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_FelicitaSala.jpg\" /></a><figcaption>Art by Felicita Sala from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>.</figcaption></figure>\n<p>This is why we need writers — those professional observers, in Susan Sontag’s <a href=\"https://www.themarginalian.org/2014/02/10/the-project-of-literature-susan-sontag-92y/\">splendid definition</a>, whose job it is to “pay attention to the world” and shine the light of that attention on every side of the kaleidoscope that is a given culture at a given time. A decade after Iris Murdoch wrote in her <a href=\"https://www.themarginalian.org/2019/02/12/iris-murdoch-salvation-by-words/\">superb reckoning with the role of literature in democracy</a> that “tyrants always fear art because tyrants want to mystify while art tends to clarify,” Lessing writes:</p>\n<blockquote><p>In totalitarian societies writers are distrusted for precisely this reason… Writers everywhere are aspects of each other, aspects of a function that has been evolved by society… Literature is one of the most useful ways we have of achieving this “other eye,” this detached manner of seeing ourselves; history is another.</p></blockquote>\n<p>Because we are the future of our own past, the posterity of our ancestors, looking back on history from our present vantage point offers fertile training ground for looking forward, for shaping the world of tomorrow. Lessing writes:</p>\n<blockquote><p>Anyone who reads history at all knows that the passionate and powerful convictions of one century usually seem absurd, extraordinary, to the next. There is no epoch in history that seems to us as it must have to the people who lived through it. What we live through, in any age, is the effect on us of mass emotions and of social conditions from which it is almost impossible to detach ourselves.</p>\n<p>[…]</p>\n<p>There is no such thing as my being in the right, my side being in the right, because within a generation or two, my present way of thinking is bound to be found perhaps faintly ludicrous, perhaps quite outmoded by new development — at the best, something that has been changed, all passion spent, into a small part of a great process, a development.</p></blockquote>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?resize=680%2C685&amp;ssl=1\" width=\"680\" height=\"685\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?w=1490&amp;ssl=1 1490w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?resize=320%2C322&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?resize=600%2C604&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?resize=240%2C242&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?resize=768%2C773&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/DorisLessing_NPG_TheMarginalian1.jpg?w=1360&amp;ssl=1 1360w\" /><figcaption>Doris Lessing, 1950s. (National Portrait Gallery, London)</figcaption></figure>\n<p>In consonance with Carl Sagan’s admonition against <a href=\"https://www.themarginalian.org/2016/11/09/carl-sagan-demon-haunted-world-ignorance-compassion/\">“the sense that we have a monopoly on the truth”</a> and with Joan Didion’s admonition against <a href=\"https://www.themarginalian.org/2016/12/05/joan-didion-on-morality/\">mistaking self-righteousness for morality</a>, Lessing offers:</p>\n<blockquote><p>This business of seeing ourselves as in the right, others in the wrong; our cause as right, theirs as wrong; our ideas as correct, theirs as nonsense, if not as downright evil… Well, in our sober moments, our human moments, the times when we think, reflect, and allow our rational minds to dominate us, we all of us suspect that this “I am right, you are wrong” is, quite simply, nonsense. All history, development goes on through interaction and mutual influence, and even the most violent extremes of thought, of behaviour, become woven into the general texture of human life, as one strand of it. This process can be seen over and over again in history. In fact, it is as if what is real in human development — the main current of social evolution — cannot tolerate extremes, so it seeks to expel extremes and extremists, or to get rid of them by absorbing them into the general stream.</p></blockquote>\n<p>Looking back on the colonialist Zimbabwe of her childhood, on the “prejudiced, ugly, ignorant” attitudes of the ruling whites, she reflects:</p>\n<blockquote><p>These attitudes were assumed to be unchallengeable and unalterable, though the merest glance at history would have told them (and many of them were educated people) that it was inevitable their rule would pass, that their certitudes were temporary.</p></blockquote>\n<p>At the center of Lessing’s inquiry is the paradox of how seemingly sound-minded, kind-hearted people get enlisted in ideologies of oppression. Kierkegaard <a href=\"https://www.themarginalian.org/2014/11/26/kierkegaard-individual-crowd-conformity-minority/\">had written</a> in the Golden Age of European revolutions — those idealistic but imperfect attempts to unify fractured feudal duchies into free nations, attempts that modeled the possibility of a United States of America — that “the evolution of the world tends to show the absolute importance of the category of the individual apart from the crowd,” that “truth always rests with the minority, and the minority is always stronger than the majority, because… the strength of a majority is illusory, formed by the gangs who have no opinion.” An epoch and a world order later, Lessing considers how regimes of terror take hold:</p>\n<blockquote><p>Nearly everyone in such situations behaves automatically. But there is always the minority who do not, and it seems to me that our future, the future of everybody, depends on this minority. And that we should be thinking of ways to educate our children to strengthen this minority and not, as we mostly do now, to revere the pack.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2023/11/26/bear-is-never-alone/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/bearisneveralone1.jpg\" /></a><figcaption>Art by Jeska Verstegen from <a href=\"https://www.themarginalian.org/2023/11/26/bear-is-never-alone/\"><em>Bear Is Never Alone</em></a> by Marc Veerkamp</figcaption></figure>\n<p>The mess we have made, she intimates, may be the most effective teaching tool we have — a living admonition against doing the same, a clarion call to rebel by doing otherwise:</p>\n<blockquote><p>Perhaps it is not too much to say that in these violent times the kindest, wisest wish we have for the young must be: “We hope that your period of immersion in group lunacy, group self-righteousness, will not coincide with some period of your country’s history when you can put your murderous and stupid ideas into practice. “If you are lucky, you will emerge much enlarged by your experience of what you are capable of in the way of bigotry and intolerance. You will understand absolutely how sane people, in periods of public insanity, can murder, destroy, lie, swear black is white.”</p></blockquote>\n<p>As for us, here in the roiling mess, our sole salvation lies in learning to “live our lives with minds free of violent and passionate commitment, but in a condition of intelligent doubt about ourselves and our lives, a state of quiet, tentative, dispassionate curiosity.” Lessing writes:</p>\n<blockquote><p>While all these boilings and upheavals go on, at the same time, parallel, continues this other revolution: the quiet revolution, based on sober and accurate observation of ourselves, our behaviour, our capacities… If we decided to use it, [we may] transform the world we live in. But it means making that deliberate step into objectivity and away from wild emotionalism, deliberately choosing to see ourselves as, perhaps, a visitor from another planet might see us.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/08/30/kamau-zuzu-find-a-way/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/kamauandzuzu4.jpg\" /></a><figcaption>Art by Diana Ejaita from <a href=\"https://www.themarginalian.org/2024/08/30/kamau-zuzu-find-a-way/\"><em>Kamau &amp; ZuZu Find a Way</em></a> by poet Aracelis Girmay</figcaption></figure>\n<p>This, in fact, was the conditional clause in Baldwin’s words to Mead — in order to be “each other’s only hope,” <a href=\"https://www.themarginalian.org/2015/03/19/a-rap-on-race-margaret-mead-and-james-baldwin/\">he said</a>, we ought to be “as clear-headed about human beings as possible.” This, too, was Maya Angelou’s conditional optimism for humanity: “That is when, and only when, we come to it” — to that <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">“Brave and Startling Truth,”</a> balanced on the fulcrum of our conflicted capacities, “that we are the possible, we are the miraculous, the true wonder of this world.”</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"3121a17d043eab1d3d7c58faff6fe27d2ce4c7899ea2c2ce179bfff191186418","category":"Sites"}