{"title":"Unlearning","link":"https://sive.rs/unlearning","date":1528329600000,"content":"<p>\nThings I learned in the past are now wrong.\nTimes have changed.\n</p><p>\nBeliefs that were true are now false.\nThey were based on old limitations that are now gone.\n</p><p>\nWays that used to work don’t work anymore.\nThe old road collapsed.\nThere’s a tunnel through the mountain now.\nWhen the old map is wrong, we can’t just draw a new line on it — we need to get a new map or we’ll be following closed roads.\n</p><p>\nSometimes the world is the same, but my situation has changed.\nWhat got me here won’t get me there.\n</p><p>\n<strong>\nThe solution is deliberate unlearning.\n</strong>\n</p><ol><li>\nDoubt what I know.\n</li><li>\nStop the habit of thinking I know it.\n</li><li>\nRequire current proof that it’s still true today.\nOtherwise, let it go.\n</li></ol><p>\nWhere I had expertise before, I don’t now.\nPeople ask my advice on things I knew well years ago.\nIt’s tempting to think I still know the answer, but instead I have to admit, “Sorry. I don’t know.”\n</p><p>\nIt hurts to go from feeling like an expert to feeling like an idiot.\nBut it’s crucial to go through that pain or I’ll never grow.\n</p><p>\nJohn Cage said, “I can’t understand why people are frightened of new ideas. I’m frightened of the old ones.”\n</p><p>\nAlvin Toffler said, “The illiterates of the 21st century will not be those who cannot read and write but those who cannot learn, unlearn, and relearn.”\n</p><p>\nMany people learn only in their first third of life, so schools don’t teach unlearning.\n</p><p>\nWe want to see the world clearly and know what’s what.\nBut once we’re past the first stage of wisdom, the next stage involves adapting to new changes.\n</p><p>\nWe don’t get wise just by adding and adding.\nWe also need to <a href=\"https://sive.rs/subtract\">subtract</a>.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"31343596f16dede7153229417c86e9fd0b3377a08a4cdd15301603e24b9470ce","category":"Sites"}