{"title":"Our Unpleasant Privatized Reality","link":"https://kottke.org/24/06/our-unpleasant-privatized-reality","date":1717447080000,"content":"\n        <p>Hamilton Nolan, <a href=\"https://www.hamiltonnolan.com/p/everyone-into-the-grinder\">Everyone Into The Grinder</a>:</p>\n\n<blockquote><p>Rich kids should go to public schools. The mayor should ride the subway to work. When wealthy people get sick, they should be sent to public hospitals. Business executives should have to stand in the same airport security lines as everyone else. The very fact that people want to buy their way out of all of these experiences points to the reason why they shouldn’t be able to. Private schools and private limos and private doctors and private security are all pressure release valves that eliminate the friction that would cause powerful people to call for all of these bad things to get better. The degree to which we allow the rich to insulate themselves from the unpleasant reality that others are forced to experience is directly related to how long that reality is allowed to stay unpleasant. When they are left with no other option, rich people will force improvement in public systems. Their public spirit will be infinitely less urgent when they are contemplating these things from afar than when they are sitting in a hot ER waiting room for six hours themselves.</p></blockquote>\n\n<p>See also Ranjan Roy’s <a href=\"https://www.readmargins.com/p/the-sweetgreen-ification-of-society\">The Sweetgreen-ification of Society</a> and Tom Junod’s <a href=\"https://www.esquire.com/news-politics/news/a15636/whitewater-flash-pass-12403562/\">The Water-Park Scandal and Two Americas in the Raw: Are We a Nation of Line-Cutters, or Are We the Line?</a> about the introduction of a cut-the-line pass at a waterpark:</p>\n\n<blockquote><p>It wouldn’t be so bad, if the line still moved. But it doesn’t. It stops, every time a group of people with Flash Passes cut to the front. You used to be able to go on, say, three or four rides an hour, even on the most crowded days. Now you go on one or two. After four hours at Whitewater the other day, my daughter and I had gone on five. And so it’s not just that some people can afford to pay for an enhanced experience. It’s that your experience - what you’ve paid full price for - has been devalued. The experience of the line becomes an infernal humiliation; and the experience of avoiding the line becomes the only way to enjoy the water park.</p></blockquote>\n\n<p>And <a href=\"https://kottke.org/21/11/where-the-rich-use-public-transportation\">this quote</a> from the former mayor of Bogotá, Enrique Peñalosa:</p>\n\n<blockquote><p>An advanced city is not one where even the poor use cars, but rather one where even the rich use public transport.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Enrique%20Penalosa\">Enrique Penalosa</a> · <a href=\"https://kottke.org/tag/Hamilton%20Nolan\">Hamilton Nolan</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Ranjan%20Roy\">Ranjan Roy</a> · <a href=\"https://kottke.org/tag/Tom%20Junod\">Tom Junod</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"31777b7b0021d7a9b2fc0b13e63f770fcfeea218173bb0943974892a27a57a4e","category":"default"}