{"title":"Musk, the Foxy Kingmaker","link":"https://om.co/2024/07/23/musk-the-foxy-kingmaker/","date":1721756650000,"content":"<p>No matter how much I try to avoid political news, there’s no hiding from the forthcoming U.S. presidential election and the ensuing political circus. Not even technology newsletters are a respite. <a target=\"_blank\" href=\"https://www.theatlantic.com/technology/archive/2024/07/joe-biden-x-announcement-elon-musk/679184/?utm_campaign=galaxy-brain&amp;utm_content=20240723&amp;utm_source=newsletter&amp;utm_medium=email&amp;lctg=6050f061f98ec7553cebfa1e&amp;utm_term=Galaxy%20Brain\">Charlie Warzel</a> of The Atlantic and <a target=\"_blank\" href=\"https://www.bloomberg.com/news/newsletters/2024-07-23/musk-flips-script-on-who-suspects-political-bias-on-x?cmpid=BBD072324_TECH&amp;utm_medium=email&amp;utm_source=newsletter&amp;utm_term=240723&amp;utm_campaign=tech\">Sarah Frier</a> of Bloomberg in their most recent editions made a point that echoes something I said two years ago when Elon Musk was ready to overpay for Twitter: in the long run, that deal is going to be a win for Musk because it would anoint him as the kingmaker.</p>\n\n\n\n<p>For me, Twitter (now X) was going to replace Rupert Murdoch’s Fox. I said as much two years ago in a piece for <a target=\"_blank\" href=\"https://om.co/2023/05/15/the-musky-fox/\">The Spectator UK</a>. It was clear that Musk would become <a target=\"_blank\" href=\"https://om.co/2023/05/25/twitter-is-new-fox/\">the new kingmaker for the conservative agenda</a>.</p>\n\n\n\n<blockquote>\n<p>Musk has also realized that social media is going the way of traditional media — and divided along political affiliations. As an owner with right-of-center leanings, Twitter will succeed where every other right-of-center leaning social network — Gab, Parler, Truth Social — has failed.</p>\n\n\n\n<p>Musk has bought the Fox News of the post-TV reality for $44 billion, a pittance considering how much power it gives him over his rivals and the politicians. We can all sense that with Rupert Murdoch in the twilight of his career, and cable revenues declining due to cord-cutting, Fox News isn’t going to set the political agenda for much longer.</p>\n</blockquote>\n\n\n\n<p>Despite negativity and increased competition from Facebook’s Threads and other alternatives, Twitter (now X) remains the go-to platform for news. It can influence perception and discourse, generate stories and shape narratives. Even those opposed to Musk’s views must engage on his platform.</p>\n\n\n\n<p>President Joe Biden, despite X’s often anti-Biden stance, had to announce his decision to seek re-election there. Traditional news outlets such as CNN and TV networks that previously were the first call for politicians have faded into the background. The continued pre-eminence of even a deprecated Twitter shows how much power sits in Elon Musk’s hands.</p>\n\n\n\n<p>In 2022, when Musk was about to purchase Twitter,<a target=\"_blank\" href=\"https://om.co/2022/04/25/why-elon-is-buying-twitter/\"> I outlined my theory</a> about why he wanted to buy the social media platform:</p>\n\n\n\n<blockquote>\n<p>Musk is too intelligent to care about politics. After all, politicians are fungible, but billions are forever. Elon’s desire to buy Twitter has nothing to do with free speech and some well-meaning concepts of cleaning up the platform or making the company efficient and innovative. However, all those would be nice. </p>\n\n\n\n<p>Instead, buying Twitter ensures that he is never locked out from the platform that gives him the <strong>bully pulpit and power</strong> — the man needs the megaphone to achieve his final goals.</p>\n</blockquote>\n\n\n\n<p>This is precisely what I meant by the “bully pulpit” – a platform from which to speak directly to the public and influence the conversation. In the past, presidents and media barons held this power. Now it belongs to Musk, the richest man (depending on stock market valuations).</p>\n\n\n\n<p>Again, it’s not a surprise, as I’ve written about this fundamental change in how information flows in the age of connectedness. Traditional media, once the gatekeepers of public discourse, now feel plodding and struggle to keep up with the noise of news on social platforms. Now, traditional media is on the back foot, almost constantly reacting to conversations started on Twitter. Musk understood this well and bought a platform that can easily create a fog of half-truths.</p>\n\n\n\n<p>Musk is more effective at controlling the agenda than traditional media ever were. Immediate, global and allowing for direct interaction, Twitter doesn’t distinguish much between real authorities and bots. It doesn’t spend much time worrying about editorial filters and fact-checkers, for better or worse. Crucially, it gives Musk unprecedented power to amplify certain voices — no matter how outlandish —and suppress others, particularly his critics.</p>\n\n\n\n<p>He will say anything as long as it furthers his interests — and will stay quiet about issues that don’t suit his interests. It would be fun to see him tee-off on the Chinese leadership. However, that’s unlikely to happen, given that China is a crucial market for Tesla. And that’s not in Elon’s personal best interest.</p>\n\n\n\n<p><strong><em>July 23, 2024. San Francisco </em></strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"318b8708b46f887683d0bcef32be93f549fe7e8e76104910ce6252e35c87a26b","category":"default"}