{"title":"Actions, not words, reveal our real values","link":"https://sive.rs/arv","date":1497571200000,"content":"<p>\nI told my old coach that I really wanted to start my new company.\n</p><p>\nHe said, “No, you don’t.”\n</p><p>\nI said, “Yes, I do!\nThis is really important to me!”\n</p><p>\nHe said, “No, it’s not.\nSaying it doesn’t make it true.”\n</p><p>\nI said, “You can’t ignore what I’m saying.\nI know myself well.\nI’m telling you what’s important to me.”\n</p><p>\nHe said, “Yes, I can ignore what you’re saying and just look at your actions.\nOur actions always reveal our real values.”\n</p><p>\nI thought about that, but it sounded wrong to me.\nWhat about people who want to learn languages, or create businesses, but haven’t started yet?\nWhat about people who want to quit smoking or quit their jobs, but haven’t been able to yet?\n</p><p>\nHe said, “<strong>If they really wanted to do it, they would have done it.</strong>\nYou’ve been talking about this new company idea since 2008, but never launched it.\nLooking at your actions, and knowing you, I’d say that you don’t really want to start another company.\nYou actually prefer the simple life you have now, focused on learning, writing, and playing with your kid.\n<strong>No matter what you say, your actions reveal the truth.</strong>”\n</p><p>\nWow.\nYep.\nHe was right.\n</p><p>\nI had been fooling myself for years, telling myself I wanted to do this, but my actions proved otherwise.\nYes, I wanted it a little bit, but I wanted something else more.\n</p><p>\nNow I’ve been sharing this thought with friends who talk about wanting something, but aren’t making it happen.\nEach time, they have the same reaction I did.\n</p><p>\nNo matter what you tell the world or tell yourself, your actions reveal your real values.\n<strong>\nYour actions show you what you actually want.\n</strong>\n</p><p>\nThere are two smart reactions to this:\n</p>\n<ol><li>\nStop lying to yourself, and admit your real priorities.\n</li><li>\nStart doing what you say you want to do, and see if it’s really true.\n</li></ol>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"3297e0790943cc84b08c789abf4972e61c83ee01f12771358cb5827a1ad8cff0","category":"Sites"}