{"title":"Are Kids Screenable?","link":"https://om.co/2024/10/14/are-kids-screenable/","date":1728941005000,"content":"<p>Last week over coffee, a friend told me about <a href=\"https://getscreenable.com\" target=\"_blank\">Screenable</a>, a new app designed to help with digital parenting. Founded by ex-Googler Tom Clifton and his brother, Stevie, the app manages children’s access to smartphones. Screenable limits access to phones and text messages, for example. It works on any Apple phone or iPad released in the past 10 years. The developers have created a simple way for parents to manage screen time and device access. They call it “Kid Phone for Apple families.” </p>\n\n\n\n<p><strong><em>Cute!</em></strong></p>\n\n\n\n<p>When I first heard about it, I thought it was a good idea. I’d even use it to limit my screen time and avoid getting worked up over comments on social media. There’s also the GenZ trend toward minimalist “dumb phones.” I’ve watched enough YouTube videos to learn how to turn my smartphone into a basic device, but Screenable seems easier.</p>\n\n\n\n<p>I wanted to know more, so I decided to reach out to Tom and talk about the motivation behind Screenable. Clifton, being a technologist, knows well that there are benefits and downsides to kids having smartphones. Apple, the iPhone maker, seems to know that not all is perfect in our smartphone world. That’s why he and his brother came up with Screenable.</p>\n\n\n\n<p>“We’re pretty pro-technology. I borderline consider myself a futurist, but we’re also realists,” says Clifton. “Phones are super powerful, and just like anything powerful—like driving a car—we want our kids to eventually be able to enjoy the benefits. But we also know it takes time and training to get there, and you have to go slowly and progressively.”</p>\n\n\n\n<p>But as Clifton told me, the decision to start the app stemmed from frustrations he and other parents shared regarding existing parental control options in Apple’s Screen Time. He described it as “a mess of settings” prone to breaking down. He isn’t wrong — with an ever-expanding ecosystem, Apple has lost much of the simplicity that once marked its software.</p>\n\n\n\n<p>“Apple has not given us what we need,” Clifton says. “Their Screen Time is just a mess of settings and they’re neither parent- nor kid-friendly. We wanted to solve that problem and do it the right way.”</p>\n\n\n\n<p>The app uses Apple’s Screen Time API to provide granular control. The app requires that the target device be set up as a “kid mode” account in Apple’s Family Sharing system, which allows these restrictions to be applied effectively. In a perfect world, Apple would invest in making the Screen Time API more robust for developers to build better experiences.</p>\n\n\n\n<blockquote></blockquote>\n\n\n\n<h3><strong>How Does Screenable Work?</strong></h3>\n\n\n\n<p>Screenable, an app available for download from Apple’s App Store, allows parents to limit the features and functionalities of their child’s device. Currently available for iPhones and iPads, it offers settings appropriate for kids of varying ages. The four modes are essentially simplified access for “ages and stages.”</p>\n\n\n\n<ul>\n<li><strong>Media Player Mode</strong>: When using shared devices like a family iPad, it gives children a safe way to watch videos or play games without access to the broader internet.</li>\n\n\n\n<li><strong>Dumb Phone Mode</strong>: This mode limits the device’s functionality to just calling and texting, and possibly location sharing, with all other apps inaccessible.</li>\n\n\n\n<li><strong>Screen Trainer Mode</strong>: As children grow older, the Screen Trainer Mode allows parents to monitor usage, set daily limits and receive reports on screen time without intruding on privacy.</li>\n\n\n\n<li><strong>Social Trainer Mode</strong>: For teens ready to start using social media, Social Trainer Mode provides a guided introduction to apps like Snapchat or Instagram. Parents receive advice on setting up in-app parental controls.</li>\n</ul>\n\n\n\n<p>All this isn’t free — it costs about $5 a month.</p>\n\n\n\n<p>“The idea is to offer parents an easy way to dial down the phone to the right level of power for each kid’s age and stage,” Clifton explains. “It’s not about locking everything down forever, but about gradually opening up access as they demonstrate responsibility.”</p>\n\n\n\n<h3><strong>Future Plans</strong></h3>\n\n\n\n<p>Screenable is currently limited to iPhones and iPads, but the company wants to expand to other Apple devices like MacBooks and Apple Watches. The app launched two weeks ago and has signed up a few hundred people. Not surprisingly, even adults have expressed strong interest in the app for their own use.</p>\n\n\n\n<p>“Parents keep asking us, ‘How do we use this for ourselves?’ They see the value for their kids, but also want to be able to control their own screen habits,” says Clifton. “That’s definitely something we’re exploring.”</p>\n\n\n\n<p>What I like about Tom and his family — yes, it’s a family business, with his brother and their wives, Scarlet and Hannah, are now part of the company — is that they aren’t aiming to build a hyper-growth, venture-scale business. “We’ve raised tens of millions of dollars before, and it came with a lot of pressure to grow, grow, grow,” Clifton reflects. “This time, we want to build slowly and sustainably. We want to do things the right way.”</p>\n\n\n\n<p><em>Good for them!</em></p>\n\n\n\n<p>I don’t have children, so I don’t fully understand the emotional pressures of managing the digital lives of impressionable minds. However, I see this as a good way to build something of value that simplifies and eases things for parents. As Tom aptly says, “It’s not about being anti-technology. It’s about being pro-responsibility.”</p>\n\n\n\n<p><strong><em>October 14, 2024. San Francisco</em></strong></p>\n\n\n\n<p>If you’re reading this and have children or grandchildren,<a href=\"https://getscreenable.com/\" target=\"_blank\"> try out Screenable</a>. And let me know about the experience. </p>\n\n\n\n<p>There is no Android-version neither are there any plans to develop for Android OS for the near future.</p>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"334cb20d4c91238ab8724c44789a0ab1c732eda1e6afaa26ad5ddd5d033d5ba1","category":"Sites"}