{"title":"Here’s how to live: Create.","link":"https://sive.rs/htl23","date":1640217600000,"content":"<p>\nThe most valuable real estate in the world is the graveyard.\n<br />\nThere lie millions of half-written books, ideas never launched, and talents never developed.\n<br />\nMost people die with everything still inside of them.\n</p><p>\nThe way to live is to create.\n<br />\nDie empty.\n<br />\nGet every idea out of your head and into reality.\n</p><p>\nCalling yourself creative doesn’t make it true.\n<br />\nAll that matters is what you’ve launched.\n<br />\nMake finishing your top priority.\n</p><p>\nWhen most people see modern art, they think, “I could do that!”\n<br />\nBut they didn’t.\n<br />\nThat is the difference between consumer and creator.\n</p><p>\nWhich would you rather be?\n<br />\nSomeone who hasn’t created anything in years because you’re so busy consuming?\n<br />\nOr someone who hasn’t consumed anything in years because you’re so busy creating?\n</p><p>\nDon’t wait for inspiration.\n<br />\nInspiration will never make the first move.\n<br />\nShe comes only when you’ve shown you don’t need her.\n<br />\nDo your work every day, no matter what.\n</p><p>\nSuspend all judgment when creating the first draft.\n<br />\nJust get to the end.\n<br />\nIt’s better to create something bad than nothing at all.\n<br />\nYou can improve something bad.\n<br />\nYou can’t improve nothing.\n</p><p>\nMost of what you make will be fertilizer for the few that turn out great.\n<br />\nBut you won’t know which is which until afterward.\n<br />\nKeep creating as much as you can.\n</p><p>\nCreativity is a magic coin.\n<br />\nThe more you spend, the more you have.\n</p><p>\nDon’t alter your state with alcohol or drugs.\n<br />\nThey make the mundane more interesting to you, which then makes you less interesting to others.\n<br />\nThey make you think you’re creative when you’re actually boring.\n<br />\nOnly creating makes you creative.\n</p><p>\nEmbrace what’s weird about you, and use it to create.\n<br />\nNever think you need to be normal or perfect.\n<br />\nFlawless people don’t need to make art.\n</p><p>\nPicasso was asked if he knew what a painting was going to look like when he started it.\n<br />\nHe said, “No, of course not. If I knew, I wouldn’t bother doing it.”\n<br />\nDon’t just express yourself.\n<br />\nDiscover yourself.\n<br />\nCreate questions, not answers.\n<br />\nExplore whatever excites you most.\n<br />\nIf you’re not excited by it, your audience won’t be either.\n</p><p>\nImitate your heroes.\n<br />\nIt’s not copying because it won’t be the same.\n<br />\nYour imitation of anything will be unrecognizably warped by your own twisted perspective.\n<br />\nMost creations are new combinations of existing ideas.\n<br />\nOriginality just means hiding your sources.\n</p><p>\nCreating is a higher form of communicating.\n<br />\nYou join the elite conversation by contributing.\n<br />\nYou reference creations from the past to make your own unique addition or combination.\n<br />\nThe dialog can span centuries.\n</p><p>\nCreating is telepathy.\n<br />\nYou speak directly to people across the world, whether days or decades from now, connecting your mind to theirs.\n<br />\nYou send important messages to those who can hear it.\n</p><p>\nWhen your creation is good enough, let it go.\n<br />\nRelease it, so it can go out into the world, without you.\n<br />\nIt can join the conversation, and others can improve it.\n</p><p>\nSeparate creation and release.\n<br />\nWhen you’ve finished a work, wait a while before you release it to the world.\n<br />\nBy then, you’re on to something new.\n<br />\nThe public comments won’t affect you, since they will be about your past work.\n</p><p>\nConsider creating under a pseudonym.\n<br />\nThis will help you know that criticism is not about you, just something you made.\n</p><p>\nIf you are proud of what you made, it was a success.\n<br />\nThe less you please everyone else, the more you please your fans.\n<br />\nReal success comes not from the crowd, but from feeling proud.\n</p><p>\nLive in a city.\n<br />\nCities are more conducive to creativity.\n<br />\nGeniuses come from cities.\n<br />\nIt reminds you of your audience.\n<br />\nUltimately, you need to connect with people, not trees.\n<br />\nStay in situations where you’re forced to show your work to others.\n</p><p>\nCollect ideas in a crowd.\n<br />\nCreate in silence and solitude.\n<br />\nLike your bedroom, your work space needs to be private.\n<br />\nThis is where you dream and get naked.\n</p><p>\nForget the view outside your window.\n<br />\nFocus on the view inside your head.\n<br />\nInstead of bringing the world in to your mind, bring your mind out to the world.\n</p><p>\nDistribute your work as widely as you can.\n<br />\nDo whatever it takes to call attention to it.\n<br />\nArt needs an audience.\n<br />\nThere are no unknown geniuses.\n</p><p>\nCharge money to make sure your creations are going to people who really want them.\n<br />\nPeople don’t value what’s free.\n<br />\nCharge for their sake as much as yours.\n<br />\nCharge even if you don’t need the money.\n</p><p>\nIncorporate a company.\n<br />\nName it something you can take seriously.\n<br />\nYou own the company, and it owns your creations.\n<br />\nThat creates a healthy distance so the company can demand payment for its copyrights.\n<br />\nIt can be your guard dog and bill collector, so you can remain a pure artist.\n</p><p>\nKeep a counterweight job.\n<br />\nSomething effortless that covers your bills.\n<br />\nSomething you can do a few hours per day, but otherwise not think about.\n<br />\nIt gives discipline and regularity to your life.\n<br />\nIt gives deadlines and freedom to your art.\n</p><p>\nLet the deadline of death drive you.\n<br />\nCreate until your last breath.\n<br />\nLet your last spark of life go into your work.\n<br />\nDie empty, so death takes only a corpse.\n</p><p>\nWhen you’re gone, your work shows who you were.\n<br />\nNot your intentions.\n<br />\nNot what you took in.\n<br />\nOnly what you put out.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"33f10c89058667df80fe79d02c349228831006afa818484cb39ccb21f027cdc4","category":"Sites"}