{"title":"Matriline versus Patriline: Social Mobility in England, 1754-2023","link":"https://feeds.feedblitz.com/~/867201887/0/marginalrevolution~Matriline-versus-Patriline-Social-Mobility-in-England.html","date":1706790069000,"content":"<p>Greg Clark may well be the most important social scientist of the 21st century. His use of historical data informed by evolutionary theory and genetics is a unique contribution to social science with important and challenging results.</p>\r\n<p>Clark’s <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.ehes.org/wp/EHES_248.pdf\">latest paper</a> (with Neil Cummins) makes a simple but striking point. If the primary systematic determinant of social outcomes is genetic then we expect the father and the mother to contribute equally (each giving half their genes). If, on the other hand, the primary determinant is social then we expect widely different mother-father contributions in different societies and at different times and for different characteristics. Fathers ought to matter more in patriarchies, for example, and mothers more in matriarchies and gender-egalitarian societies. Similarly, if social factors are determinative, we would surely see a rising contribution of mothers to child outcomes as the social power of women rises (you can’t use your mother’s contacts in the legal profession to get a job, for example, if your mother was never a lawyer.) Similarly, if social factors are determinative we would expect mothers to be more important perhaps for characteristics determined early and fathers for characteristics determined late.</p>\r\n<p>As Clark and Cummins write:</p>\r\n<blockquote><p>Social institutions and conventions would suggest that social status will often be more strongly transmitted between generations on either the patriline or the matriline. The factors favoring stronger transmission on the matriline are the much greater involvement in all societies of mothers in the care and education of children. The greater time investment of mothers in childcare is found in all societies, even those such as in contemporary Nordic countries where gender equality is the most advanced. Thus we would on the human capital interpretation of social outcomes expect a greater maternal than paternal connection in the modern world. However, a countervailing force in earlier times was the greater access of fathers to resources, and professional contacts. Also since in earlier years only fathers had occupations and educational qualifications, the father could be much more of a model for the outcomes of sons. It is thus uncertain whether the paternal or maternal line would better predict social outcomes in any earlier society. But we would expect the paternal effect to be greater in high status groups, and the maternal effect greater in average or lower class families.</p>\r\n<p>What we find with the FOE data, however, is that in 27 out of 31 child outcomes (other than wealth) examined across marriages in the years 1754-1995, the patriline and matriline had a predictive ability for child outcomes that was not statistically distinguishable at the 5% level. In the four cases where the coefficients differed significantly, in three the maternal effect was greater, and in one the paternal effect. Thus for most social outcomes – literacy, age at beginning work, age at leaving schooling, higher education, and occupational status – mother and fathers appear always to contribute roughly equally. The one clear exception is wealth, where always patriline wealth is a much stronger predictor of child wealth than is matriline wealth.</p>\r\n<p>…The results suggest, however, that the mechanism of transmission is largely independent of parental time interacting with children. The results reported above are thus consistent with the finding of Clark (2023) that the pattern of inheritance of most social outcomes in England 1600-2022 was consistent with direct additive genetic transmission. Such transmission would imply a symmetry of mother and father predictive effects.</p></blockquote>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/02/87627.html\">Matriline versus Patriline: Social Mobility in England, 1754-2023</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/867201887/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/867201887/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/867201887/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/867201887/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/867201887/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/867201887/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comment-160712817\">In reply to Sure.   Anecdotal, so take with a heap of salt: in ...</a> <i>by Raj Thomas</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comment-160712678\">In reply to Sure.   And yet father’s height is a better ...</a> <i>by Third Bill</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comment-160712672\">In reply to Reason.   (Here's some other results; among White ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comment-160712661\">In reply to Reason.   Reason, you're probably not reading this, ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comment-160712623\">In reply to Sure.   This does not account for X-inactivation in ...</a> <i>by Tony</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/87627.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/if-econs-could-hoop-the-new-bazaar.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=if-econs-could-hoop-the-new-bazaar\">If econs could hoop — The New Bazaar</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/01/did-the-trump-tariffs-help-the-heartland.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=did-the-trump-tariffs-help-the-heartland\">Did the Trump tariffs help the heartland?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/01/my-new-podcast-with-dwarkesh-patel.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-new-podcast-with-dwarkesh-patel\">My new podcast with Dwarkesh Patel</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"343943e6cc846a30c17515335f1f47bd9d7447050d1aa3a03440bdcdbe33d15f","category":"default"}