{"title":"Don’t quote. Make it yours and say it yourself.","link":"https://sive.rs/dq","date":1569715200000,"content":"<p>\nWhich sounds better to you?\n</p><p>\n“In his best-selling book on behavioral science, <em>Thinking, Fast and Slow</em>, Nobel-prize winning psychologist Daniel Kahneman said, ‘Nothing in life is as important as you think it is when you are thinking about it.’.”\n</p><p>\n… or just saying it:\n</p><p>\n“Whatever’s on your mind is not as important as it seems.”\n</p><p>\nWhen I first started reading a lot of books, I started quoting them a lot.\nWhen bringing up an idea in conversation, first I would mention its source — the book, the title, the author, and the subject of the book — before finally saying the idea.\n</p><p>\nAfter far too many times hearing myself referencing this book and that book, always naming titles and authors, I realized it was a lot of unnecessary clutter.\nI could see my listeners waiting for me to get to the point.\n<strong>\nIt was inconsiderate.\n</strong>\n</p><p>\nThen I started noticing how annoying it was to read books that do the same thing.\nIt’s really common in these <a href=\"https://sive.rs/book\">pop non-fiction</a> books I like:\n“This person said this thing. That person said that thing.”\n</p><p>\nIt got me wondering:\n<strong>\nWhy don’t we just say the idea, instead of referencing and quoting it?\n</strong>\n</p><p>\nI think there are a few reasons:\n</p>\n<ol><li>\n<strong>\nIt feels like stealing.\n</strong>\nIt’s <em>their</em> idea, not mine.\nBut all ideas come from somewhere.\nMaybe they were paraphrasing it from someone else.\n</li><li>\n<strong>\nSchool teaches us to reference.\n</strong>\nBut we’re not trying to impress a teacher anymore.\nAnd every unnecessary fact dilutes our point.\n</li><li>\n<strong>\nBy quoting someone else, we can easily disavow the idea if attacked.\n</strong>\nIf someone says it’s wrong, we can avoid responsibility and say, “Don’t look at me! It’s his idea, not mine!”\n</li></ol>\n<p>\nSo instead, I go the other way now.\n</p><p>\nIf I hear an idea, have considered it, and integrated it into my beliefs, <strong>it’s mine</strong>.\nI’ll say it succinctly in my own words, and stand behind it.\nLike adopting a child, I will take care of this idea and raise it as my own.\nIf anyone wants to know the source, I’ll be happy to tell them.\n</p><p>\nI highly recommend this.\nStop referencing.\nStop quoting.\nParaphrase.\nInternalize it.\nMake it yours.\n<strong>\nTell me what <em>you</em> think, not what someone else thinks.\n</strong>\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"347c492df34d71a3190c3fa0ab4f9e051457289f9d27e4b48ac615081949573b","category":"default"}