{"title":"How to thrive in an unknowable future","link":"https://sive.rs/d1t","date":1460937600000,"content":"<p>\n(part of <a href=\"https://sive.rs/d1\">the “do this” directives</a>)\n</p>\n<h3>1.\nPrepare for the worst.\n</h3><p>\nSince you have no idea what the future may bring, be open to the best and the worst.\n</p><p>\nBut the best case scenario doesn’t need your preparation or your attention.\n</p><p>\nSo mentally and financially prepare for the worst case, instead.\n</p><p>\nLike insurance, don’t obsess on it.\nJust prepare, then carry on appreciating the good times.\n</p>\n<h3>2.\nExpect disaster.\n</h3><p>\nEvery biography of a successful person has that line, “And then, things took a turn for the worse.”\n</p><p>\nFully expect that disaster to come to you at any time.\n</p><p>\nCompletely assume it’s going to happen, and make your plans accordingly.\n</p><p>\nNot just money, but health, family, freedom.\n<a href=\"https://sive.rs/book/StoicJoy\">Expect it all to disappear</a>.\n</p><p>\nBesides, you appreciate things more when you know this may be your last time seeing them.\n</p>\n<h3>3.\nOwn as little as possible. \n</h3><p>\nDepend on even less.\n</p><p>\nThe less you own, the less you’re affected by disaster.\n</p>\n<h3>4.\nChoose opportunity, not loyalty.\n</h3><p>\nHave no loyalty to location, corporation, or your past public statements.\n</p><p>\nBe an absolute <a href=\"https://sive.rs/book/Antifragile\">opportunist</a>, doing whatever is best for the future in the current situation, unbound by the past.\n</p><p>\nHave loyalty for only your most important human relationships.\n</p>\n<h3>5.\nChoose the plan with the most options.\n</h3><p>\nThe best plan is the one that lets you change your plans.\n</p><p>\n(Example: renting a house is buying the option to move at any time without losing money in a changing market.)\n</p>\n<h3>6.\nAvoid planning.\n</h3><p>\nFor maximum options, don’t plan at all.\n</p><p>\nSince you have no idea how the situation or your mood may change in the future, wait until the last moment to make each decision.\n</p>\n<img src=\"/images/thinking.jpg\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"34931019cbcd8122d5550d0d73f247cb100d35ab636c203d4e94dc496ce85077","category":"default"}