{"title":"Knicks win, fans stunned","link":"http://scripting.com/2024/05/04/134004.html?title=knicksWinFansStunned","date":1714830004000,"content":"<p></p><div><img src=\"https://imgs.scripting.com/2024/05/04/ogDunksOnEmbiidHahahaaahaLoveIt.png\" />Knicks star <a href=\"https://www.si.com/nba/knicks/slamanoby-og-anunoby-ends-new-york-knicks-series-style\">OG Anunoby</a> dunks on last season's MVP Joel Embiid.</div><p></p>\n<p><b>Two first round questions</b></p>\n<ul>\n<li>Why didn't Sixers coach Nick Nurse continue to play <a href=\"https://www.google.com/search?sca_esv=ecb6ee45659b3970&amp;rlz=1C5CHFA_enUS743US747&amp;sxsrf=ADLYWIJCOqn7DU76bzgDcnSordiwZJtE3w:1714831647760&amp;q=Buddy+Hield&amp;tbm=nws&amp;source=lnms&amp;sa=X&amp;ved=2ahUKEwj4kdvZlfSFAxW34MkDHaZPBvwQ0pQJegQIDRAB&amp;biw=1634&amp;bih=1036&amp;dpr=2\">Buddy Hield</a> who had the hot hand in the second and third quarters, and got the Sixers back in the game after the Knicks early dominance? He sat out most of the fourth quarter, was put back in at the very end and took the last Sixers desperation shot. </li>\n<li>In the other big Eastern Division game on Thursday, why did Doc Rivers, the Milwaukee Bucks' coach go into <a href=\"https://en.wikipedia.org/wiki/Garbage_time\">garbage time</a> when the Bucks were down by only 10 with 2.5 minutes remaining? What the frack was he thinking? Deficits like that are often made up, esp in elimination games? Being a good sport is one thing, but quitting the season early when you're only down by 10? What the what? I tuned in the game at the point when his stars were coming out, before the Knicks game started, and couldn't figure out why he was giving up so soon?</li>\n</ul>\n<p><b>It couldn't actually happen</b></p>\n<ul>\n<li>In the pause between the first and second rounds of the NBA playoffs, I am having the very very very strange thought that maybe possibly maybe the Knicks will could possibly maybe perhaps nah never hmm -- go all the way?</li>\n</ul>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"3556c2eb05b4cccea13718d0b4a675104f599f6b743d3bef05f11caf31d2bf47","category":"default"}