{"title":"Polyvagal Theory and the Neurobiology of Connection: The Science of Rupture, Repair, and Reciprocity","link":"https://www.themarginalian.org/2024/05/31/polyvagal-theory/","date":1717190437000,"content":"<h3>“The mind narrates what the nervous system knows. Story follows state.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Polyvagal-Theory-Therapy-Interpersonal-Neurobiology/dp/0393712370/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"487\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?fit=320%2C487&amp;ssl=1\" alt=\"Polyvagal Theory and the Neurobiology of Connection: The Science of Rupture, Repair, and Reciprocity\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?w=789&amp;ssl=1 789w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?resize=320%2C487&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?resize=600%2C913&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?resize=240%2C365&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/polyvagal_dana.jpg?resize=768%2C1168&amp;ssl=1 768w\" /></a></p><p>“A purely disembodied human emotion is a nonentity,” William James wrote in his <a href=\"https://www.themarginalian.org/2016/01/11/what-is-an-emotion-william-james/\">pioneering 1884 theory</a> of how our bodies affect our feelings — the first great gauntlet thrown at the Cartesian dualism of body versus mind. In the century and a half since, we have come to see <a href=\"https://www.themarginalian.org/2016/06/20/the-body-keeps-the-score-van-der-kolk/\">how the body and the mind converge in the healing of trauma</a>; we have come to see consciousness itself <a href=\"https://www.themarginalian.org/2021/12/24/feeling-knowing-damasio/\">as a full-body phenomenon</a>. </p>\n<p>Beyond the brain, no portion of the body shapes our mental and emotional landscape more profoundly than the tenth cranial nerve — the longest nerve of the autonomic nervous system that unconsciously governs the inner workings of the body. Known as the vagus nerve — from the Latin for “wandering,” a root shared with <em>vagabond</em> and <em>vague</em> — it meanders from the brain to the gut, touching every organ along the way with its tendrils, controlling everything from our heart rate and digestion to our reflexes and moods. </p>\n<figure><a href=\"https://www.themarginalian.org/2017/02/23/beautiful-brain-santiago-ramon-y-cajal/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?resize=680%2C887&amp;ssl=1\" width=\"680\" height=\"887\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?resize=240%2C313&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?resize=320%2C417&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?resize=768%2C1002&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/02/BeautifulBrain_p064.jpg?resize=600%2C783&amp;ssl=1 600w\" /></a><figcaption>One of Santiago Ramón y Cajal’s <a href=\"https://www.themarginalian.org/2017/02/23/beautiful-brain-santiago-ramon-y-cajal/\">little-known drawings of the brain</a>.</figcaption></figure>\n<p>In James’s lifetime, it was believed that synaptic communication within the brain was electrical. But when neuroscience founding father <a href=\"https://www.themarginalian.org/2017/03/17/diseases-of-the-will-cajal-advice-for-a-young-investigator/\">Santiago Ramón y Cajal</a> discovered a gap between neurons — a miniature abyss electricity could not cross — it became clear that something else must be transmitting the signals between neurons. In 1921, the German pharmacologist Otto Loewi confirmed the existence of these theorized chemical messengers by stimulating the vagus nerve of a frog and discovering in the secreted substance the first known neurotransmitter. Every thought, feeling, and mood that has ever swept across the sky of your mind was forecast by your neurotransmitters and executed by your vagus nerve.</p>\n<p>A century after James, while working with premature babies, the psychiatrist Stephen Porges uncovered two distinct vagal pathways in the nervous system — the much older dorsal vagus, which evolved around 500 million years ago in a fish now extinct to regulate fear response and activate shutdown, and the ventral vagus, a uniquely mammalian development about 200 million old, controlling our capacity for connection and communication. This research became the foundation of polyvagal theory — the science of how the interplay of these two systems shapes our sense of safety and danger, shapes our attachment styles and relationship patterns, shapes our very ability to tolerate the risks of living necessary for being in love with life. </p>\n<p>In the decades since, no one has championed polyvagal theory more ardently than the clinical psychologist Deb Dana. In her book <a href=\"https://www.amazon.com/Polyvagal-Theory-Therapy-Interpersonal-Neurobiology/dp/0393712370/?tag=braipick-20\" target=\"_blank\"><strong><em>The Polyvagal Theory in Therapy: Engaging the Rhythm of Regulation</em></strong></a> (<a href=\"https://search.worldcat.org/title/988292557\" target=\"_blank\"><em>public library</em></a>), written for therapists, she explores how trauma automates our adaptive responses in a survival story that puts the fear-based dorsal vagus in command to induce collapse and dissociation, and how we can rewire our neural pathways toward the emotional safety of the ventral vagal state, where our capacity for curiosity, connection, and change flourishes. </p>\n<figure><a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=680%2C811&amp;ssl=1\" width=\"680\" height=\"811\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?w=1161&amp;ssl=1 1161w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=320%2C382&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=600%2C716&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=240%2C286&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=768%2C916&amp;ssl=1 768w\" /></a><figcaption>Art by Sophie Blackall from <a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><em>Things to Look Forward to</em></a></figcaption></figure>\n<p>Dana writes:</p>\n<blockquote><p>Connectedness is a biological imperative, and at the top of the autonomic hierarchy is the ventral vagal pathway that supports feelings of safety and connection. The ventral vagus (sometimes called the “smart vagus” or “social vagus”) provides the neurobiological foundation for health, growth, and restoration. When the ventral vagus is active, our attention is toward connection. We seek opportunities for co-regulation. The ability to soothe and be soothed, to talk and listen, to offer and receive, to fluidly move in and out of connection is centered in this newest part of the autonomic nervous system. Reciprocity, the mutual ebb and flow that defines nourishing relationships, is a function of the ventral vagus. As a result of its myelinated pathways, the ventral vagus provides rapid and organized responses. In a ventral vagal state, we have access to a range of responses including calm, happy, meditative, engaged, attentive, active, interested, excited, passionate, alert, ready, relaxed, savoring, and joyful.</p></blockquote>\n<p>This biological need for co-regulation with others is not dissimilar to the concept of <a href=\"https://www.themarginalian.org/2021/12/04/general-theory-of-love-music-emotion/\"><em>limbic revision</em></a> — “the power to remodel the emotional parts of the people we love,” and to have our own emotional pathways remodeled by the people who love us. This is only possible in safe relationships, and it is the vagus system that governs our sense of safety. </p>\n<p>Central to polyvagal theory is the distinction between conscious perception and what Porges termed neuroception — the conditioned way the autonomic nervous system responds from within the body, without our awareness, to cues of safety and danger in the outside world. Because our vagal pathways are shaped by our earliest experiences of co-regulation in the infant-parent dyad, ruptures in that co-regulation — whether by abuse or neglect — condition the dorsal vagus to become dominant and make a neuroception of danger the default response, storying reality away from safety, nowhere more perilously than in intimate relationships. Dana writes: </p>\n<blockquote><p>Co-regulation is at the heart of positive relationships… If we miss opportunities to co-regulate in childhood, we feel that loss in our adult relationships. Trauma, either in experiences of commission (acts of harm) or omission (absence of care), makes co-regulation dangerous and interrupts the development of our co-regulatory skills. Out of necessity, the autonomic nervous system is shaped to independently regulate. Clients will often say that they needed connection but there was no one in their life who was safe, so after a while they stopped looking. Through a polyvagal perspective, we know that although they stopped explicitly looking and found ways to navigate on their own, their autonomic nervous system never stopped needing, and longing for, co-regulation.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/09/bigwolflittlewolf8.jpg\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><em>Big Wolf &amp; Little Wolf</em></a></figcaption></figure>\n<p>Because we are physiologies first and psychologies second, but we are also storytelling and sensemaking creatures, our minds naturally create emotional narratives out of these unconscious vagal states — stories that, if we are not careful enough and conscious enough, may come to subsume reality. Dana observes:</p>\n<blockquote><p>The mind narrates what the nervous system knows. Story follows state.</p></blockquote>\n<p>Our early adaptive survival responses of trauma train the autonomic nervous system on a default neuroception of danger, replacing patterns of connection with patterns of protection in a fear-based narrative. And yet these reflexes can be recalibrated by retraining our regulatory pathways. </p>\n<p>Because the feeling of reciprocity is one of the most powerful regulators of the autonomic nervous system, a great deal of repair and rewiring can happen in relationships winged with true reciprocity. Dana writes:</p>\n<blockquote><p>Reciprocity is a connection between people that is created in the back-and-forth communication between two autonomic nervous systems. It is the experience of heartfelt listening and responding. We are nourished in experiences of reciprocity, feeling the ebb and flow, giving and receiving, attunement, and resonance.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2012/04/27/the-human-body-1959/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?resize=680%2C357&amp;ssl=1\" width=\"680\" height=\"357\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?resize=320%2C168&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?resize=600%2C315&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?resize=240%2C126&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thehumanbody_TheMarginalian_copyright.jpg?resize=768%2C403&amp;ssl=1 768w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2012/04/27/the-human-body-1959/\"><em>The Human Body</em></a>, 1959.</figcaption></figure>\n<p>But the great paradox is that if our earliest template of connection is marked by rupture and deficient co-regulation, our very notion of reciprocity may be warped, leading us to tolerate immense asymmetries of affection and attention, to mistake deeply imbalanced relationships for reciprocal. The grounds for optimism lie in the very real possibility of changing the template through safe and nourishing relationships — ones we may not so much choose at first, for trauma can taint our choices with unhealthy patterns, as chance into and only then choose to nurture. The payoff is a gradual transition from the dorsal vagal state into the ventral vagal, a gradual willingness to release the patterns of protection in favor of connection, allowing the kinds of relationships Adrienne Rich <a href=\"https://www.themarginalian.org/2013/07/02/adrienne-rich-honorable-human-relationship/\">celebrated</a> as ones “in which two people have the right to use the word ‘love.'”</p>\n<p>Complement with the science of <a href=\"https://www.themarginalian.org/2024/02/23/how-emotions-are-made/\">how emotion are made</a> and <a href=\"https://www.themarginalian.org/2021/12/04/general-theory-of-love-music-emotion/\">how love rewires the brain</a>, then revisit Toni Morrison on <a href=\"https://www.themarginalian.org/2021/01/03/toni-morrison-beloved-heart/\">reclaiming the body as an instrument of joy, sanity, and self-love</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"3573d3509f68f57bda1df152420de7dabac9e176317e1d33b2e50c6c20451aca","category":"default"}