{"title":"A Pickpocket&#8217;s Story","link":"https://kottke.org/24/05/a-pickpockets-story-1","date":1716911116000,"content":"\n        <p>Until his recent incarceration, <a href=\"http://www.nytimes.com/2014/07/20/nyregion/the-pickpockets-tale.html\">Wilfred Rose was a very successful pickpocket</a> operating on the streets of NYC.</p>\n\n<blockquote><p>Some of the thieves have a shtick. There is Francisco Hita, who when caught touching someone’s wallet, pretends to be deaf, the police say, responding with gesticulations of incomprehension. There is an older man who pretends to be stricken by palsy while on a bus, and then uses a behind-the-back maneuver to infiltrate the pocket of the passenger next to him.</p>\n\n<p>There are flashy dressers, like the 5-foot-3 Duval Simmons, whose reputation is so well known among the police that he says he sometimes sits on his hands while riding the subway, so he cannot be accused of stealing. Mr. Simmons, an occasional partner of Mr. Rose’s, said he honed his skills on a jacket that hung in his closet, tying bells to it to measure how heavy his hand was.</p>\n\n<p>Mr. Rose’s notoriety stems from how infrequently he has been arrested, and how, at least in the last 15 years, he has never been caught in the act by plainclothes officers.</p></blockquote>\n\n<p>See also <a href=\"http://www.newyorker.com/magazine/2013/01/07/a-pickpockets-tale?currentPage=all\">Adam Green’s fascinating piece on Apollo Robbins</a> from The New Yorker. Especially the bit about surfing attention:</p>\n\n<blockquote><p>But physical technique, Robbins pointed out, is merely a tool. “It’s all about the choreography of people’s attention,” he said. “Attention is like water. It flows. It’s liquid. You create channels to divert it, and you hope that it flows the right way.”</p>\n\n<p>Robbins uses various metaphors to describe how he works with attention, talking about “surfing attention,” “carving up the attentional pie,” and “framing.” “I use framing the way a movie director or a cinematographer would,” he said. “If I lean my face close in to someone’s, like this” — he demonstrated — “it’s like a closeup. All their attention is on my face, and their pockets, especially the ones on their lower body, are out of the frame. Or if I want to move their attention off their jacket pocket, I can say, ‘You had a wallet in your back pocket — is it still there?’ Now their focus is on their back pocket, or their brain just short-circuits for a second, and I’m free to steal from their jacket.”</p></blockquote>\n\n         <p><em>[This is a vintage post originally from Jul 2014.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Apollo%20Robbins\">Apollo Robbins</a> · <a href=\"https://kottke.org/tag/crime\">crime</a> · <a href=\"https://kottke.org/tag/NYC\">NYC</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/Wilfred%20Rose\">Wilfred Rose</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"35a8f350abb5d26323fd68dc6c04f435da8909aff3c6050b911c98b4388816f0","category":"default"}