{"title":"Blackened Vesuvius Scroll Read for First Time in 2000 Years","link":"https://kottke.org/24/02/blackened-vesuvius-scroll-read-for-first-time-in-2000-years","date":1708443637000,"content":"\n        <p>A team of three students were able to virtually “unroll” a 2000-year-old papyrus scroll that was carbonized during the eruption of Mount Vesuvius in Herculaneum, <a href=\"https://scrollprize.org/grandprize\">thereby winning the grand prize in the Vesuvius Challenge</a>. These scrolls (there are hundreds of them) are little more than “lumps of carbonized ash”; <a href=\"https://en.wikipedia.org/wiki/Herculaneum_papyri\">this Wikipedia entry</a> helpfully summarizes their fate:</p>\n\n<blockquote><p>Due to the eruption of Mount Vesuvius in 79 AD, bundles of scrolls were carbonized by the intense heat of the pyroclastic flows. This intense parching took place over an extremely short period of time, in a room deprived of oxygen, resulting in the scrolls’ carbonization into compact and highly fragile blocks. They were then preserved by the layers of cement-like rock.</p></blockquote>\n\n<p>Using high-resolution CT scans of the scrolls, machine learning, and computer vision techniques, the team was able to read the text inside one of the scrolls without actually unrolling it. I am stunned by how much text they were able to recover from these blackened documents — take a look at this image:</p>\n\n<p><img src=\"/plus/misc/images/vesuvius-challenge-scroll-text.jpg\" width=\"1000\" height=\"953\" alt=\"Vesuvius Challenge Scroll Text\" /></p>\n\n<blockquote><p>There was one submission that stood out clearly from the rest. Working independently, each member of our team of papyrologists recovered more text from this submission than any other. Remarkably, the entry achieved the criteria we set when announcing the Vesuvius Challenge in March: 4 passages of 140 characters each, with at least 85% of characters recoverable. This was not a given: most of us on the organizing team assigned a less than 30% probability of success when we announced these criteria! And in addition, the submission includes another 11 (!) columns of text - more than 2000 characters total.</p></blockquote>\n\n<p>If you’re interested, it’s fascinating to <a href=\"https://scrollprize.org/grandprize\">read through the whole thing</a> to see just how little they were working with compared to how much they were able to recover. And the best part is, all the contest submissions are open source, so researchers will be able to build each other’s successes. (via <a href=\"https://waxy.org/\">waxy.org</a>)</p>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/artificial%20intelligence\">artificial intelligence</a> · <a href=\"https://kottke.org/tag/language\">language</a> · <a href=\"https://kottke.org/tag/Mount%20Vesuvius\">Mount Vesuvius</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/blackened-vesuvius-scroll-read-for-first-time-in-2000-years\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"35c4311c0a15afb6c9322da24d0aba46a831a5f8bac5c74da146daa0fe70e14d","category":"default"}