{"title":"What Happens If We Do Nothing About the Climate Crisis?","link":"https://kottke.org/24/04/what-happens-if-we-do-nothing-about-the-climate-crisis","date":1712770727000,"content":"\n        <p></p>\n\n<p>Let’s say the countries of the world most responsible for the changing climate continue to drag their feet on doing something about it. What is the world going to look like in 20 or 30 or 80 years? This TED-Ed video describes that bleak potential future.</p>\n\n<blockquote><p>Reports on heatwaves and wildfires regularly fill the evening news. Summer days exceed 40 degrees in London and 45 degrees in Delhi, as extreme heat waves are now 8 to 9 times more common. These high temperatures prompt widespread blackouts, as power grids struggle to keep up with the energy demands needed to properly cool homes. Ambulance sirens blare through the night, carrying patients suffering from heatstroke, dehydration, and exhaustion. The southwestern United States, southern Africa, and eastern Australia experience longer, more frequent, and more severe droughts.</p>\n\n<p>Meanwhile, the Philippines, Indonesia, and Japan face more frequent heavy rainfall as rising temperatures cause water to evaporate faster, and trap more water in the atmosphere. As the weather becomes more erratic, some communities are unable to keep pace with rebuilding what’s constantly destroyed.</p></blockquote>\n\n<p>(via <a href=\"https://www.openculture.com/2024/04/what-earth-could-look-like-in-2050-if-we-do-nothing-about-climate-change.html\">open culture</a>)</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/climate%20crisis\">climate crisis</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/what-happens-if-we-do-nothing-about-the-climate-crisis\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"36a93e36d0249a3e9f93fef7544d025fb3aba3e20aa0c8f91543e8eefbaf4ce9","category":"default"}