{"title":"The Longest Total Solar Eclipse Ever (73 Minutes!)","link":"https://kottke.org/24/04/the-longest-total-solar-eclipse-ever-73-minutes","date":1713284114000,"content":"\n        <p></p>\n\n<p>Ok, I said no more eclipse posts (maybe) and then posted like two or three more, but really this is the last one — maybe! In 1973, a group of scientists witnessed the longest ever total solar eclipse by flying in the shadow (umbra) of the moon in a Concorde prototype for 74 minutes over the Sahara desert. From the abstract of <a href=\"https://www.nature.com/articles/246072a0\">a paper in Nature</a> about the flight:</p>\n\n<blockquote><p>On June 30, 1973, Concorde 001 intercepted the path of a solar eclipse over North Africa, Flying at Mach 2.05 the aircraft provided seven observers from France, Britain and the United States with 74 min of totality bounded by extended second (7 min) and third (12 min) contacts. The former permitted searches for time variations of much longer period than previously possible and the latter provided an opportunity for chromospheric observations of improved height resolution. The altitude, which varied between 16,200 and 17,700 m, freed the observations from the usual weather problems and greatly reduced atmospheric absorption and sky noise in regions of the infrared.</p></blockquote>\n\n<p>Mach 2.05 = 1573 mph = 2531 km/h. 17,700 m = 58,000 ft. They added portholes to the roof of the plane for better viewing and data gathering. <a href=\"http://xjubier.free.fr/en/site_pages/solar_eclipses/TSE_19730630_Concorde001.html\">This page on Xavier Jubier’s site</a> contains lots of amazing details about the flight, including a map of the flight’s path compared to the umbra, photos of the retrofitted plane, and a graph of the umbra’s velocity across the surface of the Earth (which shows that for at least part of the eclipse, the Concorde was actually outrunning the moon’s shadow).</p>\n\n<blockquote><p>By flying inside the umbral shadow cone of the Moon at the same speed, the Concorde was going to stay in the darkness for nearly 74 minutes, the time for astronomers and physicists on board to do all the experiences they could imagine to complete during this incredible period of black Sun. They were able to achieve in one hour and fifteen minutes what would have taken decades by observing fifteen total solar eclipses from places that would have not necessarily gotten clear skies.</p></blockquote>\n\n<p>And finally, <a href=\"https://www.youtube.com/watch?v=BNxz-2NRsBs\">here’s a 30-minute French documentary from 1973 about the eclipse flight</a>.</p>\n\n<p>So. Cool!</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/1973%20solar%20eclipse\">1973 solar eclipse</a> · <a href=\"https://kottke.org/tag/astronomy\">astronomy</a> · <a href=\"https://kottke.org/tag/flying\">flying</a> · <a href=\"https://kottke.org/tag/Moon\">Moon</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/Sun\">Sun</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/the-longest-total-solar-eclipse-ever-73-minutes\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"3759f5f7697d3c3a085b37f09852836a3832f72b29579f65ea3039e07332a3ac","category":"default"}