{"title":"Here’s how to live: Follow the great book.","link":"https://sive.rs/htl16","date":1639612800000,"content":"<p>\nYou know what your great book is.\n<br />\nWhether the Bible, Tanakh, Upanishads, Quran, Think and Grow Rich, Seven Habits of Highly Effective People, or another, follow it diligently.\n</p><p>\nYour book is wiser than you.\n<br />\nIt’s describing natural law — the way our world works.\n<br />\nIt’s not just someone’s opinion.\n<br />\nIt has the definitive answers to the choices you’re confronted with each day.\n<br />\nDon’t think you know better.\n</p><p>\nPeople say they want to make their own decisions.\n<br />\nBut imagine that you have a life-or-death medical situation, so you rush to the doctor, and the doctor says, “There are hundreds of different approaches we could take. You decide. It’s up to you.”\n<br />\nYou would say, “No! You’re the doctor. You’re the expert. You know best. You decide. Tell me what to do.”\n<br />\nYour book is the expert on how to live.\n<br />\nIt’s helped millions of people.\n<br />\nDefer to its wisdom.\n</p><p>\nYour book was meant for people exactly like you.\n<br />\nYou’re not an exception to humanity.\n<br />\nIts rules apply to you.\n<br />\nIt guides you on a good life.\n</p><p>\nIf your book is ancient, you may think it’s not enough since it doesn’t mention modern life.\n<br />\nBut nothing is truly new.\n<br />\nMorals seem like they’ve changed in recent history.\n<br />\nBut really, morals haven’t changed in longer history.\n<br />\nIf you update the language and some references, books written thousands of years ago sound like they could have been written today.\n<br />\nThe human condition remains the same.\n<br />\nYour book has all the wisdom you need.\n<br />\nRead metaphorically, and apply it to your modern life.\n</p><p>\nYou don’t lack direction.\n<br />\nYou have too many directions.\n<br />\nAn open mind, like an open mouth, needs to eventually close on something.\n<br />\nStop swerving and chasing new leaders.\n<br />\nStay on a single steady path.\n<br />\nFollowing your book is how to live.\n</p><p>\nFirst, make a “born again” split.\n<br />\nLet go of your old identity.\n<br />\nLet your new self be incongruent with your old self.\n<br />\nLet your friends and family know that you’ve changed.\n</p><p>\nBring your book with you everywhere as a constant reminder and reference.\n<br />\nRefer to its rules in every situation, every day.\n<br />\nMemorize its crucial sentences.\n<br />\nKeep them at the forefront of your mind.\n</p><p>\nFollowing rules is smart.\n<br />\nIt’s efficient.\n<br />\nYou don’t need to stop and re-think every situation.\n</p><p>\n“Follow your passion” is terrible advice.\n<br />\nFleeting interests are a bad compass.\n<br />\nPassions pass so quickly that to follow them would have you dashing around like a dog chasing bubbles.\n</p><p>\nDon’t follow your heart.\n<br />\nYour heart has been hacked.\n<br />\nYour intuition is usually wrong because it’s just emotion, subliminally influenced by amoral inputs.\n<br />\nEmotions are a wild animal.\n<br />\nYou need rules to tame them.\n</p><p>\nRules give you freedom from your desires.\n<br />\nWhen you rise above your instincts, you still feel them but no longer do what they say.\n<br />\nFollowing your emotions is not freedom.\n<br />\nBeing free from following emotions is freedom.\n</p><p>\nWhen you stop following emotions, and just do what’s right, then you’ll finally get what you always wanted.\n<br />\nIt was the emotions that were distracting you all along.\n</p><p>\nSo what’s the right thing to do?\n<br />\nAn action with good results?\n<br />\nAn action that feels good?\n<br />\nNo.\n<br />\nThe action prescribed by your book.\n<br />\nNo need to judge or decide.\n<br />\nJust follow the rules and trust the path.\n</p><p>\nRules must be absolutely unbreakable.\n<br />\nIf you try to decide, each time, whether it’s OK to break the rule or not, then you’ve missed the whole point of rules.\n<br />\nRules are to save you from deciding.\n<br />\nThat’s why hard rules are easier to keep.\n</p><p>\nDiscipline turns intentions into action.\n<br />\nDiscipline means no procrastination.\n<br />\nDiscipline means now.\n<br />\nChoose the pain of discipline, not the pain of regret.\n</p><p>\nAn undisciplined moment seems harmless, but they add up to disaster.\n<br />\nWithout discipline, the tiny things in life will be your downfall.\n</p><p>\nSelf-control is always rewarding.\n<br />\nSelf-control is always the right thing to do.\n<br />\nThis is a universal law.\n<br />\nYour self-control is highest in the morning and diminishes during the day, so review your book’s rules every afternoon.\n</p><p>\nPhysical discipline helps mental discipline.\n<br />\nAlign your outer self with your inner self.\n<br />\nCleaning your house helps clean your mind.\n</p><p>\nDiscipline gets you to your destination.\n<br />\nWithout it, you’re led astray by everyone else.\n<br />\nIf you don’t obey your constraints, persuasive people and technology will pull you their way.\n</p><p>\nPeople beg you to bend your rules to fit their agenda.\n<br />\nSo blame your book when you refuse.\n<br />\nSaying “the book says so” helps your burden of responsibility.\n<br />\nIf someone challenges your choices or asks you to explain, just say “the book says so” and carry on without the exhausting debate.\n</p><p>\nSome people may surpass you by breaking the rules.\n<br />\nBut remember: the miserable, broken, destitute people in the world are the other outcome of breaking the rules.\n<br />\nMany more fail than succeed.\n<br />\nRules may keep you from some stupendous heights, but they will always keep you from falling too low.\n</p><p>\nDefine a good life as more than shallow pleasure.\n<br />\nA good life is contribution.\n<br />\nA good life is resisting temptation.\n<br />\nA good life is being the best you can be.\n<br />\nA good life is diligently following your book.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"376b2ab1dfeb5c7571a1d76a93219d2b3101943aac32d706d5923323f797cdbd","category":"Sites"}