{"title":"The Two Souls Within: Hermann Hesse on the Dual Life of the Creative Spirit","link":"https://www.themarginalian.org/2024/01/07/hermann-hesse-steppenwolf-artist/","date":1704647049000,"content":"<h3>“Like a precious, fleeting foam over the sea of suffering arise all those works of art, in which a single individual lifts himself for an hour so high above his personal destiny that his happiness shines like a star and appears to all who see it as something eternal and as a happiness of their own.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Steppenwolf-Novel-Hermann-Hesse/dp/0312278675/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?fit=320%2C480&amp;ssl=1\" alt=\"The Two Souls Within: Hermann Hesse on the Dual Life of the Creative Spirit\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?w=1000&amp;ssl=1 1000w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?resize=240%2C360&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/hesse_steppenwolf.jpg?resize=768%2C1152&amp;ssl=1 768w\" /></a></p><p>Coursing through every civilization are the myths that shape what its people come to believe about reality and possibility. Some of them are healing and some damaging. Some are easy to recognize for what they are — almost all isms are damaging myths. But some are more subtle, more pernicious, permeating the substratum of culture and the marrow of the psyche. </p>\n<p>One of Western culture’s most damaging myths, largely inherited from the Romantics, is that of the tortured genius — the suffering artist who needs to have suffered and must go on suffering in order to create works of beauty and poignancy, portals to the sacred. The truth, of course, is far more nuanced — artists are simply people who feel life deeply in all of its dimensions, who are awake and alive to both its tragedy and its transcendence, who put their heightened sensitivity in the service of wakefulness and aliveness for others. </p>\n<p>Virginia Woolf knew this when she wrote of <a href=\"https://www.themarginalian.org/2015/09/09/virginia-woolf-cotton-wool-moments-of-being/\">the shock-receiving capacity</a> necessary for being an artist. In his diary, Walt Whitman contemplated the superior porousness of the creative spirit to both life’s “sunny expanses and sky-reaching heights” and its “bare spots and darknesses,” believing that “no artist or work of the very first class may be or can be without them.” </p>\n<p>These, of course, are the polarities we all live with, the polarities that live in us, which Maya Angelou channeled in her stunning poem <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">“A Brave and Startling Truth.”</a> The artist is humanity’s magnifying lens for the inherent dualities of human nature — something James Baldwin captured in his insistence that an artist’s role is <a href=\"https://www.themarginalian.org/2017/05/24/james-baldwin-life-magazine-1963/\">“to make you realize the doom and glory of knowing who you are and what you are.”</a> The measure of our creative vitality lies in how intimately we contact both the doom and the glory of being, what we make of the restless tension between our own poles, how we harmonize them into something beautiful. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=680%2C960&amp;ssl=1\" width=\"680\" height=\"960\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=320%2C452&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=600%2C847&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=240%2C339&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=768%2C1084&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/HermannHesse_TheMarginalian.jpg?resize=1088%2C1536&amp;ssl=1 1088w\" /><figcaption>Hermann Hesse</figcaption></figure>\n<p>In the interlude between two world wars, as humanity hungered for beauty to controvert its own brutality, <a href=\"https://www.themarginalian.org/tag/hermann-hesse/\">Hermann Hesse</a> (July 2, 1877–August 9, 1962) considered the inner life of the creative spirit in a poignant passage from his 1927 novel <a href=\"https://www.amazon.com/Steppenwolf-Novel-Hermann-Hesse/dp/0312278675/?tag=braipick-20\" target=\"_blank\"><strong><em>Steppenwolf</em></strong></a> (<a href=\"https://search.worldcat.org/title/698117126\" target=\"_blank\"><em>public library</em></a>), painting the artist as a divided creature that yearns for wholeness and turns that yearning into the creative act:</p>\n<blockquote><p>Many artists… have two souls, two beings within them. There is God and the devil in them; the mother’s blood and the father’s; the capacity for happiness and the capacity for suffering; and in just such a state of enmity and entanglement towards and within each other as were the wolf and man.</p></blockquote>\n<p>For Hesse’s artist, riven by these inner tensions, “life has no repose.” And yet out of that restlessness comes the artist’s gift to the world:</p>\n<blockquote><p>[Artists] live at times in their rare moments of happiness with such strength and indescribable beauty, the spray of their moment’s happiness is flung so high and dazzlingly over the wide sea of suffering, that the light of it, spreading its radiance, touches others too with its enchantment. Thus, like a precious, fleeting foam over the sea of suffering arise all those works of art, in which a single individual lifts himself for an hour so high above his personal destiny that his happiness shines like a star and appears to all who see it as something eternal and as a happiness of their own.</p></blockquote>\n<p>Complement with other excellent reflections on what it means to be an artist from <a href=\"https://www.themarginalian.org/2015/02/09/e-e-cummings-miscellany-agony-of-the-artist/\">e.e. cummings</a>, <a href=\"https://www.themarginalian.org/2020/02/25/m-c-richards-centering-creativity/\">M.C. Richards</a>, <a href=\"https://www.themarginalian.org/2018/06/01/egon-schiele-letter/\">Egon Schiele</a>, and <a href=\"https://www.themarginalian.org/2016/11/30/marina-abramovic-artist-manifesto/\">Marina Abramović</a>, then revisit Hesse on <a href=\"https://www.themarginalian.org/2019/01/15/hermann-hesse-solitude-suffering-destiny/\">the courage to be yourself</a>, <a href=\"https://www.themarginalian.org/2018/12/12/hermann-hesse-letter-to-a-young-german/\">the wisdom of the inner voice</a>, and <a href=\"https://www.themarginalian.org/2023/07/06/hermann-hesse-wonder-butterflies/\">how to be more alive</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"39cca5d98a33c6e4886e9d35e4a900f9baaf98c2e7420eb170779600f61c392b","category":"default"}