{"title":"Trailer for Season Two of The Rings of Power","link":"https://kottke.org/24/05/trailer-for-season-two-of-the-rings-of-power","date":1715871334000,"content":"\n        <p></p>\n\n<p>I am apparently one of the few people who really liked the first season of the Lord of the Rings prequel series, <a href=\"https://www.amazon.com/exec/obidos/ASIN/B09QH98YG1/ref=nosim/0sil8\">The Rings of Power</a>. I mean, it had its rough spots and maybe there was a little too much table-setting, but in general it left me wanting to see what was going to happen next. The trailer for season two just dropped and it looks pretty action-packed and stocked with characters &amp; events that would be familiar to those who have read the main book series. Here’s the synopsis:</p>\n\n<blockquote><p>Sauron has returned. Cast out by Galadriel, without army or ally, the rising Dark Lord must now rely on his own cunning to rebuild his strength and oversee the creation of the Rings of Power, which will allow him to bind all the peoples of Middle-earth to his sinister will. Building on Season One’s epic scope and ambition, the new season plunges even its most beloved and vulnerable characters into a rising tide of darkness, challenging each to find their place in a world that is increasingly on the brink of calamity. Elves and dwarves, orcs and men, wizards and Harfoots… as friendships are strained and kingdoms begin to fracture, the forces of good will struggle ever more valiantly to hold on to what matters to them most of all… each other.</p></blockquote>\n\n<p>And they also released a behind-the-scenes look at the production of season two:</p>\n\n<p></p>\n\n<p>The second season of The Rings of Power premieres on August 29 on Amazon Prime.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/The%20Lord%20of%20the%20Rings\">The Lord of the Rings</a> · <a href=\"https://kottke.org/tag/The%20Rings%20of%20Power\">The Rings of Power</a> · <a href=\"https://kottke.org/tag/trailers\">trailers</a> · <a href=\"https://kottke.org/tag/TV\">TV</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/trailer-for-season-two-of-the-rings-of-power\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"3a4bd4a1d2d24f9d74e073834012d28c0fe046edd84a0a582fefcc8e6ea51c0f","category":"default"}