{"title":"Google Is Mind-Bogglingly Bad","link":"https://om.co/2024/07/19/google-is-mind-bogglingly-bad/","date":1721399400000,"content":"<p>A few days ago I <a target=\"_blank\" href=\"https://x.com/om/status/1805020146903470198\">wondered aloud, “What</a> would happen if Google CEO Sundar Pichai decided to sign up for Google Cloud using a secret identity, without getting help from any of his staff?” I added, “Every single CEO should try to use their service as if they were a new customer that the company is going to try and win over. That alone will be a 10x boost in tech products!” </p>\n\n\n\n<p>It’s too bad Sundar isn’t going to do this, because if anything his company needs a real kick in the pants. It makes so many bad product decisions that it’s mind-boggling. </p>\n\n\n\n<p>For example, I am a customer of Google Workspace and host my email with them. I use Google’s Webpass as an internetservice provider. I am also a customer of Google Cloud (for their AI-related offerings). Yet, when I use Google’s web email client, I find all the relevant and important emails — invoices, bills, and other alerts — automatically classified as junk and sent to the junk folders. Then I get a message threatening to cut off my internet, delivered to the junk folder of course. I shudder to think how many of my emails don’t reach their recipients and vice versa. </p>\n\n\n\n<p>It shouldn’t be a surprise that there’s no one with any real “product” chops at the company. It’s a perfect example of a once-great company trapped in the “management spider web,” where everyone is essentially there for a few years to cash in their stock options. </p>\n\n\n\n<p>This is bonus culture 2.0, where no one wants to risk having any product opinions and thus make any real decisions. Why upset the apple cart? Why not keep agreeing with meaningless metrics instead of fixing the problems? Google is not the only one, for this affliction infects almost all large Silicon Valley companies. Sure, there are rare exceptions, but they are notable in their rarity.  </p>\n\n\n\n<p>It is just that it is more noticeable in the case of Google, as we touch their products daily. Google doesn’t excel at anything anymore — not even search, which has become abysmal. It’s unfortunate to see the once-mighty Google become such a middling version of itself. </p>\n\n\n\n<hr />\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/02/08/does-google-need-a-new-ceo/\">Does Google need a new CEO?</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"3a4cd1e65061238003661350c9a1c0c6d89da2bad176dacb7e9a34f63b46b384","category":"default"}