{"title":"America, the final season","link":"https://www.garbageday.email/p/america-the-final-season","date":1730921820000,"content":"<div><div><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/1f041577-f349-4faa-be75-340cd9b87dfd/Screenshot_2024-11-06_at_1.06.51_PM.png?t=1730916421\" /><div><span><p>(<a href=\"https://x.com/punished_stu/status/1854104643472642479?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">x.com/punished_stu</a>)</p></span></div></div><p>In yesterday’s election, former President Donald Trump smashed Vice President Kamala Harris in a <a href=\"https://www.ft.com/content/392e1e79-a8c1-4473-ab51-3267c415b078?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">red wave</a> across almost every voting demographic. It was a disaster for Democrats — and the future of American democracy. And, at least right now, you can really take your pick as far as what you want to believe caused the Trump blowout. Racism, misogyny, economic pressure, the Harris campaign’s over-reliance on digital. Who knows, maybe it was because Gen Z voters <a href=\"https://x.com/erinburnett/status/1853873163769196814?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">don’t know how</a> to sign their names correctly.</p><p>Author Brian Merchant hit on something especially important, though, <a href=\"https://x.com/bcmerchant/status/1854013828356354089?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">writing</a>, “The consultants behind Harris’ campaign — reining in the ‘weird’ line, bringing in the Cheneys, completely spurning Uncommitted and all the student protestors — should never work in Washington again (they will).” Or, as <i>Washington Post</i> columnist Shadi Hamid put <a href=\"https://x.com/shadihamid/status/1853990939775115356?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">another way</a>: “Democrats spent the last few weeks courting a constituency that doesn't even exist.”</p><p>It’s hard to process how exciting and hopeful Harris’ campaign felt this summer compared to how the wreckage looks now. Jumping into the campaign following Biden’s atrocious debate performance, Harris seemed like, if not a perfect candidate, at the very least, a breath of fresh air. And for a few magical weeks, it did seem as if her team had figured out a path forward for Democrats. Digitally savvy with an aggressive irl ground game, flush with millennial cash. But buzzy Zoom fundraising and being anointed “brat” couldn’t make up for her inability to separate herself from the Biden administration. The baggage she was given a blank check to dump at the start continued to follow her around. The last weeks of her campaign were defined by her refusal to break rank on Israel, find a progressive spin on the border, and or distance herself from Bidenomics. Meanwhile, her veep pick, Gov. Tim Walz, came out the gate strong. But, here, too, her team were more interested in the well-trod middle than imagining something new, asking him to tone down the name-calling to court neocons. A campaign for no one, burning money to chase votes from an America they made up in their heads.</p><p>Turns out marketing yourself as a<b> </b>watered down version of the competitor<b> </b>isn’t the slam dunk the wonks thought it would be. Even if it doesn’t totally encapsulate the totality of her failure yesterday, it’s a fitting indictment of how badly Harris missed the mark that no one on her team noticed how pointless it was to earn a Taylor Swift endorsement while also cozying up to former Vice President Dick Cheney. As one beleaguered Swiftie <a href=\"https://x.com/not_chasebank/status/1854015591444890035?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">wrote</a> last night, “if you voted for Trump and went to the Eras Tour just know Taylor Swift hates you.” Well, the majority of Swift’s audience probably don’t, considering, <a href=\"https://www.newsweek.com/white-women-college-educated-voters-surge-bad-sign-trump-exit-poll-1980939?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">per exit polls</a>, white women, once again, overwhelmingly voted for Trump. Why drink a Pepsi when you can just get a Coke?</p><p>Though, unlike 2016, and even 2020, yesterday’s election was far less online than expected. There was Russian meddling, of course. Social networks were flooded with Kremlin-sponsored disinformation, which <a href=\"https://dfrlab.org/2024/11/05/russia-china-us-election-operation-overload/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">was, in turn, boosted</a> by a Chinese botnet. But the bulk of Russia’s strategy yesterday manifested in the form of good old fashioned stochastic terrorism. There were bomb threats called in at four polling centers in <a href=\"https://x.com/rljnews/status/1853929365161345147?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">Navajo Nation</a>, five polling centers in <a href=\"https://x.com/ShawnReynolds_/status/1853945730164990130?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">DeKalb County</a>, Georgia, and <a href=\"https://x.com/VeraMBergen/status/1853991436061966346?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">32 bomb threats</a> in Georgia’s Fulton County. The majority of which originated in Russia, <a href=\"https://www.reuters.com/world/us/fake-bomb-threats-linked-russia-briefly-close-georgia-polling-locations-2024-11-05/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">according to the FBI</a>. But Trump’s team clearly bet on the right horse here: The internet is, simply, not where voters are won.</p><p>Trump, early on, dropped any last vestiges of what a modern political campaign should look like, continuing to stump in rallies across swing states, even after multiple assassination attempts forced the former president to encase himself in a <a href=\"https://x.com/wizardsextape/status/1825209044526596101?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">cube of agony</a>. He whittled down his campaign into a simple message: “I will make you wealthy and hurt everyone you hate.” And the only thing Americans love more than spite is lower taxes. He flooded local markets with ads selling Trump-branded xenophobia and transphobia and, by the end, literally hired an insult comic to roast all of Puerto Rico. And, unlike the Harris campaign, he only relied on the internet for propaganda, following his son Barron’s advice, who reportedly <a href=\"https://www.eonline.com/news/1409596/how-president-elect-donald-trumps-son-barron-18-played-a-role-in-his-campaign?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">was the one</a> pushing him to spend his time doing manosphere podcast interviews. Meanwhile, his vice presidential pick, JD Vance, gave him an important line to Silicon Valley’s most radicalized CEOs and the country’s two most-brainrotted men, Elon Musk (metaphorical brainrot) and Robert F. Kennedy Jr. (literal brainrot).</p><p>But none of this really captures the existential weight of yesterday’s vote. Trump is headed to the White House again with a Senate majority, <a href=\"https://www.aclu.org/press-releases/supreme-court-grants-trump-broad-immunity-for-official-acts-placing-presidents-above-the-law?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">legal immunity</a>, a sympathetic Supreme Court, and <a href=\"https://news.bloomberglaw.com/us-law-week/second-trump-term-opens-door-to-even-more-conservative-judges?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">Trumpist lower courts</a>. And, unlike 2016, he knows how close he came to dying in prison without the protection of power. As <i>New York Times</i> columnist Jamelle Bouie <a href=\"https://bsky.app/profile/jamellebouie.net/post/3labtvfoo7p26?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">wrote on Bluesky</a>, “I think that the people interested in recriminations and score settling right now aren’t seriously grappling with the magnitude of what happened and the implications for the rest of our lives. Most of us will probably die living in the political order that will emerge out of this election.”</p><p>And this time there are no asterisks. Republicans <a href=\"https://thehill.com/homenews/nexstar_media_wire/4976301-when-was-the-last-time-the-republican-party-won-the-popular-vote/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">won the popular vote</a> yesterday for the first time since former President George W. Bush’s reelection in 2004. This is the country Americans want. Regardless of whether or not we ever get to legally vote for a new one ever again.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6b8559eb-994c-4b60-8a0b-bc48cf120a9d/Screenshot_2024-11-06_at_11.28.37_AM.png?t=1730910529\" /><div><span><p>(<a href=\"https://x.com/hausofdecline/status/1854034843543228639?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">x.com/hausofdecline</a>)</p></span></div></div><p>In terms of what we can expect from Trump’s second term, conservatives have already laid out their blueprint online. They’ve spent the last four years reshaping the architecture of the social web to match their designs for American society at large. It has been easy to laugh off Musk’s purchase of Twitter and its subsequent drop into irrelevance. But irrelevance was never a bug, but a feature. Big Tech monopolists, many of whom are <a href=\"https://x.com/JeffBezos/status/1854184441511571765?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">now congratulating</a> Trump on his win today, have successfully created an internet of paranoid cul-de-sacs, where no one trusts each other and nothing can break through the noise. Steve Bannon’s dream of “flooding the zone with shit,” finally realized. A zone of shit for everyone, algorithmically personalized and inescapable. An America where you can watch MSNBC’s Steve Kornacki deliver calming data points on a livestream <a href=\"https://x.com/moorehn/status/1853987813101822028?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">like a zoo animal</a> or an Info Wars stream on X <a href=\"https://x.com/liv_agar/status/1853971938101596372?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">hosted</a> by Michael Flynn and the Papa John’s guy. As Musk <a href=\"https://x.com/elonmusk/status/1854045379408326909?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">wrote</a> this morning, “You are the media now.” He, obviously, meant this to be a good thing. But sit with the enormity of what that means for a second. Author and journalist Ned Resnikoff <a href=\"https://resnikoff.beehiiv.com/p/some-thoughts-about-tuesday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">asked a chilling followup question</a> this morning, “If conventional campaigns don’t matter, does anything?” And the answer is, no, and that’s the point. You’re on your own now.</p><p>And this will only get worse now. Conspiracy theories like QAnon thrived under Trump’s first presidency. Trump’s most ardent followers will use misinformation to divine meaning from the chaos and fight the cognitive dissonance as Trump, once again, <a href=\"https://x.com/randygdub/status/1854188841797857541?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">delivers on nothing</a>.<b> </b>It will all go according to plan, even though there isn’t one. </p><p>But, worst of all, none of this will be isolated to the US. Trump is off the leash and, now, so is every other Trump wannabe. Populism Updates <a href=\"https://x.com/populismupdates/status/1854017209045319926?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">has a good thread</a> about this new “untethered” era for Trumpism and, by extension, far-right authoritarianism around the world. This election was seen as Trump’s last shot, if only because of his age (he was clear on running from prison if it ever got to that point). His imitators in countries like Italy, Brazil, the UK, France, Germany, The Netherlands, Hungary, and elsewhere have proof now that the long game can work. To say nothing of the Russia and China-led coalition of anti-democracies that know this is their chance to finally flex their muscles as we recede back into Trumpist isolationism. It has never been a more dangerous time to be Taiwanese, Ukrainian, Palestinian. </p><p>And it is easy to read all of that and feel hopeless. At Garbage Day Live shows this summer, we would end every night with a simple request to the audience: Make websites, send emails, use open platforms, share memes, not go to viral, but just to communicate with people you care about, support independent media, and start to learn to use the internet in a way that can’t be censored by algorithm, corporation, or government. To learn how to have fun online again. And that request feels very trite now.</p><p>And in 2019, the very <a href=\"https://www.garbageday.email/p/coming-soon?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">first issue of Garbage Day</a> promised readers “NO JOURNALISM”. Today, we’re formally retiring that promise — or at least <a href=\"https://www.youtube.com/watch?v=5yuL6PcgSgM&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">adding a comma</a>. Because it’s time to accept what is needed in the new reality we woke up to this morning. The way we all have been building things, doing journalism, and organizing will simply not be enough. We have to build new ways of communicating. Create unions and support networks that can’t be crushed or throttled or shadowbanned. And we have to do that now because things are going to start moving very quickly.</p><p>But the most important thing, at least today, as you process all of this, is to not feel embarrassed about being one of the 66 million-plus that voted for Harris yesterday. Even if she failed to do anything with that vote. Back <a href=\"https://www.garbageday.email/p/ok-enjoy?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\">in August</a>, we wrote that if <span>Trump somehow won, it wouldn’t have been cringe to say you went down swinging, to have let yourself believe this could have worked. And that’s still true. </span>It was not embarrassing to think that we could have finally separated ourselves from Trump’s American carnage. To finally just fucking move on. And it is worth holding on to that brief glimmer of optimism as we enter this decidedly darker era of American history. But it’s going to be a fight and there’s no way around that. Because the bastards in charge now will do everything in their power to make the very idea of something better and brighter impossible to imagine. But it’s not and it never will be. </p><p><i>Adam Bumas contributed to the reporting of this piece.</i></p><hr /><h2>LISTEN: How QAnon Changed American Politics Forever</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/7602beb5-8c64-42d0-97ac-c4cf7e7035bb/traviscover.png?t=1730919452\" /></div><p>We thought it was time for a quick recap of the last 10 years of QAnon, seeing as how it will, you know, be the guiding ideology of the next presidential administration and also has nice new cozy home on X, the everything app. We brought on Q expect Travis View, one of the hosts of the excellent QAA podcast to help us wade through the fever swamp. </p><p><a href=\"https://podcasts.apple.com/us/podcast/panic-world/id1740187810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\" target=\"_blank\"><b>You can check out that episode here</b></a> or on whatever app you use to cram audio content into your earholes.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=america-the-final-season\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><p><i>***Any typos in this email were not on purpose today***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=a2dc1a71-cb31-48ce-8c4d-0b20e227d91b&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan BroderickAdam Bumas","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"3a6e2e1568a777b8155ff7cfe595761ebec1700e382ba992866046e86ffb3364","category":"Sites"}