{"title":"The Art of Allowing Change: Neurobiologist Susan R. Barry’s Moving Correspondence with Oliver Sacks about the Blessed Overwhelm of Transformation","link":"https://www.themarginalian.org/2024/02/07/dear-oliver/","date":1707341677000,"content":"<p><a href=\"https://www.amazon.com/Dear-Oliver-Unexpected-Friendship-Sacks/dp/1891011308/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"478\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?fit=320%2C478&amp;ssl=1\" alt=\"The Art of Allowing Change: Neurobiologist Susan R. Barry’s Moving Correspondence with Oliver Sacks about the Blessed Overwhelm of Transformation\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?w=803&amp;ssl=1 803w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?resize=320%2C478&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?resize=600%2C897&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?resize=240%2C359&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/dearoliver_barry.jpg?resize=768%2C1148&amp;ssl=1 768w\" /></a></p><p>There is a thought experiment known as <a href=\"https://www.themarginalian.org/2021/08/24/marys-room-frank-jackson-animated/\">Mary’s Room</a>, brilliant and haunting, about the abyss between felt experience and our mental models of it, about the nature of knowledge, the mystery of consciousness, and the irreducibility of aliveness: Living in a black-and-white chamber, Mary the scientist studies how nature works — from the physics of light to the biology of the eye — but when she exits her monochrome room and encounters color, she experiences something far beyond her knowledge of what color is. It might be impossible, the experiment intimates, to imagine — even with our finest knowledge and best predictive models — what an experience would feel like before we have it, raw and revelatory and resinous with the one thing we can never model, never reduce to information: wonder — the wonder of the world suddenly new and we suddenly new to ourselves.</p>\n<p>Neurobiologist Susan R. Barry was in her fifties when she realized she had been living in Mary’s Room.</p>\n<p>Born cross-eyed and stereoblind — unable to form three-dimensional images the way most people do as we aim our two eyes in the same direction, combining the visual input in the brain — Barry had undergone a number of corrective eye-muscle surgeries as a child, which made her eyes appear aligned. She was told she was cured, able to do anything people with normal vision do except fly an airplane. </p>\n<figure><a href=\"https://society6.com/product/stereogram-of-the-full-moon-by-lewis-morris-rutherford-1864_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?resize=680%2C347&amp;ssl=1\" width=\"680\" height=\"347\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?resize=320%2C163&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?resize=600%2C307&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?resize=240%2C123&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Rutherford_stereogram_TheMarginalian.jpg?resize=768%2C392&amp;ssl=1 768w\" /></a><figcaption>1864 stereogram of the Moon by Lewis Morris Rutherford. (Available as <a href=\"https://society6.com/product/stereogram-of-the-full-moon-by-lewis-morris-rutherford-1864_print?curator=brainpicker\" target=\"_blank\">a print</a>.)</figcaption></figure>\n<p>It was not until her junior year of college that, listening to a lecture about the visual cortex and ocular dominance columns, she learned about monocular and binocular vision. She was astonished to realize that she had gone through life lacking the latter — the kind most people have, which allows us to see in stereo. She accepted her condition and went on living with the lens chance had dealt her. But by midlife, her eyes had grown even more misaligned, both horizontally and vertically. She learned about a kind of vision therapy involving a set of prism glasses and some impressively inventive eye-training exercises. It was transformative. Paintings began to look more three-dimensional and she could see “the empty, yet palpable, volumes of space between leaves on tree.” She recounts:</p>\n<blockquote><p>Over the next several months, my vision was completely transformed. I had no idea what I had been missing. Ordinary things looked extraordinary. Light fixtures floated and water faucets stuck way out into space.</p></blockquote>\n<p>Three years into relearning to see, she met <a href=\"https://www.themarginalian.org/tag/oliver-sacks/\">Oliver Sacks</a> at her astronaut husband’s space shuttle launch. With his passionate curiosity about the interplay of physiology and psychological reality, the famed neurologist asked her a question that came to haunt her: Could she imagine what the world would look like viewed with two eyes? </p>\n<p>As a neurobiology professor herself, having written and read countless papers on visual processing, binocular vision, and stereopsis, Barry was at first certain she could. But the more she thought about the question, the more she felt into it, the more she realized that something essential was missing from her cerebral understanding: She was Mary, and the world was the world. </p>\n<figure><a href=\"https://www.themarginalian.org/2018/03/11/chemistry-imagined-roald-hoffmann-vivian-torrence-carl-sagan/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?resize=680%2C908&amp;ssl=1\" width=\"680\" height=\"908\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?resize=240%2C320&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?resize=320%2C427&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?resize=768%2C1025&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/03/chemistryimagined28.jpg?resize=600%2C801&amp;ssl=1 600w\" /></a><figcaption>Art by Vivian Torrence from <a href=\"https://www.themarginalian.org/2018/03/11/chemistry-imagined-roald-hoffmann-vivian-torrence-carl-sagan/\"><em>Chemistry Imagined</em></a> by Nobel laureate Roald Hoffmann.</figcaption></figure>\n<p>Discomposed by the implications of the question, she decided to reach out to the questioner — for orientation, for consolation, for collaborative reckoning with this suddenly exposed facet of the confusion of consciousness. “That is my story,” she wrote at the end of the nine-page letter detailing her unusual vision history. “If you have the time and inclination, I would greatly appreciate your thoughts. And, of course, I eagerly await your next book.” </p>\n<p>Within days, Oliver had written back. Amazed at her defiance of the odds — it had long been accepted that binocular vision must be achieved by a “critical age” or will forever elude the seer — he expressed his admiration for her willingness to welcome her “new world” with such “openness and wonder.” So began their decade-long correspondence, which helped Barry “shape a new identity.” This richly nourishing epistolary friendship, which lasted until his death, now lives on in her wonderful part-memoir, part-memorial <a href=\"https://www.amazon.com/Dear-Oliver-Unexpected-Friendship-Sacks/dp/1891011308/?tag=braipick-20\" target=\"_blank\"><strong><em>Dear Oliver</em></strong></a> (<a href=\"https://search.worldcat.org/title/1390775551?oclcNum=1390775551\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>From her very first letter, she sets out to convey the wonder-filled disorientation of her newly trained vision — a transformation both life-expanding and overwhelming, given <a href=\"https://www.themarginalian.org/2022/05/28/arthur-zajonc-catching-the-light/\">the coevolution of vision and consciousness</a>. She writes:</p>\n<blockquote><p>Imagine a person who saw only in shades of gray suddenly able to see in full color. Such a person would probably be overwhelmed by the beauty of the world. Could they stop looking? Each day, I spend time looking head-on at objects — flowers, my fingers, faucets, anything — in order to get that strong three-dimensional sense… After almost three years, my new vision continues to surprise and delight me. One winter day, I was racing from the classroom to the deli for a quick lunch. After taking only a few steps from the classroom building, I stopped short. The snow was falling lazily around me in large, wet flakes. I could see the space between each flake, and all the flakes together produced a beautiful three-dimensional dance. In the past, the snow would have appeared to fall in a flat sheet in one plane slightly in front of me. I would have felt like I was looking in on the snowfall. But, now, I felt myself within the snowfall, among the snowflakes. Lunch forgotten, I watched the snow fall for several minutes, and, as I watched, I was overcome with a deep sense of joy. A snowfall can be quite beautiful — especially when you see it for the first time.</p></blockquote>\n<p>Barry’s question about whether one could be so overwhelmed by a new way of seeing as to stop looking is not rhetorical — the history of medicine is <a href=\"https://www.themarginalian.org/2022/05/28/arthur-zajonc-catching-the-light/\">strewn with cases</a> of blind people receiving corrective surgery that grants them sight, only to reject the new reality of light and return to the familiar world of darkness, moving through their lives with eyes shut. </p>\n<p>These physiological transformations are a haunting analogue for our psychological pitfalls — accepting change, even toward something that deepens and broadens our experience of aliveness, is never easy, in part because we are <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">so poor at picturing</a> an alternate rendering of reality. “The things we want are transformative,” Rebecca Solnit wrote in her superb <a href=\"https://www.themarginalian.org/2014/08/04/field-guide-to-getting-lost-rebecca-solnit/\"><em>Field Guide to Getting Lost</em></a>, “and we don’t know or only think we know what is on the other side of that transformation.” We live so often lost in our frames of reference, lulled by the familiar, too terrified to live a larger life on the other side of a transformation that upends our comfortable ways of seeing and of being. (And what is the self if not just a style of being?) It takes both great courage and great vulnerability to welcome such a change — a transformation often mired in uncertainty, discomfiture, and confusion as we adapt to the overwhelm of life more magnified; a transformation that asks us to begin again, and a beginning always <a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\">places a singular strain on the psyche</a>.</p>\n<figure><a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=680%2C794&amp;ssl=1\" width=\"680\" height=\"794\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=320%2C374&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=600%2C701&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=240%2C280&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=768%2C897&amp;ssl=1 768w\" /></a><figcaption>Butterfly metamorphosis by <a href=\"https://www.themarginalian.org/2021/10/12/gosse-devonshire-coast/\">Philip Henry Gosse</a> from <em>Entomologia terrae novae</em>, 1833. (Available as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_cards\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Years into their correspondence, Barry shares with Oliver the case of a young woman who embodied this courageous willingness to welcome transformation —  a student of hers born with almost no hearing, who had received a cochlear implant at age 12. Barry writes:</p>\n<blockquote><p>When her implant was first turned on, she did not recognize a sound as a sound but rather as a terrifying, unpleasant, unnerving feeling. For the first few days, she had this same frightening sensation every time she put on the implant. Eventually, she said, she came to accept the feeling. Then she began to expect the sensations and to interpret some of them as meaningful sounds.</p>\n<p>[…]</p>\n<p>I was intrigued by her use of the word “accept,” because I think anyone who goes through a substantial perceptual improvement must learn to tolerate a certain amount of discomfort, uncertainty, and confusion. If one doesn’t have the support of doctors, therapists, family, and/or friends, then one may not allow the changes to occur.</p></blockquote>\n<p>The degree to which we allow transformation — whether it comes in the form of new prism glasses or a new cochlear implant or a new love — may be the fullest measure of our courage, the great barometer of being fully alive. </p>\n<p>Complement with the blind resistance hero Jacques Lusseyran’s <a href=\"https://www.themarginalian.org/2023/09/06/and-there-was-light-jacques-lusseyran/\">luminous meditation on seeing the heart of life</a> and <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">The Vampire Problem</a> — another brilliant and haunting thought experiment, illuminating the psychological paradox of transformative experiences — then revisit Oliver Sacks himself on <a href=\"https://www.themarginalian.org/2023/11/23/oliver-sacks-illusions/\">the necessity of our illusions</a>, <a href=\"https://www.themarginalian.org/2018/01/15/oliver-sacks-identity-self-narrative/\">the building blocks of personhood</a>, <a href=\"https://www.themarginalian.org/2017/11/09/oliver-sacks-the-river-of-consciousness-the-creative-self/\">the three essential elements of creativity</a>, and <a href=\"https://www.themarginalian.org/2015/11/24/oliver-sacks-gratitude-book/\">the measure of a life fully lived</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"3a9e731875d20f8fa46e1c952a2f3cec0c29341436fbc6dea224d09205602ed6","category":"default"}