{"title":"Jony Made a Button","link":"https://om.co/2024/09/07/jony-made-a-button/","date":1725719345000,"content":"<p><strong>TLDR</strong>: Jony Ive’s design agency LoveFrom has reimagined the humble button for Moncler, once again proving that for Sir Jony, everything is up for reinterpretation. It’s a reminder that innovation often lies in refining the familiar, not just inventing the new.</p>\n\n\n\n<p><strong>Source:</strong> <a target=\"_blank\" href=\"https://www.fastcompany.com/91185536/jony-ives-lovefrom-reinvents-the-button-with-moncler\">Jony Ive’s LoveFrom Reinvents a Button With Moncler</a></p>\n\n\n\n<p><strong>Key Points:</strong></p>\n\n\n\n<p>Moncler is a luxury ski-apparel company that now makes all sorts of clothing — but is mostly known for its jackets and puffers with a big M logo. LoveFrom, Jony Ive’s design firm, and Moncler started working together four years ago and have come up with “LoveFrom, Moncler,” a three-in-one shell jacket that goes on sale later this month.</p>\n\n\n\n<p>At its core is Moncore, a down-filled vest to which you can add a field jacket, a parka or a hooded poncho. None of this is new — companies have built layered outerwear for a long time. What’s new is how it all comes together — with a brand-new kind of button.</p>\n\n\n\n<p>Sometimes a button is not just a button — it’s how you build the entire system. Ive focused on a button because that’s how every layer of the “four-in-one jacket” system comes together.</p>\n\n\n\n<blockquote>\n<p>“How could you connect something where you didn’t have to pay attention? Velcro’s sort of ingenious in that way. But I don’t think it’s satisfying,” Ive told Fast Company. “Explorations into all methods of attachment followed. “I tried to do better zippers, and zippers are really hard.”</p>\n</blockquote>\n\n\n\n<p>Ergo, buttons!</p>\n\n\n\n<blockquote>\n<p>“There wasn’t some arrogant ambition around disruption [of buttons]. It was a very gentle, humble exploration.”</p>\n</blockquote>\n\n\n\n<figure><img width=\"1024\" height=\"349\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-1024x349.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-1024x349.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-300x102.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-768x262.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-1536x524.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-2048x699.jpg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-192x66.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-1100x375.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-560x191.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/moncler-lovefrom-button-1800x614.jpg 1800w\" /></figure>\n\n\n\n<p>It’s a two-part design — one half of the button is on the base layer, Moncore vest. The other half, shaped like a donut, is on the other layers. To the touch, they feel solid, but there’s a piston inside the base layer. When the two halves come close, magnets inside the donut engage, pulling out the piston from the base layer and locking the two halves. To unlock, simply press the center. The result is a pressable button. </p>\n\n\n\n<p><em>MagSafe for buttons is a fitting analogy</em>.</p>\n\n\n\n<blockquote>\n<p>“Your practice and your process leads to what you make,” Ive says. “And you know, I’ve become more and more focused on who I do things with, rather than the what. Because that defines your process and what you’re going to learn or not learn. “I love seeing the world through the lens of a relationship, not a project. That’s one of the things I’m learning much more about.”</p>\n</blockquote>\n\n\n\n<p>While not quite the iPhone or the Apple Watch, it’s no less exciting to see Ive take his approach to  mundane everyday items. I won’t be surprised if it is not long before this design gets copied as well.</p>\n\n\n\n<p><strong>My Thoughts</strong>:</p>\n\n\n\n<p> Ive’s role model, Dieter Rams once said, “Design should make a product easier to use, not more difficult.” This button project also serves as a reminder that true innovation doesn’t always mean creating something entirely new. Often, it’s about refining and perfecting the familiar. <br /><br />I’ve seen this kind of effort before.</p>\n\n\n\n<p>Over a year ago, I met Ian Schon, a former designer and engineer from Philadelphia. He started <a target=\"_blank\" href=\"https://www.schondsgn.com/?srsltid=AfmBOopg0GFUILvjDTnO_3gmR7UDCEh8oJflJRSDqwm00pLfiRAbqMCH\">a pen company, crafting</a> beautiful pens out of various metals and other industrial materials. He uses various techniques to give them texture, color and patinas. Then one day, he decided to redesign and reimagine a fountain pen nib, carving it from a solid block of titanium to create a singularly new writing experience. The nib is called the <a target=\"_blank\" href=\"https://www.schondsgn.com/blogs/news/monoc_titanium_nib_schon_dsgn\">Monoc</a>.</p>\n\n\n<div>\n<figure><img width=\"577\" height=\"385\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/MononNib.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/MononNib.jpg 577w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/MononNib-300x200.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/MononNib-192x128.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/MononNib-560x374.jpg 560w\" /></figure></div>\n\n\n<p>No one needed that nib. Fountain pens are a shrinking market, a hobby only for the obsessive. However, Schon didn’t care. He reinvented a brand-new nib — and thankfully there are many who wanted to buy this $400 nib. Ian, to me, represents what I call a lean-forward innovation philosophy.</p>\n\n\n\n<p>Ive’s take on Button is part of that lean-forward innovation philosophy — one that implies that with optimism and ingenuity, anything is possible.</p>\n\n\n\n<p><strong>Source:</strong> <a target=\"_blank\" href=\"https://www.fastcompany.com/91185536/jony-ives-lovefrom-reinvents-the-button-with-moncler\">Jony Ive’s LoveFrom Reinvents a Button With Moncler</a></p>\n\n\n\n<p><strong>September 7, 2024, San Francisco</strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"3af4a4835a06b55e85e25ddfeb6185d1549924c7ddf9acb50ea0b2fb0daa9b7a","category":"Sites"}