{"title":"The Birth of the Byline: How a Bronze Age Woman Became the World’s First Named Author and Used the Moon to Unify the World’s First Empire","link":"https://www.themarginalian.org/2024/06/20/enheduanna/","date":1718901396000,"content":"<p>Days after I arrived in America as a lone teenager, the same age Mary Shelley was when she wrote <em>Frankenstein</em>, not yet knowing I too was to become a writer, I found myself wandering the vast cool halls of the Penn Museum. There among the thousands of ancient artifacts was one to which I would owe my future life — an alabaster disk from Bronze Age Mesopotamia, inscribed in Cuneiform with the name of the world’s first known author: Enheduanna. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?resize=680%2C417&amp;ssl=1\" width=\"680\" height=\"417\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?resize=320%2C196&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?resize=600%2C368&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?resize=240%2C147&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/EnheduannaDisk_PennMuseum_TheMarginalian.jpg?resize=768%2C471&amp;ssl=1 768w\" /><figcaption>The disk of Enheduanna (Penn Museum)</figcaption></figure>\n<p>Born in present-day Iraq with a Semitic name lost to history, the daughter of the Sumerian king Sargon of Akkad named herself <em>en</em> (“high priestess”) <em>hedu</em> (“ornament”) <em>an</em> (the Sumerian sky god) <em>na</em>: high priestess of the ornament of the sky, our Moon. Her father — himself the son of a priestess single mother, who had borne him in secret, then cast the infant on the Euphrates river in a straw basket into a life as an orphan — had conquered the major Sumerian city of Ur in 2334 B.C.E. and set out to unify the tessellation of warring city-states that was then Mesopotamia, creating the world’s first multinational empire. </p>\n<p>He did all the practical things that help people cohere into a people — fostered a common language, standardized weights and measures, introduced taxes to support soldiers and artists — but he came to see what all leaders eventually see: that nothing binds human beings more powerfully than ideas. His citizens had to believe in one thing to become one people. </p>\n<p>Sargon hired the best man for the job: his daughter; she anchored her strategy in what Margaret Fuller called <a href=\"https://www.themarginalian.org/2024/04/19/facts-about-the-moon-dorianne-laux/\">“that best fact, the Moon.”</a></p>\n<figure><a href=\"https://society6.com/product/17th-century-astronomical-art-by-maria-clara-eimmart-moon-phases_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?resize=680%2C451&amp;ssl=1\" width=\"680\" height=\"451\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?resize=240%2C159&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?resize=320%2C212&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?resize=768%2C509&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/01/mariaclaraeimmart_moon4.jpg?resize=600%2C398&amp;ssl=1 600w\" /></a><figcaption>Phases of the Moon by the self-taught 17th-century artist and astronomer <a href=\"https://www.themarginalian.org/2019/01/06/maria-clara-eimmart/\">Maria Clara Eimmart</a>. (Available <a href=\"https://society6.com/product/17th-century-astronomical-art-by-maria-clara-eimmart-moon-phases_print?curator=brainpicker\" target=\"_blank\">as a print.</a>)</figcaption></figure>\n<p>Enheduanna, whose story is woven into Rebecca Boyle’s altogether fascinating book <a href=\"https://www.amazon.com/Our-Moon-Celestial-Companion-Transformed/dp/0593129725/?tag=braipick-20\" target=\"_blank\"><strong><em>Our Moon: How Earth’s Celestial Companion Transformed the Planet, Guided Evolution, and Made Us Who We Are</em></strong></a> (<a href=\"https://search.worldcat.org/title/1406104511\" target=\"_blank\"><em>public library</em></a>), took it upon herself to unify the Akkadian and Sumerian religions, using the Moon as the unifying force and poetry partway between prayer and propaganda as the fulcrum. </p>\n<p>Over the course of her forty-year reign, Enheduanna composed hundreds, perhaps thousands of poems, passionate and playful, unafraid of the sensuous that is the human in the divine and the divine in the human — poems through which, as Boyle writes, “humanity tried to make connections between heaven and Earth for the first time”; poems that, in bringing the gods down to Earth, made them equally interested in all human life, Akkadian or Sumerian. Her crowning achievement of unification were her forty-two verses about different holy places across the empire, known as the Sumerian Temple Hymns and inscribed with the world’s first byline:</p>\n<blockquote><p>The compiler of the tablets was Enheduanna. My King, something has been created here that no one has ever created before.</p></blockquote>\n<p>Enheduanna has been called the Shakespeare of the ancient Middle East. Like Shakespeare’s, her authorship is disputed. But, like Shakespeare, without counterproof she remains the greatest poet of her time and place — doubly so for turning even her pain and loneliness into sacred art: When Sargon’s grandson became king and a rebellion broke out, Enheduanna was exiled to the desert; there, as civil unrest was rupturing the empire, she wrote in verse about her suffering, which was the suffering of many. I am reminded of James Baldwin’s definition of a great poet: “The greatest poet in the English language,” he <a href=\"https://www.themarginalian.org/2016/11/11/james-baldwin-shakespeare-language-poetry/\">wrote of Shakespeare</a>, “found his poetry where poetry is found: in the lives of the people. He could have done this only through love — by knowing, which is not the same thing as understanding, that whatever was happening to anyone was happening to him.” </p>\n<p>Complement with <a href=\"https://www.themarginalian.org/2019/09/10/john-adams-whipple-moon/\">the story of the first surviving photograph of the Moon</a>, which helped humanity bridge immortality and impermanence — those old concerns of religion — through a young science.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"3bf676a528f56f73884ee53a930f7861d87ebe5e30de4d1e58f58e8c48122693","category":"default"}