{"title":"Goodbye 2023!!!","link":"https://www.garbageday.email/p/goodbye-2023","date":1703530113000,"content":"<div><div><h2>I Am So Annoyed I Have To Write This</h2><p>After today, I’m going dark until the first week of January. If you need me, I’m reachable on email and I’ll be lurking in the Discord, as well.</p><p>The plan was to make today’s issue a fun round up of stuff everyone liked in the Garbage Day Discord. And that’s here too, further down below. But, unfortunately, it doesn’t just get to be a bunch of fun stuff because Substack has, once again, stepped in it. I put a version of what I’m about to say here in the paid issue over the weekend, but after stewing on it — instead of enjoying the holidays!!!! — I decided I should put this in the main issue, as well.</p><p>Substack’s co-founder Hamish McKenzie <a href=\"https://substack.com/@hamish/note/c-45811343?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\" target=\"_blank\">posted a real bad statement</a> this week about the platform’s Nazi problem. A bunch of writers I respect are leaving the platform and I think I will be, as well. To be clear: I don’t want to move actually. Substack, at least as a product, works incredibly well and there are lots of good people working there who have been super helpful over the last few years. But I don’t think it’s worth staying there anymore.</p><p>I’ve tried to make the case a few different times as to how Substack should moderate themselves. I don’t even think it’s that complicated. But it goes nowhere and they clearly don’t care. And so, at this point, I’m just annoyed. Substack is, essentially, my primary business partner and their pathological need to virtue signal to the worst people in the world is exhausting. And I am, frankly, sick of waking up every few months to deal with the fallout after they release a statement that pisses off all my readers.</p><p>To put this in language they seem to value (more than moderation), they are, increasingly, making it harder to do business with them. Not only do they refuse to enforce literally their own terms of service, but they also can’t stop blogging about it. If I had a chief technology officer who was constantly posting about people’s right under the first amendment to sell Nazi memorabilia I would feel the same way. So, yeah, I’m probably out. I’ll be spending the next few weeks looking into where I’ll move to, but whatever happens, it shouldn’t affect how you receive issues (hopefully).</p><p>OK, now that that’s out of the way, let’s get to the good stuff.</p><hr /><h2>One Last Video Essay For The Year</h2><p>I collected a bunch of reporting I did this year and put it all together into a video essay that I think tackles what was, for me, the biggest trend of 2023: Rage bait. And particularly, rage bait from TikTok. </p><p>Pornstars with fake podcasts, #WaterTok, dress re-selling on Depop, NPC streaming — this video covers it all. Enjoy!</p><hr /><h2>The Content Mines Is Back (For An Episode)</h2><p>We thought we’d jump back on mic and talk through the weirdness of 2023, our first year since COVID that we didn’t put out a podcast every week. Luke thinks 2023 feels weird because millennials are no longer relevant. I think 2023 feels weird because the internet has reverted back to what it was like in 2010. Maybe both theories are correct! Or maybe it was some other third reason. Either way, we spend a lot of time arguing about TikTok.</p><hr /><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/33d7d3a4-24f4-4c14-b584-34821e60080c/d7e83ea8-5893-4d10-9c13-7e703261cd16_2200x96.png?t=1705691551\" /></div><h2>2023 According To The Garbage Day Discord</h2><p><i>—by Adam Bumas</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/ec6ca9b4-4ca5-4ba5-bb19-a2ea7ffff8b8/2e368f7b-0e20-47e6-962f-b5db9ba415e7_1036x208.png?t=1705691551\" /></div><p>Alright, here’s what you’ve all been waiting for. Just <a href=\"https://www.garbageday.email/p/the-discord-wrote-a-garbage-day-issue?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\" target=\"_blank\">like last year</a>, we opened up a special channel in the Garbage Day Discord and asked everyone what their favorite piece of content was this year. I couldn’t fit everything in, but I hope I did it justice. If this looks like a good crowd, you can join by hitting the green button below.</p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\"><span> Subscribe now </span></a></div><p>I noticed that there was a lot more emphasis on events than posts. We got a bumper crop of great videos, insane takes, and timeless tweets (Just think! In January they were still called “tweets!”), but I saw way more reminiscence about the times something big enough happened that everyone was talking about it. Here’s the biggest moments of the year according to the Discord:</p><ul><li><p>The Paris trash strikes in March (first mentioned by Discord user Alyx). </p></li><li><p>The OceanGate submarine disaster in June (first mentioned by yellojkt).</p></li><li><p>Colleen Ballinger’s ukulele apology later that month (first mentioned by albertinho).</p></li><li><p>Barbenheimer in July (first mentioned by HarryJ).</p></li><li><p>The Boston cop’s slide at the beginning of August (first mentioned by ppyajunebug).</p></li><li><p>The Montgomery riverfront brawl a week later (first mentioned by nickweird).</p></li><li><p>Burning man getting rained out at the end of August (first mentioned by SunglassesCats).</p></li><li><p>Lauren Boebert at the theater in September (first mentioned by Mo).</p></li><li><p>The Eras Tour and its film version in October (first mentioned by Dr. Jo).</p></li><li><p>Henry Kissinger dying, not even a month ago (first mentioned by JRo).</p></li></ul><p>I know it’s silly and maybe a tiny bit tactless to link together all these wildly distinct events, but they all shared at least a little grain of the vanishing monoculture. They brought the Discord together in conversation and I assume they did the same for a lot of other communities out there. </p><p>As I see it, the structures of our online communities are becoming disconnected enough that these events are now feast days. They’re occasions to reach out and connect in kindred spirit, even if that spirit is dunking on a centenarian war criminal. Like Garbage Day’s motto says, “Love to have fun online”, and people had fun online with all of these.</p><p>Here are some more of the Discord’s favorite pieces of content this year.</p><h3>Some Good <i>Zelda</i> Music</h3><p>This was shared by lusername.</p><h3>A Good Post</h3><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/2a0a20a8-29ac-41bb-b56d-aa499b576a5c/6369a90a-a225-4ab9-881c-6bffa7e447b7_1214x496.png?t=1705691552\" /></div><p>This comes courtesy of Daniel Entertainment Cheese.</p><h3>Is Conner O’Malley Better At This Than Us?</h3><p>User hypirlink shared this video from last week. It’s a whole-ass short film, and one perfectly in line with everything about community I wrote up there in that last section. User Sean also noted “It’s more like thriller than comedy,” adding “and it’s just so <i>sad</i> lol”.</p><h3>The Robots Aren’t In Charge…Yet</h3><div></div><p>This video was shared by user the-jim, who said “I liked the AI Biden/Obama/Trump content but this is my favorite hands down.” The trend was definitely big for a few months there, and I think it ended simply because people got bored of the new toy.</p><h3>A Good Chart </h3><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/cd8049ea-88fb-49e0-9e87-e6018dd18da2/ae697f6f-f499-4ed0-8706-585e76cc3df8_1220x1458.png?t=1705691554\" /></div><p>This was shared by SunglassesCats. You can <a href=\"https://twitter.com/akie_works/status/1713743514847121758?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\" target=\"_blank\">click here</a> to see it in all its glory if you haven’t yet.</p><h3>I Love The Rain</h3><div></div><p>This comes from user moxie<b>.</b></p><h3>A Garbage Day Reader Goes To California Pizza Kitchen</h3><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8f44f594-598f-4d99-984a-428bd4a71195/78242a4f-fbb3-466d-b441-ca0e88c432fd_966x868.png?t=1705691556\" /></div><p>This one is a bit tricky to explain, but, essentially, a user in the Discord named Michael was pestered for months to go to California Pizza Kitchen. Last month, he finally went. Except he didn’t actually get pizza. He got tortilla soup and jambalaya, apparently. Either way, it was a big moment on the server this year and, I realize while writing this, completely indecipherable to outsiders. Welcome to the new internet! As user cissy wrote, “I'm worried about the lesson we've all learned about how internet bullying is good actually.”</p><h3>A Cool Game</h3><p>The <a href=\"https://neal.fun/password-game/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\" target=\"_blank\">Password Game</a> was shared by user Alyx. It’s made by Neal Agarwal, who’s made a ton of fun Garbage Day-adjacent stuff, and I was surprised how enjoyable of a challenge it was. User zreese also noted “password game is good but I don’t think it was elevated to true art until Kitboga used it against call center scammers”. </p><h3>Actual POV TikTok</h3><div></div><p>This comes courtesy of Webthing.</p><h3>And, Finally, An Important Discussion From The Discord</h3><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/42b1b062-b19c-4d7d-86bb-2b61bca36bb4/b29e0170-6d4a-44c9-bf6a-cefb3c49971d_770x486.png?t=1705691557\" /></div><hr /><p>That’s all, folks! Thank you all for reading and supporting Garbage Day. This year has been a blast, truly. This is the best job ever. I’ll see you in the new year!</p><p>P.S. here’s a <a href=\"https://www.instagram.com/p/CvUTR6bvCui?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=goodbye-2023\" target=\"_blank\">good belly rub video</a>, recommended by Lucas in the Discord.</p><p><i>***Any typos in this email are due to drinking too much egg nog***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=eb6bdf13-ba61-4c63-9f8e-9cc3b9a91c18&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"3c6153bdf81ccde39c1ff1dc502f714bb9c69fb0648e725e30b866b308b7902b","category":"default"}