{"title":"Equality Act 2010","link":"https://feeds.feedblitz.com/~/904456928/0/marginalrevolution~Equality-Act.html","date":1726124505000,"content":"<p>The UK’s Orwellian sounding <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.legislation.gov.uk/ukpga/2010/15/section/65\">Equality Act 2010</a> is strikingly Marxist. It demands equal pay for work of equal value where these are defined as follows:</p>\r\n<blockquote><p>A’s work is equal to that of B if it is like B’s work, rated as equivalent to B’s work, or of equal value to B’s work.</p>\r\n<p>A’s work is like B’s work if A’s work and B’s work are the same or broadly similar, and such differences as there are between their work are not of practical importance in relation to the terms of their work.</p>\r\n<p>…A’s work is rated as equivalent to B’s work if a job evaluation study— gives an equal value to A’s job and B’s job in terms of the demands made on a worker</p>\r\n<p>…A’s work is of equal value to B’s work if it is neither like B’s work nor rated as equivalent to B’s work, but nevertheless equal to B’s work in terms of the demands made on A by reference to factors such as effort, skill and decision-making.</p></blockquote>\r\n<p>In short, supply and demand have been replaced by judges and labor boards with the authority to deem which jobs are “equal” and therefore should be paid equally. And the labor boards do so based on vague and subjective considerations that do not change with changing circumstances. Imagine replacing “jobs” with “condiments” and having judges decide whether ketchup and mustard should be priced equally because they are similar, broadly comparable, or rated equivalent in terms of the effort, skill, and decision-making that went into their production.</p>\r\n<p>You think I am joking. I am not. Here’s an example of a case <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.bbc.com/news/articles/cj0817jd9dqo\">just decided in the UK</a>.</p>\r\n<blockquote><p>More than 3,500 current and former workers at Next have won the final stage of a six-year legal battle for equal pay.</p>\r\n<p>An employment tribunal said store staff, who are predominantly women, should not have been paid at lower rates than employees in warehouses, where just over half the staff are male.</p></blockquote>\r\n<p>The tribunal ruled that retail workers and warehouse workers were “equal” and thus had to be paid equally. Next replied that they paid everyone market wages. Verboten!</p>\r\n<blockquote><p>Next argued that pay rates for warehouse workers were higher than for retail workers in the wider labour market, justifying the different rates at the company.</p>\r\n<p>But the employment tribunal rejected that argument as a justification for the pay difference.</p>\r\n<p>According to the tribunal’s ruling, between 2012 and 2023, 77.5% of Next’s retail consultants were female, while 52.75% of warehouse operators were male.</p>\r\n<p>The tribunal accepted that the difference in pay rates between the jobs was not down to “direct discrimination”, including the “conscious or subconscious influence of gender” on pay decisions, but was caused by efforts to “reduce cost and enhance profit”.</p>\r\n<p>It ruled that the “business need was not sufficiently great as to overcome the discriminatory effect of lower basic pay”.</p></blockquote>\r\n<p>No one is alleging that male and female warehouse workers were paid unequally or that male and female retail workers were paid unequally or that there was any direct or indirect discrimination. The only claim is that warehouse workers, who are less likely to be female than retail workers, earn more than retail workers. And since these jobs have been judged “equal,” the company has violated <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.legislation.gov.uk/ukpga/2010/15/section/65\">Equality Act 2010</a>.</p>\r\n<p>Who could have predicted that jobs as disparate as warehouse and retail jobs might one day be deemed “equal.” Y<span>et because Next failed to foresee such lunacy they are now required to pay millions in back wages to their retail employees. Software engineers, particularly in AI, are currently in high demand. A British firm looking to hire them may hesitate to raise wages, fearing that a future ruling could classify software engineers as “equal” to a larger, lower-paid group like HR administrators. Such a decision could easily push the firm into bankruptcy.</span></p>\r\n<p>The warehouse workers were almost 50% female (47.25%). So females were not barred from the higher paying jobs. The fact that 77.5% of the retail workers were female suggests that retail work has special appeal to females relative to males and thus that there are compensating differentials. Any of the three female plaintiffs could have taken jobs in the warehouse. If the jobs are equal and the warehouse jobs pay more this is, on the plaintiffs’ theory, “puzzling”. [Or, as Ayn Rand would say, blank out.]</p>\r\n<p>In fact, the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.nextplc.co.uk/~/media/Files/N/Next-PLC-V2/documents/investors/1302019-2018-Reserved%20Judgment%2022-08-2024.pdf\">court case</a> reveals that Next was struggling to fill the warehouse positions and offered any retail employee—including the plaintiffs—the opportunity to switch to warehouse work. On cross-examination, one of the plaintiffs admitted that, given the unpleasant conditions in the warehouse—described by the court as “the drone of machinery,…vibration, alarm sirens and the screeching of machinery, wheels and rollers, continuously present in all areas”—the warehouse job “did not seem particularly attractive” compared to the greater autonomy and more appealing environment of the retail job. The plaintiff added that she would only have considered the warehouse job if it paid “<em>a lot more money</em>.”</p>\r\n<p><img src=\"https://marginalrevolution.com/wp-content/uploads/2024/09/AmandaCoxReport.png\" width=\"388\" height=\"436\" srcset=\"https://marginalrevolution.com/wp-content/uploads/2024/09/AmandaCoxReport.png 641w, https://marginalrevolution.com/wp-content/uploads/2024/09/AmandaCoxReport-267x300.png 267w\" />Thank goodness for the men and women who were willing to take such jobs for only a little more money! It should not shock that different people have different preferences over jobs, just as they have different preferences over ice cream. In particular, it will perhaps surprise only the judges to learn that men tend to be more wage-focused and “women are relatively more attracted to employers with low pay but high values of nonpay characteristics (<a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.nber.org/papers/w32408\">NBER 32408</a>).” The court, however, recoiled from this idea, noting that if they were to take demonstrated preferences seriously this would be tantamount to applying “an unfettered free market model of supply and demand.” The horror.</p>\r\n<p>Now consider how the jobs were deemed “equal”. On the left is the job evaluation report for claimant Amanda Cox. The specific categories and numbers are not important; what is important is that the jobs are rated across 11 categories, and the point-scores are then added to get a total score at the bottom.</p>\r\n<p>Amusingly, the evaluators emphasize that they use <em>equal</em> weighting across the categories. Of course, they did—because “equal” is synonymous with fair, right? An unequal weighting would surely be discriminatory!</p>\r\n<p>I am <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.nextplc.co.uk/~/media/Files/N/Next-PLC-V2/documents/investors/1302019-2018-Reserved%20Judgment%2022-08-2024.pdf\">not making this up</a>:</p>\r\n<blockquote><p><em>Any scheme which has as its starting point – “This qualification is paramount” or that “This skill is vital” is nearly always going to be biased or at least open to charges of bias or discrimination.</em></p></blockquote>\r\n<p><img src=\"https://marginalrevolution.com/wp-content/uploads/2024/09/ComparisonReport.png\" width=\"484\" height=\"469\" srcset=\"https://marginalrevolution.com/wp-content/uploads/2024/09/ComparisonReport.png 809w, https://marginalrevolution.com/wp-content/uploads/2024/09/ComparisonReport-300x291.png 300w, https://marginalrevolution.com/wp-content/uploads/2024/09/ComparisonReport-768x745.png 768w\" />Thus, if you think that a skill is vital for a job, that’s discrimination!</p>\r\n<p>(Notice also that equal weighting is just another form of weighting. Given the subjective nature of both the categories and the points assigned, equal weighting holds no inherent superiority or objectivity.)</p>\r\n<p>But no matter—we have yet to get to the best part. The evaluators selected three warehouse workers and assessed them using the same metric. For example, Amanda Cox was compared to warehouse worker Calvin Hazelhurst, resulting in the table on the right.</p>\r\n<p>Can you spot something surprising in this table? I’ll give you a moment.</p>\r\n<p>The obvious conclusion any reasonable person would draw from this table is that the jobs are clearly <em>not</em> equal. Amanda’s total score is 440, while Calvin’s is 340. 440 ≠ 340. Not even close! In nearly every category—except (no surprise!) physical demands and working conditions—the retail job requires more points, aka “skill and responsibility”.</p>\r\n<p>At this point, most people would stop and ask some critical questions. If the jobs differ so much across multiple dimensions, isn’t it clear that they are not equal? And why do jobs that seemingly require less “skill” pay more? Could it be that our point-score rating system is oversimplified? Maybe the market is telling us something that this crude scoring system isn’t capturing? Is it time to check our premises?</p>\r\n<p>But not the evaluators! Oh, no. The evaluators are thrilled–because the fact that the jobs are unequal proves that they are equal!</p>\r\n<p><img src=\"https://marginalrevolution.com/wp-content/uploads/2024/09/Conclusion.png\" width=\"777\" height=\"124\" srcset=\"https://marginalrevolution.com/wp-content/uploads/2024/09/Conclusion.png 777w, https://marginalrevolution.com/wp-content/uploads/2024/09/Conclusion-300x48.png 300w, https://marginalrevolution.com/wp-content/uploads/2024/09/Conclusion-768x123.png 768w\" /></p>\r\n<p>War is peace, freedom is slavery, ignorance is strength. <strong>UNEQUAL IS EQUAL</strong>.</p>\r\n<p>Adam Smith had a <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.gutenberg.org/files/3300/3300-h/3300-h.htm\">much better understanding of wages in 1776</a> than UK judges have today.</p>\r\n<blockquote><p>The wages of labour vary with the ease or hardship, the cleanliness or dirtiness, the honourableness or dishonourableness, of the employment. Thus in most places, take the year round, a journeyman tailor earns less than a journeyman weaver. His work is much easier. A journeyman weaver earns less than a journeyman smith. His work is not always easier, but it is much cleanlier. A journeyman blacksmith, though an artificer, seldom earns so much in twelve hours, as a collier, who is only a labourer, does in eight. His work is not quite so dirty, is less dangerous, and is carried on in day-light, and above ground. Honour makes a great part of the reward of all honourable professions. In point of pecuniary gain, all things considered, they are generally under-recompensed, as I shall endeavour to shew by and by. Disgrace has the contrary effect. The trade of a butcher is a brutal and an odious business; but it is in most places more profitable than the greater part of common trades. The most detestable of all employments, that of public executioner, is, in proportion to the quantity of work done, better paid than any common trade whatever.</p></blockquote>\r\n<p>Today, the UK would convene a labor board to rule that the tailor and the weaver must be paid equally because they <strong>DO WORK OF EQUAL VALUE</strong>. Case closed.</p>\r\n<p>Labor boards will inevitably lead to the misallocation of labor, diminishing both wealth and fairness. Severe misallocation may lead to further intervention, in the worst scenario, even to the allocation of labor by fiat. Politicization breeds division, rent-seeking, and a stagnant, unpleasant society.</p>\r\n<p>More generally, it pains me that there is no recognition that the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://econjwatch.org/File+download/913/HayekMay2016.pdf?mimetype=pdf\">market is a discovery procedure</a>, including the discovery of the value of different skills and people’s preferences over different jobs. No recognition that the market harnesses <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://en.wikipedia.org/wiki/Tacit_knowledge\">tacit knowledge</a> and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://home.uchicago.edu/~vlima/courses/econ200/spring01/hayek.pdf\">knowledge of particular circumstances of time and place–</a>knowledge that is difficult to quantify, communicate, or communicate in a timely manner–and that “society’s economic problems are primarily related to adapting quickly to changes in these circumstances.” No recognition that <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.youtube.com/watch?v=aBYzvPbIFNw&amp;t=1s\">a price is a signal wrapped up in an incentive</a>.</p>\r\n<p>I despair when I consider that these fundamental ideas are the foundation of our liberal, global, and prosperous civilization. On economics, as on free speech, the UK has entered the great forgetting.</p>\r\n<p><strong>Addendum</strong>: A special hat tip to <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://x.com/brucegreig\">Bruce Greig</a> who brought this to my attention and had the receipts.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html\">Equality Act 2010</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/904456928/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/904456928/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/904456928/marginalrevolution,https%3a%2f%2fmarginalrevolution.com%2fwp-content%2fuploads%2f2024%2f09%2fAmandaCoxReport.png\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/904456928/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/904456928/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/904456928/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comment-160811133\">In reply to JVM.   Fantastic post by Alex.   Sadly he will ...</a> <i>by The Good Bill</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comment-160811131\">In reply to Kyle.   We are seeing in real time the suicide of a ...</a> <i>by Engineer</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comment-160811129\">In reply to Niko Davor.   I'm an economist first, who opposes ...</a> <i>by Hazel Meade</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comment-160811127\">In reply to Hazel Meade.   Why can't they accept it?   There ...</a> <i>by notRover</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comment-160811125\">In reply to M.   Obviously, if we believe that evil witches ...</a> <i>by Scott H.</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/equality-act-2010.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/honduras-and-its-disputes.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=honduras-and-its-disputes\">Honduras and its disputes</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/should-we-keep-the-wealthy-non-diversified-from-my-email.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=should-we-keep-the-wealthy-non-diversified-from-my-email\">Should we keep the wealthy non-diversified? (from my email)</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/against-an-american-sovereign-wealth-fund.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=against-an-american-sovereign-wealth-fund\">Against an American sovereign wealth fund</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"3cc1b612ab7eb329e365dbaadc2e88302fc27d96bde5a42cbd3c44a575bd8f0b","category":"Sites"}