{"title":"What Is The Most Surprising Predator Prey Relationship?","link":"https://kottke.org/24/11/what-is-the-most-surprising-predator-prey-relationship","date":1731955235000,"content":"\n        <p>OK, I see you have your hand up with an answer, but I’m going to take this one, alright? Killer whales hunt moose. Right? That’s the most surprising. </p>\n\n<p>It is not terribly common, but in the Pacific Northwest, habitats of two of the more massive mammals intersect. Moose will swim to look for food or escape other predators and orcas will eat anything once, just like Jason. For more on the reasons orcas sometime eat moose, we turn now to noted naturalist publication, <a href=\"https://www.forbes.com/sites/scotttravers/2024/10/22/4-decades-ago-we-learned-that-an-orcas-diet-may-include-moose-heres-why-and-where-this-predator-prey-pairing-exists/\">Forbes</a>.</p>\n\n<blockquote><p>One documented incident occurred in 1992 in Alaska, when a hungry pod of four Biggs’ killer whales attacked a pair of swimming moose. They feasted on the larger of the two. The smaller one escaped the feeding frenzy, but it was wounded so badly that it was unable to keep swimming and drowned a little later.</p></blockquote>\n\n<p>So are killer whales, with their jerky tendencies and habit of toying with prey the bluejay of the sea? I say no. Bluejays have no redeeming qualities and orcas sink yachts for fun, anecdotally save humans from sharks, rescue trapped whales, and wash the dishes after dinner. I made up that last one, no clue if they do the dishes at not. I know for sure bluejays don’t, the bullies.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/moose\">moose</a> · <a href=\"https://kottke.org/tag/nature\">nature</a> · <a href=\"https://kottke.org/tag/whales\">whales</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/11/what-is-the-most-surprising-predator-prey-relationship\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"3d4b459ce20f495ee5ecc3ee4c637b5009b9be1b4391f7520ba50c815a548f89","category":"Sites"}