{"title":"Saying no to everything else","link":"https://sive.rs/no2","date":1442966400000,"content":"<p>\n<a href=\"https://stevenpressfield.com/about/\">Steven Pressfield</a> called himself an author for years, but he’d never actually finished a book.\nEventually, the psychological pain of not finishing kept building until he couldn’t stand it anymore.\nHe decided to finally beat the devil he calls “The Resistance”.\n</p><p>\nHe created a situation with no escape.\nHe rented a cabin, brought his typewriter, and shut off all other options.\n</p><p>\nHe said,\n</p>\n<blockquote>\n“I didn’t talk to anybody during that year…\nI didn’t hang out.\nI just worked.\nI had a book in mind and I had decided I would finish it or kill myself.\nI could not run away again, or let people down again, or let myself down again.\nThis was it, do or die.”\n</blockquote>\n<p>\nAfter a difficult year of wrestling with those inner demons and avoiding all temptations, he did it.\nHe finished his first book.\nIt wasn’t a success, but it didn’t matter.\nHe had finally beat The Resistance.\nHe went on to write many successful novels.\n</p><p>\nHe told this story in the great book <i><a href=\"https://sive.rs/book/TurningPro\">Turning Pro</a></i>, the third in his series of little books about the creative struggle, including <i><a href=\"https://sive.rs/book/WarOfArt\">The War of Art</a></i> and <i><a href=\"https://sive.rs/book/DoTheWork\">Do the Work</a></i>.\nRead all three.\n</p><p>\n“<a href=\"https://sive.rs/hellyeah\">Hell yeah or no</a>” is a filter you can use to decide what’s worth doing.\nBut this is simpler and more serious.\n<strong>\nThis is a decision to stop deciding.\n</strong>\nIt’s one decision, in advance, that the answer to all future distractions is “no” until you finish what you started.\n<strong>\nIt’s saying yes to one thing, and no to absolutely everything else.\n</strong>\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"3d864ce9d8567726005a965e93bb947f7de0b870e2cb1ace3b857ab31f23067f","category":"default"}