{"title":"Reserves, Recycling, and Returns","link":"https://www.usv.com/writing/2024/08/reserves-recycling-and-returns/","date":1725025937000,"content":"<p>A lot of folks who are new to the venture capital business and are building their own firms and funds will email or message me about reserves and recycling. I am happy to engage with them on these very “inside VC” topics because I believe they matter a lot when managing venture capital fund and firm.</p>\n<p>For those of you who are not VCs, you may find this irrelevant. Or you may find it interesting. For those who are in venture capital, I think you should understand these topics so I hope you find this valuable.</p>\n<p>Early stage venture investing is like poker . You make a small initial investment, which is like the ante in poker, and you get a seat at the table. Then you watch the founder and team execute until they need more money. That is like the first set of cards you get. Then you get the chance to invest more money. That is like putting more chips on the table. This repeats a few more times and eventually the company succeeds or fails. That’s like the river and the reveal.</p>\n<p>In order to play the hand correctly, you need to have reserves. You can’t invest all of your money in the ante. You need to have more chips so you can keep seeing more cards. A lot of investors, particularly newbies, don’t understand this and run out of money too early in a deal and don’t get to keep investing in their best companies. That’s like not being able to play your best hands in poker. That’s a disaster since you only get a few of those.</p>\n<p>So at USV, we make sure we always have sufficient reserves for each and every portfolio company. We do this by building a sophisticated model of each fund and the fund’s portfolio of investments and the expected capital needs of each and every business over a long period of time along with probabilities associated with each and every round and we run simulations to predict what the fund will need to reserve to support each company and we raise a new fund when our simulations tell us we need to do so.</p>\n<p>In this way, we always have enough reserves for each portfolio company so we don’t get tapped out.</p>\n<p>We also recycle capital at USV. This means that for any given fund, we will keep the returns we get on early smaller exits and put them back into the fund. This increases our reserves capacity but it also means that we invest more money in our portfolios than we raised, including the management fee load. If a $200mm fund can actually invest $250mm and gets a 3x on that $250mm, it generates a 3.75x on the $200mm that was invested by limited partners. That has a hugely positive impact on returns.</p>\n<p>Reserves and recycling are two techniques that can significantly enhance the returns on a venture capital fund. We use both of these techniques at USV. They are built into our culture, our DNA, and our processes.</p>\n<p>You cannot produce a top decile fund with just reserves and recycling. You need to be working with great founders and teams who are building breakout companies. Just like a poker player needs to get dealt some great hands. But how you play those hands when you are dealt them is also critically important. I have seen early stage VCs make way too little on their best companies because they ran out of money and could not keep on participating or they had to sell too soon or some other reason that was effectively poor portfolio and fund management.</p>\n<p>Reserves, recycling, and returns go hand in hand. So build them into your firm’s culture and processes. They make a difference over the long run.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/reserves-recycling-and-returns/\">Reserves, Recycling, and Returns</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"3da51cd3aac7f6a37e96e008c8add4485266c87e48240219d525cb3033227968","category":"Sites"}