{"title":"Where we do and don’t want automation","link":"https://sive.rs/autom","date":1570665600000,"content":"<p>\nI used to use Gmail.\nBut one day, as I typed my mother’s email address into the “To:” field, Google popped up a prompt asking if I also wanted to CC my uncle.\nThat was so invasive and creepy that I deleted the account immediately and never used it again.\nI don’t want automated intelligence in my private email.\n</p><p>\nMy friend lives in a home full of the smartest technology, and loves getting all the new smart things, but he drives a deliberately retro old car with no computer chips.\nHe loves to tinker with his car, and wants to do any maintenance himself.\n</p><p>\nAnother friend lives in a tech-free rustic cabin with no screens, but drives a Tesla.\n</p><p>\nI do everything on a broken old Linux laptop, using only the command line, usually offline, nothing in the cloud.\nI think it’s because I don’t want any outside automation or intelligence in the work that matters to me.\n</p><p>\nWhen software is described as “auto-”, “smart”, or “intelligent” it means that <strong>somebody else put their rules into it</strong>.\nBut I don’t want my computer to do anything I didn’t explicitly tell it to do.\nIt shouldn’t change what I typed unless I tell it to.\nIt should never guess or predict what I want.\n<strong>\nI want full manual control.\n</strong>\n</p><p>\nOn the other hand, I don’t mind if my phone does these things, because I don’t care about my phone much.\nAnd I would love a high-tech car, full of smart AI automation, because I’m not a car aficionado.\n</p><p>\nAt first I thought that an expert at something won’t want assistance.\nBut no, of course, auto-pilot for airline pilots, and <a href=\"https://www.youtube.com/watch?v=GSKERVTMWqs\">IDE</a>s for programmers.\n</p><p>\nSo I think it comes down to:\n</p>\n<ol><li>\nhow much of an expert you are at controlling this thing yourself\n</li><li>\nhow much you still enjoy doing it\n</li><li>\nif you want the kind of assistance it provides\n</li></ol>\n<p>\nAny thoughts on this subject?\nI’d love to hear another point of view.\n</p>\n<img src=\"/images/robots.jpg\" alt=\"robots\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"3dc14747c43dd1e0f90e6c50cccd1c58848f289fa0e2da898d20ed5e2953a749","category":"Sites"}