{"title":"No Fate But What We Make","link":"https://kottke.org/24/11/no-fate-but-what-we-make","date":1730481820000,"content":"\n        <p>This is a great piece by Jamelle Bouie: <a href=\"https://www.nytimes.com/2024/11/01/opinion/donald-trump-kamala-harris-election-power.html?unlocked_article_code=1.Wk4.S1lK.O7tbymT0gllX\">Donald Trump Is Done With Checks and Balances</a>. The first half is a short lesson on how our present Constitution came to be, which might differ slightly from the version you learned in school:</p>\n\n<blockquote><p>It is important to remember that the Constitution was neither written nor ratified with democracy in mind. Just the opposite: It was written to restrain — and contain — the democratic impulses of Americans shaped in the hothouse of revolutionary fervor.</p>\n\n<p>“Most of the men who assembled at the Constitutional Convention in Philadelphia in 1787 were also convinced that the national government under the Articles of Confederation was too weak to counter the rising tide of democracy in the states,” the historian Terry Bouton writes in “Taming Democracy: ‘The People,’ the Founders, and the Troubled Ending of the American Revolution.”</p></blockquote>\n\n<p>The second part of the piece plainly and succinctly lays out the stakes of a second Trump presidency (emphasis mine):</p>\n\n<blockquote><p>America got lucky. It won’t get lucky again. Free of the guardrails that kept him in place the first time, affirmed by the Supreme Court and backed by allies and apparatchiks in the conservative movement, Trump will merge the office of the presidency with himself. <em>He will shake it from its moorings in the Constitution and rebuild it as an instrument of his will, wielded for his friends and against his enemies.</em> In doing so, he will erode the democratic assumptions that undergird our current constitutional order. And he will have the total loyalty of a Republican Party that itself is twisting and abusing the counter-majoritarian features of the American system to undermine and unravel democracy in the states it controls.</p></blockquote>\n\n<p>What a sentence that is.</p>\n\n<p>See also <a href=\"https://www.nytimes.com/2024/10/25/opinion/trump-milley-kelly-esper-generals.html?unlocked_article_code=1.VE4.tNnl.O6o3pXjgTSSM\">The Guardrails Failed. Now It’s Down to Us.</a>, also by Bouie.</p>\n\n<blockquote><p>We don’t, in 2024, hear much talk of guardrails anymore. And for good reason. The guardrails failed. Every single one of them. The Republican Party failed to police its own boundaries, welcoming Trump when it should have done everything it could to expel him. The impeachment process, designed to remove a rogue president, was short-circuited, unable to work in a world of rigid partisan loyalty. The criminal legal system tried to hold Trump accountable, but this was slow-walked and sabotaged by sympathetic judges (and justices) appointed by Trump or committed to the Republican Party.</p>\n\n<p>When the states tried to take matters into their own hands, citing the clear text of Section 3 of the 14th Amendment, a Republican-appointed majority on the Supreme Court stepped in to rewrite the amendment, turning a self-executing prohibition on insurrectionists in office into a mechanism that required a congressional vote those justices knew would never come.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Jamelle%20Bouie\">Jamelle Bouie</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"3de62fe8889dac2a4387623628cfab9bbb9f670417864d92aa3debfcd00adbb3","category":"Sites"}