{"title":"Vinyl Records","link":"https://www.usv.com/writing/2024/08/vinyl-records/","date":1722865668000,"content":"<p>The other day I woke up to the sounds of A Love Supreme by John Coltrane.</p>\n<p>We recently bought a record player for our home. Carrie requested one for her birthday. I never grew up with vinyl records, so I didn’t “get it.” But now I do. It has been a gift that keeps on giving.</p>\n<p>One of the best parts about it is that our kids have taken to it in such a special way. They love putting a record on and watching it spin and listening to the music come out of the speaker.</p>\n<p>Every morning when he wakes up, one of the first things my seven-year-old does is run to the record player and throw something on. His favorite album is The Best of the Pogues . He picked it out himself when we visited a record store in Kingston called Rhino Records . It’s a lot of fun to go record shopping with your family because you get to talk about all the different artists you see. The owner also gave us two free classical records when we checked out, Vivaldi and Debussy, because he wants more people to be exposed to the genre.</p>\n<p>Watching my kids play with vinyl records reminds me of how I felt playing and collecting CDs growing up. Sitting on the floor of my room reading the lyrics in the album booklet while following along with the music. I can’t help but think that this is a similar experience for them. There’s something uniquely physical about it, and stands in stark contrast to a world filled with streams and screens. It’s nostalgic, but also extremely present.</p>\n<p>I remember several months ago my partner Albert sent me this chart about a resurgence in vinyl record sales.</p>\n<p>I now understand why. It’s such a special way to experience music. It’s very akin to the idea of deep reals . This record player has been a wonderful addition to our home, and it has already become an important fixture in our lives. I’m really happy about that.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/vinyl-records/\">Vinyl Records</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"3e86bdd8965e1eb211823ed22fb5c8a46ba43a0c54e96dfa47de40ba08347e90","category":"default"}