{"title":"","link":"http://scripting.com/2024/02/28.html#a154126","date":1709134886000,"content":"<img src=\"http://scripting.com/images/scriptingNewsAd.gif\" />There are a lot of blogging communities out there in 2024, but we don't think of them that way. But they totally behave like a blogging community. I remember when I was starting <a href=\"https://web.archive.org/web/20000621103057/http://www.weblogs.com/\">weblogs.com</a>, I wanted to get an idea of when sites were updating, so I didn't have to go hunting through a blogroll, clicking on links to find out if there was anything new. So I wrote a script that worked off a list of blogs, read each one in turn, and compared it with the last version we read, and if there was a change, it would move it to the top of the list. I didn't just make it for myself, I shared it with everyone. There was a mail list where people were freaking out about this. The server that would read their blog every so often was called <a href=\"https://www.google.com/search?q=site%3Ascripting.com+subhonker\">subhonker</a>. This was something new and they were scared. I couldn't show them the benefit until the script had been running for a while. Everyone got upset. I remember being confused and scared, but I guess from their point of view it looked scary. I don't know. In the end weblogs.com became really popular, it became the central place to find out what's new with blogs, and then <a href=\"https://web.archive.org/web/20010123225500/http://weblogs.com/stories/\">evolved</a> to use <a href=\"https://cyber.harvard.edu/rss/rss.html\">RSS</a> so we could find changes in even more detail. I guess the thing is people should see the benefit before they see the price? And as an innovator, we have to be aware of this, people may not see the benefit until they can <i>use</i> it.","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"3fad8d380f8864e477d8bffa9147865c5d92617af1c3b981b2d34627c5708935","category":"default"}