{"title":"MacBook Pro (Late 2016) review","link":"https://blog.webb.page/2017-01-07-macbook-pro-review.txt","date":1483747200000,"content":"<p>TL;DR: If you aren't already a Mac user in the market for a new laptop, then\nthis isn't for you. If you <em>are</em> in the market <em>or</em> would like to see how I\nview my new computer, read on!</p>\n<h2>The adapter \"problem\"</h2>\n<p>I can understand why a lot of people are complaining about the dongles,\nplugadoos<a href=\"https://theoutline.com/post/682/in-which-we-try-to-rebrand-the-dongle\">1</a>, throughports, &amp;c, but I don't understand why I'm seeing these\ncomplaints from people who would <em>never</em> buy a computer from Apple. Quite\nfrankly, it reads as bullshit and an excuse to complain on the Internet.</p>\n<p>I have two plugadoos and I backed another one on Kickstarter<a href=\"https://www.kickstarter.com/projects/hypershop/hyperdrivetm-compact-thunderbolt-3-usb-c-hub-for-m\">2</a>. I haven't\ndecided which one will stay at home and which one will stay in my bag yet\n(the Kickstarter one has more ports than the Satechi multi-port adapter<a href=\"https://www.amazon.com/gp/product/B01J4BO0X8\">3</a> I'm\ncurrently using). The transition period is <em>always</em> annoying but once\n<em>everyone</em> is in this USB-C future, no one will be complaining. To borrow\nEdison Wrzosek's response to a 9to5Mac article<a href=\"https://disqus.com/home/discussion/9to5maccom/majority_of_readers_say_no_big_deal_adapting_to_usb_c_world_of_new_macbook_pro/#comment-3066707705\">4</a>:</p>\n<blockquote>\n<p>Ah, people have such short term memory… I still remember when Apple\ntransitioned people, almost overnight, to USB-only iMac's, at a time when USB\nwas nicknamed the \"U-Son-of-a-Bitch\" port in the PC world due to\ncompatibility, reliability issues, and lack of supported peripherals. Now look\nat USB, it's supplanted almost EVERY other standard.</p>\n<p>People just LOVE to whine and complain, and it's Human nature to abhor\nchange, and be fearful of it. TB3/USB3.1 is the future, and it's here and now.\nTime to embrace it.</p>\n<p>I'm still gonna rock my 2011 MBP for a while longer, but I'm really looking\nforward to a ubiquitous standard cable for ALL connectivity.</p>\n</blockquote>\n<p>I <em>really</em> wish \"U-Son-of-a-Bitch\" port stuck, unofficially. That sounds\nhilarious.</p>\n<h2>Battery life</h2>\n<p>Trash.</p>\n<p>Charging? Hella quick. It's a great compromise IMO. That and I'm not sure if\nI'm using my computer like a normal person. It's not uncommon for me to be\nrunning several browser windows with tabs that are almost too small, while\ncompressing a 1 GB folder of images, in addition to running local servers\n(not sure if this last part is applicable to power consumption).</p>\n<p>Basically, it's <em>meh</em>. Could be better. I should've tested this to be certain,\nbut I think my average is ~3 hours at max brightness.</p>\n<h2>MagSafe</h2>\n<p><em>Sigh</em></p>\n<p>I <em>loved</em> MagSafe because life is unpredictable. I've walked into my charge\ncable too many times to count and I never had to worry about my laptop flying\nto the floor. Because I shouldn't have nice things, I've done the same thing\nwith my new MacBook Pro and it stayed on the table! The charge puck fell out\nof the wall instead, thankfully.</p>\n<p>Speaking of the charge puck, another complaint I've heard is in regard to the\nretractable arms on the old charge puck. In practice, the absence of them is\n<em>not</em> a big deal. To store my charge cable and puck in my bag, I just fold and\ntie the cable while it's still plugged into the puck. I'm not focused on\nmaking my cable storage pretty while I'm in transit.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-a.jpg\">Not sure what the big deal is…</a></p>\n<h2>The screen</h2>\n<p>Good grief this thing is bright, <em>and I like it</em>.</p>\n<p>I'm the kind of person who keeps the brightness on his phone to maximum so\nwhen I heard that this computer's brightness and color gamut was\nincreased/enhanced, I was excited. Colour is such a huge part of my life, I\nget inspired<a href=\"http://www.brisseaux.com/retro-series\">5</a> by it. In certain lighting conditions, I <em>do</em> turn the\nbrightness down though. I'm not an animal!</p>\n<h2>The ESC key, or lack thereof</h2>\n<p>Two weeks in and I'm still confused when I need to use it. Albeit only for a\nsplit second but it's enough to give me pause and think, \"That's weird\",\nbefore continuing with whatever I was doing. Currently, the only time I use it\nis when cancelling a screenshot in progress, dismissing autocomplete keywords\nin Atom, or exiting an iTunes visualization or whatever else is in fullscreen\nmode.</p>\n<p>Before I've experienced this for myself, I heard developers (who also didn't\nhave the computer to even try it) say they wouldn't be able to do programming\non it. Maybe I'm just a simple man because all I do is code in HTML, CSS, and\nJavaScript, but if you <em>need</em> to use a physical ESC key to get things done\nyou might have other issues or a hella interesting programming environment\n(if I'm wrong, let me know<a href=\"https://twitter.com/@NetOpWibby\">6</a>).</p>\n<h2>The Touch Bar and Function keys</h2>\n<p>This thing is neat. My most-used \"keys\" are volume up/down. Sliding the volume\nlevel is much more satisfying than repeatedly tapping a button. I know, that\nsounds weird to say but it's true! There's more granularity too. I've slid the\nvolume down to where the on-screen display says the volume is effectively off\nbut I can still hear audio. With the old function keys, volume was changeable\nin steps.</p>\n<p>Something to get used to is doing hard refreshes in my browser. I have Vivaldi\nsetup to do a hard refresh to clear the cache sometimes and that keyboard\nshortcut is <code>Shift + F5</code>. Well, I don't have my Touch Bar setup to show me the\nfunction row by default so my shortcut (when not using an external keyboard)\nis <code>Fn + Shift + F5</code>.</p>\n<p>The Touch Bar changes based on whatever app you're using, which is great.\nHowever, I don't think I've ever used it for an app besides iTunes. When\nediting the photo of how I tie my charge cable, I saw this in the\nTouch Bar (using Affinity Photo<a href=\"https://affinity.serif.com/en-us/photo\">7</a>):</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-b.png\">Neat-o</a></p>\n<h2>Touch ID</h2>\n<p>Like with the iPhone, you have to input your password when cold\nbooting (01.png \"UGH\") but in-between cold boots, it's wonderful to use a\nsingle finger press to unlock my computer.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-c.png\">Mmm, dat sweet Touch ID</a></p>\n<p>How much time do we spend typing passwords? Who knows, but <em>my</em> time doing so\nhas decreased dramatically in part to Touch ID. The other reason for my\n(almost) no password typing life? 1Password.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-d.png\">1Password is life</a></p>\n<p>You'd need to type in your Master Password to unlock it but now you don't!\nIt's <em>even less</em> of a hassle to use an already hassle-free product for\npersonal security. I don't know 90% of my passwords.</p>\n<h2>The keyboard</h2>\n<p>I thought I would <em>hate</em> the keyboard due to the short travel. This was\nbased upon my previous experience of typing on the MacBook\nOne<a href=\"http://www.apple.com/macbook\">8</a> (that's not the real name, but it's the MacBook with only one port) in\nan Apple Store once. Might as well be typing on a screen! I believe I was\nlistening to ATP when I heard Marco Arment talk about the keyboard travel on\nthe MacBook Pro I typed this post on, and he spoke highly of it. That made me\nfeel better about purchasing this and in everyday use, I enjoy it. Typing\ndoesn't sound particularly loud to me (this is another complaint I've heard).\nMaybe this is because I own a Das Keyboard? 🤔</p>\n<p>The <em>only</em> gripe I have is with the new arrow keys. WTF<a href=\"https://www.instagram.com/p/BOV3YBjBJdV\">9</a>. Someone coming\nto MacBooks without prior usage would acclimate faster, I think.</p>\n<h2>The trackpad</h2>\n<p>Dayum.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-e.jpg\">Shot of the massive trackpad</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-f.jpg\"><em>DJ Khaled voice</em> Another one</a></p>\n<p>The trackpad is nearly as big as my Magic Trackpad. As a former external\nmouse<a href=\"http://www.microsoft.com/accessories/en-us/products/mice/arc-touch-mouse/rvf-00052\">10</a>-only guy, I can say that 1) having a big surface for multi-gesture\ncontrols is awesome and 2) it's even better when it's on a laptop. Even with\nthe dbrand skin<a href=\"https://dbrand.com/shop/apple-macbook-pro-15-skins-2016-touch-bar\">11</a> I have on it, the trackpad is super responsive. My palms\naren't typically on the trackpad when I'm typing but when they are, the palm\nrejection is great.</p>\n<h2>USB-C</h2>\n<p>I saved the best for last.</p>\n<p>Let me tell you about the <em>glory</em> that is USB-C.</p>\n<p>You know when you're outside on a <em>sweltering</em> hot day, and your sweat betrays\nyou and only makes you warmer? Okay, picture that. Now, picture that you've\njust been given one of those red, white, and blue popsicle rockets. You bite\noff a bit and your body thanks you by cooling you down and you feel that\nelation of peace and tranquility and your mood improves by 10 notches.</p>\n<p>That's how I felt when I needed to charge my computer and I realized that I\ncould do so FROM ANY PORT FROM EITHER SIDE OF THE COMPUTER. <em>MAN</em>. I'm\nmobile with my laptop of course, and I like taking it to the living room while\nthe family is watching TV or hanging out, &amp;c. Typically, I was forced to sit\nin certain spots if my computer needed charging. Now, the <em>world</em> is my\noyster. It doesn't seem like a big deal but trust me, it <em>is</em>.</p>\n<h2>FIN</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/macbook-pro-review-g.jpg\">Shot of the outside of my MacBook Pro</a></p>\n<p>In conclusion, I will say that this computer was a fantastic upgrade for me.\nIt even survives water getting splashed on it! Not saying I've ever done that\nrecently, it's just something I've heard about… 👀 Of course, I'm going to\nfeel some type of way i̶f̶ when Apple refreshes this laptop later this year\nbut it's okay. I like getting glimpses of the future when I can. This computer\nis 0.5 pounds lighter than the previous generation and I can definitely tell.\nI'm a happy customer.</p>\n<p>All that's left for Apple to do now is make everything super energy\nefficient, crazily so. Oh, and fix software bugs. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"4022a0bde56a1a19cae7a95f9a47fe4694e49b661e5d52a894e057d4357a3b8f","category":"Sites"}