{"title":"\"Pokémon with guns\" and AI art hysteria","link":"https://www.garbageday.email/p/pokmon-guns-ai-art-hysteria","date":1705948887000,"content":"<div><div><h2><i>Palworld</i> Conquers Steam, Incites Mass Panic Over AI Art</h2><p>Last Friday, Japanese game studio Pocket Pair launched early access for their mega-hyped new game <i>Palworld</i>, which most folks have been calling “<i>Pokémon</i> with guns” ever since its first ridiculous trailer went viral back in 2021.</p><p><i>Palworld</i> over the weekend broke massive records for downloads and streams and is now one of the <a href=\"https://www.ign.com/articles/palworld-has-huge-weekend-sells-5-million-and-overtakes-cyberpunk-2077-in-steams-most-played-games-list?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">most popular games ever</a> on Steam. Its servers are crashing and the team behind the game is reportedly in emergency mode to handle all the attention. </p><p>I first became aware of Pocket Pair last year after I fell down a rabbit hole looking for RPGs for my Steam Deck. I wanted a very specific kind of vibe and all the subreddits and YouTubers I stumbled across recommended Pocket Pair’s previous release, <i>Craftopia</i>. I didn’t end up playing it because it looked like shit, but I did learn in the process that Pocket Pair’s whole strategy is taking a bunch of game mechanics, usually from Nintendo, slapping them together with some basic Unreal Engine assets, and selling them for cheap on Steam. And this Shein strategy is exactly what they’ve now done again with <i>Palworld</i>. Except <i>Palworld</i> is a big hit.</p><p>Before we get into the AI hysteria, I think it’s important to clearly talk about what the game actually is. I put about 10 hours into <i>Palworld</i> over the weekend because, unfortunately for my brain chemistry, it combines all of the video game cognitohazards that I get super addicted to. And while the game has been compared to <i>Pokémon</i>, and does feature absolutely shameless rip-offs of specific Pokémon, it doesn’t really play like it. </p><p>You wake up on a map that is pretty much identical to <i>The Legend of Zelda: Breath of the Wild </i>or a cartoony <i>Elden Ring</i>, and you capture not-Pokémon called Pals with a not-pokéball called a pal sphere. Once you have some Pals, you can choose to have them fight in real-time battles alongside you or, more commonly, you can put them to work building your base. You can also kill and eat Pals or stick them in a sweat shop to make weapons for you. At the opening of the game, I had to beat an adorable chicken Pal to death with my bare hands and actually felt sort of ill.</p><p>The panic that <i>Palworld</i> was using AI art began over the weekend after several users on X discovered that Pocket Pair <a href=\"https://twitter.com/imZaytri/status/1748215825851629751?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">released</a> a game back in 2022 called <i>AI: Art Impostor</i>, which uses generative-AI to power a party game. There are also <a href=\"https://twitter.com/imZaytri/status/1748432267792547987?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">screenshots</a> going around of tweets from 2022 from Pocket Pair’s CEO Takuro Mizobe talking about how convincing AI-generated <i>Pokémon</i> look. These two facts became extremely <a href=\"https://twitter.com/blessingjr/status/1748770846431207752?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">twisted</a> <a href=\"https://twitter.com/invert_x/status/1748495038898942380?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">together</a> over the weekend and resulted in thousands of users accusing Pocket Pair of using AI to generate character designs in <i>Palworld</i>. </p><p>I’m going to put this as clearly as I can: It would honestly take more effort to use generative AI to make 3D video game character designs than to just pay someone to make bad ones (trust me, I’ve actually tried). And if you look at something like <i>Palworld</i> and think an AI can do that, you are actually a massive sucker and are being duped by AI companies. AI panic is just as helpful for companies like Open AI as AI evangelism is. When you assume generative-AI tools are better than they are, you’re making it much easier for AI companies to spook lawmakers and give themselves more resources to argue they need “govern themselves” to protect us from the robot uprising. </p><p>Also, every CEO loves AI. Even the CEOs that say they don’t love AI are just waiting for the kind of AI they like to be invented. That’s because when you become a CEO, they insert a little parasitic worm into your brain that makes you innately drawn to things like AI, achieving immortality, and creating your own sovereign city-state on an abandoned oil tanker.</p><p>Also, the real story behind <i>Palworld</i>’s designs is even funnier. According to a <a href=\"https://note.com/pocketpair/n/n54f674cccc40?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria#33883a37-8fdb-4f0d-ab06-853c8aa8be4a\" target=\"_blank\">Japanese-language blog post </a>Pocket Pair released last week, the team <a href=\"https://twitter.com/Repiteo/status/1749081646685364625?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">had no idea</a> what they were doing and this was the first time the company had ever even tried to make their own character models rather than just buying stock ones off the Unreal marketplace. Also, Mizobe has been <a href=\"https://twitter.com/urokuta_ja/status/1749058399969665195?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">posting</a> on X all weekend trying to convey exactly how unprepared they were for any of this. For instance, they only have one infrastructure engineer. Also, there were legal reviews <a href=\"https://www.gamesradar.com/palworld-lead-shoots-down-legal-concerns-following-pokemon-comparisons-we-have-absolutely-no-intention-of-infringing-upon-the-intellectual-property-of-other-companies/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">conducted</a> before the game was released and there was no infringement found. </p><blockquote><p></p><p>Palworld already has a Pokemon mod</p><p></p><a href=\"https://twitter.com/dexerto/status/1749405397046231109?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\"><p> — Dexerto (@Dexerto) <br /> Jan 22, 2024 </p></a></blockquote><p><i>The Washington Post</i>’s games reporter, Gene Park, has thankfully been trying to knockdown the AI accusations, while also taking <i>Palworld</i> seriously enough to really weigh in on what it still lacks compared to the games it’s, uh, inspired by.</p><p>“The magic of <i>Pokémon</i> isn’t just the gameplay or the monsters or the catching. It’s the biggest IP in the world because people enjoy living in what began already as an established culture and world,” Park <a href=\"https://twitter.com/GenePark/status/1749145011428467190?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">wrote</a>. “One thing about <i>Palworld</i> is that it’s missing a sense of place and lore so far.”</p><p>And my favorite take overall was from one X user <a href=\"https://twitter.com/KrisWolfheart/status/1749250966329671800?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">who wrote</a>, “<i>Palworld</i> is successful because they cut trailers where you sell Pikachu into slavery to an arms dealer and priced their game at $26, I think trying to assign too much meaning beyond that is silly.”</p><p>Do I think <i>Palworld</i> could the next big video game franchise of the future? Without some massive work from Pocket Pair, absolutely not. But who knows, there are lots of examples of knock-offs beating the original, just ask Oreos or Lego or literally every comic book publisher. But if that happens, it won’t be because of AI. </p><p>Though, hopefully, for creature-collecting addicts like me, this finally gives Game Freak, the studio behind <i>Pokémon</i>, a seriously-needed wakeup call about how bad the quality in <i>Pokémon</i> games has dipped over the last decade. </p><hr /><h2>It’s Moving Day</h2><p>Today’s the first day I’m sending this out on Beehiiv, Garbage Day’s new home. For most of you, it should be totally seamless. But there does seem to have been an issue with foreign currencies and double-charging. Refunds should be rolling out to correct the issue, but if there are any problems, reply to this email and I can get you sorted out.</p><p>Also, I know that change is scary, especially when it involves your bank account. So to coax some of you to upgrade, I’m running a coupon on annual subscriptions for the next 24 hours. Hit the button below to sign up!</p><div><div><a href=\"https://www.garbageday.email/upgrade?offer_id=fc722f7b-86c4-4eef-b37b-a117800535db&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\"><div><p> Happy Moving Day Discount! </p><p> Join Garbage Day's premium community and get lots of extra fun stuff. Just 10% off for the next 24 hours. </p></div></a></div></div><p>Garbage Intelligence subscribers, you still exist lol, but Beehiiv doesn’t have the functionality for a third price tier yet. Don’t panic. I’ve got you. Hang tight for more updates.</p><hr /><div><h2><span>Let’s Debunk The Toaster Guy, Shall We?</span></h2><p><span><i>—by Adam Bumas</i></span></p><blockquote><p></p><p>i actually thought using 2 toasters would cancel each other out, no?</p><p></p><a href=\"https://twitter.com/imboggles/status/1748711247401415017?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\"><p> — Boggles (@imboggles) <br /> Jan 20, 2024 </p></a></blockquote><p><span>This was shared in the Garbage Day Discord by user lesspopmorefizz. Just so we’re on the same page, the streamer (who’s based in Australia and goes by Boggles) didn’t actually do this, any of the three times he’s claimed to over the past few days. Though, it is a bad idea to stick a fork in a toaster. But not because it’ll create a cartoon explosion. </span></p><div><img src=\"https://lh7-us.googleusercontent.com/WIKe1MnuPm7XJPq7SAnXUfIBl6Zo64qOnL5h8UHopahnuvNlmbjgXPcX2Muf6jGwDHiFQZX6OK7LMtQALFuzxi2yuDH--EQnQcQBpEQoTzxmYitraXOPV3iUG0iajLUqonVXis8snHb-ipLpcf4nKqo\" /><div><span><p><span>(YouTube/Boggles)</span></p></span></div></div><p><span>Speaking of bad ideas, part of what sells it as supposedly real is that Boggles has a history of doing really dumb things. Last May, he reportedly got a </span><span><a href=\"https://www.thegamer.com/youtuber-sprays-gamers-with-deodorant/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">lifetime ban</a></span><span> from the DreamHack game convention for spraying deodorant at people and </span><span><a href=\"https://www.youtube.com/watch?v=pml30XADBLI&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">a video</a></span><span> from last January shows him try to sneak into the Australian Open by asking nicely.</span></p><p><span>Obviously, being a stupid troublemaker for fun and attention is nothing new. What is new is X’s video-first algorithm. It’s taken the already popular format of context-free rage bait videos that people take at face value, and made it pretty much the only thing it shows to people. Seriously, we’ve had to talk about these at least once a week since November.</span></p><p><span>And that’s kind of a shame because once you can see the video in its context, the technical execution actually deserves some respect. Faking it required more effort from Boggles than most of his other stunts. The effects (such as they are) look pretty authentic, and the timing and editing of everything is really well done. </span></p><p><span>But, no, he did not electrocute himself so hard he pooped his pants on stream.</span></p></div><hr /><h2>MrBeast’s Undisclosed Ad Isn’t Technically An Undisclosed Ad</h2><blockquote><p></p><p>$1 Car vs $100,000,000 Car!!!</p><p>I’m curious how much ad revenue a video on X would make so I’m reuploading this to test it. Will share ad rev next week ❤️</p><p></p><a href=\"https://twitter.com/MrBeast/status/1747044525116108854?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\"><p> — MrBeast (@MrBeast) <br /> Jan 15, 2024 </p></a></blockquote><p>Last week, MrBeast uploaded a months-old video called “$1 vs $100,000,000 Car,” to X as a test of Elon Musk’s new nonsense claim that X, the everything app, was also now a video-first app.</p><p>After the video went live, I started getting messages from readers that they were seeing it all over X, even if they don’t follow MrBeast or Musk. And other users <a href=\"https://twitter.com/SHL0MS/status/1748336871568994403?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">quickly realized</a> that if you clicked on the drop down menu next to the video, you would see that it was, in fact, getting paid promotion on the site as an ad, even though there was no label or disclosure. Which is illegal in most countries, including the US.</p><p>Well, right before Friday’s issue went out last week, I was contacted by an X employee who explained how this works.</p><p>There is a pre-roll ad <span><a href=\"https://substack.com/redirect/acbff8bf-e72d-4656-80d1-5d5427883645?j=eyJ1IjoiMWRobXcifQ.YnI3khPYsJABG8mVIwXCfSh3UbEsRm2pEKFdr_PUCrs&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">from Shopify</a></span> in front of MrBeast’s video. X’s pre-roll feature is called <span><a href=\"https://substack.com/redirect/d114e23b-7d30-4977-9f7c-f41734908afa?j=eyJ1IjoiMWRobXcifQ.YnI3khPYsJABG8mVIwXCfSh3UbEsRm2pEKFdr_PUCrs&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">Amplify</a></span>, and when a post contains a video that has an Amplify ad in it, the post is boosted like an ad, but without the label. Because technically, MrBeast’s post is not the ad and thus doesn’t require one. The ad is the Shopify pre-roll, which is correctly labeled as an ad for users who press play. This would also explain all the other not-an-ad boosted posts you’re seeing. The ad is loaded in front of the video inside of the post. </p><p>Get it? Well, I hope the FTC does. </p><p>Though, apparently, Musk doesn’t because <a href=\"https://twitter.com/mattbinder/status/1748829313603158177?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">he’s posted</a> that there is no amplification happening to the video, when there absolutely is. </p><hr /><h2>Meatball Ron Calls It Quits</h2><p>Ron DeSantis has dropped out of the Republican primary. Very sad. Hate to see it. NBC News has a great piece on the campaign drama leading up to the announcement this week. Please <a href=\"https://www.nbcnews.com/politics/2024-election/ron-desantis-campaign-doomed-puzzle-rcna132688?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">click here</a> and type “ctrl+F” and then type, “Scott Wagner does a puzzle”.</p><p>Let us never forget the important things about the DeSantis campaign, like the fact that he eats pudding <a href=\"https://www.vanityfair.com/news/2023/03/ron-desantis-chocolate-pudding-denial?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">with his hands</a> and <a href=\"https://defector.com/is-ron-desantis-wearing-hidden-platform-heels-inside-his-stupid-ugly-boots-an-investigation?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">the bizarre contraption</a> that may have been inside of his boots to make himself look slightly taller. He never had a chance at beating Trump and that’s a good thing because he probably would have been a much more efficient authoritarian than Trump (maybe).</p><p>But, most importantly, as writer John Paul Brammer <a href=\"https://twitter.com/jpbrammer/status/1749251734986186992?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">put it</a>, “It's not just that DeSantis was easy to bully, but also that he was fun to bully. You really got the sense that he went home and wept every night.”</p><hr /><h2>Why Does Gen Z Look Old?</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@taylordonoghuee?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\"> @taylordonoghuee </a><p>Bye digging my own grave never ask social media ur age lol</p></section></blockquote><p>I was not aware of this discourse until it went <a href=\"https://twitter.com/jilleeann_/status/1748339479432114201?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">viral again</a> on X over the weekend. But it is something I have noticed without really understanding that I was noticing it.</p><p>I’ve seen a bunch of different theories as to why Gen Z “looks old,” including a lot of people saying it’s stress (lol ok) or nicotine addictions (possible), but I think the answer is actually much simpler. Millennials dress young and Gen Z dress old. And I don’t even mean Gen Z like retro fashions, I mean they gravitate towards styles that are both comfortable — they are the Zoom school generation — and also flashy. They either didn’t live through or don’t remember the recession, so they don’t have the same hangups millennials do about showing off wealth. Especially online. I also think the Gen Z predilection for filming up-close videos means they wear a lot more makeup.</p><p>All of this creates an overall aesthetic for Gen Z that I would call Boca Raton-core. They kind of look like young people cosplaying as old retirees. Of course, I assume they all look at millennials and think we look like frumpy adult babies.</p><hr /><h2>PSP GPS</h2><blockquote><p></p><p>PSPナビまだまだ使える</p><p></p><a href=\"https://twitter.com/P1RACING__/status/1748608806614126603?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\"><p> — 逆ばにー(18) (@P1RACING__) <br /> Jan 20, 2024 </p></a></blockquote><p>Guys, it’s so nice to have embeds again. I really missed embeds.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://slate.com/business/2024/01/pitchfork-gq-music-reviews-layoffs.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">“Did Condé Nast Even Read </a><i><a href=\"https://slate.com/business/2024/01/pitchfork-gq-music-reviews-layoffs.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">Pitchfork</a></i><a href=\"https://slate.com/business/2024/01/pitchfork-gq-music-reviews-layoffs.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">?”</a></p></li><li><p><a href=\"https://www.discourseblog.com/p/soon-will-come-a-day-that-none-of?utm_source=pocket_reader\" target=\"_blank\">“Soon Will Come a Day That None of This Exists”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://twitter.com/Random_Factor/status/1748756394302476410?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=pokemon-with-guns-and-ai-art-hysteria\" target=\"_blank\">the mocking emu</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=275b5287-1fde-4b98-8ccd-4d9349fab54f&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"402bebf4066b545e2aa9c1cfa11df2966a2e9be5d3b4bbf7a53c5562d944bc60","category":"default"}