{"title":"Now is the time of sea shanties","link":"https://www.garbageday.email/p/now-time-sea-shanties","date":1715626835000,"content":"<div><div><div><div><span></span></div></div><p><i>You can find audio versions of Garbage Day on every major podcasting app. If it’s not there, </i><i><a href=\"https://anchor.fm/s/f499c1b4/podcast/rss?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">here’s an RSS feed</a></i><i>.</i></p><hr /><h2>Notes On A Scene (Or Lack Thereof)</h2><p>A few weeks ago, a friend of mine told me that he had ended up at a sea shanty concert in Brighton, UK, and was shocked to discover it was full of Gen Z kids (and younger) all going nuts for 19th-century folk music. He asked me if I knew what the deal was and I told him I suspected it had something to do with TikTok. </p><p>Back in 2020, a <a href=\"https://www.tiktok.com/@nathanevanss/video/6910995345421962498?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">TikTok video</a> of Scottish musician Nathan Evans singing a New Zealand whaling song called \"The Wellerman” went incredibly viral. Evans’ video <a href=\"https://www.tiktok.com/@jonnystewartbass/video/6913909783548431618?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">was dueted</a> by musicians all over the app and also made previous recordings of the song go viral, as well. One of these recordings was <a href=\"https://www.youtube.com/watch?v=UNVFEt5vkWc&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">uploaded to YouTube</a> by a band called The Longest Johns, which was the band my friend was seeing in Brighton. An interesting side note here, it seems like many of these covers went viral enough to attract the attention of Universal Music Group, which means Evans’ original video is still muted on TikTok.</p><p>I was dying to see what one of these concerts was like and ended up going to check out The Longest Johns at their sold out show in New York last week. And it was a fascinating look at how TikTok is changing how fame works. </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/42dcf206-9e75-43fc-b91f-df371e514151/Screenshot_2024-05-13_at_10.21.31_AM.png?t=1715610103\" /><div><span><p>(Credit: My phone after approximately 2.5 beers.)</p></span></div></div><p>I was teenager at a moment when the internet was just beginning to rewrite how music “scenes” worked. They were still regional — the Gainesville pop punk scene, the midwest Christian metalcore scene, the Boston hardcore scene, the Long Island emo scene, etc. — but those bands and their fans were sharing that music on early social platforms like Myspace and MP3 blogs, which allowed those bands to build bigger fandoms around the country than they ever could have previously. But it wasn’t just music that was “going viral,” to use the terminology we now have for what was happening. The fashion and attitudes that were popular in those geographic areas would blow up alongside these music sub-genres. And this was happening with other genres besides rock music, as well. </p><p>There was a moment in the late 2000s when Atlanta Crunk, Oakland Hyphy, and Chicago conscious rap were all competing for radio time as artists in each scene figured out how to break through. Which is how I ended up “ghostriding the whip” around a 7-Eleven parking lot one night in high school. I drove a 1986 Nissan pickup truck and it had a manual transmission, so it was actually pretty easy to throw it into neutral and blast E-40. ANYWAYS…</p><p>Thanks to TikTok, it doesn’t actually matter where a musician is from anymore. And I don’t think this is a bad thing. In fact, it might even be a net positive for music. There’s now an entire generation of kids who have never had to justify their various hyperfixations to the weird older guys in their town that go to all-ages shows to hit — or hit on — the young audiences that show up. Massachusetts Warped Tour dates weren’t so much concerts as they were just a staging ground for brawls between the state’s various warring regional factions. Which I don’t think is happening anymore, but there are new problems caused by audiences brought together solely via what they’ve seen on their screens.</p><p>The consensus is that Gen Z crowds are deeply <a href=\"https://www.reddit.com/r/deathgrips/comments/15iixbo/seen_at_the_show_in_sayreville_nj/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">annoying</a>, trampling each other, filming shows with a Nintendo DS, shouting “mommy” at the stage, and throwing things at performers. A 2022 <i>Paste Magazine</i> piece, largely about how awful the crowds are at Mitski shows now, <a href=\"https://www.pastemagazine.com/music/live-music/gen-z-concert-safety?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">described the issue</a> as “a clash between these people’s concepts of Mitski as an online character and as a real human person who is performing her art for an audience.”</p><p>I should say, the sea shanty kids were a very polite and enthusiastic audience. Though, at one point a bunch of them got on the floor and pretended to row a boat which was, honestly, appropriate, all things considered. </p><p>But watching a crowd of teenagers, 20-somethings, and bewildered boomer folk aficionados, singing whaling songs in a sold out New York venue made it very clear how thoroughly TikTok has broken the continuity of how things used to work. This is what politicians are really saying when they talk about TikTok radicalization. And this is why every week there’s <a href=\"https://twitter.com/Sharon_Kuruvila/status/1789753864050139246?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">some panic</a> on boomer apps like X or Threads or LinkedIn or whatever about how Gen Z women use internet slang. The world, it turns out, operates very differently when young people don’t have to rationalize what they like, how they dress, or how they act to the people that happen to live around them. And I don’t think suddenly removing TikTok from the US market will put the genie back in the bottle here. </p><p>In fact, at the Longest Johns concert in New York, one of the openers was a singer named Seán Dagher from Montreal. The very young crowd knew all the words to the very old songs he was singing, but I didn’t recognize him from TikTok. Well, it turns out he <a href=\"https://assassinscreed.fandom.com/wiki/Se%C3%A1n_Dagher?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">performed</a> many of the sea shanties featured in <i>Assassin's Creed IV: Black Flag</i>. The clock isn’t getting turned back. If you think TikTok fame is confusing, try following what’s happening in video games.</p><p>The old world is dying. The new world struggles to be born. Now is the time of sea shanties.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2>A Good Tweet</h2><blockquote><p></p><p>you can just say things, it doesn't even need to make sense. my barista told me she's upping her sertraline dose and I said \"that's so art deco\" and she agreed.</p><p></p><a href=\"https://twitter.com/AudreyPorne/status/1789868406855909664?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"><p> — Audrey Porne (@AudreyPorne) <br /> May 13, 2024 </p></a></blockquote><hr /><h2>Did Someone Actually Make An AI-Generated Feature Film?</h2><p>Last week, Filmmaker Joe Russo, a guy who is not a Marvel director, but, I think, many people think is one of the Marvel Russo’s, <a href=\"https://twitter.com/joerussotweets/status/1788260699015455091?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">shared a clip</a> from what he called “an AI movie”. Russo warned it was “coming this summer” and his post went very viral. It got lots of replies from folks who are extremely worried that this is a real movie that is coming to a movie theater soon. But no one was sharing any info about what this thing actually is.</p><p>Well, I found the trailer and Russo is overstating things a bit. It was created by TCLtv+, which is a streaming service that lives inside of TCL-made smart TVs. It’s called <i>Next Stop Paris </i>and it was “developed” by TCLtv+’s chief content officers using a custom Stable Diffusion model. I actually think the use of AI here is the least bleak thing about this whole thing. </p><p>As for where you can actually watch this, which, to be clear, sucks ass and is, probably, an affront to God and, definitely, an affront to the human soul, it will be available inside of the TCLtv+ streaming app. Also, the team behind it <a href=\"https://technology.inquirer.net/134329/first-ever-ai-movie?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">is already saying</a> it’s not going to actually look like this if and when it goes live.</p><p>It’s also not the first feature-length AI-generated movie. A team of filmmakers made a horror movie last year called <a href=\"https://www.youtube.com/watch?v=WjMbUbMOsSE&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\"><i>THTHNG: Desolation Unknown</i></a>, which also looks bad.</p><hr /><h2>ChatGPT Can Laugh And Giggle Now, Apparently</h2><p>Today OpenAI announced GPT-4o, which is a new model that seems designed to kill a wave of AI hardware startups. The “o” stands for “omni,” and its big upgrade is that it can work across text, audio, and vision all at the same time. It can sing and, unnerving, now, it can laugh. It’s also free. </p><p>You can read OpenAI CEO Sam Altman’s post about the new product <a href=\"https://blog.samaltman.com/gpt-4o?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">here</a> and you can listen to its horrific new laugh around the one-minute mark down below.</p><blockquote><p></p><p>Say hello to GPT-4o, our new flagship model which can reason across audio, vision, and text in real time: </p><p>Text and image input rolling out today in API and ChatGPT with voice and video in the coming weeks.</p><p></p><a href=\"https://twitter.com/OpenAI/status/1790072174117613963?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"><p> — OpenAI (@OpenAI) <br /> May 13, 2024 </p></a></blockquote><hr /><h2>The Dublin/New York Portal Has Already Spun Out Of Control</h2><p>A Lithuanian artist named Benediktas Gylys <a href=\"https://www.theguardian.com/world/article/2024/may/13/smiles-waves-flashed-body-parts-video-portal-links-dublin-new-york?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">erected</a> a “portal” connecting New York City and Dublin via a 24/7 livestream. And it has gone exactly how you might imagine it would. People are mooning it, flipping each other off, having sex in front of it, and I’ve seen more than few clips of Dubliners holding up their phones to the camera and<a href=\"https://twitter.com/realonx1/status/1789396386061898239?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\"> playing footage of 9/11</a>.</p><p>The portal, <a href=\"https://www.bbc.com/news/articles/c03d56pepx5o?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">per the BBC</a>, will be connecting to more countries soon, including Poland, Lithuania, and Brazil. Excited to see how folks in those cities haze New Yorkers next. </p><hr /><h2>Everything Is E-Commerce</h2><p>Last week, Gilad Erdan, Israel’s ambassador to the United Nations, shredded the UN charter during a general assembly. “You are shredding the UN Charter with your own hands,” he said.</p><p>The stunt <a href=\"https://www.yahoo.com/news/israeli-envoy-paper-shredder-stunt-224529512.html?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cuZ29vZ2xlLmNvbS8&amp;guce_referrer_sig=AQAAAIg93wpENtvlcZ6_e-yEukmB2AG-LAj6TofxICUgcqhyrUTgTliYFHurmSdI2_DQjGRODGpfNqd9PraIpzil6dY4Jk-OgKF5-Y4879do4RZpXsDWHTUH_5BLcrbFn_myL-lU3aojelgtRJoMQ_U2xy-yrAZGZCgjyqFIxoKIkom5&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">was not well-received</a> and the UN <a href=\"https://www.cnn.com/videos/world/2024/05/10/unga-palestinian-membership-israel-ambassador-shredder-sot-digvid.cnn?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">still passed</a> a resolution to look into UN membership for Palestine. But you know who is pretty excited about this whole thing? The Chinese manufacturer that sold the little printer that Erdan used to shred the charter.</p><blockquote><p></p><p>IM C R Y I N G THE CHINESE STORE THAT SELLS THE MINI SHREDDER IS NOW ADVERTISING IT AS \"Isr@3li Ambassador United Nations Charter Same Model USB Shredder\"</p><p>\"The same model of shredder, you deserve to own it!\"</p><p></p><a href=\"https://twitter.com/xiranjayzhao/status/1789563706554155482?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"><p> — 𝕏iran Jay Zhao 🍉 (@XiranJayZhao) <br /> May 12, 2024 </p></a></blockquote><p>I mean, look, political theater aside, the shredder did a great job and, according to a listing for it shared by author Xiran Jay Zhao, it only costs $7. What a bargain!</p><hr /><h2>This Mountain Lion Is A New Fashion Icon</h2><blockquote><p></p><p>her as a guest judge on drag race when?????</p><p></p><a href=\"https://twitter.com/hugeasmammoth_/status/1789223227237228742?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"><p> — hugeasmammoth.films (@hugeasmammoth_) <br /> May 11, 2024 </p></a></blockquote><p>I’m not going to embed the original mountain lion picture here because it’s, uh, a picture of the lioness eating, but if you want to see it (carcass warning) you can <a href=\"https://www.instagram.com/p/CnwqEQ8vt1b/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">click here</a>. The photo was taken by photographer Jeff Wirth and he’s very happy about how viral the lioness is right now.</p><p>One fandom that as really latched on to the mountain lion <a href=\"https://twitter.com/seasonmaraj/status/1789751792055566595?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">are the Barbz</a>, or fans of Nicki Minaj. And Wirth made a print of Minaj next to the lion and he’s <a href=\"https://staywildmedia.com/shop/charity-barb?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">now selling</a> that on his website. All the proceeds are going to a mountain lion charity.</p><hr /><h2>Floppy Disk Boombox</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@luke.the.maker?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\"> @luke.the.maker </a><p>When I heard about this thing I knew I had to have one. I designed the labels and the cases. I found the midi files in a giant archive of ... See more</p></section></blockquote><p>This was dropped in the Garbage Day Discord by Zach and it rules.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.theverge.com/24107998/threads-fediverse-mastodon-how-to?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">“How to cross-post your Threads posts to the fediverse”</a></p></li><li><p><a href=\"https://slate.com/culture/2024/05/creed-2024-concert-tour-cruise-summer-99-scott-stapp.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">“With Arms Wide Open”</a></p></li><li><p><a href=\"https://www.newyorker.com/magazine/2024/05/20/lucy-letby-was-found-guilty-of-killing-seven-babies-did-she-do-it?utm_source=pocket_saves\" target=\"_blank\">The </a><i><a href=\"https://www.newyorker.com/magazine/2024/05/20/lucy-letby-was-found-guilty-of-killing-seven-babies-did-she-do-it?utm_source=pocket_saves\" target=\"_blank\">New Yorker</a></i><a href=\"https://www.newyorker.com/magazine/2024/05/20/lucy-letby-was-found-guilty-of-killing-seven-babies-did-she-do-it?utm_source=pocket_saves\" target=\"_blank\"> went long on the Lucy Letby case. This link is blocked in the UK due to legal reasons.</a></p></li></ul><hr /><p><span>P.S. here’s </span><span><a href=\"https://www.tiktok.com/@yassinandseanterrio/video/7367352806543478021?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=now-is-the-time-of-sea-shanties\" target=\"_blank\">Trump singing My Chemical Romance</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=568fe058-08e6-4d8b-aa43-0cae61c27231&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"4091464842013395e597fed22c7343e2a9cca18360e759d5ccc31c71714145a8","category":"default"}