{"title":"The Fallacy of Imposter Syndrome","link":"https://blog.webb.page/2018-08-22-the-fallacy-of-imposter-syndrome.txt","date":1534896000000,"content":"<p>You (or, someone you know) has claimed to suffer from imposter syndrome at some\npoint in time. But what IS it, really?</p>\n<blockquote>\n<p>\"Impostor syndrome\" is a psychological pattern in which an individual doubts\ntheir accomplishments and has a persistent internalized fear of being exposed\nas a \"fraud\", despite external evidence of their competence.</p>\n</blockquote>\n<p>I'm speaking from the lens of someone firmly entrenched in the web industry,\nbut what I'm about to say applies anywhere. Imposter syndrome appears to be a\nvery real threat to the psyche. It has occurred to me that maybe…it's NOT.</p>\n<p>Y'see, when people reach the next plateau of their career they begin to compare\nthemselves against impossible odds. They look at the \"superstar\" members of\ntheir industry, they look at their peers of similar standing, <em>they look at\neverything around and beyond them</em>. I mean, just check out that VIEW! What\nhappens next w̶i̶l̶l̶ won't shock you.</p>\n<blockquote>\n<p>How did I get here? I don't <em>belong</em> here! What if they kNoW?!</p>\n</blockquote>\n<p>These are questions people ask themselves instead of the one that <em>matters</em> as\nthey turn around:</p>\n<blockquote>\n<p><em>Wow</em>, I really came THIS far? 🤩</p>\n</blockquote>\n<p>Our fast-paced society and the scripted nature of social media where we only\ndisplay accomplishments and accolades encourages us to keep our figurative\nnecks on a swivel. <em>Mentally, we ALL have full range of motion.</em> Not just\nlaterally and up, but backwards too! It's important to acknowledge your\naccomplishments to yourself. Internalize it. Believe it!</p>\n<p>Let's think about this another way.</p>\n<p>Imagine someone riding a horse with a long stick in hand. On that stick is an\nequally long string with a carrot tied to the end. The horse sees the carrot\nand starts to trot towards it. The horse jockey moves the carrot when they want\nthe horse to change direction. Now, replace the carrot with everything you saw\non that plateau and the horse with yourself. PLOT TWIST, you are ALSO the\nhorse jockey.</p>\n<p>WHUUUUUH?!</p>\n<p>Get off the horse and give them a salt lick for doing a g̶o̶o̶d̶ g̶r̶e̶a̶t̶ <em>fantastic</em>\njob. Huh, interesting…that salt lick is suspiciously similar to your personal\naccomplishments.</p>\n<h2>TL;DR</h2>\n<p>You're awesome. Stop beating yourself up. Stop and smell the roses of your\naccomplishments thus far. Know when to use blinders. 🕸</p>\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"409ca1b86b287102a8448233a9acce4357726aa9db1042ba6e35b90cc4df145d","category":"Sites"}