{"title":"The Last Great Movie Star","link":"https://www.usv.com/writing/2024/06/the-last-great-movie-star/","date":1718364390000,"content":"<p>This will be the last generation of global movie superstars.</p>\n<p>In the not-too-distant future, everyone will have the tools they need to create a completely AI-generated film that is indistinguishable in quality from a traditional Hollywood movie. This includes the whole shebang: from the main characters and actors to costume and set design. Our only limitations will be the constraints of our imagination. But even that will be augmented with technology. It is easy to draw a line between where we are today with the capabilities of AI tools to where we will be by the end of the decade. And while these statements may seem hyperbolic, the rate of progress across generative AI is accelerating. Things happen gradually, then suddenly . We are approaching the inflection point.</p>\n<p>This type of sea change, while unsettling for those who have mastered the status quo, holds immense potential for the broader population. The proliferation of new technologies and tools not only empowers a class of emergent creators but also lowers the barrier to participation and expands the market for industries. This is a positive shift – broadening access to the arts, expression, and creativity to everyone across the globe with a computer and an internet connection – but it disrupts the current norms.</p>\n<p>Why would a movie studio build a franchise around a human actor when it can use an AI-generated actor it has created and owns as IP and can uniquely customize across geographies and demographics? Is that dystopian and inhumane, or is it the obvious future? Denis Villeneuve’s recent Dune series is a masterpiece, but the second installment cost $190m to produce. How many orders of magnitude will that production cost come down as people in remote corners of Earth will have access to tools that enable them to create something of equal quality on their phones? Is that an absurd question, an implausible reality, or an inevitable one?</p>\n<p>This premise doesn’t just extend to film – it applies to all media. We are already seeing it happen with art, images, text, and music. Video is just an extension of these, and new formats that didn’t exist before will follow. The implications are hard to fathom, but here is a spectrum of scenarios for the future of media and entertainment, all of which will coexist:</p>\n<p>We are moving towards a world where content is auto-generated specifically for the sole purpose of entertaining individuals. It will be uniquely customized to suit their needs, tastes, and preferences without the need for explicit definition. Today, companies like TikTok use other people’s content to entertain a mass audience. They, like other scaled (sometimes social) media platforms, understand what we want to watch more than we know what we want to watch, and they capture our attention by surfacing addictive content. In this future, why would a media platform want to be dependent on a group of human creators when it can auto-generate all media itself with AI? We are rapidly approaching this world. Content – from music to video to memes and beyond – can be spun up instantly and uniquely customized to every individual and then immediately discarded. The endless scroll will be truly infinite. Scroller beware of the implications.</p>\n<p>Humans will embrace AI tools to augment their creativity and explore new artistic frontiers . We’ve come a long way since the days of cavemen painting pictures with twigs and pigment blocks. We are now armed with tools that expand our capabilities and creativity to new dimensions. In 1997, world chess champion Gary Kasparov was the first knowledge worker/athlete/artist (pick your own descriptor) to lose his job to AI when he was defeated by Deep Blue. Since then, it has been believed that between human chess players and AI chess engines, the most skillful player is actually a combination of human and AI, or a chess cyborg. Media is experiencing its chess moment, and creators now have AI partners to help them push into new frontiers. Over the past two decades, some of the largest and most powerful networks in the world emerged around media. These networks built around “social media ” grew on the backs of user-generated content – photographs from point-and-shoot cameras, 140-character quips, memes, videos taken with smartphones, entries on message boards, and more. The combination of humans and AI is going to produce new atomic units of media and expression, and around these novel (and weird ) formats will emerge tomorrow’s global networks.</p>\n<p>There will always be an important market for authentically human creations, and as AI-generated media floods the digital realm, the value of “deep reals ” will grow. Live experiences that showcase human talent will counterbalance the manipulation of bits, and its scarcity will drive demand. The same goes for unassisted, human-created media. While these formats may be more niche and never achieve the reach or ubiquity that their AI-generated or AI-assisted counterparts will – a human-directed, produced, and acted film may never have the same “popularity” (ie views, impressions, etc.) as a perfectly optimized-for-engagement AI-generated movie – they will still be critical foundations of culture.</p>\n<p>Media exists on a spectrum, and the introduction of AI tools is stretching and adding new dimensions to it. Innovative tooling is critical, but I am most interested in the networks that emerge around these novel “Human + AI” formats, as well as the experiences and infrastructure that help deep reals thrive. While this may feel like a particularly daunting moment for those who have thrived in the status quo, I’m optimistic about new opportunities for exploration and the ever-expanding canvas of expression and creativity that can fit in the hands of everyone across the globe.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/the-last-great-movie-star/\">The Last Great Movie Star</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"410d3cc4b106ac0c975e8af24d7cf1a7bd89b744069a2945bb44bd1bfaf9d748","category":"default"}