{"title":"The Slow Hunch Podcast: Episode 2 with Muneeb Ali","link":"https://www.usv.com/writing/2024/08/the-slow-hunch-podcast-episode-2-with-muneeb-ali-2/","date":1722862894000,"content":"<p>The middle of a crypto (and broader financial) market meltdown is perhaps an apropos moment to introduce my second podcast guest: Muneeb Ali , the co-founder of Stacks .</p>\n<p>Stacks is a “Bitcoin L2”, meaning a system for scaling and expanding the usefulness of the bitcoin network, by making it less expensive and more programmable.</p>\n<p>The “Slow Hunch” that Muneeb has followed for over a decade is the idea that blockchain networks can and will be used for more than just financial transactions.</p>\n<p>USV invested in the the precursor to the Stacks project back in 2014 — at that time, the focus was a project called OneName, which can be thought of as an “app” (for digital identity) on top of what would become the Stacks “platform”.</p>\n<p>We believed then, as we do now, that cryptonetworks and blockchain technology are not just financial technology but also “internet” technology and will, over time, change the way that many internet applications are built.</p>\n<p>This has indeed been a slow hunch so far. In 2014, the technology infrastructure was so far away from supporting consumer use cases in a smooth way. One could argue that that’s still true today, a decade later — though the advances, especially in the last 2 years, have been remarkable.</p>\n<p>Aside from the “if” of this slow hunch, there is the “how”. In 2015, Ethereum launched on very much the same thesis of a highly programmable blockchain. And over the years since, it has used an “L2” (aka Layer 2) approach to scaling — with a highly secure, but slow and expensive base layer, paired with an ecosystem of faster/cheaper L2s on top.</p>\n<p>Where the Stacks project has differed is in this approach — believing that Bitcoin makes more sense as the base layer, given its simpler approach and more reliable security. Muneeb and the Stacks team believe that this approach is more consistent with the “stack” of internet protocols, built around the highly simple, but extremely durable, IP protocol.</p>\n<p>I hope you enjoy my conversation with Muneeb.</p>\n<p>Get the episode on Spotify / Apple / RSS / Youtube</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/the-slow-hunch-podcast-episode-2-with-muneeb-ali-2/\">The Slow Hunch Podcast: Episode 2 with Muneeb Ali</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"41482ca3764bc5ef8b829059c73427d2cdd56336bcebb489572d8a9e5af3a221","category":"default"}