{"title":"My Thoughts About Apple’s iPhone 16 “Glowtime” Event","link":"https://om.co/2024/09/10/my-thoughts-about-apples-iphone-16-glowtime-event/","date":1726010053000,"content":"<p>Did you know that at one point more than 2 million people were watching Apple’s fall 2024 launch event stream on YouTube? If nothing else, it shows a deep interest in the company and its products. These events — carefully crafted exercises in public relations — seem to have the same place in the modern zeitgeist as fashion collections being unveiled every season. Predictably, we are either disappointed or excited about what is on show. It’s not surprising that the reaction from those who follow Apple and its products is divided.</p>\n\n\n\n<p>It’s hard to internalize, but we are at the end of the “phone hardware” cycle. From 1996 to 2007, we had a world dominated by 12-keypad phones that did a few other things. From 2007 to 2024, we have had a rectangular slab that does many things, including making calls. The first cycle lasted 11 years. This one has lasted longer. Toward the end of the first mobile phone era, it became all about incremental changes: better cameras, longer battery life, cooler colors, slightly different shapes, curves and, of course, thinner devices. Sound familiar?</p>\n\n\n\n<p>A few years ago, I wrote an essay on the <a target=\"_blank\" href=\"https://om.co/2020/10/23/iphone-12-and-why-great-design-is-timeless/\">timeless nature of good design</a>. It was inspired by a debate over the iPhone 12 and its perceived lack of innovation. I believed then, and I believe now, that sameness in design is not equivalent to a lack of creativity. I pointed to Porsche, the German automaker that has been producing variations of the same design for longer than Silicon Valley has existed.</p>\n\n\n\n<blockquote>\n<p>“Enduring design doesn’t need constant reinterpretation. It needs tweaking, polishing, and subtle improvement. I think of the iPhone and its design language very similar to Porsche’s design language. Or, for that matter of a classic Leica camera. I see Porsche’s design lines spread throughout the entire family of its products — the 911, Macan, the Cayman, Panamera, Boxer, and every other variant. You can easily tell a Porsche from another carmaker, even when zipping past you over the speed limit. I see a strong design language in Leica’s manual cameras, and they are instantly recognizable.</p>\n</blockquote>\n\n\n\n<p>In an earlier piece, I <a target=\"_blank\" href=\"https://om.co/2018/09/12/iphonexsmax-now-thats-a-tongue-twister/\">pointed out</a>:</p>\n\n\n\n<blockquote>\n<p>Like the Porsche design, iPhone is a product that is available in many variations of the original, which was so good that it can only be tuned, not reinvented. I think like Porsche, iPhone to gets a lot of improvements under the hood. And it is hard for Apple to make the normals care about how much effort it puts into the making of the phones. The guts of the iPhone are as beautiful as the outside.  Too bad there is no easy way to tell this story in words.</p>\n</blockquote>\n\n\n\n<figure><img src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2020/10/null.jpeg\" /></figure>\n\n\n\n<p>I am repeating myself when I point out that today, Apple is doing what it can to improve a form factor that has plateaued. And it is doing so in its own unique way. Better chips, better materials, better battery management — you know, the stuff that is hard to do but harder to get in a tizzy about. I don’t know about you, but I get excited when they come up with a ceramic shield that is 50% tougher than the previous generation. Sexy? Not really! Useful? 100%.</p>\n\n\n\n<p>The same goes for the A18 chips. To a casual observer, it’s all geek speak, but in reality, that’s the stuff that makes features like portrait mode better and Apple Intelligence come to life. It’s the new chips that add a few hours of battery life to their top-end models. Apple’s silicon and its ability to innovate around it in tandem with their own software is the real edge for the company. Without that, they can’t make sensor fusion work — you know, the technology that makes an Apple Watch an essential health care accessory or AirPods the new “hearing aids.”</p>\n\n\n\n<p>The smartphone world is in a bit of a holding pattern. Apple is setting the stage for the next evolution of hardware devices with the new iPhone 16 series — an evolution to AI-enhanced, personalized devices. Apple calls it “Apple Intelligence.” Others call it artificial intelligence. Whatever the moniker, it’s essentially all about turning personal computers even more personal.</p>\n\n\n\n<p>The “AI” transition is a shift in how we interact with information, much as how the browser and later the mobile device changed our relationship with it and what we could do with it. This transition is more complicated and perhaps scarier, for it has demigod-like capabilities. If you have been a student of history — Silicon Valley doesn’t believe in the past — you know that humans often start out being scared of new and seemingly powerful technologies. But ultimately, we put them to our service (or disservice).</p>\n\n\n\n<p>The same goes for AI, which as of now is here to augment our capabilities. Apple is simply easing us regular folks into this future where machines make decisions on our behalf — while still giving us a modicum of control. In the near future, we might be sufficiently trained to trust the machines as allies, not enemies.</p>\n\n\n\n<p>Apple’s AI philosophy hinges on doing as much on-device as possible for privacy and responsiveness. The new A18 Pro silicon is key to this, with a 16-core Neural Engine and next-gen ML accelerators to power real-time AI with lower latency. It has more powerful CPU and GPUs that do more but consume 35% less energy. As I have said time and again, Apple’s chip division is the pointy edge of the spear.</p>\n\n\n\n<p>Apple’s magic is in marrying hardware and software, and that shines through with the “Camera Control” interface. The interface uses AI smarts to understand what the camera sees, letting users seamlessly interact with real-world objects and scenes. Point it at a restaurant to see reviews, at a flier to add an event to your calendar – it promises to make visual AI tangible and intuitive in a way only Apple can.</p>\n\n\n\n<p>Those three attributes—personalization, ease of use, and privacy—are classic Apple tentpoles. The company is betting that its historic strengths in silicon development (with the new A18 chip powering complex ML models), UI design, and privacy-preserving architecture will enable it to create a differentiated AI experience—one that’s more tailored to each user. </p>\n\n\n\n<p>Apple is carefully sprinkling AI capabilities across core iPhone experiences, rather than using them in a single chat assistant. Apple Intelligence enhances everything from the camera (with the new Camera Control UI) to voice dictation to the Lock Screen. Apple is making AI ambient and omnipresent, and less threatening. Think of this as “Assistive Intelligence.” Or even more simply, the “bicycle for the mind” approach that Steve Jobs espoused, now enhanced by AI.</p>\n\n\n\n<p>Will it work? Who knows. If history teaches us something, Apple is good at mainstreaming technologies that others might have pioneered, at just the right time for mass impact (multi-touch, mobile payments, wearables). With the iPhone 16, it’s betting that personalized AI is ready for its close-up.</p>\n\n\n\n<figure><img width=\"1024\" height=\"575\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-1024x575.png\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-1024x575.png 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-300x168.png 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-768x431.png 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-1536x862.png 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-2048x1150.png 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-192x108.png 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-1100x618.png 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-560x314.png 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16CameraControl-1800x1011.png 1800w\" /></figure>\n\n\n\n<div><div>\n<p>What are the standout new features that impressed me? Here is a short list:</p>\n\n\n\n<ul>\n<li>“Camera Control” appears to be the next evolution, marrying intuitive user experience enabled by new sensors to unleash more intelligent, AI-powered photography. A dedicated button (physical, not virtual) allows users to capture photos and videos and change settings. It can be used for “visual intelligence.”</li>\n\n\n\n<li>As a photographer, I appreciate the new improved camera systems on both iPhone 16 and iPhone 16 Pro. As a “Max” user, I can’t wait to capture photos with it.</li>\n\n\n\n<li>The Apple Watch Series 10 has a new OLED display that is fantastic. I loved how the watch face changed with the movement of the hand. I am a self-confessed watch-face nerd, so this really captured my heart.</li>\n\n\n\n<li>Ability to capture data to detect signs of sleep apnea is amazing. <a href=\"https://www.apple.com/newsroom/2024/09/apple-introduces-groundbreaking-health-features/\" target=\"_blank\">Link</a></li>\n\n\n\n<li>Ability to detect hearing issues with AirPods Pro 2 is a pretty big deal. <a href=\"https://www.apple.com/newsroom/2024/09/apple-introduces-groundbreaking-health-features/\" target=\"_blank\">Link</a></li>\n</ul>\n</div></div>\n\n\n\n<h4>Apple Watch:</h4>\n\n\n\n<p>Apple is making its wrist computer an essential health and fitness companion. Apple Watch Series 10 gets bigger (display), smarter (sleep apnea detection, water depth sensing) and sleeker. A decade into its existence, Apple is still a leader in personal health and fitness devices and is becoming even more indispensable. Others can match or surpass any single feature, but as a collective package, it now stands alone. It is simply gorgeous, thanks to that OLED screen. The only problem I have with the Apple Watch is that it threatens to take wrist space from my collection of analog watches.</p>\n\n\n\n<h4>AirPods:</h4>\n\n\n\n<p>The new <a href=\"https://www.apple.com/newsroom/2024/09/apple-introduces-airpods-4-and-a-hearing-health-experience-with-airpods-pro-2/\" target=\"_blank\">AirPods</a> 4 have active noise cancellation, a big deal in an open-ear, non-sealing design. The new H2 chip, advanced algorithms and bespoke acoustics mean these are good for daily modern life. The upcoming software update to the AirPods Pro 2 will be a perfect showcase for “computational audio meets health tech.” How long before they can measure my blood pressure and take my body temperature? I would say before 2030!</p>\n\n\n\n<h4>What’s New:</h4>\n\n\n\n<p>The images do a good job of capturing what’s new and updated on the devices. The links take you to the press release where you can find more detail.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.apple.com/newsroom/2024/09/apple-debuts-iphone-16-pro-and-iphone-16-pro-max/\">iPhone 16 Pro &amp; iPhone 16 Pro Max</a>  </p>\n\n\n\n<figure><img width=\"1024\" height=\"581\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-1024x581.png\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-1024x581.png 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-300x170.png 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-768x436.png 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-1536x872.png 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-2048x1162.png 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-192x109.png 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-1100x624.png 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-560x318.png 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16ProFeatures-1800x1022.png 1800w\" /></figure>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.apple.com/newsroom/2024/09/apple-introduces-iphone-16-and-iphone-16-plus/\">iPhone 16 &amp; iPhone 16 Plus </a></p>\n\n\n\n<figure><img width=\"1024\" height=\"573\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-1024x573.png\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-1024x573.png 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-300x168.png 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-768x430.png 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-1536x859.png 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-2048x1145.png 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-192x107.png 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-1100x615.png 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-560x313.png 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/iPhone16Features-1800x1007.png 1800w\" /></figure>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.apple.com/newsroom/2024/09/introducing-apple-watch-series-10/\">Apple Watch Series 10</a></p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"575\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-1024x575.png\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-1024x575.png 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-300x168.png 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-768x431.png 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-1536x862.png 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-2048x1150.png 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-192x108.png 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-1100x617.png 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-560x314.png 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/09/AppleWatchSeries10Features-1800x1010.png 1800w\" /></figure>\n\n\n\n<h4>MY PHOTO ESSAY ABOUT THE EVENT</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/09/10/the-iphone-content-machine-a-visual-essay/\">The iPhone Content Machine: A Visual Essay</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4159c71d6fcfe114014122182d6841bfea04869da0512ec71b9461a25fc917dc","category":"Sites"}