{"title":"The Artists&#8217; and Writers&#8217; Cookbook","link":"https://kottke.org/24/09/the-artists-and-writers-cookbook-1","date":1727297107000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/artists-writers-cookbook.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/artists-writers-cookbook.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/artists-writers-cookbook.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"874\" alt=\"Artists and Writers Cookbook\" /></p>\n\n<p>Published in 1961 with an introduction by Alice B Toklas, <a href=\"http://www.amazon.com/exec/obidos/ASIN/B000FYZF42/ref=nosim/0sil8\">The Artists’ and Writers’ Cookbook</a> features recipes and wisdom from dozens of writers and artists, including Harper Lee, Man Ray, Marcel Duchamp, Pearl Buck, Upton Sinclair, John Keats, and Burl Ives. Lee shared <a href=\"http://www.theparisreview.org/blog/2014/03/07/pork-products-in-the-work-of-harper-lee/\">her recipe for crackling cornbread</a>:</p>\n\n<blockquote><p>First, catch your pig. Then ship it to the abattoir nearest you. Bake what they send back. Remove the solid fat and throw the rest away. Fry fat, drain off liquid grease, and combine the residue (called “cracklings”) with:</p>\n\n<p>1 ½ cups water-ground white meal<br />\n1 teaspoon salt<br />\n1 teaspoon baking powder<br />\n1 egg<br />\n1 cup milk</p>\n\n<p>Bake in very hot oven until brown (about 15 minutes).</p>\n\n<p>Result: one pan crackling bread serving 6. Total cost: about \\$250, depending upon size of pig. Some historians say this recipe alone fell the Confederacy.</p></blockquote>\n\n<p>And Marcel Duchamp offers up <a href=\"http://www.brainpickings.org/2013/04/17/the-artists-writers-cookbook-1961/\">a preparation of steak tartare</a>:</p>\n\n<blockquote><p>Let me begin by saying, ma chere, that Steak Tartare, alias Bitteck Tartare, also known as Steck Tartare, is in no way related to tartar sauce. The steak to which I refer originated with the Cossacks in Siberia, and it can be prepared on horseback, at swift gallop, if conditions make this a necessity.</p>\n\n<p>Indications: Chop one half pound (per person) of the very best beef obtainable, and shape carefully with artistry into a bird’s nest. Place on porcelain plate of a solid color — ivory is the best setting — so that no pattern will disturb the distribution of ingredients. In hollow center of nest, permit two egg yolks to recline. Like a wreath surrounding the nest of chopped meat, arrange on border of plate in small, separate bouquets:</p>\n\n<p>Chopped raw white onion<br />\nBright green capers<br />\nCurled silvers of anchovy<br />\nFresh parsley, chopped fine<br />\nBlack olives minutely chopped in company with yellow celery leaves<br />\nSalt and pepper to taste</p>\n\n<p>Each guest, with his plate before him, lifts his fork and blends the ingredients with the egg yolks and meat. In center of table: Russian pumpernickel bread, sweet butter, and bottles of vin rosé.</p></blockquote>\n\n<p>Not to be outdone, MoMA published <a href=\"http://www.amazon.com/exec/obidos/ASIN/0810920999/ref=nosim/0sil8\">their own artists’ cookbook</a> in 1977, featuring contributions from Louise Bourgeois, Christo, Salvador Dali, Willem De Kooning, Roy Lichtenstein, and Andy Warhol. Here’s Warhol’s recipe:</p>\n\n<blockquote><p>Andy Warhol doesn’t eat anything out of a can anymore. For years, when he cooked for himself, it was Heinz or Campbell’s tomato soup and a ham sandwich. He also lived on candy, chocolate, and “anything with red dye #2 in it.” Now, though he still loves junk food, McDonald’s hamburgers and French fries are something “you just dream for.”</p>\n\n<p>The emphasis is on health, staying thin and eating “simple American food, nothing complicated, no salt or butter.” In fact, he says, “I like to go to bad restaurants, because then I don’t have to eat. Airplane food is the best food — it’s simple, they throw it away so quickly and it’s so bad you don’t have to eat it.”</p>\n\n<p>Campbell’s Milk of Tomato Soup<br />\nA 10 3/4-ounce can Campbell’s condensed tomato soup<br />\n2 cans milk<br />\nIn a saucepan bring soup and two cans milk to boil; stir. Serve.</p></blockquote>\n\n         <p><em>[This is a vintage post originally from May 2015.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Andy%20Warhol\">Andy Warhol</a> · <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/cooking\">cooking</a> · <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/Harper%20Lee\">Harper Lee</a> · <a href=\"https://kottke.org/tag/MoMA\">MoMA</a> · <a href=\"https://kottke.org/tag/museums\">museums</a> · <a href=\"https://kottke.org/tag/The%20Artists%27%20and%20Writers%27%20Cookbook\">The Artists’ and Writers’ Cookbook</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"421fd987a57aee3a1973da32bcd14677d07b9f3258edbb57ad764b2eb50013d5","category":"Sites"}