{"title":"Are You an NPC? (Or Do You Have Free Will?)","link":"https://kottke.org/24/06/are-you-an-npc-or-do-you-have-free-will","date":1718220060000,"content":"\n        <p></p>\n\n<p>Kurzgesagt attempts to answer the question (from the perspective of physics): Do we have free will? Here’s the deterministic perspective (from the <a href=\"https://sites.google.com/view/sources-free-will/\">show notes</a>):</p>\n\n<blockquote><p>Now imagine that if right after the Big Bang, a supersmart supercomputer looked at every single particle in the universe and noted all their properties. Just by applying the deterministic laws of physics, it should be able to predict what all the particles in existence would be doing until the end of time.</p>\n\n<p>But if you are made of particles and it’s technically possible to calculate what particles will do forever, then you never decided anything. Your past, present and future were already predetermined and decided at the Big Bang. This would mean there is a kind of fate and you are not free to decide anything.</p>\n\n<p>You may feel like you make decisions, but you are on autopilot. The motions of the particles that make up your brain cells that made you watch this video were decided 14 billion years ago. You are just in the room when it happens. You are only witnessing how the universe inside you unfolds in real time.</p></blockquote>\n\n<p>And the other side of the argument (in favor of free will):</p>\n\n<blockquote><p>We know that we can reduce everything that exists to its basic particles and the laws that guide them. While this makes physics feel like the only scientific discipline that actually matters, there is a problem: You can’t explain everything in our universe only from particles.</p>\n\n<p>One key fact about reality that we can’t explain by looking just at electrons and quantum stuff is emergence. Emergence is when many small things together create new fundamental traits that didn’t exist before.</p>\n\n<p>Emergence occurs at all levels of reality, and reality seems to be organized in layers: atoms, molecules, cells, tissues, organs, you, society. Put many things in one layer together and they’ll create the next layer up. Every time they do, entirely new properties emerge.</p></blockquote>\n\n<p>Having thought about this for all of 20 minutes (or, practically all of my life), the emergence argument against determinism makes a lot of sense to me. Then again, James Gleick’s <a href=\"https://www.amazon.com/exec/obidos/ASIN/0143113453/ref=nosim/0sil8\">Chaos</a> and Steven Johnson’s <a href=\"https://www.amazon.com/exec/obidos/ASIN/0684868768/ref=nosim/0sil8\">Emergence</a> both made a huge impression on me when I read it more than 20 years ago.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/emergence\">emergence</a> · <a href=\"https://kottke.org/tag/Kurzgesagt\">Kurzgesagt</a> · <a href=\"https://kottke.org/tag/physics\">physics</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/06/are-you-an-npc-or-do-you-have-free-will\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"422ebedbc149c5eedfd2427a6e75f1bef24b28376c8f0395c1a282917cd134d2","category":"default"}