{"title":"No One You Love Is Ever Dead: Hemingway on the Most Devastating of Losses and the Meaning of Life","link":"https://www.themarginalian.org/2024/05/21/hemingway-loss-letter/","date":1716326767000,"content":"<h3>“We must live it, now, a day at a time and be very careful not to hurt each other.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Letters-Note-Grief-Shaun-Usher/dp/014313678X/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"437\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?fit=320%2C437&amp;ssl=1\" alt=\"No One You Love Is Ever Dead: Hemingway on the Most Devastating of Losses and the Meaning of Life\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?w=1099&amp;ssl=1 1099w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?resize=320%2C437&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?resize=600%2C819&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?resize=240%2C328&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/lettersofnote_grief.jpg?resize=768%2C1048&amp;ssl=1 768w\" /></a></p><p>Along the spectrum of losses, <a href=\"https://www.themarginalian.org/2021/01/31/elizabeth-bishop-one-art/\">from the door keys to the love of one’s life</a>, none is more unimaginable, more incomprehensible in its unnatural violation of being and time, than a parent’s loss of a child. </p>\n<p><strong>Ernest Hemingway</strong> (July 21, 1899–July 2, 1961) was in his twenties and living in France when he befriend Gerald and Sara Murphy. The couple eventually returned to America when one of their sons fell ill, but it was their other son, Baoth, who died after a savage struggle with meningitis. </p>\n<p>Upon receiving the news, the thirty-five-year-old writer sent his friends an extraordinary letter, part consolation for and part consecration of a loss for which there is no salve, found in Shaun Usher’s moving compilation <a href=\"https://www.amazon.com/Letters-Note-Grief-Shaun-Usher/dp/014313678X/?tag=braipick-20\" target=\"_blank\"><strong><em>Letters of Note: Grief</em></strong></a> (<a href=\"https://search.worldcat.org/title/1267402746\" target=\"_blank\"><em>public library</em></a>).</p>\n<figure><a href=\"https://www.amazon.com/Letters-Note-Grief-Shaun-Usher/dp/014313678X/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2013/11/ernesthemingwayonwriting1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Ernest Hemingway</figcaption></figure>\n<p>On March 19, 1935, Hemingway writes:</p>\n<blockquote><p>Dear Sara and Dear Gerald:</p>\n<p>You know there is nothing we can ever say or write… Yesterday I tried to write you and I couldn’t.</p>\n<p>It is not as bad for Baoth because he had a fine time, always, and he has only done something now that we all must do. He has just gotten it over with… </p>\n<p>About him having to die so young — Remember that he had a very fine time and having it a thousand times makes it no better. And he is spared from learning what sort of a place the world is.</p>\n<p>It is <em>your</em> loss: more than it is his, so it is something that you can, legitimately, be brave about. But I can’t be brave about it and in all my heart I am sick for you both. </p>\n<p>Absolutely truly and coldly in the head, though, I know that anyone who dies young after a happy childhood, and no one ever made a happier childhood than you made for your children, has won a great victory. We all have to look forward to death by defeat, our bodies gone, our world destroyed; but it is the same dying we must do, while he has gotten it all over with, his world all intact and the death only by accident.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/03/08/cry-heart-but-never-break/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/03/cryheartbutneverbreak2.jpg\" /></a><figcaption>Art by Charlotte Pardi from <a href=\"https://www.themarginalian.org/2016/03/08/cry-heart-but-never-break/\"><em>Cry, Heart, But Never Break</em></a> by Glenn Ringtved — a soulful Danish illustrated meditation on love and loss</figcaption></figure>\n<p>In a breathtaking sentiment evocative of Anaïs Nin’s <a href=\"https://www.themarginalian.org/2017/01/19/anais-nin-on-reading/\">admonition against the stupor of near-living</a>, and of poet Meghan O’Rourke’s grief-honed conviction that <a href=\"https://www.themarginalian.org/2014/06/09/meghan-o-rourke-the-long-goodbye/\">“the people we most love do become a physical part of us, ingrained in our synapses, in the pathways where memories are created,”</a> Hemingway adds:</p>\n<blockquote><p>Very few people ever really are alive and those that are never die; no matter if they are gone. No one you love is ever dead.</p></blockquote>\n<p>With this, echoing Auden’s insistence that <a href=\"https://www.themarginalian.org/2022/04/07/the-more-loving-one-auden-universe-in-verse/\">“we must love one another or die,”</a> he comes the closest he ever came to formulating the meaning of life. Like David Foster Wallace, who <a href=\"https://www.themarginalian.org/2012/09/12/this-is-water-david-foster-wallace/\">addressed the meaning of life</a> with such exquisite lucidity shortly before he was slain by depression, Hemingway too would lose hold of that meaning in the throes of the agony that would take his life a quarter century later. Now, from the fortunate platform of the prime of life, he writes:</p>\n<blockquote><p>We must live it, now, a day at a time and be very careful not to hurt each other. It seems as though we were all on a boat together, a good boat still, that we have made but that we know will never reach port. There will be all kinds of weather, good and bad, and especially because we know now that there will be no landfall we must keep the boat up very well and be very good to each other. We are fortunate we have good people on the boat.</p></blockquote>\n<p>Complement with the young Dostoyevsky’s <a href=\"https://www.themarginalian.org/2019/12/05/dostoyevsky-execution-life/\">exultation about the meaning of life</a> shortly after his death sentence was repealed, Emily Dickinson on <a href=\"https://www.themarginalian.org/2021/05/28/emily-dickinson-grief/\">love and loss</a>, Thoreau on <a href=\"https://www.themarginalian.org/2023/03/01/thoreau-grief/\">living through loss</a>, and Nick Cave — who lived, twice, the unimaginable tragedy of the Murphys — on <a href=\"https://www.themarginalian.org/2020/07/27/nick-cave-loss-grief/\">grief as a portal to aliveness</a>, then revisit the fascinating neuroscience of <a href=\"https://www.themarginalian.org/2022/05/25/the-grieving-brain-mary-frances-o-connor/\">your brain on grief and your heart on healing</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4244641a6adb9b4ae74419768a7b5ddf5233cf32b95b28db936eada26ba1321d","category":"default"}