{"title":"My Conversation with Musa al-Gharbi","link":"https://feeds.feedblitz.com/~/906337478/0/marginalrevolution~My-Conversation-with-Musa-alGharbi.html","date":1729143447000,"content":"<p>I am a big fan of Musa’s work, most of all his new book <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/Have-Never-Been-Woke-Contradictions/dp/0691232601/ref=sr_1_1?crid=194EI0624MFQK&amp;dib=eyJ2IjoiMSJ9.2FJo4PUjYpdte7G4hi_E7PsNBIhYCqUds0pAUsHfsVC7z2oFMbJMbPkezm3dy4FD.90UkAuIXZplDtOSCweWfcSxymQpbZc0Ta_vxqSla4fk&amp;dib_tag=se&amp;keywords=musa+al-gharbi&amp;qid=1729096800&amp;sprefix=musa%2Caps%2C407&amp;sr=8-1\" target=\"_blank\">We Have Never Been Woke: The Cultural Contradictions of a New Elite</a>.  As for the podcast, here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/musa-al-gharbi/\" target=\"_blank\">the video, audio, and transcript</a>.  Here is the episode summary:</p>\r\n<blockquote><p>Tyler and Musa explore the rise and fall of the “Great Awokening” and more, including how elite overproduction fuels social movements, why wokeness tends to fizzle out, whether future waves of wokeness will ratchet up in intensity, why neuroticism seems to be higher on the political Left, how a great awokening would manifest in a Muslim society, Black Muslims and the Nation of Islam, why Musa left Catholicism, who the greatest sociologist of Islam is, Muslim immigration and assimilation in Europe, and more.</p></blockquote>\r\n<p>Excerpt:</p>\r\n<blockquote>\r\n<p><strong>COWEN:</strong> Let me give you an alternate theory of the Great Awokening, and tell me what’s wrong with it. It’s not really my view, but I hear it a lot.</p>\r\n<p>So on the Left, there’s some long-term investment in teaching in America’s top universities. You produce a lot of troops who could become journalists, and they’re mostly left-leaning. Then 2011, 2012 — there’s something about the interaction of social media and, say, <em>The New York Times</em> and other major outlets, where all of a sudden they have a much bigger incentive to have a lot of articles about race, gender, Black Lives Matter, whatever. When those two things come together, wokeness takes off based on a background in Christianity and growing feminization of society.</p>\r\n<p>By the time you get to something like 2021, enough of mainstream media has broken down that it’s simply social media out there going crazy. That just gives us a lot of diversity of bizarre views rather than just sheer wokeness — and besides, Elon is owning Twitter, so wokeness ends.</p>\r\n<p>What’s wrong with that account?</p>\r\n<p><strong>AL-GHARBI:</strong> For one, I do think that some of the factors that you identified are important for contextualizing the current moment. For instance, a lot of the symbolic professions, like law and consulting, academia, journalism — they are being feminized. I do talk a bit in the book about how this matters for understanding the dynamics in a lot of these institutions. Not just over the last 10 years, but over the last several decades, in part because women and men tend to engage in very different forms of status-seeking and competition and things like that. So that does matter.</p>\r\n<p>Things like social media obviously do change the way interactions play out. But you can see, actually, that things like social media or changes in the media landscape after 2010 — one limitation for using those kinds of explanations to explain the current moment is that it becomes hard, then, to understand how or why it was the case that . . .</p>\r\n<p>There were three previous episodes like this, one in the 1920s through the early ’30s, one in the mid-1960s to the late ’70s, and then one in the late ’80s through early ’90s. In all cases where we didn’t have social media, where the structure of media enterprises was importantly different than it is today, and before you had Gen Z “kids these days” with their idiosyncratic attitudes, or before a lot of these professions were as feminized as they were today.</p>\r\n<p>I think all of those factors you said actually do matter, and they matter in the sense — because each of these episodes, there’s so much in common, an insane amount. When you read the book and I walk through some of these — I think a lot of readers will be troubled, maybe, by how similar these episodes are. But they’re also importantly different. They don’t play out identically. They are importantly different: The role that symbolic capitalists occupy in society changed immensely over the last century. The constitution of these fields has changed immensely. There are a lot more women; there are a lot more nonwhite people in these professions than there were in the past, and so on and so forth.</p>\r\n<p>All of those factors you described: I think they actually do matter, especially for understanding the ways in which this period of awokening might differ from previous episodes, but I don’t think they explain why awokenings happen at all.</p>\r\n<p><strong>COWEN:</strong> If “woke” recurs, do you think there’s a ratchet effect where it comes back bigger and stronger each time, a bit like the destructiveness of war? Or is it more of a random walk? Like, the next wave of woke in 37 years might be half as strong as the one we just had. What’s your model?</p>\r\n<p><strong>AL-GHARBI:</strong> I think it’s random; that depends a little bit on . . .</p>\r\n<p>What I argue in the book is that the — for instance, when we look at the last period of awokening in the late ’80s and early ’90s, it was much less — that was the last time we had these struggles over what they call political correctness, or the PC culture, which we call wokeness today. As I argue in the book, it didn’t last as long, that awokening. It was shorter than most of the others, actually. Shorter than the one in the ’60s, shorter than the one after 2010. It was a little shorter, and it also wasn’t quite as dramatic.</p>\r\n<p>I think there are these kind of contextual factors that significantly inform how severe it is or how long it lasts, how long it’s able to sustain itself or how long it is until the frustrated elites get — enough of them get satisfied that they disengage. My guess is that it’s more of a random walk, but I’m open to persuasion.</p>\r\n</blockquote>\r\n<p>Definitely interesting.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html\">My Conversation with Musa al-Gharbi</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/906337478/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/906337478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/906337478/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/906337478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/906337478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/906337478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comment-160823714\">In reply to The Original D.   Such a libertarian argument. ...</a> <i>by Brian Villanueva</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comment-160823713\">In reply to Don't forget sex.   That's a really fascinating ...</a> <i>by Brian Villanueva</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comment-160823712\">In reply to H.   That may be your experience in law, but ...</a> <i>by Brian Villanueva</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comment-160823711\">In reply to Remember to vote on Jan 5.   &gt; and start talking ...</a> <i>by PHinton</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comment-160823710\">“Awokenings have a hard time retaining their coherence.” ...</a> <i>by Brian Villanueva</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-conversation-with-musa-al-gharbi.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/my-excellent-conversation-with-tom-tugendhat.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-tom-tugendhat\">My excellent Conversation with Tom Tugendhat</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/the-value-of-books-on-tractors.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-value-of-books-on-tractors\">The value of books on tractors</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/10/a-country-run-by-schoolteachers.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=a-country-run-by-schoolteachers\">A country run by schoolteachers?</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"42aa1dcf2f375094924066e0a1ec53c27288e45f4e6070793162dc08c31c2733","category":"Sites"}