{"title":"Contenting Ourselves With Stories","link":"https://kottke.org/24/05/contenting-ourselves-with-stories","date":1716316108000,"content":"\n        <p>I just started a rewatch of <a href=\"https://www.hbo.com/chernobyl\">Chernobyl</a> and was struck by the opening lines of the first episode spoken by Jared Harris, who plays Soviet nuclear physicist Valery Legasov:</p>\n\n<blockquote><p>What is the cost of lies? It’s not that we’ll mistake them for the truth. The real danger is that if we hear enough lies, then we no longer recognize the truth at all. What can we do then? What else is left but to abandon even the hope of truth and content ourselves instead with stories? In these stories, it doesn’t matter who the heroes are. All we want to know is: Who is to blame?</p></blockquote>\n\n<p>Which reminds me of what historian and philosopher Hannah Arendt <a href=\"https://web.archive.org/web/20170206000801/https://www.nybooks.com/articles/1978/10/26/hannah-arendt-from-an-interview/\">said in a 1974 interview</a>:</p>\n\n<blockquote><p>The moment we no longer have a free press, anything can happen. What makes it possible for a totalitarian or any other dictatorship to rule is that people are not informed; how can you have an opinion if you are not informed? If everybody always lies to you, the consequence is not that you believe the lies, but rather that nobody believes anything any longer. This is because lies, by their very nature, have to be changed, and a lying government has constantly to rewrite its own history. On the receiving end you get not only one lie-a lie which you could go on for the rest of your days-but you get a great number of lies, depending on how the political wind blows. And a people that no longer can believe anything cannot make up its mind. It is deprived not only of its capacity to act but also of its capacity to think and to judge. And with such a people you can then do what you please.</p></blockquote>\n\n<p>And also what <a href=\"https://kottke.org/16/11/fighting-authoritarianism-20-lessons-from-the-20th-century\">On Tyranny</a> author Timothy Snyder <a href=\"https://www.nytimes.com/2021/01/09/magazine/trump-coup.html?unlocked_article_code=1.tk0.t6dn.HMxNHhHfTPb2\">wrote a few days after the January 6th attack on Congress</a>:</p>\n\n<blockquote><p>Post-truth is pre-fascism, and Trump has been our post-truth president. When we give up on truth, we concede power to those with the wealth and charisma to create spectacle in its place. Without agreement about some basic facts, citizens cannot form the civil society that would allow them to defend themselves. If we lose the institutions that produce facts that are pertinent to us, then we tend to wallow in attractive abstractions and fictions. Truth defends itself particularly poorly when there is not very much of it around, and the era of Trump — like the era of Vladimir Putin in Russia — is one of the decline of local news. Social media is no substitute: It supercharges the mental habits by which we seek emotional stimulation and comfort, which means losing the distinction between what feels true and what actually is true.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Chernobyl\">Chernobyl</a> · <a href=\"https://kottke.org/tag/Hannah%20Arendt\">Hannah Arendt</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Timothy%20Snyder\">Timothy Snyder</a> · <a href=\"https://kottke.org/tag/TV\">TV</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/contenting-ourselves-with-stories\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"42ab89e0ad6680f4c9e9a5ceada971bfb25c4c2060c6dcf7513a6093b5d87836","category":"default"}