{"title":"2030&#58; The next decade","link":"https://blog.webb.page/2019-12-31-the-next-decade.txt","date":1577750400000,"content":"<p>The year 2020 is upon us and while it is merely a number change it feels like\nit bears significance. My wife joked that she was \"going into 2020 with clear\nvision\" and you can be <em>sure</em> that's not the last time you'll hear such\njokes/puns this upcoming year. So, what does this new year mean to me? A\ncouple things come to mind.</p>\n<p>I am currently 31 years old and from what I've read in my 20s, your 30s is\nwhen you <em>finally</em> get your shit together. I certainly <em>feel</em> more confident\nin my professional skills and my propensity to create whatever comes to mind\nwith dexterity. But rather than make resolutions or plans for next year I am\ndrawn to the idea of doing so for the next <em>decade</em>. Where do I want to be at\n41, physically and mentally? What skills will I possess? What habits will I\nbreak and what habits will be formed?</p>\n<p>It may sound cliché but, to forecast my future I look to my past;\nintrospection, basically. It's a powerful tool that I believe everyone should\nemploy frequently.</p>\n<p>When I was in 5th grade there was a \"Career Day\" and four adults came to my\nclass to talk about their respective careers. After explaining what they did\nfor work, every kid in my class stood up and said what they imagined their\nfuture career to be. When it was my turn I mentioned <em>several</em> career paths I\nwanted in life. The demographic makeup of the adults in the room were four\nWhite women (one of them being my teacher) and one Black man. I feel this\ndetail is necessary because all the women chuckled in disbelief (some with\nincredulous looks on their faces), which encouraged some of my classmates to\nlaugh as well. The man only smiled and listened intently which gave me the\ncourage to continue. In the moment it didn't seem notable but in hindsight it\ncertainly does. I think I'll save my thoughts on this matter for a future post\nas I've had other similar interactions in life.</p>\n<p>The point is, thinking back to your dreams and aspirations from your childhood\ncan help steer you when you feel you've lost direction in your life. For this\nnext decade I'd like to make the 5th grade version of the most fantabulous\nPaul Anthony Webb feel proud about the man he's become. Here's a\nnon-exhaustive list of things I'd like to attain/obtain, followed by reasons\nwhy I chose these items:</p>\n<ul>\n<li>author</li>\n<li>cooking</li>\n<li>driving license</li>\n<li>filmmaker</li>\n<li>fitness</li>\n<li>fluency in (conversational) Japanese</li>\n<li>hardware product (kimoyo beads?)</li>\n<li>home ownership</li>\n<li>media network<ul>\n<li>publishing house</li>\n<li>record label</li>\n</ul>\n</li>\n<li>musician</li>\n<li>podcast</li>\n<li>revenue generating businesses</li>\n<li>teacher</li>\n</ul>\n<h2>Author</h2>\n<p>I enjoy writing and feel I should do it a LOT more. A couple weeks ago I\ndecided to try journaling and have been pretty consistent. The past week\nhasn't been eventful in any way but I think I should still make an effort to\nput in an entry at least once a week. I use an application called Standard\nNotes<a href=\"https://standardnotes.org\">1</a> to keep track of all my ideas. It has a \"pin\" feature so whenever I\ngo to the \"All Notes\" section I can see my journal there. Anyhoo, I've had\nconcepts for novels and screenplays since high school and I <em>thankfully</em>\nscanned most of those documents…I don't know where they are but the core\nconcepts are still in my mind. There's enough content for a trilogy.</p>\n<p>Another book idea I've had for some years is titled \"How to be Awesome\" and is\nbased on how I see obstacles and overcome them. For whatever reason I have\nbeen able to stick to my guns<a href=\"https://idioms.thefreedictionary.com/stick+to+my+guns\">2</a> in the face of negativity and adversity no\nmatter the source: family, friends, life, whatever, AND unassisted by drugs or\nalcohol (the only casualty has been my hairline)! I'm not sure why I'm the way\nI am but private conversations throughout my life indicate that others would\nbenefit from my story. Maybe I would benefit from in-depth introspection too.</p>\n<h2>Cooking</h2>\n<p>My wife would <em>love</em> if I took up cooking, especially because my culinary\ninterests are largely Asian-based. She's already pretty good at cooking\nregular/soul food and is not trying to learn other cuisines. I am interested\nin replicating the amazing ramen I had on my last day in Japan. Woks are a\nfascinating tool to me so I'd like to learn how to use it efficiently. One of\nmy buddies got me a cookbook from one of my favorite food trucks in Boston\n(Mei Mei). The main food item I ordered from them is dubbed,\n\"The Double Awesome\". It's a scallion pancake sandwich with ham and a\nscrambled egg in it, with pesto and other things. Add Sriracha and you're all\nset! Mei Mei's Haymaker's Punch was perfect for chilly days and a good pair\nfor the sandwich. I tried making a Double Awesome while on vacation at\nDisney World and…it was quite crispy (burnt). One day at a time!</p>\n<h2>Driving License</h2>\n<p>Growing up in the Boston area, I had no need for a license. Public\ntransportation is pretty good, even though the MBTA (we just call it \"the T\")\nregularly has issues. Moving to Tennessee means I lost my mobility and\nbasically became a homebody, much to the chagrin of my wife. It's not a big\ndeal to me (right now) but I know I'll need a license <em>eventually</em>. Also, now\nthat Tesla's Cybertruck exists I think I'll <em>accelerate</em> 🤣 my plans to\nobtain one.</p>\n<h2>Filmmaker</h2>\n<p>I'm a big fan of doing things myself, which is why I self-host a lot of things\n(including my own email server). For my space-centric novels I always imagined\nhow they'd look cinematically and what changes I'd need to make to the story\nto allow the reader to visualize what <em>I</em> see in my mind. It only makes sense\nthat I'd film my stories to ensure correctness. To flesh out the world of my\nnovels I'd need to film faux commercials and recently have jotted down some\nhumorous concepts.</p>\n<h2>Fitness</h2>\n<p>I've been roughly 145 pounds since high school thanks to a fast metabolism and\nsporadic eating/sleeping habits. While I have good body positivity I've always\nbeen curious to see how I'd look with muscle and more meat on my bones.\nI'Robot is one of my favorite films and with Will Smith being one of my\nfavorite actors (and rapper, don't @ me), his home workout scene<a href=\"https://www.youtube.com/watch?v=Uv83ZKIZSoI\">3</a> solidified\nthe body type I want to achieve. My dad was in the Army and jogged shirtless\nin way too short shorts that were tight so you <em>know</em> he was fit. Physical\nfitness also improves mental health and mood so <em>why not</em> delve into this?</p>\n<h2>Fluency in Japanese</h2>\n<p>A couple things from my high school years influenced my desire to visit Japan\nand absorb the culture.</p>\n<ul>\n<li>Anime: Samurai Champloo, Tenchi Muyo, Yuyu Hakusho, Dragonball Z,\n   Rockman.EXE, Ghost in the Shell: Stand Alone Complex, Cowboy Bebop</li>\n<li>Games: Megaman Battle Network</li>\n<li>Music: Samurai Champloo and GITS:SAC OSTs</li>\n</ul>\n<p>I often watched fan-subbed versions of anime when they weren't officially\navailable in English (sometimes for <em>years</em>). Every now and then I would think\nabout learning Japanese so I could skip over all that and well, something else\nwas always more \"important\". In hindsight, it'd be easier to learn then due to\nbetter brain elasticity but my work ethic/dedication/diligence is\nstronger now.</p>\n<p>Fun fact! I learned how to use chopsticks from watching the Rockman.EXE anime.\nI also learned a couple phrases like, \"Roger that\" (Batou from Ghost in the\nShell says that a <em>lot</em> to Major), \"Cool/Awesome\", \"What?!\", \"Excuse me\",\n\"Damn you\", and so on. Most anime l̶o̶v̶e̶r̶s̶ connoisseurs know these\nphrases too.</p>\n<h2>Hardware Product</h2>\n<p>I think I'm pretty good with software but <em>hardware</em> is something I have zero\nknowledge about. I own probably every Raspberry Pi that has been released thus\nfar and have done NOTHING with them. At ALL. For me to really get into\nsomething I need to have an ambitious goal. Creating functioning kimoyo beads\nis definitely ambitious and would require sourcing research and probably\nmicrocontroller programming. I just made that up, not sure if that's necessary\nbut that goes to show that I don't know what I don't know. What I learn along\nthe way is gonna open up so many more mental pathways and that excites me.</p>\n<h2>Home Ownership</h2>\n<p>Ownership is something that is becoming increasingly important to me as the\nyears go on. Having a landlord absolves you of certain responsibilities but\nyou are also not the master of your domain. In high school I used to daydream\nabout having a custom home built (and recently I learned of a startup<a href=\"https://www.homebound.com\">4</a> in\nthat space). I would like my kids to have a \"childhood home\" to grow up in,\nmove out of, and visit.</p>\n<h2>Media Network</h2>\n<p>Y'know that space novel series I mentioned above? Over the years it has\nevolved into something that spans many creative disciplines. 2000s-era Toonami\nis what I have in mind for this network. A series of shows with space-centric\nidents between them. Video content is expensive and time-consuming to create\nso initially the network would have the music I create on shuffle\n(essentially) with generative visuals. Naturally, having a record label and\npublishing house under this umbrella makes sense and would fund the content\ncreation. What if it was part incubator? Seems like a great way to curate\ncontent for licensing. HMM.</p>\n<h2>Musician</h2>\n<p>When I was actively making music I did so under a number of aliases and in\ndifferent genres, namely, rap/hip-hop and house/lounge with some experimental\nEPs. The rap content was semi-conscious, braggadocious, and space-centric. The\nlounge content was mostly instrumental but when there were lyrics I focused on\ntopics of love and longing. I made my own beats and attempted to make them\nsound mastered but uh, to my ears now they sound kinda terrible.</p>\n<p>My DAW of choice was Acid Pro, which is a Windows-exclusive application. When\nI entered the web industry full-time I transitioned to macOS and haven't\nlooked back. Acid Pro is still in active development and the latest features\nare <em>incredible</em> but sadly (for me), it remains Windows-exclusive. I could\nalways learn how to use another DAW but every one I've tried since just don't\n<em>feel</em> right so a custom PC build is in my future.</p>\n<h2>Podcast</h2>\n<p>While working at the flagship Converse store in Boston many years ago, a\nmiddle-aged woman followed me around the store asking questions about\nvirtually anything; just to hear me speak. She said I had a nice radio voice\nand that's when I knew a rap career could work for me. Can you imagine?</p>\n<blockquote>\n<p>\"Boy, his lyrics are hot <em>garBAGE</em> but his voice is smooth AF!\"</p>\n</blockquote>\n<p>I like making money so that's why I didn't pursue rap as strongly as\nweb design.</p>\n<p>Anyhoo, I get into fascinating discussions with friends and family and some of\nthose conversations would make for excellent podcast content. I have a dope\nname in mind for it too, all I need is a home office again. Because my\ninterests are so varied my podcast would probably be in the \"lifestyle\"\ncategory. Gaming, design, technology, animation, Blackness, &amp;c; I'm passionate\nabout a lot of things. I'd make good use of the drum machine I currently have\nin a box as a soundboard.</p>\n<h2>Revenue Generating Businesses</h2>\n<p>I come from an entrepreneurial family and I have <em>way</em> too many side projects\nto not have any of them generating income. Then again, all of them are in\nalpha/beta status and in varying states of neglect. An immediate change I am\nmaking in the new year is seeing my projects to completion or out of test\nstatus. One of my services has been in operation and virtually unchanged for\nmore than two years. It's amazing I was able to hack together something that\nstill works, haha! It certainly <em>feels</em> like hacks compared to my\nknowledge now.</p>\n<p><em>SIGH</em></p>\n<p>The struggle of a creative. Everything you ever made is absolute trash almost\nimmediately, no matter how much time you spent on it before releasing it onto\nthe world.</p>\n<h2>Teacher</h2>\n<p>I like sharing what I know, and figuring out how to distill high level\nconcepts to easily understandable concepts is an interesting challenge. About\na month ago I had a dream where I was teaching middle-/high-school kids about\nweb development. And they were listening! Seems to bode well for the future.\nIn terms of industry titles, I could be considered a senior front-end/ux\ndeveloper and the next step up is managerial. I just call myself an architech;\nsomeone who designs and builds technology (there's no ego tied to it and is a\nbetter descriptor for me). It'd be nice to have a mentor in 2020 though, I've\nbeen teaching myself everything I know since the recession of '08. 👨🏾‍🦳</p>\n<h2>FIN</h2>\n<p>The beautiful thing about the Internet is that it has democratized a <em>lot</em> of\nindustries so I <em>could</em> complete several things on my list within the next\nyear no problem…well, the only problem being me half-assing things just to say\nI did them. Barring that, I will seriously attempt to accomplish everything\nwithin the decade. The main trait I lack is <em>discipline</em> and it will be\ndifficult to instill greater levels of accountability into myself. 😥\nBut not impossible!</p>\n<p>The other benefit of being in my 30s is having the financial means to invest a\nbit more into my ventures. With a decade of experience in the web space I can\nfetch a pretty good salary and put non-trivial amounts of money away for more\nambitious projects.</p>\n<p>What a ride life has been thus far. A decade ago I had no kids and could\nbarely code my way out of a paper bag. The services and sites I've created in\nthat time since were mere thoughts scribbled in a notebook on my lunch break.\nWild! I can only imagine what my 2040 blog post will contain. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"43131b9be636f97a66f0b3ebc2badd978458d460547078c1789ba5a76ed3486b","category":"Sites"}