{"title":"Field Notes 07.03.2024","link":"https://om.co/2024/07/03/field-notes-07-03-2024/","date":1720038565000,"content":"<h4>On My Mind</h4>\n\n\n\n<p>On the eve of our Independence Day, I can’t help but think of our current political challenges. It doesn’t matter which side of the political aisle you walk. After all, the reality of our collective future doesn’t change, one way or the other. The challenges facing our society, economy and country don’t change with political affiliation.</p>\n\n\n\n<p>If not this decade, then soon there after, we will be heading into an unknown technological future. I’m not sure anyone knows if the current architecture of our social norms, rules and regulations is likely to survive a future where we humans have to coexist with what you can colloquially call aware machines. What happens when the core norms of current economic systems are eroded because fewer humans are needed for production? Is it time for a post-capitalist economic ideology?</p>\n\n\n\n<p>These are unanswered (and admittedly not fully formed) questions. Yet a version of this future is approaching — this is not dystopia, but rather a reality we are heading into. For this future, every country, not just America, needs a different kind of leadership — technologically adept, adaptable and more willing to go beyond established ideologies.</p>\n\n\n\n<p>Happy Fourth of July everyone!</p>\n\n\n\n<hr />\n\n\n\n<blockquote>\n<p>“So many people think that computing starts and ends with garages in California and dorm rooms in Massachusetts, and that’s not the case. It really is a highly dispersed story with many interesting places, and Utah is one of those early centers of creativity.”</p>\n\n\n\n<p>Andrew Meade McGee, curator of computing, Smithsonian’s National Museum of Air and Space</p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<h4>In The News<strong>: </strong></h4>\n\n\n\n<ul>\n<li>Figma, a fast-growing collaborative design startup that Adobe tried to acquire before being thwarted by regulators, found itself in trouble after launching an AI design tool that liberally borrowed from other people’s work. The AI Designer not only threatens to put its current customer base out of business but also undermined their efforts. <strong>Sebastiaan de With</strong>, co-creator of photography app Halide and a former Apple designer, explains that this isn’t Figma’s only shortcoming. [<a href=\"https://sdw.space/figma-ai-and-lost-jobs/\" target=\"_blank\">Design deserves better than Figma AI</a>]</li>\n\n\n\n<li>A few days ago, the Supreme Court voted 6-3 to overturn the 1984 decision in Chevron<a href=\"https://casetext.com/case/chevron-inc-v-natural-resources-defense-council-inc-american-iron-and-steel-institute-v-natural-resources-defense-council-inc-ruckelshaus-v-natural-resources-defense-council-inc\" target=\"_blank\"><strong><em> v. Natural Resources Defense Council, also known as the Chevron doctrine. This</em></strong></a> decision has significant implications for our country, society and technology. I am reading extensively to learn about this. Here are some informative articles I have read recently: <a href=\"https://www.scotusblog.com/2024/06/supreme-court-strikes-down-chevron-curtailing-power-of-federal-agencies/\" target=\"_blank\">The SCOTUSblog</a><a href=\"https://www.wileyconnect.com/how-the-supreme-courts-blockbuster-chevron-case-might-affect-the-future-of-tech-regulation\" target=\"_blank\">How the Decision Affects Technology’s Future </a><a href=\"https://www.thenewatlantis.com/publications/will-congress-take-the-w-on-chevron\" target=\"_blank\">What can and will Congress do?</a></li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>Great Reads</strong></h4>\n\n\n\n<ul>\n<li>The Washington Post is going through a major upheaval, right when it is most needed. A great investigation into the mess at the capital’s paper, and the incompetence of its owner, Jeff Bezos. [<a href=\"https://www.theatlantic.com/ideas/archive/2024/06/washington-post-jeff-bezos-william-lewis/678799/\" target=\"_blank\">The Atlantic</a>]</li>\n\n\n\n<li>I haven’t yet summarized, analyzed or ruminated on Apple’s AI announcement. It’s not as if there’s a shortage of hot takes, though. However, if you’re looking for a deep dive into Apple’s AI strategy, John Gruber does a great job in this overview. [<a href=\"https://daringfireball.net/2024/06/wwdc24_apple_intelligence\" target=\"_blank\">DaringFireball</a>]</li>\n\n\n\n<li>The chemistry nerd in me can’t help himself. I love reading about materials, elements and their stories. And there is nothing as magical as lithium, which has become one of the most sought-after (and scarcest) materials on the planet. Who knew that something that helped with mental illness and ovenproof casseroles would become key component of the EV revolution and our modern life? [<a href=\"https://read.readwise.io/new/read/01j1r898m7hegjg2wbew2p3e5j\" target=\"_blank\">Noema</a>]</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>I Read About It:</strong></h4>\n\n\n\n<ul>\n<li>Semaglutide madness has swept the nation. The numbers tell the story: The U.S. has 3,490 semaglutide clinics, with Florida, Texas and California having the most. Utah, New Hampshire and Florida have the most semaglutide clinics per capita. Miami, Tampa and New York City have the highest number of semaglutide clinics. [<a href=\"https://semaglutidesearch.com/studies/semaglutide-clinics/\" target=\"_blank\">Semaglutide Research</a>]</li>\n\n\n\n<li>AI is increasing emissions at Google. Since 2019, the company’s emissions have grown by48%, pushing it further from its 2030 goal of being carbon neutral. Microsoft’s emissions are up30%t as well, due to AI transition. [<a href=\"https://www.gstatic.com/gumdrop/sustainability/google-2024-environmental-report.pdf\" target=\"_blank\">Google Environmental Report</a>]</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<p><strong>What Are My Field Notes</strong>: Notable pieces of information gathered during Internet travels. Field notes record<strong> observations and activities encountered or participated in during fieldwork</strong>. Internet is my fieldwork. John Naughton inspired this format. Published on Wednesday and/or Sunday. </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"431e51bf96823d72000ee62b4e0093a5886c2b3dd170a8cdb082734e347332c8","category":"default"}