{"title":"the anatomy of a digital world","link":"https://keningzhu.com/journal/the-anatomy-of-a-digital-world","date":1725371114000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/13-the-anatomy-of-a-digital-world/id1731169431?i=1000668168774\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/0bdXmgR9aprUY5aGaYcuYM?si=5112abfedaf84e4e\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>this week, I’ll deconstruct and translate the concept of<strong> </strong>website as digital world into concrete design elements, and give you a poetic reframing of how to think about each piece of your website under the philosophy of world-building —  we’ll explore: </p><ul><li><p>the website as a body to inhabit</p></li><li><p>the atmosphere of a world: vision / brand / world logic </p></li><li><p>places &amp; destinations — homepage &amp; subpages</p></li><li><p>the garden for creative growing things — blog CMS </p></li><li><p>4 pathways of traveling — navigation &amp; links </p></li></ul><p><br />this episode is about the big-picture vision of imagining and building a website world, and making your creative home in a digital body.<br /></p><p><strong>additional resources</strong></p><p><a href=\"https://keningzhu.notion.site/House-on-the-Webs-Introduction-5c22f966677342b7b7250848a463cb03?pvs=4\" target=\"_blank\">house on the webs: introduction</a><br /><a href=\"https://keningzhu.notion.site/Day-0-Incubations-be27abc556164cd6b5399a44685cd99a?pvs=4\" target=\"_blank\">house on the webs: day 0 incubation work</a><br /><a href=\"https://keningzhu.com/journal/how-to-world-build-a-cyclical-guide\" target=\"_blank\">how to build a world: a cyclical guide</a><br /><a href=\"https://www.ways-of-seeing.com/\" target=\"_blank\">ways of seeing by john berger</a></p><p></p><p></p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bdf977db-a6d6-4c8e-9596-4082eca0f8ee/ep_13%E2%80%949.3.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction</h1><p>In this week's episode, I want to dissect, deconstruct, and map out the anatomy of a digital world.</p><p>I wanna take this big abstract idea of digital worlds and ground it in something tangible, elemental, and concrete.</p><p>So today I'll lay out the technical elements of a website, the brand, the site map or site pages, the blog CMS, the navigation and UX, and tell you my way of interpreting these elements in the metaphorical poetic language of world building.</p><p>For these last many episodes, I've been talking about world building as my principle practice and ethos for sharing your work on the internet.</p><p>I define world building as the practice of expressing your authentic whole creative self in all of its forms in a digital environment that you build and share.</p><p>This way of thinking about website as worlds is the approach and process that I bring to my private client work and to my teaching.</p><p>After many years of hibernation, I'm reopening my website creation course called \"<a href=\"https://keningzhu.com/house-on-the-webs\">House on the Webs</a>\" where I'll guide you on your own seven-day journey to build a website world of your own.</p><p>You can explore the intro lesson in day zero, which is about creative incubation for free linked in the show notes.</p><p>So let me give you an overview of the world anatomy we'll be covering today in four broad categories.</p><p>1. the atmosphere or essence.</p><p>2. the places within your world.</p><p>3. the garden of growing things.</p><p>4. the pathways and channels that form connected webs in between.</p><p><br /></p><h1>body as inhabiting  </h1><p>So I use the word anatomy in this episode title and I really like thinking about the body as world or a world as body because a body is something we inhabit.</p><p>A body is an environment, whether that's our own physical or energetic bodies or the body of the planet, of a city, of a home.</p><p>To think about world building as creating and inhabiting a body means to bring a spark and life energy to all the ways in which we show up online and how we show up with absolute presence.</p><p>It is to let our spirit and soul live in our digital expressions, to feel safe in that act of inhabiting.</p><p>And I feel like in this day and age, this is not easy.</p><p>It's hard to arrive at this place of being able to give your creativity, full permission to speak and to be seen, especially coming from the crowded cruise boat worlds of platforms.</p><p>My personal story is that I began relating to my website as a world, garden and home, back when I was living out of a suitcase, traveling for two years and feeling pretty disembodied, deeply ungrounded and very existentially alone.</p><p>I didn't read about world building or tech philosophy or even about digital gardening.</p><p>I just knew how I wanted or needed to relate to my website as an ongoing public creative practice to inhabit.</p><p>It took me years to live this and more years to distill my philosophy and values into a clear form.</p><p>So today I want to share the landscape of that form with you.<br /><br /></p><h1><span>layer 1 - atmosphere (vision &amp; brand)</span></h1><p>And let's begin with the first element, which is the most abstract part, that of ether, air and inner fire, the atmosphere or essence of a world.</p><p>So in business marketing or design terms, you can think of this as the vision, mission and the brand.</p><p>Branding is something that I'm really passionate about because it's really about distilling identity, the first astrological house of the self, the I.</p><p>Who am I?</p><p>Who are you?</p><p>What, who is, what is this world?</p><p>What is the soul, the core, the essence of this world?</p><p>I'm describing this, all of this as the atmosphere because whenever you enter an environment, you can sense the atmosphere, energy and feeling, even if you can't pinpoint it down to any one thing.</p><p>Many things together create a sense, a mood or tone.</p><p>In the body of a creative world, I had to think of this as the blood.</p><p>This is the blood that flows through all of the organs.</p><p>So what makes up this essence, atmosphere or blood?</p><p>I'm breaking it down into three subparts.</p><p>One is the vision, two is the visual identity or branding and three is the world ethos or logic.</p><p>So let's explore them.<br /></p><h1>vision </h1><p>For me, all worlds begin with an urge, an inkling, a sort of creative spark within me that says, I want a container for this, for this theme or this topic or for me or for how I wanna show up in this particular way.</p><p>And it takes work to slowly peel back the layers and longings to clarify and distill this vision.</p><p>But once you have, it's like finding your inner fire.</p><p>It's like tending to the embers of a creative fuel source at the very, very center of this planet.</p><p>It's the heart, it's the compass.</p><p>Vision is what gives purpose, direction and blood to all the creative efforts and energies you're trying to summon and direct.</p><p>When I think about vision, the first thing I ask my clients and students that I ask myself is, why do you want this world to exist?</p><p>Which dreams or ideas or longings or desires, which visions do you want to create space for?</p><p>Because the act of building a world is about making space.</p><p>It's making space on the internet, yes, but more than that, it's making space in your own psyche, in your own life.</p><p>And when you do that, you make space in the connected, collective psyche of the world.</p><p>The process of distilling and clarifying your vision is not something you do once and be done with.</p><p>It's a continual process of evolution, of listening.</p><p>It begins with incubating your vision and letting it ripen on its own in the inner environment of your creative psyche.</p><p>So let's talk about the second element of atmosphere.<br /></p><h1>visual language </h1><p>That is the visual language.</p><p>Visual language or the visual brand identity sounds like it's about having polished design packaging.</p><p>But this isn't really how I like to think about or approach branding.</p><p>Branding for me always comes from distillation of what's deep within.</p><p>It comes from translating a world's essence, vision, and purpose into visual language.</p><p>And the four primary elements of a visual language are the logo, which I think about as like having a tattoo on the face of your world body, the color palette, to evoke the mood, the typography as an expression of your tone of voice, and visual elements like graphics, photography, motifs, or art.</p><p>These could be as minimalist as a single color choice, one typeface, and a deliberate absence of visuals.</p><p>Visual identity is first and foremost a feeling, mood, and tone.</p><p>It feels like a scent in the air or the cinematography of a world.</p><p>It's the subtext, but it's also everywhere.</p><p>And there's a quote I think of whenever I think about branding or visual creation in general, and that's from John Berger's ways of seeing.</p><p>Quote, \"Seeing comes before words,\" unquote.</p><p>As in, the visual comes before the linguistic.</p><p>The way your words and images look on a page changes how they're experienced.</p><p>So visual essence is about making this environment feel like you.</p><p>The last part of the atmosphere or essence that I want to talk about is world ethos or logic.<br /></p><h1>world ethos / logic </h1><p>I think this is very much so in fantasy and sci-fi worlds that there's rich histories, backstories, and mythologies to a world.</p><p>Maybe there's rules to how a world works.</p><p>The plants and animals and habitats, and even the weather and gravity could feel different on different worlds.</p><p>In creative world building terms, I describe the ethos logic as the underlying principles, values, and meaning-making that form the psychological fabric of the world.</p><p>These could be reoccurring themes or visual motifs.</p><p>It could be ways of organizing and presenting ideas.</p><p>It could be styling decisions that dictate very concrete things like layout, spacing, or capitalization stylings.</p><p>World ethos and logic begins with asking, how does this world work?</p><p>How does this world want you to feel in it and interact with it?</p><p>What does this world value or think is important?</p><p>The answers to these questions are often something that emerges slowly over time.</p><p>The world ethos or logic is always in service of the vision and works with the visual language to weave a sense of cohesiveness.</p><p>Now that I've talked about the first layer of world building, the atmosphere comprised of three elements, vision, visual language, and world logic or ethos, let's come down to earth and ground in the second layer, places.<br /></p><h1><span>layer 2 - places &amp; destinations (site pages)</span></h1><p>In simple web design terms, places or spaces is simply the structure of web pages that make up a website.</p><p>In my own poetic metaphorical universe, I think of these as destinations on a map, collections of form that hold the creations.</p><p>And if a world were a body, this would be the organs, the body parts, each serving a different purpose.</p><p>Let me break it down into two very general types of pages.</p><h1><br />homepage / entryway</h1><p>Number one is the entryway, otherwise known as the homepage.</p><p>So when you arrive at the threshold of a world, what do you see?</p><p>What do you feel?</p><p>What do you experience?</p><p>In the marketing world, the homepage is often seen as like a prime conversion opportunity.</p><p>And that's why the homepage of most websites have been flattened down into a brochure as an opportunity to capture leads.</p><p>It asks the question, how can I persuade or sell myself in 30 seconds or less?</p><p>How can I not lose this traffic?</p><p>But in a world building philosophy, a door is a portal, is a threshold.</p><p>The purpose of an entryway is not to persuade or sell something, it's to guide you to explore this place slowly.</p><p>Or if you're a returning visitor to get you efficiently to where you want to go.</p><p>So let's reframe the door as not just a flat two dimensional border, but instead as an entryway space in itself.</p><p>For example, maybe your world is like a castle and you've arrived on the homepage as a spacious welcome hall and you see many doors before you leading you elsewhere.</p><p>In my own imaginations, I often imagine being at the beginning of a long hike where you're ready to set off on a journey and then you look at the map and you're like, okay, well, there's seven different paths I could go on, which one do I take?</p><p>I find that the internet is a choose your own adventure kind of trail.</p><p>When you design the homepage, you decide what kinds of journeys you want to take your visitors on and what are the different paths that you want to draw their attention to.</p><p>Yet another way of thinking about the homepage is imagining it as a menu of options.</p><p>If your website world were a menu at a restaurant, what would be the appetizers, the main course and the desserts or drinks?</p><p>This metaphor asks the question, how do you want to nourish yourself, your visitors and your world?</p><p>Now that I've explained the homepage as space, let's talk about all of the other sub pages that live beneath the homepage.</p><h1><br />subpages / rooms </h1><p>If a website were a house, the sub pages would be the rooms of a house.</p><p>If your website were a world, the sub pages would be the different lands or destinations, the places marked X on the map.</p><p>And I think there's something exciting about this because there's all these places that are unmarked that form the liminal space between two rooms or between two places.</p><p>So there's always potentiality for new destinations to emerge from this world.</p><p>That is to say, you can always build a new page.</p><p>It's like Harry Potter, where the staircases are always shifting and moving and the new room of requirements are being revealed as they are required.</p><p>Sub pages serve as collections, rooms that store things in your world organized in a particular and purposeful way for you to use.</p><p>And of course there can be rooms nested within rooms, like nesting eggs or Russian dolls, except overlapping because this is the internet and each room can be in infinite places at once.</p><p>Rooms can be structured by theme or function or how you interact with them.</p><p>I remember when I was at the beginning of my travels, I spent four months in a rural Japan with a close friend.</p><p>Because we were in confinement, we were talking about what a house needs to feel complete.</p><p>Here's what I landed on.</p><p>A temple of art, a garden of ideas, a library of writings and inspirations, a home of the self and a window into other worlds.</p><p>These days I relate to my website more as the oceanic ecosystem, as islands and bodies of water, but the ethos still remains.</p><p>When you think about places within a world, think about what your world wants to contain and to express, to feel whole.</p><p>If your website were an adventure map, how would you draw it?</p><p>Now that we've explored the atmosphere of a world as well as its spaces and places, let's move even further down to earth.</p><p>Let's go to the level of dirt and soil, that is the garden.</p><h1><span><br />layer 3 - garden (blog cms)</span></h1><p>In website design terms, the garden is a blog CMS or content management system.</p><p>This is a functional digital space that holds updated collections of posts organized by tags and categories.</p><p>In the world building universe, the garden is where you plant your creative seeds.</p><p>It is the birthplace of everything that grows in your world.</p><p>And the website where a body, the garden and its growing things are the individual cells of a body that make up your organs and move through your bloodstream.</p><p>I spoke earlier about how the functional purpose of a world is for collection.</p><p>And as you're thinking about growing your world, I would start with the question, what do you long to create, collect and make space for?</p><p>And I believe that a garden is meant to be multi-form.</p><p>If you're listening to this podcast, you're probably not a content marketing farm creating one kind of crop with the help of AI and selling it to advertisers for profit.</p><p>World building is about full dimensional self-expression.</p><p>Therefore it's about cultivating creative biodiversity on the internet.</p><p>In concrete technical design terms, I'm saying that instead of building separate blogs or portfolio galleries for your creative forms, organize everything under one master blog CMS.</p><p>Then use tags and categories to organize them where they'll be eventually curated into the destinations or sub pages of your website.</p><p>Focusing on planting all of your seeds into one garden is what will allow you to stop worrying about how they'll fit and instead focus on the creation itself.</p><p>There's so much more to say here, but I'll be exploring and unpacking those two processes of creation versus curation in next week's episode.</p><h1><span><br /><br />layer 4 - paths &amp; channels (navigation)</span></h1><p>The last part in the anatomy of a digital world is traveling through it, the paths and channels that move you from one space to another.</p><p>In web design terms, this is called navigation or how a visitor moves through and interacts with a space.</p><p>In world building terms, if the garden, places and destinations are earth, then I think about traveling channels as the element of water or air.</p><p>If a website were a body, I'd call this the veins that connect the different organs which pump the blood from organ to organ.</p><p>This is the labyrinth of pathways, tunnels and doors that connect different parts of your world or your garden or your house in this interconnected web.</p><p>So let's explore it.</p><p>And first, I wanna start with something very concrete.</p><p><strong>There are four primary ways to travel within a website world.</strong></p><h1><br />top navigation </h1><p>Number one is the top navigation bar, the header or literally head of the web body.</p><p>This is like having buttons on your face that you can press anytime you want to be somewhere fast.</p><p>It's like on Google maps, you define the addresses that are home, work, school.</p><p>It's not like everything is a heart or a favorite.</p><p>And of course you can design this any way you want, but my personal philosophy is that each link in your top navigation bar must serve an essential, existential purpose to your website as a whole.</p><p>It could be divided into three functionalities.</p><p>One, explorations, a shortcut to browse your public gardens, two, offerings, a shortcut to your paid inner labyrinth and three, about, a shortcut to read context about you or this space.</p><p>Okay, so next let's move down to the bottom footer.</p><h1><br />bottom footer</h1><p>Literally this is the foot or tail end of a website.</p><p>And this is 100% my personal sensibility, but I'm a big fan of the footer.</p><p>I enjoy indexes, tables of contents, the back index of a book, the text-based map.</p><p>It's a place where you have room to be a little bit comprehensive and thorough, which I like.</p><p>Of course, you can also use the footer to replace the function of the top navigation and just include the most important shortcuts.</p><p>The footer is generally where your newsletter signups would go.</p><p>I think of the footer as kind of like the end of a story where you give a little guidance as to where to go next, or it's like having a pocket map while you're traveling.</p><p>The last two ways of traveling are within the body of a website.</p><p></p><h1>on-page visual elements</h1><p>First is through the visual elements and buttons.</p><p>These are the images, cards, graphics, any visual element that is leading you to another page, moving you through one space to another.</p><p>They serve the function of on-page doors.</p><h1><br />body text links </h1><p>And last but not least, the fourth way of traveling is through the body text links.</p><p>If the top and bottom navigations provide the primary structural layout of a world and the body visual elements like buttons, posters, cards, images, show main paths that connect with each other, then I think about the body links as like tiny side paths or like the back door, the alleyways, the meandering little roads, which whenever I see one of those in the real world, I just can't resist but walk down it.</p><p>It's non-intrusive.</p><p>It's just a side thought, a tangent.</p><p>It's designed for marginal daydreaming.</p><p>It's like, oh yeah, that reminds me of this other thing.</p><p>And I love hyperlinks because it works like the mind.</p><p>It connects threads of ideas, thoughts, memories, like the tiny, almost invisible threads of a spider web.</p><p>It allows you to keep moving and fall further down the rabbit hole.</p><p>Though, of course, I also think it's possible to do too much in a way that feels overwhelming or desensitizing or even a little bit annoying.</p><p>I think it really depends on how you use the in-body links.</p><p>The last thing about website world anatomy I'll offer my thoughts on is the skeletal structure.<br /></p><h1>skeletal structure</h1><p>I find that in web design, whether I'm redesigning my own website or for a client, thinking about structure can be the most exciting and tricky part because it's really asking an existential question.</p><p>What forms the skeleton of your internet body?</p><p>What is the spine of your world?</p><p>How do you wanna organize how others experience and move through it?</p><p>I think a typical way of approaching structure is the brochure website template of here's my about page, here's my portfolio, here's my contact me, here's my blog.</p><p>But in a world, of course, there are no rules, only possibilities.</p><p>You get to decide your structure.</p><p>I know that this question can feel gigantic, like asking what are the core themes of your creative practice?</p><p>For me, structure always feels a bit aspirational.</p><p>It's the opening and forming of containers to hold more of what I want in my life and in my world.</p><p>Not forever, of course.</p><p>Only for this next phase.</p><p>But if you're just beginning your world, I would start with something extremely minimal.</p><p>I wouldn't worry too much about the structure at first, just like I wouldn't overthink your world ethos logic, unless it feels inspiring and exciting and expansive.</p><p>Because it's almost something that exists beyond the thinking mind and more from the intuitive subconscious.</p><p>I find that if you just are immersed in the practice of living and inhabiting your world, you will feel its bones shift and evolve over time.</p><p>Perhaps the structure will rise from the ocean of your psyche, like the contours of an island.</p><h1><br /><br />closing thoughts</h1><p>In closing this episode, I'll reiterate the primary four parts of a creative world.</p><p>One is the atmosphere, vision and brand, and world logic or ethos that form the essence of your world.</p><p>Two are the places and destinations, including homepage and sub pages that curate and organize your creative flow.</p><p>Three is the garden or the blog CMS that holds your creative flow.</p><p>Four is the paths, navigations, links and user interactions that allows you and visitors to travel.</p><p>So this episode looked at the big picture universe view of world building, but in next week's episode, I'll bring it back down to lived embodied practice and share some very simple guidelines on how to inhabit a world, tend to it and grow it slowly over time.</p><p>If you'd like more focused step-by-step guidance on building a digital world of your own, you can explore \"House on the Webs\" or if you're curious about working with me one-on-one, you can always send me an email.</p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"43bc54debe74052c34577c65cd4c7e155141f677cac5293bfd769684dc453a46","category":"Sites"}