{"title":"“Just tell me what to do”: compressing knowledge into directives","link":"https://sive.rs/2do","date":1440806400000,"content":"<h3>\nInternalizing books\n</h3>\n<p>\nWanting to be successful, I’ve always read every book I thought could help.\nEven if a book had just one useful insight, it was worth the $20 and my time spent reading and thinking.\n</p><p>\nA few years ago, I realized I was forgetting the lessons I’d learned from past books.\nSo I started taking detailed notes while reading, saving every important idea.\nI wanted to permanently remember what I’d learned, and act on it.\n</p><p>\nI saved these notes as text files and put them on my phone, so I could review them often.\nNow I also share them on my site at <a href=\"https://sive.rs/book\">sive.rs/book</a>.\nThere are over 200 books there now, with my top recommendations at the top. Enjoy.\n</p>\n<h3>\n“Just tell me what to do.”\n</h3>\n<p>\nWhen I’d tell my friends about a great book I’d just read, they didn’t want to read it.\nThey didn’t want 300 pages of anecdotes, explanations, and supporting arguments.\nThey’d say, “Just tell me what to do.”\n</p><p>\nI realized that for some things, I also don’t want the full 20-hour explanation.\nI’d be happier with just the conclusions — the actions — the directives.\n</p><p>\nFor example, I’d heard great things about Michael Pollan’s book “<a href=\"http://michaelpollan.com/books/the-omnivores-dilemma/\">The Omnivore’s Dilemma</a>”.\nBut 450 pages about the history of food?  Eh...\n</p><p>\nThen two years later he wrote “<a href=\"http://michaelpollan.com/books/in-defense-of-food/\">In Defense of Food</a>”.\nIt sounded like a tighter argument at 250 pages, but... eh....\n</p><p>\nThen he wrote “<a href=\"http://michaelpollan.com/books/food-rules/\">Food Rules</a>”, a tiny little book that <strong>compresses all of his advice into 64 sentences</strong>.\n<a href=\"https://sive.rs/hellyeah\">Hell yeah!</a>\n</p><p>\nIt takes only 30 minutes to read, with succinct advice like “Eat only foods that will eventually rot.” and “Avoid food products that make health claims.”\nEach point has just a few sentences of explanation.\nThat’s all I needed, because I already trust him.\nBut you can reference his previous book if you want the supporting evidence behind the advice.\n</p><p>\nCompressing wisdom into directives — (“Do <em>this</em>.”) — is so valuable, but so rarely done.\nIt feels arrogant and imperial to tell people what to do.\nWho am I to order people around?\nOn the other hand, who am I <em>not</em> to?\nIt’s useful to people, so do it.\n</p><p>\nI’m humble.\nI don’t expect anyone to actually do what I say.\nIt’s just a succinct and powerful way to communicate an idea.\nFocus on the action.\n</p>\n<h3>\nCompressing all this wisdom into directives\n</h3>\n<p>\nSo I spent the last few months going through all my notes for 220 books.\n</p><p>\nFirst I extracted just the most essential and counterintuitive points.\n</p><p>\nThen the hardest part was turning observations into advice.\n</p><p>\nFor example, this observation —\n</p><p><em>\n“Behavioral psychologists Stephen M. Garcia and Avishalom Tor showed that merely knowing there are more competitors in a competition decreases our performance.”\n</em></p><p>\n— turns into this advice:\n</p><p><em>\n“Avoid awareness of competitors.”\n</em></p><p>\nBut what about this observation?\n</p><p><em>\n“Half a group was shown that extraverts are more successful.  Other half shown that introverts are more successful.  Then when asked to recall events from their past to help determine which they were, they remembered just the events that support the successful group they were told.”\n</em></p><p>\nHow would you turn that into advice?\n</p>\n<h3>\nThe result?\n</h3>\n<p>\nI’ve now got hundreds of these wise directives.\n</p><p>\nI tried turning them into a 30-minute talk for a conference, but it was a disaster.\nFun for the first three minutes, then overwhelming.\nA 30-minute TO-DO list that would take a lifetime to complete.\n</p><p>\n<a href=\"https://sive.rs/d1\">I list many of them at sive.rs/d1</a>, but I think a list is not as useful.\nI prefer presenting <a href=\"https://sive.rs/1idea\">one idea at a time</a>.\n</p><p>\nMaybe I’ll turn them into a book.\n(I like the title “Do This”.)\n</p><p>\n<strong>Any other ideas?</strong>\n</p>\n<img src=\"/images/bonsai.jpg\" />\n<div>(Bonsai photo by <a href=\"https://www.flickr.com/photos/grufnik/408948777\">Grufnik</a>.)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"43cbf0f06ff452d4c2ad9fca0915ac03113935d495a4eaeb22b3f114dfe4fcfd","category":"default"}