{"title":"Kafka on Friendship and the Art of Reconnection","link":"https://www.themarginalian.org/2024/11/17/kafka-on-friendship/","date":1731871233000,"content":"<p><a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"494\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?fit=320%2C494&amp;ssl=1\" alt=\"Kafka on Friendship and the Art of Reconnection\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?w=777&amp;ssl=1 777w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=320%2C494&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=600%2C927&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=768%2C1186&amp;ssl=1 768w\" /></a></p><p>Among <a href=\"https://www.themarginalian.org/2015/08/24/simone-weil-friendship-separation/\">the paradoxes of friendship</a> is this: All friendships of depth and durability are based on a profound knowledge of each other, of the soul beneath the costume of personality — that lovely Celtic notion of <a href=\"https://www.themarginalian.org/2015/08/12/anam-cara-john-o-donohue-soul-friend/\"><em>anam cara</em></a>. We bring this knowledge, this  mutual understanding, to every interaction with a true friend — that is what makes friendship satisfying, steadying, safe; it is what makes it, in Kahlil Gibran’s immortal words, a <a href=\"https://www.themarginalian.org/2019/06/20/kahlil-gibran-prophet-friendship/\">“field which you sow with love and reap with thanksgiving.”</a> And yet, if we are alive enough, each time we meet we are meeting for the first time, getting to know each other afresh, for only the self that goes on changing goes on living. </p>\n<p>A true friend blesses both the abiding and the possible in us. </p>\n<p>Another paradox: It is often the loneliest people, those most riven by self-doubt and most unsure of where they belong, that make the most steadfast and salutary friends once they break through the barriers of insecurity and fear to allow connection. Because for them the gift of being understood is especially hard-earned, they give it back redoubled with gratitude.</p>\n<p><strong>Franz Kafka</strong> (July 3, 1883–June 3, 1924) was one such person. </p>\n<figure><a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/06/franzkafka1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Franz Kafka</figcaption></figure>\n<p>“Am I broken?” he asks on the pages of <a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><strong><em>Diaries: 1910–1923</em></strong></a> (<a href=\"https://search.worldcat.org/title/183927241\" target=\"_blank\"><em>public library</em></a>) — the journal in which he <a href=\"https://www.themarginalian.org/2024/10/20/kafka-diaries-self-doubt/\">grappled so desperately with self-doubt</a> — and answers himself: “Almost nothing but hope speaks against it.” When his hope dwindled, he declared himself “unfit for friendship,” doubted whether friendship is “even possible” for someone as strange and solitary as himself, and yet he yearned for it: “I am incapable, alone, of bearing the assault of my own life, the demands of my own person.” </p>\n<p>In a particularly dispirited diary entry from the last year of his thirties, which was also one of the last years of his life, he declares himself “forsaken” and writes:</p>\n<blockquote><p>[I am] incapable of striking up a friendship with anyone, incapable of tolerating a friendship, at bottom full of endless astonishment when I see a group of people cheerfully assembled together.</p></blockquote>\n<p>It takes just one unwavering friend — a friend to the soul beneath the self that does the doubting — to quietly and consistently revise these punishing stories we tell ourselves. All along, through all the years of all this punishing self-talk, Kafka’s childhood friend Max Brod had been the greatest champion of his talent, never losing faith in his friend or in the friendship. Though Kafka frequently withdrew into his self-elected isolation, Max never withdrew his love. </p>\n<figure><a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/05/lionandbird_dubuc4.jpg?w=680&amp;ssl=1\" /></a><figcaption>Art by Marianne Dubuc from <a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><em>The Lion and the Bird</em></a> — a tender illustrated story about loyalty and the gift of friendship</figcaption></figure>\n<p>With time, Kafka came to understand that in every friendship, life happens and interrupts the continuity of connection, making it difficult to reconnect — difficult but infinitely important, for in moving through the difficulty of discontinuity, in the repair of the rupture, the deeper substratum of trust and durability is laid down and reaffirmed again and again. </p>\n<p>In another diary entry, he writes:</p>\n<blockquote><p>Since a friendship without interruption of one’s daily life is unthinkable, a great many of its manifestations are blown away time and again, even if its core remains undamaged. From the undamaged core they are formed anew, but as every such formation requires time, and not everything that is expected succeeds, one can never, even aside from the change in one’s personal moods, pick up again where one left off last time. Out of this, in friendships that have a deep foundation, an uneasiness must arise before every fresh meeting which need not be so great that it is felt as such, but which can disturb one’s conversation and behaviour to such a degree that one is consciously astonished, especially as one is not aware of, or cannot believe, the reason for it.</p></blockquote>\n<p>Like all deep and complex people, Kafka was not fully aware of the reasons for his frequent withdrawals. But some part of him hoped, trusted that true friendship withstands the elasticity of presence. When he finally realized that the tuberculosis he had been living with for years was going to take his life, he left all his papers and manuscripts to Max, instructing him to destroy everything. In an act of love — refusing to enable a friend’s damaging self-doubt is always an act of love — Max disobeyed, instead preserving Kafka’s writing for posterity, publishing a tender biography of his friend, and immortalizing their friendship in his 1928 novel <em>The Kingdom of Love</em>.</p>\n<figure><a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=650%2C472&amp;ssl=1\" width=\"650\" height=\"472\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?w=650&amp;ssl=1 650w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=240%2C174&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=320%2C232&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=600%2C436&amp;ssl=1 600w\" /></a><figcaption>Illustration by Maurice Sendak from <a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\">a vintage ode to friendship</a> by Janice May Udry</figcaption></figure>\n<p>Complement with <a href=\"https://www.themarginalian.org/2024/10/17/comet-star/\"><em>Comet &amp; Star</em></a> — a cosmic fable about the rhythms and consolations of friendship — and <a href=\"https://www.themarginalian.org/2023/03/23/thoreau-friendship/\">an introvert’s guide to friendship</a> from Thoreau, another strange and solitary person riven by self-doubt, then revisit Kafka on <a href=\"https://www.themarginalian.org/2016/04/18/conversations-with-kafka-taoism-truth/\">the nature of reality</a>, <a href=\"https://www.themarginalian.org/2015/10/22/conversations-with-kafka-love-patience/\">the power of patience</a>, and <a href=\"https://www.themarginalian.org/2024/10/20/kafka-diaries-self-doubt/\">the four psychological hindrances that keep the talented from manifesting their talent</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"44222b83d4f360ae54ed2cf502948b2c4f3416e2d6c584782a8d37dbe6126671","category":"Sites"}