{"title":"Understanding Vietnam","link":"https://sive.rs/vn14","date":1390262400000,"content":"<p><em>\nThis essay is by Jeremy Wellard, who is based in Hanoi.\nThis is the first chapter of my new <a href=\"https://woodegg.com/vn\">Vietnam 2014 book</a>.\n</em></p>\n<hr />\n<p>\nThe only thing most people know of Vietnam is the Vietnam War.\nIn Vietnam, they call it the American War, and it’s just old history.\nThere is so much more to this youthful, thriving country.\n</p>\n<p>\nVietnam has long been considered the cultural and artistic heart of Asia, and the Vietnamese are the “Italians of Asia”.\nHighly social and heart-driven, with a penchant for drama and performance they are quick to raise their voices to sway a discussion, but equally quick to laugh off a misunderstanding.\nOne of the greatest strengths of Vietnamese is their ability to find joy in everyday moments.\nWhether laboring in the fields or rushing through busy urban lives, they still find any excuse to put down their tools and laugh in conversation over a cup of tea.\n</p>\n<p>\nSince opening up to the world in the late 1980s, the Vietnamese have been racing ahead at full speed.\nYears of struggle under a system of collective production left people ready to enthusiastically embrace capitalist ideals.\nSince the late 1990s, Vietnam has had one of the highest economic growth rates in the world.\nThis rapid growth created a highly entrepreneurial environment where everyone seems to have a second or third business on the side.\n</p>\n<p>\nVietnam is the world’s only “Socialist-Oriented Market Economy”.\nThis means the government maintains a large ownership and control of major companies, while small and medium businesses are left to develop freely.\n</p>\n<p>\nForget any notions of the frugal communist lifestyle.\nWealth and possessions are flaunted as signs of success.\nPeople will spend many months’ salary for a status symbol like an iPhone, fancy motorbike, or designer clothes.\n</p>\n<p>\nYet there’s a deep-seated habit of saving money wherever possible.\nThis can be seen in shops, where the air-conditioning is turned off until a customer walks in, or in the recycling culture where even used plastic bags have value.\nVietnamese take great pride in their bargaining skills.\nWhen a new purchase is shown to friends, someone will immediately ask how much they paid for it.\nAbility to negotiate a good price demonstrates not just savvy but strong relationships.\n</p>\n<p>\nTrading on relationships is key.\nA popular saying is, “First your family, second your friends, third comes money.”\nThis means people will always look out for family and friends, but for outsiders their help comes at a price.\n</p>\n<p>\nStrong family networks define the career and social lives of many Vietnamese.\nThe government strongly recommends families have only two children, and most do.\nThere are highly traditional expectations regarding responsibility to family, education, career choices, gender roles, marriage, and children.\nNewly wed couples live at the home of the husband’s parents until they can afford to buy their own house.\nThree generations often live together under one roof, and grandparents play an important role in providing childcare.\nBecause of this in-home care, mothers usually return to work much sooner than the six months of maternity leave given by Vietnam’s labor laws, which strongly favor worker’s rights.\n</p>\n<p>\nIn Vietnam, the year and date of a person’s birth is very important.\nIt influences their whole life, including when they are allowed to marry, open a business, hold important meetings and have children.\nSocial interactions and forms of address are determined by age, so upon meeting a new person, one of the first questions Vietnamese will ask is what year they were born.\n</p>\n<p>\nBecause of a strongly collective past, where standing out from the crowd was potentially dangerous, new ideas may be regarded with caution.\nBut once the viability of an idea is demonstrated, acceptance, imitation and adaptation rapidly follow.\nThis tendency to follow others can lead Vietnamese to seem unoriginal in their thinking.\nBut in fact their ability to quickly see an opportunity and willingness to capitalize on it creates a very dynamic and exciting environment.\n</p>\n<p>\nDespite the collective past, upwardly mobile Vietnamese have fully embraced the concept that the individual who works smarter and has more relationships can have more than their neighbor.\nA new “me-first” culture is rising.\nBut there still remains a highly structured society underneath.\nIn many ways, Vietnam is perhaps both the most-collective and least-collective of the Asian cultures.\n</p>\n<p>\nVietnamese have been living with occupation, change and uncertainty for thousands of years and have developed community-based social systems that preserve order and personal freedom at a micro level, regardless of macro changes.\nAs the local saying goes, “The rules of the village are stronger than the rules of the king.”\n</p>\n<p>\nUnlike common misconceptions regarding Communist states, Vietnam is actually a democracy, and all citizens have the right to vote every three years.\nAlthough they can only choose candidates from one political party, within this party there are factions with very different viewpoints.\nIndividuals have a lot of freedom in most areas of everyday life.\nOverall though, they tend to avoid openly discussing political issues.\nSpeaking against the government, protesting high-level corruption, or promoting other political systems can incur severe punishments for locals and expulsion for foreigners.\n</p>\n<p>\nVietnam is chaotic, but far from lawless.\nThe country has an advanced legal system.\nBut there are many ways in which rules can seem more like guidelines.\nA “no” can become a “yes” with the right timing and persuasion.\nThis can seem daunting, but those who understand the system are great at navigating its complexities.\nThis is one of the main reasons foreign business people need a trusted local partner or good lawyer.\n</p>\n<p>\nForeigners are surprised that sociopolitical tensions are actually highest with China, rather than the United States, France, or Japan.\nVietnam is increasingly wary of China’s growing power and territorial ambitions.\nThis has caused a strong wave of anti-China sentiment where Chinese products, particularly food, are considered poor quality and unhealthy.\nIt has also driven a celebration of products “Made in Vietnam” and is combining with a growing awareness of health and safety to birth a clean-food movement.\n</p>\n<p>\nThe only thing constant in Vietnam is change.\nTrends come and go, businesses open and close, and construction is a constant.\nThe pervasive dust and noise are the sweat and tears of progress.\nBut underneath this turmoil, there is a country that remains deeply Vietnamese, and people who are proud, ambitious, and happy to be open to a world of opportunities.\n</p>\n<a href=\"https://woodegg.com/vn\"><img src=\"https://woodegg.com/images/we14/we14cover-VN-200.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"4432cd1b0436c495b9d89394c3b60d2525af4dc0b81e47e261e31fc8d12e9625","category":"default"}