{"title":"Here’s how to live: Do nothing.","link":"https://sive.rs/htl04","date":1638576000000,"content":"<p>\nThe ten commandments said what not to do.\n<br />\nMost of being a good person is not doing bad.\n<br />\nDon’t be cruel or selfish.\n<br />\nDon’t lie or steal.\n<br />\nJust do no harm.\n</p><p>\nPeople always think they need to do something.\n<br />\nOne action creates a problem, fixed by another action, so they react and counter-act, creating more problems to fix.\n<br />\nAll of this can be avoided.\n<br />\nAll actions are optional.\n<br />\nYou don’t have to act or react.\n<br />\nYou don’t have to do anything.\n</p><p>\nCriminals justify their crimes by saying they were in a crisis and had to do something.\n<br />\nPeople mistakenly say yes to work, people, and places they don’t like, then need to escape to get away from their mistakes.\n<br />\nPeople make bad decisions because they felt they had to decide.\n<br />\nIt would have been wiser to do nothing.\n</p><p>\nPeople destroy relationships with an angry over-reaction.\n<br />\nThe metaphors for “blowing off steam” or “venting” are wrong.\n<br />\nExpressing your anger doesn’t relieve it.\n<br />\nIt makes you angrier.\n</p><p>\nActions often have the opposite of the intended result.\n<br />\nPeople who try too hard to be liked are annoying.\n<br />\nPeople who try too hard to be attractive are repulsive.\n<br />\nPeople who try too hard to be enlightened are self-centered.\n<br />\nPeople who try too hard to be happy are miserable.\n</p><p>\nSo the best way to live is to do nothing.\n<br />\nStop all the thinking and doing.\n<br />\nBe still and silent.\n<br />\nNo actions and no reactions.\n<br />\nNo judgments and no conclusions.\n<br />\nNo craving and no fixing.\n</p><p>\nChange your need to change things.\n<br />\nIn your most peaceful moments, your mind is quiet.\n<br />\nYou’re not thinking you should be doing anything else.\n<br />\nWhen everything feels perfect, you say, “I wouldn’t change a thing.”\n<br />\nSo, live your whole life in this mindset.\n</p><p>\nDon’t hope.\n<br />\nHope is wanting things to be different than they are.\n<br />\nWanting to change yourself is self-loathing.\n<br />\nThere’s no deeper happiness than wanting nothing.\n<br />\nDesire is the opposite of peace.\n</p><p>\nMost of what people say and do is unnecessary.\n<br />\nMost talk is just noise.\n<br />\nThe English word “noise” comes from “nausea”.\n<br />\nSay nothing unless it must be said.\n</p><p>\nPeople will appreciate your silence, and know that when you speak, it must be important.\n<br />\nShallow rivers are noisy.\n<br />\nDeep lakes are silent.\n</p><p>\nSilence is precious.\n<br />\nSilence is the one thing that all religions have in common.\n<br />\nSilence is the only way to hear quiet wisdom.\n</p><p>\nMost trouble is caused by action.\n<br />\nNo action, no trouble.\n</p><p>\nMost actions are a pursuit of emotions.\n<br />\nYou think you want to take action or own a thing.\n<br />\nBut what you really want is the emotion you think it’ll bring.\n</p><p>\nSkip the actions.\n<br />\nGo straight for the emotion.\n<br />\nPractice feeling emotions intentionally, instead of using actions to create them.\n<br />\nYou don’t need marriage to feel security.\n<br />\nMarriage doesn’t make you secure.\n<br />\nYou don’t need recognition to feel pride.\n<br />\nRecognition doesn’t give you pride.\n<br />\nYou don’t need a beach to feel tranquility.\n<br />\nPlaces don’t make emotions.\n<br />\nYou do.\n</p><p>\nYour whole experience of life is in your mind.\n<br />\nFocus on your internal world, not external world.\n</p><p>\nWhen a problem is bothering you, it feels like you need to do something about it.\n<br />\nInstead, identify what belief is really the source of your trouble.\n<br />\nReplace that belief with one that doesn’t bother you.\n<br />\nThen the problem is solved.\n<br />\nMost problems are really just situations.\n</p><p>\nYou make decisions to feel forward motion.\n<br />\nBut it’s a treadmill that takes you nowhere.\n<br />\nWhen someone asks you to decide, just refuse.\n<br />\nThe longer you go without deciding, the more information is revealed.\n<br />\nEventually, the choice is obvious and made without an agonizing decision.\n</p><p>\nJust because somebody asked you a question doesn’t mean you have to answer it.\n<br />\nDramatic people are fueled by reactions.\n<br />\nWhen you stop reacting, they go away.\n</p><p>\nSame goes for yourself.\n<br />\nYour emotions insist they need you to respond.\n<br />\nWhen you ignore the urges, they go away too.\n</p><p>\nObserve yourself.\n<br />\nYour own mind is the best laboratory.\n<br />\nIt’s also the most private and peaceful place to work.\n</p><p>\nTo be wise, shut out all media and opinions.\n<br />\nNo news, no gossip, no entertainment.\n<br />\nMost of it is not worth knowing.\n</p><p>\nJunk may reach your senses, but don’t let it reach your mind.\n<br />\nDon’t accept the false stories people tell.\n<br />\nThings are neither good nor bad — they’re as neutral as a rock.\n<br />\nWhen people give opinions, add a question mark.\n<br />\nIf they say, “Immigration is bad,” change it to, “Immigration is bad?”\n<br />\nLet the questions drift away, unanswered.\n</p><p>\nThe unintelligent jump to conclusions.\n<br />\nThe wise just observe.\n<br />\nWisdom comes from removing the junk, lies, and obstacles to clear thinking.\n<br />\nInstead of learning more, get wise by learning less.\n<br />\nKeep an empty head, so you can observe clearly.\n</p><p>\nThe less you do, the more you can see.\n<br />\nObserve and learn.\n<br />\nWatch the world.\n</p><p>\nLive where nothing is happening.\n<br />\nMove to a quiet place with lots of nature and no ambition.\n<br />\nDoing nothing is normal there.\n<br />\nWalk and appreciate nature for hours a day.\n<br />\nYour life and mind will be tranquil and serene.\n<br />\nPeace is the absence of turmoil.\n<br />\nYou won’t need the media, the internet, or a phone.\n<br />\nYour cost of living will be hardly more than local eggs and vegetables.\n<br />\nDoing nothing is the ultimate minimalism.\n</p><p>\nIf you need money, be an investor.\n<br />\nIt’s the only career where you profit the most by doing the least.\n<br />\nIt should take no more than an hour per month.\n<br />\nThe stock market takes money from the active traders and gives it to the patient.\n</p><p>\nIf an action feels necessary, and you can’t let it go, just write it down for later.\n<br />\nEverything seems more important while you’re thinking of it.\n<br />\nLater, you’ll realize it’s not.\n</p><p>\nBut if it still feels necessary, adjust your time frame.\n<br />\nA year from now, will it be important?\n<br />\nTen years from now?\n<br />\nZoom out as far as you need to make it unimportant.\n<br />\nThen you’re free of it.\n</p><p>\nBut you may think the world needs you to do something.\n<br />\nThat line of thinking makes it upsetting to die.\n</p><p>\nLet go of feeling needed.\n<br />\nLet go too soon instead of too late.\n<br />\nThe world doesn’t need you.\n<br />\nYou’re relieved of your duty because soon you won’t exist.\n<br />\nDo nothing now to show that life goes on without you.\n<br />\nBe selfless.\n<br />\nBe free.\n</p><p>\nDoing nothing is how to live and how to die.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"44955a4b08caa74c06f19aae6d1523cbfa0fbc2a2b4f3cc6939a8a559bb0c002","category":"Sites"}