{"title":"Here’s how to live: Don’t die.","link":"https://sive.rs/htl24","date":1640304000000,"content":"<p>\nThere’s only one law of nature: if you survive, you win.\n</p><p>\nBe paranoid.\n<br />\nAvoid failure to survive.\n</p><p>\nFor something to succeed, everything needs to go right.\n<br />\nFor something to fail, only one thing needs to go wrong.\n</p><p>\nDon’t try to be more right.\n<br />\nJust be less wrong.\n</p><p>\nAvoiding failure leads to success.\n<br />\nThe winner is usually the one who makes the least mistakes.\n<br />\nThis is true in investing, extreme skiing, business, flying, and many other fields.\n<br />\nWin by not losing.\n</p><p>\nMost people die of cancer and heart disease.\n<br />\nSo yes, avoid that.\n<br />\nBut those who die from accidents die younger, losing more years of potential life.\n<br />\nSo try even harder to avoid accidents.\n<br />\nReduce risks.\n</p><p>\nWhat do you want out of life?\n<br />\nThat’s hard to answer.\n<br />\nWhat don’t you want?\n<br />\nThat’s easy.\n</p><p>\nMore than anything, we want a lack of negatives.\n<br />\nA life with no pain, no injury, no regrets, and no disaster is a good life.\n<br />\nIt’s easy to find joy in everyday things, if you can just avoid the bad.\n</p><p>\nBad has more power.\n<br />\nInsults affect you more than compliments.\n<br />\nInjuries affect you more than back rubs.\n<br />\nPoison affects you more than medicine.\n<br />\nA great relationship or reputation built over years can be destroyed by one bad deed.\n<br />\nAn otherwise perfect meal can be wrecked by one cockroach on the plate.\n</p><p>\nBut a lack of negatives is harder to talk about.\n<br />\nSo people focus on having the upsides in life.\n<br />\nInstead, focus on avoiding the downsides.\n</p><p>\nMost of eating healthy is just avoiding bad food.\n<br />\nMost of being right is just not being wrong.\n<br />\nTo have good people in your life, just cut out the bad ones.\n</p><p>\nDon’t waste a single minute.\n<br />\nLife can be long if you use time wisely.\n<br />\nBut wasting time brings death quicker.\n<br />\nTime is the only thing that can’t be replaced.\n</p><p>\nDeath reminds us that time is limited and precious.\n<br />\nWithout death, there would be no motivation.\n<br />\nDeath gives value to life — gives us something to lose.\n</p><p>\nKeep your eye on death.\n<br />\nAvoid the mistakes that end life.\n<br />\nAvoid the negatives that wreck life.\n<br />\nAvoid the time-wasting that brings death sooner.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"45c6ec015d609df3577b7127bbc7c079e6802cf8321ff95b0d614422361dd02f","category":"default"}