{"title":"The Other Significant Others: Living and Loving Outside the Confines of Conventional Friendship and Compulsory Coupledom","link":"https://www.themarginalian.org/2024/02/28/the-other-significant-others/","date":1709174380000,"content":"<h3>“While we weaken friendships by expecting too little of them, we undermine romantic relationships by expecting too much of them.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Other-Significant-Others-Reimagining-Friendship/dp/1250280915/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"494\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?fit=320%2C494&amp;ssl=1\" alt=\"The Other Significant Others: Living and Loving Outside the Confines of Conventional Friendship and Compulsory Coupledom\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?w=971&amp;ssl=1 971w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?resize=320%2C494&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?resize=600%2C927&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/theothersignificantothers.jpg?resize=768%2C1186&amp;ssl=1 768w\" /></a></p><p>We move through the world largely unaware that our emotions are <a href=\"https://www.themarginalian.org/2024/02/23/how-emotions-are-made/\">made of concepts</a> — the brain’s coping mechanism for the blooming buzzing confusion of what we are. We label, we classify, we contain — that is how we parse the maelstrom of experience into meaning. It is a useful impulse — without it, there would be no science or storytelling, no taxonomies and theorems, no poems and plots. It is also a limiting one — the most beautiful, rewarding, and transformative experiences in life transcend the categories our culture has created to contain the chaos of consciousness, nowhere more so than in the realm of relationships — those mysterious benedictions that bridge the abyss between one consciousness and another. </p>\n<p>When we <a href=\"https://www.themarginalian.org/2016/08/16/friendship/\">hollow the word <em>friend</em> by overuse and misuse</a>, when we make of love a contract with prescribed roles and <a href=\"https://www.themarginalian.org/2021/03/23/esther-perel-on-being-love/\">rigid, impossible expectations</a>, we become prisoners of our own concepts. The history of feeling is the history of <a href=\"https://www.themarginalian.org/2017/01/13/rachel-carson-dorothy-freeman-letters/\">labels too small to contain the loves of which we are capable</a> — varied and vigorously transfigured from one kind into another and back again. It takes both great courage and great vulnerability to live outside concepts, to meet each new experience, each new relationship, each new emotional landscape on its own terms and let it in turn expand the terms of living. </p>\n<figure><a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=680%2C811&amp;ssl=1\" width=\"680\" height=\"811\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?w=1161&amp;ssl=1 1161w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=320%2C382&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=600%2C716&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=240%2C286&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=768%2C916&amp;ssl=1 768w\" /></a><figcaption>Art by Sophie Blackall from <a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><em>Things to Look Forward to</em></a></figcaption></figure>\n<p>That is what Rhaina Cohen explores in <a href=\"https://www.amazon.com/Other-Significant-Others-Reimagining-Friendship/dp/1250280915/?tag=braipick-20\" target=\"_blank\"><strong><em>The Other Significant Others: Reimagining Life with Friendship at the Center</em></strong></a> (<a href=\"https://search.worldcat.org/title/1375547047\" target=\"_blank\"><em>public library</em></a>) — a journalistic investigation of the vast yet invisible world of unclassifiable intimate relationships, profiling pairs of people across various circumstances and stages of life sustained by such bonds, people who have “redrawn the borders of friendship, moving the lines further and further outward to encompass more space in each other’s lives,” people who have found themselves in finding each other. </p>\n<p>What emerges through this portrait of a type of relationship “hidden in plain sight” is an antidote to the tyranny of the “one-stop-shop coupledom ideal” and “an invitation to expand what options are open to us,” radiating a reminder that we pay a price for living by our culture’s standard concepts:</p>\n<blockquote><p>While we weaken friendships by expecting too little of them, we undermine romantic relationships by expecting too much of them.</p></blockquote>\n<p>A generation after Andrew Sullivan celebrated <a href=\"https://www.themarginalian.org/2014/04/23/love-undetectable-andrew-sullivan-friendship/\">the rewards of friendship in a culture obsessed with romance</a>, Cohen writes:</p>\n<blockquote><p>This is a book about friends who have become a <em>we</em>, despite having no scripts, no ceremonies, and precious few models to guide them toward long-term platonic commitment. These are friends who have moved together across states and continents. They’ve been their friend’s primary caregiver through organ transplants and chemotherapy. They’re co-parents, co-homeowners, and executors of each other’s wills. They belong to a club that has no name or membership form, often unaware that there are others like them. They fall under the umbrella of what Eli Finkel, a psychology professor at Northwestern University, calls “other significant others.” Having eschewed a more typical life setup, these friends confront hazards and make discoveries they wouldn’t have otherwise.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=650%2C472&amp;ssl=1\" width=\"650\" height=\"472\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?w=650&amp;ssl=1 650w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=240%2C174&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=320%2C232&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=600%2C436&amp;ssl=1 600w\" /></a><figcaption>Illustration by Maurice Sendak from <a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\">a vintage ode to friendship</a> by Janice May Udry</figcaption></figure>\n<p>Noting that her interest in the subject is more than theoretical, catalyzed by her own expansive relationship with another woman in parallel with her marriage, Cohen considers these category-defying bonds as a countercultural act of courage and resistance:</p>\n<blockquote><p>I began to see how these unusual relationships can also be a provocation — unsettling the set of societal tenets that circumscribe our intimate lives: That the central and most important person in one’s life should be a romantic partner, and friends are the supporting cast. That romantic love is the real thing, and if people claim they feel strong platonic love, it must not <em>really</em> be platonic. That adults who raise kids together should be having sex with each other, and marriage deserves special treatment by the state.</p></blockquote>\n<p>With an eye to the long lineage of people who have defied the categories of their time and place — the kinds of people populating <a href=\"https://www.themarginalian.org/2018/11/01/figuring/\"><em>Figuring</em></a>, which I wrote largely to explore such relationships — she adds:</p>\n<blockquote><p>Challenging these social norms is not new, nor are platonic partners the only dissidents. People who are feminists, queer, trans, of color, nonmonogamous, single, asexual, aromantic, celibate, or who live communally have been questioning these ideas for decades, if not centuries. All have offered counterpoints to what Eleanor Wilkinson, a professor at the University of Southampton, calls <em>compulsory coupledom</em>: the notion that a long-term monogamous romantic relationship is necessary for a normal, successful adulthood. This is a riff on the feminist writer Adrienne Rich’s influential concept of “compulsory heterosexuality” — the idea, enforced through social pressure and practical incentives, that the only normal and acceptable romantic relationship is between a man and a woman. Some of the first stories we hear as children instill compulsory coupledom, equating characters finding their “one true love” with living “happily ever after.”</p>\n<p>[…]</p>\n<p>It can be confusing to live in the gulf between the life you have and the life you believe you’re supposed to be living.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/Other-Significant-Others-Reimagining-Friendship/dp/1250280915/?tag=braipick-20\" target=\"_blank\"><strong><em>The Other Significant Others</em></strong></a>, Cohen relays the stories of people who have sliced through the confusion to build lives that serve them through tailor-made relationships that reward the deepest and truest parts of them, relationships that reimagine what it means to love and be loved, to see and be seen — relationships like those of <a href=\"https://www.themarginalian.org/2017/01/13/rachel-carson-dorothy-freeman-letters/\">Rachel Carson and Dorothy Freeman</a>, <a href=\"https://www.themarginalian.org/2017/02/21/clara-schumann-johannes-brahms-letters/\">Clara Schumann and Johannes Brahms</a>, <a href=\"https://www.themarginalian.org/2019/06/05/ralph-waldo-emerson-margaret-fuller-letters-figuring/\">Ralph Waldo Emerson and Margaret Fuller</a>. </p>\n<p>Complement it with poet and philosopher David Whyte on <a href=\"https://www.themarginalian.org/2019/01/23/david-whyte-consolations-naming-love/\">love and resisting the tyranny of relationship labels</a>, then revisit Coleridge on <a href=\"https://www.themarginalian.org/2023/03/28/coleridge-friendship-love/\">the paradox of friendship and romantic love</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"461e52fb51c7a1d6b62a6d4c00c5de21c7e6986f0e8f9f820d76267b1cd74a71","category":"default"}