{"title":"What are the odds of that?","link":"https://sive.rs/odds","date":1499040000000,"content":"<p><strong>\nThree true stories:\n</strong></p>\n<p>\nIn 1992, in Tokyo, I dated a girl named Masako.\nAfter our month together, she moved to London.\nWe lost touch.\n</p><p>\nIn 2008, I was in London for a few days.\nI wondered if Masako still lived there, sixteen years later.\n</p><p>\nA minute later, she walked by.\n</p><p>\n“Masako!”\n</p><p>\n“Derek?!”\n</p>\n<p>\nIn 1993, I had a pen-pal from Argentina named Lucia.\nShe was studying Norwegian and planned to move to Oslo, Norway, some day.\nWe lost touch.\n</p><p>\nIn 2007, my band was on tour in Oslo for a few days.\nI was sitting in a park, wondering if Lucia ever moved there.\n</p><p>\nA minute later, she walked by.\n</p><p>\n“Lucia!”\n</p><p>\n“Derek?!”\n</p>\n<p>\nToday I’m in Singapore.\nI went to the library to write.\nIt was very busy, with nowhere to sit, so I walked from room to room before I finally found the last free seat.\n</p><p>\nI noticed that the guy next to me was reading a book I recommend often: <i><a href=\"https://sive.rs/book/EgoEnemy\">Ego Is the Enemy</a></i>.\n</p><p>\nI said, “Great book!”\n</p><p>\nHe said, “I got it because of you. You’re Derek, right?”\n</p><p>\nHis name is <a href=\"https://twitter.com/ThomasDiong\">Thomas</a>.\nWe had emailed a few days ago.\n</p><p>\n<strong>\nSome people like to think that there are no coincidences.\n</strong>\nThey say, “What are the odds of that?” as if to mean that it can’t be chance.\nLife feels more amazing to them if it all has meaning.\n(Seeking patterns in randomness is called <a href=\"https://en.wikipedia.org/wiki/Apophenia\">apophenia</a>.)\n</p><p>\n<strong>\nI like to think that everything is a coincidence.\n</strong>\nLife feels more amazing to me if <a href=\"https://sive.rs/ml\">it has no meaning</a>.\nNo secret agenda.\nBeautifully random.\n</p><p>\nWhat are the odds of winning the big lottery?\nFifty million to one?\nAh, but that’s if you’re being egocentric and thinking only of yourself!\nSomeone always wins it.\n<strong>\nSo what if you look past yourself and ask, “What are the odds that this rare thing will happen to someone?”\n</strong>\nAlmost 100 percent.\n</p><p>\nThat’s a nice reminder when the odds seem impossible.\nAmazingly rare things happen to people every day.\n</p>\n<img src=\"/images/thomasdiong.jpg\" />\n<div>(Thomas Diong and I, today, at the Singapore library.)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"46b1ae06b7b9ec80d385741ca7a3f8bdaee82852ae748f24a40ffa95fe19dbbd","category":"Sites"}