{"title":"Toward a social theory of venture","link":"https://www.usv.com/writing/2024/09/toward-a-social-theory-of-venture/","date":1725375990000,"content":"<p>To practice venture is to practice social theory. It’s not novel to point out that to really understand what’s happening in today’s technology market, we must situate it within its broader societal context. Yet during periods of intense technological innovation and irrational exuberance, the social underpinnings that shape this market can often go under-appreciated. During times like these, there’s value to be had in leaning on disciplines like social theory to gain a more human, and therefore more holistic, view of the world changing around us.</p>\n<p>I loosely define ‘social theory’ as the frameworks and methodologies used to analyze and interpret social phenomena from the social sciences, including sociology, anthropology, economics, and political science. Social theory provides a structural and theoretical basis for understanding how societies operate and change.</p>\n<p>Coming to venture from a social sciences background, I’ve been thinking about what social theory can teach me about the venture craft and how it could help me understand what’s happening in the broader technology landscape today.</p>\n<p>In 2010, Fred blogged , “If there is any certainty in the tech business, it is things are going to change. What we should all be doing is thinking about how those changes will develop, what forces are at work, and what new directions things will head in…. Because betting that things will stay the same is a bad bet. I am sure of that.”</p>\n<p>The exercise of considering what drives the present in order to predict the future is in many ways the same exercise that inspired our most influential social theories today. It’s the exercise Thomas Hobbes did when writing his social contract theory during the English Civil War. It’s how Adam Smith came up with his invisible hand idea when the Industrial Revolution challenged the mercantilist policies of the time. It’s what Max Weber was doing when he traced rationalization back to Protestantism and warned of the ‘iron cage’ of bureaucracy. Sometimes I think of social theorists as early venture capitalists.</p>\n<p>Like venture, social theory encourages a multidisciplinary approach to a question. What are the psychological reasons behind the rise of wellness? How does an ‘always on’ media cycle change how we ascribe meaning to information? A good investor, like a good social scientist, must learn how to learn from the past and how to challenge previously held assumptions, and whether it’s time for the former or the latter.</p>\n<p>Above all, good investors must be okay with uncertainty (ideally they embrace it). A social theory student once said the most important lesson he learned was to have “an eager acceptance of the limits of our ability to answer questions, and a motivation to continue asking those questions all the same.” You’ll never have all the answers in venture. Instead of feeling paralyzed by that, the best venture capitalists recognize it’s not about knowing everything, but about using available information to develop iterative theses for how change happens and where things are headed. The USV thesis is a prime example.</p>\n<p>Of course, entrepreneurs will always face the greatest degree of uncertainty. While venture capitalists manage risk by diversifying their investments, founders must burn their boats on the shore and pull forward their vision of the future through sheer force of will.</p>\n<p>I want to further explore how social theory can act as a lens for understanding what’s happening in today’s technology markets. Peter Thiel is known for writing about Rene Girard’s mimetic theory influencing his 2004 Facebook investment. USV has written about the importance of Carlota Perez’s technological revolutions framework for understanding market cyclicality.</p>\n<p>For example, I can’t help but question if Foucault somehow foresaw these AI meeting bots and wearable recording devices in the 1970s when he wrote, “the exercise of power perpetually creates knowledge and, conversely, knowledge constantly induces effects of power.” LLMs have brought a sudden legibility and utility to information that was previously inaccessible to us (our conversations, sight, brain waves), but with that, there’s a freedom that has been irretrievably lost. What else could these social theorists foresee? What directions do these tea leaves point to next?</p>\n<p>Coming up with a perfect social theory for the undercurrents driving technology markets is not only futile, it’s besides the point. If humans and venture investments were predictable, both would cease to exist as we know them. But just because it’s impossible doesn’t mean the pursuit is without value. At its best, the practice of venture, like social theory, plays a crucial role in catalyzing our future.</p>\n<p>NB: Timing is a strange thing.  had been meaning to write this blog about the intersection of social theory and venture for quite some time when (finally getting around to it this week) I decided to pull up the course website to one of my old social theory classes from college. I was saddened to learn that the much beloved director of that Social Studies department – Dr. Anya Bassett – has recently passed away. Anya was an incredible educator and brought a light to each and every student that she worked with. I am indebted to her and the community of Social Studies faculty that she cultivated for teaching me the importance of independent thought, a curiosity for the world around us, and – above all – a love of the game.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/toward-a-social-theory-of-venture/\">Toward a social theory of venture</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Grace Carney","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"4702ebbfaff7d77f908ea83abee6306e07e1fc1d30e1ee2da35927e6df3a780c","category":"Sites"}