{"title":"Facts about the Moon: Dorianne Laux’s Stunning Poem about Bearing Our Human Losses When Even the Moon Is Leaving Us","link":"https://www.themarginalian.org/2024/04/19/facts-about-the-moon-dorianne-laux/","date":1713533303000,"content":"<p><a href=\"https://www.amazon.com/Facts-About-Moon-Dorianne-Laux/dp/0393329623?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/factsaboutthemoon_laux.jpg?fit=320%2C480&amp;ssl=1\" alt=\"Facts about the Moon: Dorianne Laux’s Stunning Poem about Bearing Our Human Losses When Even the Moon Is Leaving Us\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/factsaboutthemoon_laux.jpg?w=600&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/factsaboutthemoon_laux.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/factsaboutthemoon_laux.jpg?resize=240%2C360&amp;ssl=1 240w\" /></a></p><p>“Hearing the rising tide,” Rachel Carson wrote in her poetic meditation on <a href=\"https://www.themarginalian.org/2021/06/07/rachel-carson-the-edge-of-the-sea/\">the ocean and the meaning of life</a>, “there are echoes of past and future: of the flow of time, obliterating yet containing all that has gone before… of the stream of life, flowing as inexorably as any ocean current, from past to unknown future.” There is indeed in the physics of the tides — that gravitational dialogue between our planet and its only satellite — something of the existential, something reminding us how transient all things are, how fluid the future, how slippery our grasp of anything we hold on to, how relational every loss. </p>\n<p>The tides bridge the earthly and the cosmic, science and symbol: They cause drag that slows down our planet’s spin rate; because gravity binds the two, as the Earth loses angular momentum, the Moon overcompensates in response; as it speeds up, it begins slipping out of our gravitational grip, slowly moving away from us. The prolific English astronomer Edmund Halley first began suspecting this haunting fact in the early 18th century after analyzing ancient eclipse records. It took another quarter millennium and a giant leap into the cosmos for his theory to be tested against reality in a living poem of geometry and light: When <em>Apollo</em> astronauts placed mirrors on the surface of the Moon and laser beams were aimed at them from Earth, it was revealed that the Moon is indeed drifting away from us, at the precise rate of 3.8 centimeters per year. The Moon, born of the body of the Earth billions of years ago, is drifting away at more than half the rate at which a child grows. </p>\n<p>If even the Moon is leaving us — <a href=\"https://www.themarginalian.org/2021/03/22/hasui-kawase-prints/\">“that best fact, the Moon,”</a> in Margaret Fuller’s exultant words — what is there to hold on to? How are we to bear our ordinary human losses, the worst facts of our lives?</p>\n<p>Those questions, immense and intimate, come alive in the stunning title poem of Dorianne Laux’s’ collection <a href=\"https://www.amazon.com/Facts-About-Moon-Dorianne-Laux/dp/0393329623?tag=braipick-20\" target=\"_blank\"><strong><em>Facts About the Moon</em></strong></a> (<a href=\"https://search.worldcat.org/title/80331851\" target=\"_blank\"><em>public library</em></a>), stunningly performed by <a href=\"https://www.themarginalian.org/tag/debbie-millman/\">Debbie Millman</a> at the seventh annual <a href=\"https://www.themarginalian.org/the-universe-in-verse/\"><em>Universe in Verse</em></a> on the eve of the 2024 total solar eclipse. </p>\n<p></p>\n<blockquote><p><strong>FACTS ABOUT THE MOON</strong><br />\n<em>by Dorianne Laux</em></p>\n<p>The moon is backing away from us<br />\nan inch and a half each year. That means<br />\nif you’re like me and were born<br />\naround fifty years ago the moon<br />\nwas a full six feet closer to the earth.<br />\nWhat’s a person supposed to do?<br />\nI feel the gray cloud of consternation<br />\ntravel across my face. I begin thinking<br />\nabout the moon-lit past, how if you go back<br />\nfar enough you can imagine the breathtaking<br />\nhugeness of the moon, prehistoric<br />\nsolar eclipses when the moon covered the sun<br />\nso completely there was no corona, only<br />\na darkness we had no word for.<br />\nAnd future eclipses will look like this: the moon<br />\na small black pupil in the eye of the sun.<br />\nBut these are bald facts.<br />\nWhat bothers me most is that someday<br />\nthe moon will spiral right out of orbit<br />\nand all land-based life will die.<br />\nThe moon keeps the oceans from swallowing<br />\nthe shores, keeps the electromagnetic fields<br />\nin check at the polar ends of the earth.<br />\nAnd please don’t tell me<br />\nwhat I already know, that it won’t happen<br />\nfor a long time. I don’t care. I’m afraid<br />\nof what will happen to the moon.<br />\nForget us. We don’t deserve the moon.<br />\nMaybe we once did but not now<br />\nafter all we’ve done. These nights<br />\nI harbor a secret pity for the moon, rolling<br />\naround alone in space without<br />\nher milky planet, her only child, a mother<br />\nwho’s lost a child, a bad child,<br />\na greedy child or maybe a grown boy<br />\nwho’s murdered and raped, a mother<br />\ncan’t help it, she loves that boy<br />\nanyway, and in spite of herself<br />\nshe misses him, and if you sit beside her<br />\non the padded hospital bench<br />\noutside the door to his room you can’t not<br />\ntake her hand, listen to her while she<br />\nweeps, telling you how sweet he was,<br />\nhow blue his eyes, and you know she’s only<br />\nromanticizing, that she’s conveniently<br />\nforgotten the bruises and booze,<br />\nthe stolen car, the day he ripped<br />\nthe phones from the walls, and you want<br />\nto slap her back to sanity, remind her<br />\nof the truth: he was a leech, a fuckup,<br />\na little shit, and you almost do<br />\nuntil she lifts her pale puffy face, her eyes<br />\ntwo craters and then you can’t help it<br />\neither, you know love when you see it,<br />\nyou can feel its lunar strength, its brutal pull.</p></blockquote>\n<p>Complement with a poetic meditation on <a href=\"https://www.themarginalian.org/2024/03/06/moonlight/\">moonlight and the magic of the unnecessary</a>, Japanese artist Hasui Kawase’s <a href=\"https://www.themarginalian.org/2021/03/22/hasui-kawase-prints/\">beguiling woodcut moonscapes</a>, the story of <a href=\"https://www.themarginalian.org/2019/09/10/john-adams-whipple-moon/\">the first surviving photograph of the Moon</a>, and Patti Smith’s haunting reading of Sylvia Plath’s poem <a href=\"https://www.themarginalian.org/2023/09/04/the-moon-and-the-yew-tree-sylvia-plath-patti-smith/\">“The Moon and the Yew Tree,”</a> then revisit Dorianne Laux’s <a href=\"https://www.themarginalian.org/2023/03/13/the-life-of-trees-dorianne-laux/\">love letter to trees</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4758a18b426b073dfcf0a7163b0fb5874354c70f232b1e49afc1ed845d82b830","category":"default"}