{"title":"Death of a Pig by E.B. White (1948)","link":"https://kottke.org/24/10/death-of-a-pig-by-eb-white-1948","date":1729797380000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/terrific-pig.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/terrific-pig.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/terrific-pig.jpg 1200w\" loading=\"lazy\" width=\"1262\" height=\"1600\" alt=\"a drawing from Charlotte's Web of the pig Wilbur standing under a cobweb that spells 'terrific'\" /></p>\n\n<p>From the Atlantic in 1948, <a href=\"https://www.theatlantic.com/magazine/archive/1948/01/death-pig/309203/?gift=j9r7avb6p-KY8zdjhsiSZ1-_WogIH1TkXP1viHarKVU\">Death of a Pig</a> by E.B. White is about the story that inspired the author to write Charlotte’s Web a few years later.</p>\n\n<blockquote><p>The scheme of buying a spring pig in blossom time, feeding it through summer and fall, and butchering it when the solid cold weather arrives, is a familiar scheme to me and follows an antique pattern. It is a tragedy enacted on most farms with perfect fidelity to the original script. The murder, being premeditated, is in the first degree but is quick and skillful, and the smoked bacon and ham provide a ceremonial ending whose fitness is seldom questioned.</p>\n\n<p>Once in a while something slips — one of the actors goes up in his lines and the whole performance stumbles and halts. My pig simply failed to show up for a meal. The alarm spread rapidly. The classic outline of the tragedy was lost. I found myself cast suddenly in the role of pig’s friend and physician — a farcical character with an enema bag for a prop. I had a presentiment, the very first afternoon, that the play would never regain its balance and that my sympathies were now wholly with the pig. This was slapstick - the sort of dramatic treatment which instantly appealed to my old dachshund, Fred, who joined the vigil, held the bag, and, when all was over, presided at the interment. When we slid the body into the grave, we both were shaken to the core. The loss we felt was not the loss of ham but the loss of pig. He had evidently become precious to me, not that he represented a distant nourishment in a hungry time, but that he had suffered in a suffering world.</p></blockquote>\n\n<p>Charlotte’s Web was a deeply personal book for White — even years later, when recording <a href=\"https://www.awin1.com/cread.php?awinmid=25361&amp;awinaffid=1677195&amp;ued=https%3A%2F%2Flibro.fm%2Faudiobooks%2F9780553754490\">the radiant audiobook version</a>, <a href=\"https://www.npr.org/2011/08/19/139790016/weaving-charlottes-web\">White could barely get past the death of Charlotte at the end</a>:</p>\n\n<blockquote><p>The producer later said that it took him 17 takes to read the death scene of Charlotte. And finally, they would walk outside, and E.B. White would go, this is ridiculous, a grown man crying over the death of an imaginary insect. And then, he would go in and start crying again when he got to that moment.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Charlotte%27s%20Web\">Charlotte’s Web</a> · <a href=\"https://kottke.org/tag/E.B.%20White\">E.B. White</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/10/death-of-a-pig-by-eb-white-1948\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"47693885ef91e140d0bf52bed376223bca4157361f82e7b9a575ba088e380b05","category":"Sites"}