{"title":"Response from Devin Pope, on religious attendance","link":"https://feeds.feedblitz.com/~/881941676/0/marginalrevolution~Response-from-Devin-Pope-on-religious-attendance.html","date":1713503186000,"content":"<p>All of this is from Devin Pope, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/04/wednesday-assorted-links-449.html\" target=\"_blank\">in response to Lyman Stone (and myself)</a>.  Here was <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/04/lds-and-indeed-usa-fact-of-the-day.html\" target=\"_blank\">my original post on the paper</a>, concerning the degree of religious attendance.  I won’t double indent, but here is Devin and Devin alone:</p>\r\n<p>“I’m super grateful for Lyman’s willingness to engage with my recent research on measuring religious worship attendance using cellphone data. Lyman and I have been able to go back and forth a bit on Twitter/X, but I thought it might be useful to send a review of this to you Tyler.</p>\r\n<p>For starters, I appreciate that Lyman and I agree on a lot of stuff about the paper. He has been very kind by sharing that he agrees that many parts of my paper are interesting and “very cool work”. Where we disagree is about whether the cellphone data can provide a useful estimate for population-wide estimates of worship attendance. Specifically, Lyman’s concerns are that due to people leaving their cellphones at home when they go to church and due to questionable cellphone coverage that might exist within church buildings, the results could be super biased. He sums up his critiques well with the following: “Exactly how big these effects are is anyone’s guess. But I really think you should consider just saying, `This isn’t a valid way of estimating aggregate religious behavior. But it’s a great way to look at some unique patterns of behavior among the religious!’ Don’t make a bold claim with a bunch of caveats, just make the claim you actually have really great data for!” This a very reasonable critique and I’m grateful for him making it.</p>\r\n<p>My first response to Lyman’s concerns is: we agree! I try to be super careful in how the paper is written to discuss these exact concerns that Lyman raises. Even the last line of the abstract indicates, “While cellphone data has limitations, this paper provides a unique way of understanding worship attendance and its correlates.”</p>\r\n<p>Here is where we differ though… To my knowledge, there have been just 2 approaches used to estimate the number of Americans who go to worship services weekly (say, 75% of the time): Surveys that ask people “do you go to religious services weekly?” and my paper using cell phone data. It is a very hard question to answer. Time-use surveys, counting cars in parking lots, and other methods don’t allow for estimating the number of people who are frequent religious attenders because of their repeated cross-sectional designs.</p>\r\n<p>There are definitely limitations with the cellphone data (I’ve had about 100 people tell me that I’m not doing a good job tracking Orthodox Jews!). I know that these issues exist. But survey data has its own issues. Social desirability bias and other issues could lead to widely incorrect estimates of the number of people who frequently attend services (and surveys are going to have a hard time sampling Orthodox Jews too!). Given the difficulty of measuring some of these questions, I think that a new method – even with limitations – is useful.</p>\r\n<p>At the end of the day, one has to think hard about the degree of bias of various methods and think about how much weight to put on each. The degree of bias is also where Lyman and I disagree. In my paper, I document that the cell phone data do not do a great job of predicting the number of people who go to NBA basketball games and the number of people who go to AMC theaters. I both undercount overall attendance and don’t predict differences across NBA stadiums well at all.</p>\r\n<p>The reason why Lyman is able to complain about those results so vociferously is because I’m trying to be super honest and include those results in the paper! And I don’t try to hide them. On page 2 of the paper I note: “Not all data checks are perfect. For example, I undercount the number of people who go to an AMC theater or attend NBA basketball games and provide a discussion of these mispredictions.”</p>\r\n<p>There are many other data checks that look really quite good. For example, here is a Table from the paper that compares cellphone visits as predicted by the cellphone data with actual visits using data from various companies:</p>\r\n<div></div>\r\n<div><img width=\"714\" height=\"257\" /></div>\r\n<p> </p>\r\n<p>The cellphone predictions in the above table tend to do a decent job predicting many population-wide estimates of attendance to a variety of locations. The one large miss is AMC theaters where we undercount attendance by 30%. Now about half of that undercount is because the data are missing a chunk of AMC theaters (this is not due to a cellphone pinging issue, but due to a data construction issue). But even if one were to make that correction, we undercount theater attendance by 15%.</p>\r\n<p>Lyman argues that one should be especially worried about undercounting worship attendance due to people leaving their phones at home. I agree that this is a huge concern that is specific to religious worship and doesn’t apply in the same way for trips to Walmart. I run and report results from a Prolific Survey (N=5k) that finds that 87% of people who attend worship regularly indicate that they “always” or “almost always” take their phone to services with them. So definitely some people are leaving their phones at home, but this survey can help guide our thinking about how large that bias might be. Are Prolific participants representative of the US as a whole? Certainly not. There is additional bias that one should think about in that regard.</p>\r\n<p>Overall, my view is that estimating population-wide estimates for how many people attend religious services weekly is super hard and cellphone data has limitations. My view is that other methods (surveys) also have substantial limitations. I do not think the cellphone data limitations are as large as Lyman thinks they are and stand by the last line of the abstract that once again states, “While cellphone data has limitations, this paper provides a unique way of understanding worship attendance and its correlates.”</p>\r\n<p>All of that was Devin Pope!</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html\">Response from Devin Pope, on religious attendance</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/881941676/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/881941676/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/881941676/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/881941676/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/881941676/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/881941676/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comment-160746230\">In reply to So, summing up.   I did not read your paper because ...</a> <i>by Mike in Va</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comment-160746211\">In reply to TJRedd.   People are absolutely clueless when it ...</a> <i>by David</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comment-160746200\">Evidence vs. belief. One would think that debate is long past ...</a> <i>by rayward</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comment-160746170\">In reply to Bill.   You think I just want another puzzle to ...</a> <i>by Leonard Shelby</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comment-160746169\">In reply to M.   The “at least once per year” attendance is ...</a> <i>by M</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/response-from-devin-pope.html#comments\">Plus 9 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/lds-and-indeed-usa-fact-of-the-day.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=lds-and-indeed-usa-fact-of-the-day\">LDS and indeed USA fact of the day</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/do-protests-matter.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=do-protests-matter\">Do protests matter?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/my-excellent-conversation-with-peter-thiel.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-peter-thiel\">My excellent Conversation with Peter Thiel</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"479ffe16a2c872e58d18f12521e0cd406ffb67af1cd40ee21930da90a3b25501","category":"default"}