{"title":"Lessons from MKBHD’s App Brouhaha","link":"https://om.co/2024/09/28/lessons-from-mkbhds-app-brouhaha/","date":1727573219000,"content":"<p>If you have a long career in media and writing in public like I have, you’re likely to make some mistakes. And you’re going to have some regrets. One of those was a story I <a target=\"_blank\" href=\"https://om.co/gigaom/path/\">wrote about Path</a>, a company started by Dave Morin. I was critical, harsh and unkind to the company and its product.</p>\n\n\n\n<p>I don’t have regrets because I failed to do my job or wasn’t honest. I have regrets because I forgot that the English language allows us to make points with elegance and eloquence. How could I, as a practitioner of the bard’s language, forget its original tenet? I regret using the words I did because they minimized the efforts of individuals who dreamed up something new.</p>\n\n\n\n<p>I look back and often think perhaps I should have approached my work with empathy, carefully chosen words and a measured tone. While our culture often encourages harsh takedowns, we should consider the impact of our words.</p>\n\n\n\n<p>I bring this up because of the <a href=\"https://www.reddit.com/r/mkbhd/comments/1foyg27/marques_broke_the_golden_rule_1_of_the_internet/\">recent brouhaha</a> surrounding Marques Brownlee’s (MKBHD) wallpaper app. In case you didn’t know, Brownlee is a YouTuber of considerable influence, to put it mildly. He can shake the foundations of a product company — ask Rabbit or Humane. He recently released Panels, an app that bundled a bunch of high-quality images to be used as wallpapers. As someone who once ran a media company, I appreciate his attempt to diversify revenue streams beyond YouTube.</p>\n\n\n\n<p>This $50-a-year app was a way for him to augment his revenue, which is primarily from advertising. There were several issues with Panels. John Gruber, in his review of the app, succinctly <a target=\"_blank\" href=\"https://daringfireball.net/2024/09/panels\">described</a> it as “As it stands, Panels is incongruous and incoherent.” I have not really used the app and don’t intend to — my iPhone wallpaper is a plain black screen. I’m too much of a New Yorker to have it any other way.</p>\n\n\n\n<p>However, the fracas around Panels should serve as a learning opportunity, not only for Brownlee but also for those who review products and offer opinions. It reminds us that creating something new requires effort, courage and dedication.</p>\n\n\n\n<p>Putting oneself out there inevitably invites criticism and feedback. This situation serves as a reminder for both creators and critics to approach their work thoughtfully, balancing honesty with kindness and keeping the audience’s needs at the forefront.</p>\n\n\n\n<p><em><strong>September 28, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"47ce5b274492f2cceece37480be21c3e2ddf61f884fafb61caccc1a8025a0cab","category":"Sites"}