{"title":"Ayrton Senna&#8217;s Heel-and-Toe Braking Technique","link":"https://kottke.org/24/09/ayrton-sennas-heel-and-toe-braking-technique-1","date":1726606912000,"content":"\n        <p>There’s a driving technique called <a href=\"http://en.wikipedia.org/wiki/Heel-and-toe\">heel-and-toe</a> where the driver uses all three pedals (brake, clutch, throttle) at once to make deceleration smoother, especially in the turns.</p>\n\n<blockquote><p>Heel-toe or heel-and-toe double-declutching is used before entry into a turn while a vehicle is under braking, preparing the transmission to be in the optimal range of rpm to accelerate out of the turn. One benefit of downshifting before entering a turn is to eliminate the jolt to the drivetrain, or any other unwanted dynamics. The jolt will not upset the vehicle as badly when going in a straight line, but the same jolt while turning may upset the vehicle enough to cause loss of control if it occurs after the turn has begun. Another benefit is that “heel-and-toeing” allows the driver to downshift at the last moment before entering the turn, after starting braking and the car has slowed, so the engine speed will not be high enough when the lower gear is engaged.</p></blockquote>\n\n<p>Here is a video of Formula One great Ayrton Senna demonstrating the techique in a Honda NSX. You’ll note he’s wearing a button-down shirt, dress pants, Italian loafers, and no helmet while burying the speedometer on his way around the track.</p>\n\n<p></p>\n\n<p>It’s a bit difficult to understand from the video what Senna is actually doing…<a href=\"http://www.youtube.com/watch?v=-ndly3FCcLA\">this step-by-step video</a> shows the heel-and-toe technique more clearly. (thx, micah)</p>\n\n         <p><em>[This is a vintage post originally from May 2012.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Ayrton%20Senna\">Ayrton Senna</a> · <a href=\"https://kottke.org/tag/racing\">racing</a> · <a href=\"https://kottke.org/tag/sports\">sports</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"487b5a68f8f854b63a74414a9e8b5582c78794ef3537e59f445df642bafcaec8","category":"Sites"}