{"title":"Considerate communication","link":"https://sive.rs/ccom","date":1518652800000,"content":"<p>\nYou get a big long email from someone and think, “Ooof. I’ll come back to that later.”\n(Then you never do.)\n</p><p>\nSomeone tries to contact you using a technology you hate, like a surprising incoming video call.\n</p><p>\nYou have a dilemma and need a good conversation, so you reach out to someone who replies, “Can you make it quick?”\n</p><p>\nYou’re overwhelmed with work on a tight deadline, and a friend calls trying to have a long conversation.\n</p><p>\nIt’s hard to match your communication with someone else’s preference and situation.\n</p><p>\nThere’s a huge benefit to having a great conversation, but sometimes you need to be extremely succinct.\nSo how do you reconcile this?\nHere’s my advice:\n</p><p>\n<strong>\nFirst, prepare the most succinct version of your reason for contacting someone.\n</strong>\nMake it so short that if the person only has 30 seconds to talk, you could communicate your point, ask your question, and get the answer.\n</p><p>\nWith real-time communication, like text or phone, just start by asking if they have time.\nIf they do, then take the time to get personal, be a friend, and have a good conversation.\nBut if they don’t, then just use the short version.\n</p><p>\nWith non-real-time communication, like email, assume you’ve only got ten seconds.\n<strong>\nEdit your emails down to a few sentences.\n</strong>\nBut always give a link to more information, so they can check it out if they have time.\nAnd include your other contact information, in case they prefer a longer conversation about it.\n(This is what email signatures are for.)\nThen, if they reply and ask, you can give the extra information you left out before.\n</p><p>\nSome hate texting.\nSome hate calls.\nSome hate video.\nSome hate it all.\nJust keep track of their preference for future use.\n</p><p>\nThis may sound obvious, but it’s a bigger problem than people realize.\nConsiderate communication is surprisingly rare.\n</p>\n<img src=\"/images/reach-like-you.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"487f710fa6d6e5d805ea8695fcb7fc03e762db8392a833e04af3841685990445","category":"Sites"}