{"title":"The Ecstasy of Eternity: Richard Jefferies on Time and Self-Transcendence","link":"https://www.themarginalian.org/2024/03/01/richard-jefferies-story-of-my-heart-2/","date":1709341823000,"content":"<p><a href=\"https://www.amazon.com/Story-My-Heart-Richard-Jefferies/dp/1937226417/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"517\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?fit=320%2C517&amp;ssl=1\" alt=\"The Ecstasy of Eternity: Richard Jefferies on Time and Self-Transcendence\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?w=1586&amp;ssl=1 1586w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=320%2C517&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=600%2C968&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=240%2C387&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=768%2C1240&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=952%2C1536&amp;ssl=1 952w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?resize=1269%2C2048&amp;ssl=1 1269w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/thestoryofmyheart_jefferies.jpg?w=1360&amp;ssl=1 1360w\" /></a></p><p>This is the great paradox: that human life, lived between the time of starlings and the time of stars, is made meaningful entirely inside the self, but the self is a mirage of the mind, a figment of cohesion that makes the chaos and transience bearable. A few times a lifetime, if you are lucky, something — an encounter with nature, a work of art, a <a href=\"https://www.themarginalian.org/2018/08/09/wislawa-symborska-great-love/\">great love</a> — sparks what Iris Murdoch so wonderfully termed <a href=\"https://www.themarginalian.org/2019/10/21/iris-murdoch-unselfing/\">“an occasion for unselfing,”</a> dismantling the cathedral of illusion and rendering you one with everything that ever was and ever will be. Because <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">time is the substance of being</a>, past and future meld into one, then vanish altogether. For a moment you become one with the absolute — not a self islanded in time, but an oceanic particle of eternity. </p>\n<p>The psychologist Abraham Maslow termed such moments of timelessness and selflessness <em>peak experiences</em> — “the most blissful and perfect moments of life” — and placed them atop his seminal hierarchy of needs, in the realm of transcendence. He believed that every religion arose from them — from “the private, lonely, personal illumination, revelation, or ecstasy of some acutely sensitive prophet or seer.” After interviewing thousands of people about their peak experiences, Maslow uncovered the core common denominator — a profound sense that the universe is a harmonious totality to which one belongs and of which one is an indelible part, as essential to the integrated whole as any other, existing outside time.</p>\n<figure><a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=680%2C801&amp;ssl=1\" width=\"680\" height=\"801\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=320%2C377&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=600%2C707&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=240%2C283&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=768%2C905&amp;ssl=1 768w\" /></a><figcaption>Art by <a href=\"https://www.themarginalian.org/2021/03/09/dorothy-lathrop-down-adown-derry/\">Dorothy Lathrop</a>, 1922. (Available <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\">as a print</a> and <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_cards?curator=brainpicker\" target=\"_blank\">as stationery cards</a>.)</figcaption></figure>\n<p>I know of no more beautiful or deeply felt account of such contact with eternity than the one <strong>Richard Jefferies</strong> (November 6, 1848–August 14, 1887), patron saint of modern conservation, relays in his altogether breathtaking spiritual autobiography <a href=\"https://www.amazon.com/Story-My-Heart-Richard-Jefferies/dp/1937226417/?tag=braipick-20\" target=\"_blank\"><strong><em>The Story of My Heart</em></strong></a> (<a href=\"https://search.worldcat.org/title/892799664\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>In the final years of his short life, Jefferies touched transcendence while climbing a hill he climbed regularly. (This is part of the mystery we are — why peak experiences unfold when they do, often in the midst of something familiar, something encountered countless times before without this shimmer of the miraculous.) Crowning his <a href=\"https://www.themarginalian.org/2023/06/08/richard-jefferies-story-of-my-heart/\">magnificent account of the experience</a> is the revelation that presence — this prayerful attention to the here and now — is the supreme portal to eternity. A generation after Kierkegaard insisted that <a href=\"https://www.themarginalian.org/2017/04/18/kierkegaard-concept-of-anxiety-time/\">“the moment is not properly an atom of time but an atom of eternity”</a> and a century before Mary Oliver drew on Blake and Whitman to observe that <a href=\"https://www.themarginalian.org/2014/09/10/mary-oliver-on-punctuation/\">“all eternity is in the moment,”</a> Jefferies reflects:</p>\n<blockquote><p>Realising that spirit, recognising my own inner consciousness, the psyche, so clearly, I cannot understand time. It is eternity now. I am in the midst of it. It is about me in the sunshine; I am in it, as the butterfly floats in the light-laden air. Nothing has to come; it is now. Now is eternity; now is the immortal life. Here this moment, by this tumulus, on earth, now; I exist in it. The years, the centuries, the cycles are absolutely nothing; it is only a moment since this tumulus was raised; in a thousand years it will still be only a moment. To the soul there is no past and no future; all is and will be ever, in now.</p></blockquote>\n<p>And yet it is only through the body — this perishable reliquary of life — that the mind can grasp the abstraction of timelessness; it is only through absolute presence with the aliveness of the moment that the soul can sing with the ecstasy of eternity. Jefferies writes:</p>\n<blockquote><p>I dip my hand in the brook and feel the stream; in an instant the particles of water which first touched me have floated yards down the current, my hand remains there. I take my hand away, and the flow — the time — of the brook does not exist to me. The great clock of the firmament, the sun and the stars, the crescent moon, the earth circling two thousand times, is no more to me than the flow of the brook when my hand is withdrawn; my soul has never been, and never can be, dipped in time. Time has never existed, and never will; it is a purely artificial arrangement. It is eternity now, it always was eternity, and always will be.</p></blockquote>\n<p>Complement these fragments of the wholly soul-slaking <a href=\"https://www.amazon.com/Story-My-Heart-Richard-Jefferies/dp/1937226417/?tag=braipick-20\" target=\"_blank\"><strong><em>Story of My Heart</em></strong></a> with <a href=\"https://www.themarginalian.org/2022/12/13/time/\">two centuries of ravishing reflections on time</a>, from Borges to Nina Simone, then revisit Jefferies on <a href=\"https://www.themarginalian.org/2023/06/08/richard-jefferies-story-of-my-heart/\">nature as a prayer for presence</a> and his contemporary Hermann Hesse on <a href=\"https://www.themarginalian.org/2024/02/18/hesse-soul/\">discovering the soul beneath the self</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"493c6bc7733253d71892deeba46946d95843838802876e0ba9760296674f6db7","category":"default"}