{"title":"Apple (like big tech is) primed to stumble.","link":"https://om.co/2024/05/09/apple-is-primed-to-stumble/","date":1715303971000,"content":"<p>This past week, Apple released an ad to support the new iPads and highlight their extreme thinness. The advertisement showed creativity being crushed into the iPad. The ad, called Crush, was universally panned by everyone on social media. Apple eventually apologized. </p>\n\n\n\n<p>The Crush-ad masked the actual product announcement, and the company found itself on the back foot instead. The backlash highlighted Apple’s dilemma, <a href=\"https://daringfireball.net/linked/2024/05/09/dhh-crush\">succinctly summed up by long-time Apple follower, John Gruber</a>: </p>\n\n\n\n<blockquote>\n<p>Apple’s position in our culture has changed. They’re no longer, and never again will be, the upstart. They’re The Man now. They’re part of the firmament of our entire society, not just the tech world. When you’re on top, everyone guns for you.</p>\n</blockquote>\n\n\n\n<p>Apple is no longer making iconic products that are trying to find their place in our lives through clever messaging. The Crush ad is the output of a mega-company that still doesn’t realize that it permeates all aspects of our modern lives, <a href=\"https://om.co/2020/08/10/us-china-tech-war-apple-is-in-the-eye-of-a-hurricane/\" target=\"_blank\">including our retirement plans</a>. When you are as large as Apple (or any other Big Tech giant,) mediocrity of action creeps into every aspect of your business. </p>\n\n\n\n<p>Now it is trying to be a company that has to keep selling the newer, more incremental versions of those products to keep growing, so long as it can feed the quarterly earnings monster. It has to keep the stock flying high. Apple is now a $2.75 trillion company — and it has to do everything it can to keep itself there in that elite club. It is getting harder and harder. </p>\n\n\n\n<p>Apple is not alone. Its big tech peers Amazon and Google are finding growth much more challenging. They are doing things that make them less likable by the day. And like them, Apple too, is primed to stumble! </p>\n\n\n\n<p><em>May 9, 2024. San Francisco</em></p>\n\n\n\n<blockquote>\n<p>“Creativity is in our DNA at Apple, and it’s incredibly important to us to design products that empower creatives all over the world. Our goal is to always celebrate the myriad of ways users express themselves and bring their ideas to life through iPad. We missed the mark with this video, and we’re sorry.” </p>\n\n\n\n<p><em>Ad Age</em> on Thursday, Tor Myhren, Apple’s VP of marketing communications</p>\n</blockquote>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4a0ff68fcebf58de9ea707e9a8785d2516e29d05f0812a6f9cadf883df5aa942","category":"default"}