{"title":"The Anti-Wonka Candy Factory","link":"https://kottke.org/24/11/the-anti-wonka-candy-factory-1","date":1731440146000,"content":"\n        <p></p>\n\n<p>In 2011, Magnum photographer Martin Parr visited the <a href=\"http://www.teddygrays.co.uk/\">Teddy Grays</a> candy factory near Birmingham, England that makes old-fashioned candy with Wonka-esque names — Mint Humbugs, Nutty Brittles, Spearminties. The result is this ultra-charming 20 minute film profile of the company and its candy-making process.</p>\n\n<p>Charmingness evidence, exhibit A: When asked if the company would ever modernize, company director Teddy Gray responds, “Imagine coming to work in the morning and looking at all them faxes, oh no.” Even his modernization references need modernizing.</p>\n\n<p>Charmingness evidence, exhibit B: The lingerie calendar behind Gray as he talks on the phone, and the beefcake calendar behind his daughter in the very next scene. </p>\n\n<p>Charmingness evidence, exhibit C through exhibit ZZZ: Every other scene in the film.</p>\n\n<p>I know 20 minutes for a web video sounds daunting, but it’s worth the while. At the very least, skip to 14:00 and watch how they make “lettered rock”, hard candy sticks with words written on the inside of the candy. As shown in the video, the individual letters start out 3-4 inches high, are arranged into words when rolled up into a massive tube of candy a foot in diameter, and end up a fraction of an inch tall when pulled out into small sticks, like so:</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/lettered-rock.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/lettered-rock.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/lettered-rock.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"428\" alt=\"Lettered Rock\" /></p>\n\n<p>And you thought laying out type for the web was difficult. (thx, nick)</p>\n\n         <p><em>[This is a vintage post originally from Jul 2014.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/Martin%20Parr\">Martin Parr</a> · <a href=\"https://kottke.org/tag/Teddy%20Grays\">Teddy Grays</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"4a14f386e93756e6be63e3c9a05784c8d51e8f995bfdcd0f982d4b4974c5d15d","category":"Sites"}