{"title":"Awakened Cosmos: Poetry as Spiritual Practice","link":"https://www.themarginalian.org/2024/03/21/awakened-cosmos-david-hinton/","date":1711043758000,"content":"<h3>“Poetry is the cosmos awakened to itself.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Awakened-Cosmos-Classical-Chinese-Poetry/dp/1611807425/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"494\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?fit=320%2C494&amp;ssl=1\" alt=\"Awakened Cosmos: Poetry as Spiritual Practice\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?w=971&amp;ssl=1 971w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?resize=320%2C494&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?resize=600%2C927&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/awakenedcosmos.jpg?resize=768%2C1186&amp;ssl=1 768w\" /></a></p><p>“Every atom belonging to me as good belongs to you,” <a href=\"https://www.themarginalian.org/2018/11/01/figuring/\">wrote</a> Whitman, who <a href=\"https://www.themarginalian.org/2022/04/29/walt-whitman-kosmos-dustin-yellin/\">called himself a <em>kosmos</em></a> and believed of “the true poems” that “whom they take they take into space to behold the birth of stars.” </p>\n<p>Shortly after Whitman returned his borrowed stardust to the universe, when quantum mechanics made it impossible to take seriously the image of the atom as a miniature solar system of electrons orbiting a nucleus but no one yet knew what image to replace it with, quantum pioneer Niels Bohr <a href=\"https://www.themarginalian.org/2023/10/15/the-rigor-of-angels/\">told</a> quantum pioneer Werner Heisenberg: </p>\n<blockquote><p>When it comes to atoms, language can be used only as in poetry. The poet, too, is not nearly so concerned with describing facts as with creating images and establishing mental connections.</p></blockquote>\n<p>Another half century later, after we had split the atom and split the world, James Baldwin insisted that poets are <a href=\"https://www.themarginalian.org/2016/04/13/james-baldwin-the-artists-struggle-for-integrity/\">“the only people who know the truth about us. Soldiers don’t. Statesmen don’t. Priests don’t. Union leaders don’t. Only poets.”</a> And if the truth, the elemental truth, is that we are matter yearning for meaning — <a href=\"https://www.themarginalian.org/2022/04/22/richard-feynman-yo-yo-ma/\">“atoms with consciousness,”</a> in the poetic words of the physicist Richard Feynman — then poetry, this supreme instrument of self-knowledge, is the mirror consciousness holds to the cosmos.</p>\n<figure><a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=680%2C753&amp;ssl=1\" width=\"680\" height=\"753\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=240%2C266&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=320%2C354&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=768%2C850&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=600%2C664&amp;ssl=1 600w\" /></a><figcaption>Plate from <a href=\"https://www.themarginalian.org/2021/02/16/thomas-wright-original-theory/\"><em>An Original Theory or New Hypothesis of the Universe</em></a> by Thomas Wright, 1750. (Available as <a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>That is what poet, translator, and Chinese literature scholar David Hinton explores in <a href=\"https://www.amazon.com/Awakened-Cosmos-Classical-Chinese-Poetry/dp/1611807425/?tag=braipick-20\" target=\"_blank\"><strong><em>Awakened Cosmos: The Mind of Classical Chinese Poetry</em></strong></a> (<a href=\"https://search.worldcat.org/title/1083223521\" target=\"_blank\"><em>public library</em></a>) — an inquiry into poetry as spiritual practice, lensed through the life of Tu Fu: a man of uncommon depth and breadth of spirit, who lived as an impoverished wanderer through a civil war in the eight century to become China’s greatest poet.</p>\n<p>With an eye to poetry as <a href=\"https://www.themarginalian.org/2023/02/18/robert-bringhurst-poetry/\">the language of silence</a> and a portal to <a href=\"https://www.themarginalian.org/2019/10/21/iris-murdoch-unselfing/\">unselfing</a>, Hinton writes:</p>\n<blockquote><p>Poetry is the cosmos awakened to itself. Narrative, reportage, explanation, idea: language is the medium of self-identity, and we normally live within that clutch of identity, identity that seems to look out at and think about the Cosmos as if from some outside space. But poetry pares language down to a bare minimum, thereby opening it to silence. And it is there in the margins of silence that poetry finds its deepest possibilities — for there it can render dimensions of consciousness that are much more expansive than that identity-center, primal dimensions of consciousness as the Cosmos awakened to itself. At least this is true for classical Chinese poetry, shaped as it is by Taoist and Ch’an (Zen) Buddhist thought into a form of spiritual practice. In its deepest possibilities, its inner wilds, poetry is the Cosmos awakened to itself — and the history of that awakening begins where the Cosmos begins.</p></blockquote>\n<p>Epochs before the poet John Milton <a href=\"https://www.themarginalian.org/2022/06/07/on-looking-up-by-chance-at-the-constellations/\">introduced the word <em>space</em> into the English lexicon</a> to connote the cosmic expanse, ancient Chinese poets were reckoning with the relationship between the cosmos and the ten thousand joys and ten thousand sorrow that Taoists placed at the heart of human experience. Hinton writes:</p>\n<blockquote><p>Although ancient Chinese poets and philosophers didn’t describe it in these scientific terms, this same sense of consciousness as the Cosmos open to itself was an operating assumption for them — though perhaps here <em>existence</em> is a better word than <em>Cosmos</em>, as it suggests the sense of all reality as a single tissue. This existence-tissue is the central concern of Lao Tzu’s <em>Tao Te Ching</em> (sixth century B.C.E.) — the seminal work in Taoism, the spiritual branch of Chinese philosophy that eventually evolved into Ch’an Buddhism. Lao Tzu called that existence-tissue <em>Tao</em>, which originally meant “Way,” as in a road or pathway. But Lao Tzu used it to describe the empirical Cosmos as a single living tissue that is inexplicably generative… an ontological pathway by which things emerge from the existence-tissue as distinct forms, evolve through their lives, and then vanish back into that tissue, only to be transformed and reemerge in new forms. It is a majestic and nurturing Cosmos, but also a refugee Cosmos: all change and transformation, each of the ten thousand things in perpetual flight, always on its way somewhere else.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=680%2C801&amp;ssl=1\" width=\"680\" height=\"801\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=320%2C377&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=600%2C707&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=240%2C283&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=768%2C905&amp;ssl=1 768w\" /></a><figcaption>Art by <a href=\"https://www.themarginalian.org/2021/03/09/dorothy-lathrop-down-adown-derry/\">Dorothy Lathrop</a>, 1922. (Available <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\">as a print</a> and <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_cards?curator=brainpicker\" target=\"_blank\">as stationery cards</a>.)</figcaption></figure>\n<p>It is precisely because we are pilgrims of mortality that we so long for refuge and belonging, for something to balance the presence that we are with the void out of which we came and into which we will return. Hinton writes:</p>\n<blockquote><p>The abiding aspiration of spiritual and artistic practice in ancient China was to cultivate consciousness as that existence-tissue Cosmos open to itself, awakened to itself: looking at itself, hearing and touching itself, tasting and smelling itself, and also thinking itself, feeling itself — all in the singular ways made possible by the individuality of each particular person. This is consciousness in the open, wild and woven into the generative Cosmos: wholesale belonging.</p>\n<p>[…]</p>\n<p>At its deepest level, the tissue of Tao is described by that cosmology in terms of two fundamental elements: Absence (無) and Presence (有). Presence is simply the empirical universe, the ten thousand things in constant transformation, and Absence is the generative void from which this ever-changing realm of Presence perpetually emerges. And so, Tao is the generative process through which all things arise and pass away — Absence burgeoning forth into the great transformation of Presence… The concepts of Absence and Presence are simply an approach to the fundamental nature of things. In the end, of course, they are the same: Presence grows out of and returns to Absence and is therefore always a manifestation of it. Or to state it more precisely, Absence and Presence are simply different ways of seeing Tao: either as a single formless tissue that is somehow always generative, or as that tissue in its ten thousand distinct and always changing forms.</p></blockquote>\n<p>We now know this to be not only a spiritual truth but a scientific fact — an equation written into the physics and chemistry of <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\">what happens when we die</a>. Poetry, too, plays with this equivalence of absence and presence. Because it “articulates the emptiness surrounding the words,” Hinton observes, it “infuses everyday experience with that generative tissue of emptiness” and, in doing so, reveals enlightenment as the basic fabric of our existence in “a vast and indifferent Cosmos, a Cosmos that is in the end impervious to our attempts at wisdom.” He reflects:</p>\n<blockquote><p>A poem is not simply about its apparent content — the particular life-experience described in the poem — as it seems from the perspective of our own cultural assumptions, which is the view we see in a translation of such a poem. It is, instead, about the emptiness surrounding it, each poem revealing that emptiness in a singular way. And what is that emptiness? It is, finally, the wild existence-tissue Cosmos open to itself, awakened to itself in the form of human consciousness.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/03/24/this-is-a-poem-that-heals-fish/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/03/poem_fish7.jpg\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2017/03/24/this-is-a-poem-that-heals-fish/\"><em>This Is a Poem that Heals Fish</em></a> — a tender French picture-book about how poetry works its magic on us</figcaption></figure>\n<p>Nearly a century after the titanic poet Muriel Rukeyser observed that <a href=\"https://www.themarginalian.org/2014/05/16/muriel-rukeyser-life-of-poetry/\">“however confused the scene of our life appears, however torn we may be who now do face that scene, it can be faced, and we can go on to be whole,”</a> Hinton adds:</p>\n<blockquote><p>However confused and unenlightened our lives may seem, however blind to that everyday enlightenment we may be — we are always already wild consciousness in the open, always already the Cosmos aware of itself, awakened to itself.</p>\n<p>[…]</p>\n<p>This awakening is the nature of everyday experience, the very fabric of our lives, for in the actual moment of pure perception, there is no self involved. If we look closely at what happens in consciousness, we find nothing more than the perceptual experience itself. It is only upon reflection afterward that we describe it as an “I” hearing — a description dictated not by experience itself, but by a body of philosophical assumptions.</p></blockquote>\n<p>Lao Tzu himself captured this as one of the many paradoxes the <em>Tao Te Ching</em> invites into consciousness:</p>\n<blockquote><p>If you aren’t free of yourself<br />\nhow will you ever become yourself? </p>\n<p>Give up self-reflection<br />\nand you’re soon enlightened.<br />\nGive up self-definition<br />\nand you’re soon apparent. </p>\n<p>Knowing not-knowing is lofty.<br />\nNot knowing not-knowing is affliction. </p>\n<p>The Tao of heaven…<br />\nnever speaks<br />\nand so answers perfectly.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/Awakened-Cosmos-Classical-Chinese-Poetry/dp/1611807425/?tag=braipick-20\" target=\"_blank\"><strong><em>Awakened Cosmos</em></strong></a>, Hinton leans on Tu Fu’s finest poems to examine the fundaments of memory and identity, the role of generative emptiness in creativity, the way language both limits and liberates our consciousness, and how we make meaning in a meaningless universe. Complement it with <a href=\"https://www.themarginalian.org/2024/02/16/endling/\">a poem about our cosmic destiny</a> and non-speaking autistic poet Hannah Emerson’s <a href=\"https://www.themarginalian.org/2023/09/26/hannah-emerson-center-of-the-universe/\">“Center of the Universe,”</a> then revisit Ursula K. Le Guin’s <a href=\"https://www.themarginalian.org/2016/10/21/lao-tzu-tao-te-ching-ursula-k-le-guin/\">magnificent more-than-translation of the <em>Tao Te Ching</em></a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4a471a6b53b1b91362dc6920e1657edadc7edab39c775ad832387901999d8415","category":"default"}