{"title":"Here’s how to live: for others.","link":"https://sive.rs/htl19","date":1639872000000,"content":"<p>\nFocusing on yourself seems smarter and easier, but it’s short-sighted.\n<br />\nIt’s ignoring the huge benefit of cooperation.\n</p><p>\nCompare survival strategies.\n<br />\nYou could prepare for disaster by stocking food and ammunition in a bunker by yourself.\n<br />\nBut what if, instead:\n<br />\nYou made yourself an integral member of your community.\n<br />\nYou built a reputation of being helpful and generous.\n<br />\nAnd many people around you cared about your well-being.\n<br />\nObviously, this is a better strategy.\n</p><p>\nEven if you prefer solitude, you have to admit that being a valuable member of a group is smarter.\n<br />\nThe best way to be safe is to help others be safe.\n<br />\nThe best way to be connected is to help others be connected.\n<br />\nPeople look out for each other.\n<br />\nBut nobody helps the unhelpful.\n<br />\nYou can’t actually pull yourself up by your bootstraps.\n<br />\nUltimately you are lifted by those around you.\n</p><p>\nNever say, “Not my problem.”\n<br />\nWe’re all in this together.\n<br />\nWhat’s good for your community is good for you.\n<br />\nWhatever affects others affects you.\n<br />\nThe quality of your life is tied to the quality of your community, neighborhood, and country.\n<br />\nYou can’t be healthy in a sick society.\n</p><p>\nPsychologists, philosophers, and religions all agree on one thing.\n<br />\nHelping others is a better path to happiness than helping only yourself.\n<br />\nGiving makes you happier than receiving.\n<br />\nPeople with strong social ties live longer, healthier, happier lives.\n<br />\nThe most miserable people are self-absorbed.\n<br />\nSo aim to be the opposite.\n</p><p>\nLiving for others is how to live.\n</p>\n<hr />\n<p>\nAfter age twenty, you need deliberate effort to make new friends.\n<br />\nFriends are made, not found.\n<br />\nIf you sincerely appreciate someone, and really engage with their interests, you will become friends.\n</p><p>\nAsk open-ended questions, asking people’s thoughts.\n<br />\nAsk them to elaborate on whatever they’ve said.\n<br />\nShow that you’re interested.\n<br />\nAllow silence.\n<br />\nDon’t fill it.\n<br />\nSilence gives space to think, and an invitation to contribute without pressure.\n</p><p>\nSmall talk is just a way of matching the other person’s tone and mood.\n<br />\nIt helps them be comfortable with you.\n</p><p>\nBe warm, open, and fully present with everyone you encounter.\n<br />\nConfidence attracts.\n<br />\nVulnerability endears.\n</p><p>\nAssume everyone is just as smart and deep as you.\n<br />\nAssume their temperament is just their nature, and not their fault.\n<br />\nDon’t be mad at them for being that way, for the same reason you can’t be mad at someone for being tall.\n</p><p>\nAppreciate differences.\n<br />\nA conversation with a clone of yourself would be boring.\n</p><p>\nWhenever you’re thinking something nice about someone, tell them.\n<br />\nA sincere compliment can put a lot of fuel in someone’s tank.\n<br />\nPeople don’t hear enough compliments.\n</p><p>\nBe consistent.\n<br />\nPeople can only depend on you if you’re consistent.\n<br />\nMeet up regularly to maintain each friendship, so the connections grow stronger.\n<br />\nBe patient with your friends, even for years at a time.\n<br />\nReal friendship doesn’t end.\n</p><p>\nRelationships are more delicate than people.\n<br />\nRelationships can be ruined with one inconsiderate word.\n<br />\nWithhold angry thoughts, and let the feeling pass unexpressed.\n<br />\nNever lose your cool.\n<br />\nNever vent.\n<br />\nAlways be kind, no matter how you feel.\n</p><p>\nImagine if you found out someone was going to die tomorrow.\n<br />\nImagine how much attention, compassion, and generosity you’d give them.\n<br />\nImagine how you’d forgive their faults.\n<br />\nImagine what you’d do to make their last day on Earth the best it could be.\n<br />\nNow treat everyone like that, every day.\n</p><p>\nSometimes you really need emotional support.\n<br />\nYou’re going through a hard time or a big decision.\n<br />\nYou need someone else’s perspective on your situation.\n</p><p>\nFriends or family can give wonderful comfort.\n<br />\nYou share your problem, and they share the burden.\n<br />\nThey care for you deeply, but aren’t as distraught, so you see yourself through their eyes, and realize it’s not as bad as it feels.\n</p><p>\nAn objective mentor can give this effect even more so.\n<br />\nThis person has less sympathy, and a dispassionate perspective.\n<br />\nYou summarize the facts of your situation with less indulgence and hyperbole.\n<br />\nHearing yourself tell this version of your story reduces the intensity of your emotions.\n<br />\nYou see yourself as they do: as a smaller character in a bigger picture.\n</p><p>\nSome people like support groups for this same reason.\n<br />\nTelling your tale to a group of indifferent strangers both shares and dilutes the pain.\n</p><p>\nSuccess in business comes from helping people — bringing the most happiness to the most people.\n<br />\nThe best marketing is being considerate.\n<br />\nThe best sales approach is listening.\n<br />\nServe your clients’ needs, not your own.\n<br />\nBusiness, when done right, is generous and focused on others.\n<br />\nIt draws you out of yourself, and puts you in service of humanity.\n</p><p>\nThe most extreme version of living for others is becoming famous.\n<br />\nDo everything in public, for the public.\n<br />\nShare everything you do, even though it’s extra work.\n<br />\nIt’s giving yourself to the world.\n<br />\nBut being famous means you’ll never be able to reciprocate enough.\n</p><p>\nYour caring should grow until it reaches past your community, past your country, past your generation, and past your species.\n<br />\nCare about strangers across the world as much as you do your family.\n<br />\nCare about all forms of life as much as you do humans.\n</p><p>\nLiving for others is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"4ab5b7534367eef011b26ebeeece8b63db5c167c94ba5685b231d022e1c5d087","category":"Sites"}