{"title":"How I Followed the Election Results","link":"https://om.co/2024/11/06/how-i-followed-the-election-results/","date":1730935643000,"content":"<p>In the past, I typically followed election news and results on television networks like CNN and websites such as The New York Times. This time, I opted for Apple News’ Election Center coverage instead. It turned out to be good choice.</p>\n\n\n\n<p>This approach significantly reduced the anxiety I experienced when watching live feeds on television networks or checking platforms like Twitter or Threads. Just as MSNBC and Fox are filter bubbles, so are Threads and Twitter. As someone who is acutely aware of the perils of “filter bubbles,” I make a good effort to limit my exposure to them to a few minutes a day. I did exactly the same when following the Election Day results.</p>\n\n\n\n<p>By viewing one consolidated source, Apple News, unaffiliated with mainstream publications or television channels, helped filter out excessive and unnecessary commentary surrounding the elections and results. It was effective, consistently up-to-date, and visually clear and simple. Apple News aggregated the news and kept it nonpartisan. It was an excellent way to track results and observe changes happening across the country as they trickled in.</p>\n\n\n\n<p>In comparison, Facebook Threads was completely ineffective. The “For You” feed often displayed content that was 24 hours or even 10 hours old, failing to provide anything new, contemporary, or current. It was a complete failure as a news and information source. It seems Facebook doesn’t even intend for Threads to be an information source; instead, it feels like a sanitized version of Twitter, devoid of personality or value. Twitter, on the other hand, was far more robust but overwhelming, largely due to negativity and incessant chest-thumping.</p>\n\n\n\n<p>That said, Twitter proved to be an effective megaphone for Elon Musk, who used it to not only help the president-elect but also help himself in the process. If you have been following my writings about Musk, then you should be familiar with my theory about <a target=\"_blank\" href=\"https://om.co/2022/04/25/why-elon-is-buying-twitter/\">why he bought Twitter</a> and why <a target=\"_blank\" href=\"https://om.co/2024/07/23/musk-the-foxy-kingmaker/\">Twitter was going to be the new Fox News</a>, replacing Rupert Murdoch <a target=\"_blank\" href=\"https://om.co/2023/05/15/the-musky-fox/\">as the kingmaker of the right</a>. In that context, the $44 billion purchase of Twitter was small change for the richest man on the planet.</p>\n\n\n\n<p>In the end, I’m glad I paid for a month of Apple News (despite its terrible ads) to follow election results, using it as my primary source.</p>\n\n\n\n<p><em><strong>November 6, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4b2b642b2668c3c10821d85c887698d88be43ca061e85792930670537abe71a9","category":"Sites"}