{"title":"Waiting for Apple’s Intelligence","link":"https://om.co/2024/10/20/waiting-for-apples-intelligence/","date":1729469393000,"content":"<blockquote>\n<p>Apple Intelligence won’t actually launch until about five days after the new iPad hits stores on Oct. 23.</p>\n\n\n\n<p>The bigger obstacle is that the first Apple Intelligence features are underwhelming – with the more impressive capabilities coming later.At the start, the signature feature will be notification summaries. These can be quite helpful – if they’re accurate – but they lack the wow factor of competitors’ offerings. Compared with the latest fare from Google, OpenAl and Meta Platforms Inc., Apple’s Al is still far behind.</p>\n\n\n\n<p>Even some internal studies at Apple reflect this, I’m told. The research found that OpenAl’s ChatGPT was 25% more accurate than Apple’s Siri, and able to answer 30% more questions. In fact, some at Apple believe that its generative Al technology – at least, so far – is more than two years behind the industry leaders.</p>\n\n\n\n<p><a href=\"https://www.bloomberg.com/news/newsletters/2024-10-20/apple-s-latest-ipad-mini-highlights-ai-advantage-sonos-considers-new-headphones-m2hkz4mn\" target=\"_blank\">Bloomberg</a></p>\n</blockquote>\n\n\n\n<p>Apple’s “intelligence” can’t come fast enough. Remember <a target=\"_blank\" href=\"https://om.co/2024/09/10/my-thoughts-about-apples-iphone-16-glowtime-event%20%20https://om.co/2024/06/08/apple-ai-what-to-expect-at-wwdc-2024/\">the fanfare</a> at WWDC 2024 when they announced “Apple Intelligence”?</p>\n\n\n\n<p>I was hoping it would be ready for the new phones and devices released in September. I even convinced myself that iOS 18 would be this AI-powered marvel, ready to revolutionize our digital lives. But here we are, still waiting, still hoping. Every day I wait, I am increasingly frustrated by what’s not there.</p>\n\n\n\n<p>This morning, I asked Siri to create a playlist for Eric Hilton on Apple Music. Its response? “Sorry, I don’t understand.” Come on, Siri, this shouldn’t be so difficult.</p>\n\n\n\n<p>And don’t even get me started on the iPhone’s spelling and grammar suggestions. Compared to other AI-powered tools like Google Docs, Apple’s offerings feel practically prehistoric. The suggestions often lack context and sometimes border on nonsensical. It’s like playing grammar roulette every time you type a message.</p>\n\n\n\n<p>The modern GPT-type products maintain context during conversations and are very good at predicting the next few words. They excel at fixing spelling errors. The lack of these features is glaring on Apple’s devices.</p>\n\n\n\n<p>Even the much-touted features like summarizing text messages and notifications are just… fine. Not terrible, not great. Just fine. In a world where AI is making leaps and bounds, Apple seems to be taking forever.</p>\n\n\n\n<p>This is why I’m on my knees, praying to the tech gods that Apple can pull off something miraculous with its upcoming “Apple Intelligence.” We desperately need a better experience than what we have now. The demos looked promising, I’ll give them that. And as the Bloomberg report suggests, we won’t be experiencing the full power of Apple Intelligence for a few months.</p>\n\n\n\n<p>Apple can’t afford to screw this up. Apple has the power to introduce AI and machine learning to millions of people who might otherwise never engage with these technologies. However, this opportunity comes with significant risks. It could turn a whole generation of users off from AI. Imagine your tech-averse aunt trying to use a half-baked AI assistant and concluding that all AI is useless. That’s the kind of public relations nightmare that could set back public acceptance of AI by years.</p>\n\n\n\n<p>If Apple fumbles the ball on this one, it could potentially fall behind in what is a crucial generational shift in our relationship with computers. And if Bloomberg report is to be believed, Apple has not found the right balance yet.</p>\n\n\n\n<p>Don’t get me wrong — I’m rooting for Apple. I want it to succeed. We need it to succeed. Because if Apple can get it right, the company has the potential to democratize AI in a way no other company can.</p>\n\n\n\n<p>Here’s hoping that “Apple Intelligence” lives up to its name. The technology should be able to create playlists without breaking a sweat, offer sensible grammar suggestions and perhaps even surprise us with capabilities we haven’t yet imagined.</p>\n\n\n\n<p>The world of AI isn’t slowing down for anyone. Come on, Apple. The clock is ticking.</p>\n\n\n\n<p><strong><em>October 20, 2024. San Francisco</em></strong></p>\n\n\n\n<hr />\n\n\n\n<h3>Previously on Apple, AI, Siri and more!</h3>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/09/10/my-thoughts-about-apples-iphone-16-glowtime-event/\">My Thoughts About Apple’s iPhone 16 “Glowtime” Event</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/06/08/apple-ai-what-to-expect-at-wwdc-2024/\">Apple + AI: What to Expect at WWDC 2024</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/12/06/apple-makes-a-quiet-ai-move/\">Apple Makes a Quiet AI Move</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2022/08/30/apples-missing-augmented-intelligence/\">Apple’s missing “augmented” intelligence</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2020/10/13/sorry-state-of-siri/\">Sorry (State of) Siri</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4b54be7e1d7420aab546fa50559cf2b3e1b308334926bdbf73ce3bf7907461ca","category":"Sites"}