{"title":"How I found a perfect summer campsite in the desert southwest","link":"https://bradbarrish.com/2024/06/25/how-i-found-a-perfect-summer-campsite-in-the-desert-southwest/","date":1719378200000,"content":"<p>For some reason it’s taken me five years to post about how, in the first summer of The After Time, I over-researched (surprise!) to find a campsite that was twenty to thirty degrees cooler than almost any other campsites in the desert southwest, during the month of August. </p>\n\n\n\n<p>Let’s begin with a map of the average temperature in the United States for August 2020.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1000\" height=\"690\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/monthly-average-temperature-aug-2020-1.png?w=1000\" /></figure>\n\n\n\n<p>Does it remind you of anything? Yeah, me too.</p>\n\n\n\n<p>I had just been laid off from Sonos and everything in Laura’s world had grinded to a halt, so we decided to take a 1000-mile road trip to a small town in Colorado where Laura’s parents live full-time. I ordered a bunch of gear from REI and started assembling a road trip itinerary. We weren’t going to stay in hotels, but between Los Angeles and Colorado was some of the hottest temperatures in the country and if there’s one thing that makes me totally and completely miserable, it’s heat so I wasn’t about to pitch a tent in the middle of August in the desert southwest. In order to find a suitable campground, I was going to need some data.</p>\n\n\n\n<p>First, I needed to figure out the driving route. Easy enough, but I had a Tesla Model 3 at the time and was fully determined to take it on the road trip. Why not? I wasn’t in a hurry and Tesla’s charging network was pretty built-out at that point.  Tesla even had a decent <a href=\"https://www.tesla.com/trips\">planning tool</a> for road trips. Once I knew the route, I needed to figure out how far I could realistically expect to get, what with having to charge every couple of hours or so and traveling with kids. From what I could tell, we could make it to southwestern Utah. Now, how to figure out the most temperate areas of southwestern Utah…</p>\n\n\n\n<p>I started with government weather data, which in hindsight was unnecessary, but on-brand for me. Did you know <a href=\"https://www.climate.gov/\">Climate.gov</a> has a whole section dedicated to snapshots of US monthly average temperature data? Bookmark it. You will thank me some day, I’m sure. It has handy average temperature maps in all sorts of resolutions, but even the highest resolution maps weren’t all that helpful except to make me feel kinda dumb for not just skipping all the average temperature data and looking around higher elevation areas.</p>\n\n\n\n<p>AccuWeather has some <a href=\"https://www.accuweather.com/en/us/utah/current-weather-maps\">nice interactive temperature maps</a> that confirmed my <s>stupidity</s> suspicions. </p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"872\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/cleanshot-2024-06-25-at-17.10.53402x.png?w=1024\" /></figure>\n\n\n\n<p>Now we’re talkin’! Once I had the names of some towns and freeway numbers, I started searching the <a href=\"https://www.fs.usda.gov/\">US Forest Service website</a> and <a href=\"https://www.recreation.gov/\">Recreation.gov</a> for highly reviewed campsites I could reserve. I wasn’t going to be doing any dispersed camping in a Tesla Model 3. After a lot of browsing, I found a nice looking spot near the unincorporated town of Pine Valley, UT called <a href=\"https://www.recreation.gov/camping/campgrounds/232244\">Pine Valley Recreation Area</a> and it did not disappoint!</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"768\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/img_3170-1.jpeg?w=768\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/img_3166-2.jpeg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/img_3192-1.jpeg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/img_3206.jpeg?w=1024\" /></figure>\n\n\n\n<p>It wasn’t anywhere near as hot as the rest of the state. It wasn’t particularly high in elevation (there are many campsites in the area that are much higher in elevation).  It had a gorgeous pond, free ranging cows and available sites. We’ve been camping at Pine Valley Recreation Area or somewhere nearby every summer since. This year was actually the first year I couldn’t get a reservation, but every year we’ve gone there has been a site or two available from someone not showing up or leaving early. This year the hosts sent us to the Ebenezer Bryce campground, a quick drive a little further up the mountain that we didn’t know about. I think it might be our new favorite, especially because there are no RVs, which also meant it was generally quieter. The Santa Clara River could be heard from our tent, which everyone loved. We’ll definitely be staying there again. </p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/img_3129.jpeg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/dscf0454.jpeg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/dscf0450.jpeg?w=1024\" /></figure>\n\n\n\n<figure>\n<figure><img loading=\"lazy\" width=\"1024\" height=\"683\" src=\"https://bradbarrish.com/wp-content/uploads/2024/06/dscf0460.jpeg?w=1024\" /></figure>\n</figure>\n\n\n\n<p> </p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"4b7ca6602ab06ec887722dd809b2b87964010f5a6ff45392c83054614ed3c912","category":"Sites"}