{"title":"Individual vs AI: Why Personal Matters","link":"https://om.co/2024/07/01/individual-vs-ai-why-personal-matters/","date":1719858300000,"content":"<blockquote>\n<p>As generative AI fills our feeds with regurgitated mush, our innate trust in individuals over brands will determine the winners of both attention and revenue. Everyone in media should be racing to become a trusted individual right now. <br /><br />The personal website and the personal newsletter have always been more interesting to me. They’re also more trustworthy over time. I see personal publishing as only increasing in value to the consumer the further we get into the AI era. <br /><br />You should probably establish that connection with an audience now, under your name. Soon, it may be impossible to tell if the person behind your favorite content is a person at all. <br /><br />We all know personal publishing is swimming against the current. But it always has. Our strength is in our flexibility and authenticity. I don’t see that changing. [<a href=\"https://www.cjchilvers.com/blog/whats-with-the-hostility-towards-personal-publishing/?ref=cj-chilvers-newsletter\">CJ Chilvers]</a></p>\n</blockquote>\n\n\n\n<p>CJ’s comments mirror my thinking. When giving the reasons for <a href=\"https://om.co/2024/03/16/why-i-redesigned-my-home-page/\">why I redesigned my home page</a> (and reorganized) my website, I wrote: “The rise of generative AI means that there will be more indistinguishable content on the internet, and the only way to stand out — is by reminding people that you are human.” So instead of worrying about the <a href=\"https://om.co/2024/05/27/ai-slop-is-the-new-spam/\">AI slop</a>, I think and obsess about how I can have a better humanistic relationship with my readers and my community. That starts with trust and honesty.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4b81cb2f7a5b2821ae91f232b246accef460d534139d9aea0044f7ca5a6c7fbb","category":"default"}