{"title":"Understanding Indonesia","link":"https://sive.rs/id14","date":1390262400000,"content":"<p>\n<em>\nThis essay is by <a href=\"https://twitter.com/danielziv\">Daniel Ziv</a>, who has worked in Indonesia for 14 years as a journalist, editor, and now filmmaker.\nHe wrote the bestselling book “<a href=\"http://www.amazon.com/dp/9799589878\">Jakarta Inside Out</a>” and directed the award-winning documentary film <a href=\"http://jalananmovie.com/\">JALANAN</a>, about the lives of three Jakarta street musicians.\nThis is the first chapter of my new <a href=\"https://woodegg.com/id\">Indonesia 2014 book</a>.\n</em>\n</p>\n<hr />\n<p>\nIndonesia is the world’s 4th biggest country by population, but is still a work in progress — a beta version.\n</p>\n<p>\nIndonesia 1.0 began in 1945, when they gained independence from the Dutch and became a country.\nSuddenly, 17,000 islands, 300 ethnic groups and 700 languages needed to be held together under one flag and one language.\nThese indigenous cultures were officially co-opted as caricatures rather than being allowed to grow organically.\nThe new official language was imposed very effectively at the expense of preserving local dialects.\n</p>\n<p>\nIndonesia 2.0 began in 1998, with the toppling of Suharto, the country’s dictator of 32 years.\nThis new era of reform and democratization has seen impressive stability and progress.\n</p>\n<p>\nSo let’s talk about the best part of Indonesia — its people: warm, open-minded, easygoing and always lots of fun. \n</p>\n<h4>\nFlexibility:\n</h4>\n<p>\nIndonesians are acrobats.\nThey’ve learned the hard way not to trust the system, but also to rarely challenge it.\nSo they find resourceful ways of solving problems, relying on each other and adopting an optimistic, can-do attitude in any circumstance.\nFlexibility, elasticity and teamwork are key in nearly every walk of life, and Indonesians prize the following traits:\n</p>\n<p>\n<strong>\nNon-confrontation:\n</strong>\nIndonesians put a premium on getting along and not making each other lose face.\nConfrontation is truly a last resort.\nIndonesians love group consensus as a solution to any debate.\nThe outcome is not as important as the fact that the decision was arrived at inclusively.\n</p>\n<p>\n<strong>\nPatience:\n</strong>\nA favorite Indonesian phrase is “jam karet”, which literally means “rubber time”, suggesting that time is a flexible, unpredictable commodity.\nIt’s common for Indonesians to arrive an hour late to a meeting, and just as common for their colleagues to accept this as routine.\n</p>\n<p>\n<strong>\nRule-bending:\n</strong>\nIf time is rubber, so are rules, which are meant to be delightfully broken.\nFees are waived, timetables sped up, and restrictions ignored, all for the right payment, family member, or childhood buddy.\n</p>\n<p>\n<strong>\nSelf-reliance:\n</strong>\nIn a society where very few people have health insurance, social security, or even life savings, mutual help is very common.\nIf someone is very ill, the entire family and even neighbors pitch in to cover costs.\nIf an uncle can’t afford his own motorbike, his son-in-law and two school friends will cover the down payment.\nIf the government won’t fix an awful road, local residents mobilize their own resources to get the job done.\n</p>\n<h4>\nCorruption:\n</h4>\n<p>\nIndonesians are fundamentally good, honest people born into a system that is utterly corrupt.\nSo deeply rooted is the graft that just to get things done, one must either be corrupt or play along with corruption. \n</p>\n<p>\nCorruption is therefore a double-edged sword: it’s totally unjust and results in exorbitant costs, but it also allows people to get things done easily and quickly.\n</p>\n<p>\nIndonesians resent paying huge bribes just to start up a small, legitimate business, yet love paying $25 to obtain an instant drivers license instead of the official $10 with its days of bureaucracy and road tests.\n</p>\n<p>\nSome cynically view low-level corruption as a tax system in a non-tax-paying society.\nSince the government cannot afford to pay police or teachers a livable wage, traffic cops demand petty bribes from drivers wanting to avoid hefty official fines, while teachers will accept payment to give students passing grades.\n</p>\n<h4>\nPleasure:\n</h4>\n<p>\nIf you thought this is a conservative nation of Muslim puritans, think again.\nIndonesia is a surprisingly hedonistic society that could teach America a thing or two about the “pursuit of happiness” and pleasure.\n</p>\n<p>\nIndonesians sometimes have it rough — with poverty, poor health, traffic jams, and pollution — but they constantly and unapologetically compensate themselves for these hardships.\nIn Western countries, salons and spas are for the affluent, while in Indonesia even slum dwellers set aside the time (and as little as 50 cents) for a cream bath scalp massage or foot reflexology at a local spa shack.\nInfidelity, drugs and prostitution are rampant across all social classes in Indonesia.\nWhy?\nBecause people enjoy it, and deny themselves very little. \n</p>\n<h4>\nReligion:\n</h4>\n<p>\nSee all the young women wearing headscarves on the streets?\nMuslim extremists?\nNot even close.\nIn fact many probably work as office girls for multinational companies and might even join colleagues at a karaoke lounge at night.\nIndonesia is a constant interplay between surface and substance, and nowhere is this more apparent than in the confusing, paradoxical attitude toward religion.\nThe country is a cradle of “nominal Islam” – around 85% identify themselves as Muslims, yet very few are religious in the orthodox sense.\n</p>\n<p>\nThe government dictates that every citizen must belong to one of the country’s six official religions, and this gets listed on every Indonesian’s ID card.\nBut for most Indonesians, religion is more of an identity label, security blanket or family tradition than a matter of orthodox belief or practice.\n</p>\n<p>\nThese official religious labels mask over society’s far deeper influences: pre-Islamic animist and Hindu roots, folk superstitions, and possibly more time spent worshiping English football matches or pop stars than praying in mosques or churches.\n</p>\n<h4>\nOpenness:\n</h4>\n<p>\nIndonesians take humble pride in their own culture and achievements, but are incredibly open to outside influence.\n(Unlike the Thais, for example.)\nThey are very welcoming and adaptive toward foreigners.\nThere’s no xenophobia here.\n</p>\n<p>\nThis extends to the business world too.\nForeigners have been welcomed into many of Indonesia’s largest conglomerates as both senior directors and shareholders, while many have started major local companies of their own.\nThis open-minded society has resulted in an open market full of opportunity. \n</p>\n<p>\nThis openness may explain why travel is booming.\nIndonesians are increasingly traveling overseas, interacting more intensively with the world and global economy.\nIndonesian expats are returning from years overseas to participate in the nation-building at home, becoming local entrepreneurs, academics, NGO types, lawyers, etc.\nAnd Indonesians are suddenly eagerly touristing locally, discovering their own country in a way they never did before.\n</p>\n<h4>\nFuture:\n</h4>\n<p>\nThe future looks bright for Indonesia. \n</p>\n<p>\nThere have been three democratic, peaceful regime changes in the 15 years since the big reform, and no real fear that Indonesia will return to dictatorship.\n</p>\n<p>\nIndonesia is today the most democratic country in Southeast Asia, having surpassed more “progressive” neighbors like Thailand, the Philippines and Malaysia.\n(Just fifteen years ago, Indonesia would have trailed far behind.)\n</p>\n<p>\nDespite criticism of the current government — which in itself is a breath of fresh air — President Susilo Bambang Yudhoyono managed to steer the economy very skillfully, attracting huge foreign direct investment.\n</p>\n<h4>\nSummary:\n</h4>\n<p>\nIn Indonesia, one must always look beyond the surface at the substance.\nIt’s easy to be intimidated by corruption, traffic and pollution.\nBut those frustrations are merely superficial distractions in a country that is unbelievably welcoming and more open for business than ever before.\n</p>\n<a href=\"https://woodegg.com/id\"><img src=\"https://woodegg.com/images/we14/we14cover-ID-200.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"4bc837c146a233f48ab22aca950f1064104ebf3f46dfb6ec8764dce5f33c169e","category":"default"}