{"title":"BeachfrontDigital — April Update","link":"https://blog.webb.page/2017-04-11-beachfront-digital-april-update.txt","date":1491868800000,"content":"<p>Who knew analytics could be fun?</p>\n<p>I've spent the past week and a half working on the new BeachfrontDigital<a href=\"https://beachfront.digital\">1</a>\nand I'm loving it. After publishing my previous post<a href=\"/2017-02-08-roadmap-for-beachfront-digital.txt\">2</a>, I thought about how I\ncould make BD more useful to myself and other people. Something that bothered\nme for awhile was the lack of importing. <em>To be quite honest</em>, I was scared of\nthe work required to make importing domains work. I just didn't want to deal\nwith it. <em>Lame</em>, right?</p>\n<p>Here's a reminder of why nobody bothered to sign up for V1 of\nBeachfrontDigital:</p>\n<ul>\n<li>I wasn't offering anything that a spreadsheet couldn't handle.</li>\n<li>$6/year was still too much to charge for someone who has &lt;10 domains.</li>\n<li>To make charging for my service palatable, I'd need to create a sync system\nfor registrars.<ul>\n<li>Not all registrars have public APIs (see: Hover).</li>\n<li>There are <em>so</em> many registrars. It's not cost-effective to maintain syncing\nfor each.</li>\n<li>Creating a sync system based on undocumented APIs like some people have\ndone with Hover is a <em>terrible</em> idea. Undocumented APIs means they can\nbreak at <em>any</em> moment.</li>\n</ul>\n</li>\n</ul>\n<p>This reminder was enough to get me back into making BD better, starting with\nCSV importing and guess what? It wasn't <em>that</em> bad! I think it took me two\ndays to get importing to work, with another two for optimization. When a user\ndecides to export their data, it'll look something like this:</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/beachfront-digital-april-update-a.png\">Snippet of my domain export from BeachfrontDigital</a></p>\n<h2>Eliminating friction</h2>\n<p>During a coding break, I read an article that was sitting in a tab for at\nleast a week, \"Amazon's Friction-Killing Tactics To Make Products More\nSeamless\"<a href=\"http://firstround.com/review/amazons-friction-killing-tactics-to-make-products-more-seamless\">3</a>. What an eye-opener that was! The takeaway I got from it was to\n<em>minimize as much friction as possible for the end user</em>. It was easy to\nidentify a major point of friction with BD as it was something I was actually\ndreading. Me, the guy who made the product, didn't want to perform the basic\ntask. Why? It was too much work!</p>\n<p>In V1 of BeachfrontDigital, I had to input the domain name, registrar, price,\nAND expiration for every single domain I own. Even if the number of domains I\nhad were two, that's <em>still</em> more work than I'm willing to do. No one likes\nfilling out spreadsheets, it's a chore. What to do? Automate the hell outta\nwhat we don't want to deal with!</p>\n<p>Of course, you'll have to input your domains because BD is not a mind-reading\napp (it <em>would be</em> in a few years if it was a Google product). Thankfully, BD\nwill run a WHOIS search in the background and automatically grab registrar and\nexpiration info. Pricing is something you'll have to input as well because\nregistrars don't have the same pricing for domains/top-level domains (TLDs).</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/beachfront-digital-april-update-b.jpg\">Screenshot of my domain portfolio</a></p>\n<p>Don't even get me started on how inconsistent TLD operators are with listing\nregistrar names. In my testing, I found three variations<a href=\"https://twitter.com/BeachfrontD/status/848404426557673472\">4</a> of the business\nname for Tucows. Like, why? Lucky for you, I asked customer support at both\nTucows and Hover and was told this:</p>\n<blockquote>\n<p>The variations in the Tucows name for different domains is simply how it was\ninputted at the Registry level (each domain extension or tld has a governing\nentity known as a Registry), and since that is a human's job normally, it gets\nadded to their system slightly different each time.</p>\n<p>— Jordan Q</p>\n</blockquote>\n<p>In addition, domains purchased through Hover will list the registrar in WHOIS\nsearches as Tucows. Gandi will show EPAG Domainservices GmbH, iwantmyname will\nshow 1API GmbH, and so on. It would be <em>ideal</em> to show the actual reseller you\npurchased your domains from but that's not how WHOIS works. Oh well.</p>\n<h2>New features</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/beachfront-digital-april-update-c.jpg\">Portfolio dashboard for BeachfrontDigital</a></p>\n<p>This is how the new portfolio dashboard looks! I figured that it'd be good to\nshow personal analytics in both textual and graphical formats. While creating\nthis, I learned how flexible and awesome Handlebars<a href=\"http://handlebarsjs.com\">5</a> is.</p>\n<p>At a glance, you can see how many domain renewals are occurring this month,\nthis year, and next year. January and July are busy months for me. Interesting\nthat they are six months apart. What is it about those months that give me\nideas? I just realized I haven't accounted for people who renew domains for\nmultiple years…<em>updates list of TODOs</em>.</p>\n<p>You can also see how many domains you own per registrar. Obviously, I favor\nTucows because I like the included WHOIS privacy from Hover, for domains that\nsupport it (I don't get why <code>.fm</code> and <code>.io</code> don't, so dumb). I purchased\n<code>frsh.fm</code> from Gandi initially, but then moved it to Hover. Not sure why EPAG\nDomainservices GmbH is there…</p>\n<p>Finally, you also get to see how many domains you have per TLD. <code>.com</code> and\n<code>.online</code> are my favorite ones, apparently. The legend for this chart is\nawfully busy, I'll need to find a way to make it look better. I mean, someone\nwith 50+ TLDs in their domain portfolio might be an edge-case, but it's going\nto bother me until I find a solution, haha. 🤷🏾‍♂️</p>\n<p>In order to make every data point stand out, you need color. Well, I wasn't\ngoing to manually create colors, these are all generated dynamically! I need\nto do a bit of tweaking here and there but I'm mostly satisfied with the\nresults.</p>\n<h2>In conclusion</h2>\n<p>At the end of my previous post<a href=\"/2017-02-08-roadmap-for-beachfront-digital.txt\">2</a> about BeachfrontDigital, I mentioned making\nthe service free. Hmm, <em>nope</em>. However, it <em>will</em> be free during beta, which\nis whenever I launch V2 until I deem the service is ready for primetime. That\ncould be as early as this summer or as late as 2018. At that point,\nBeachfrontDigital will cost $11/year afterwards.</p>\n<p>What you've seen above is only half of the first wave of upgrades. My next BD\npost will most likely show more charts, but centered around pricing! I'm also\nthinking about making each of the charts fullscreen-capable. It would be neat\nto use the left/right arrow keys to look at the other charts in fullscreen\nmode as well! 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"4c0c01fe98112c7ed8ffe995b7a3ab73b2075d0bcdb611b419ff1c6f9775714b","category":"Sites"}