{"title":"The Warblers and the Wonder of Being: Loren Eiseley on Contacting the Miraculous","link":"https://www.themarginalian.org/2024/02/03/loren-eiseley-birds/","date":1706979734000,"content":"<h3>“The time has to be right; one has to be, by chance or intention, upon the border of two worlds. And sometimes these two borders may shift or interpenetrate and one sees the miraculous.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Star-Thrower-Loren-Eiseley/dp/0156849097/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"475\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/thestarthrower_eiseley.jpg?fit=320%2C475&amp;ssl=1\" alt=\"The Warblers and the Wonder of Being: Loren Eiseley on Contacting the Miraculous\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/thestarthrower_eiseley.jpg?w=674&amp;ssl=1 674w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/thestarthrower_eiseley.jpg?resize=320%2C475&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/thestarthrower_eiseley.jpg?resize=600%2C890&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/thestarthrower_eiseley.jpg?resize=240%2C356&amp;ssl=1 240w\" /></a></p><p>Every once in a while, the curtain of the ordinary parts and we touch the miraculous — the sense that there is another world not beyond this one but within it, a mirror-world any glimpse of which returns our own more luminous and full of wonder. </p>\n<p>This can never be willed, but one can be willing for it — a willingness woven of two things: total wakefulness to reality and total openness to possibility. </p>\n<p>It can happen <a href=\"https://www.themarginalian.org/2015/09/09/virginia-woolf-cotton-wool-moments-of-being/\">while strolling in a garden</a>, as it did for Virginia Woolf; it can happen <a href=\"https://www.themarginalian.org/2022/06/12/g-k-chesterton-dandelion/\">while looking at a dandelion</a>, as it did for G.K. Chesterton; it can happen <a href=\"https://www.themarginalian.org/2024/01/11/blue-glass/\">in stumbling upon a piece of blue glass</a>, as it did for me.</p>\n<p>For paleontologist, anthropologist, philosopher of science, and poet <strong>Loren Eiseley</strong> (September 3, 1907–July 9, 1977), it happened in an encounter with <a href=\"https://www.themarginalian.org/2024/01/04/brian-wildsmith-birds-company-terms/\">a bouquet of warblers</a> during a fossil-collecting expedition. He recounts the experience in his essay “The Judgment of the Birds,” originally published in 1957 in the first of his many exquisite essay collections — <em>An Immense Journey</em>, which inspired Ed Yong’s excellent <a href=\"https://www.themarginalian.org/2022/08/10/ed-yong-an-immense-world-color/\"><em>An Immense World</em></a> — and later included in the posthumous collection of his finest writing, <a href=\"https://www.amazon.com/Star-Thrower-Loren-Eiseley/dp/0156849097/?tag=braipick-20\" target=\"_blank\"><strong><em>The Star Thrower</em></strong></a> (<a href=\"https://search.worldcat.org/title/754773610\" target=\"_blank\"><em>public library</em></a>), in the introduction to which W.H. Auden so poignantly captures Eiseley’s core ethos: “The first point he wishes to make is that in order to be a scientist, an artist, a doctor, a lawyer, or what-have-you, one has first to be a human being.”</p>\n<p>Reflecting on that unbidden moment when he touched the miraculous — or, rather, the miraculous touched him — Eiseley observes:</p>\n<blockquote><p>The time has to be right; one has to be, by chance or intention, upon the border of two worlds. And sometimes these two borders may shift or interpenetrate and one sees the miraculous.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/05/04/the-gold-leaf-hall-forsythe/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/thegoldleaf3.jpg\" /></a><figcaption>Art by Matthew Forsythe from <a href=\"https://www.themarginalian.org/2017/05/04/the-gold-leaf-hall-forsythe/\"><em>The Gold Leaf</em></a></figcaption></figure>\n<p>An experience of this sort, which Eiseley terms “a natural revelation,” comes about most readily in solitude and in nature. He recounts the particular revelation of his encounter with the warblers:</p>\n<blockquote><p>It was a late hour on a cold, wind-bitten autumn day when I climbed a great hill spined like a dinosaur’s back and tried to take my bearings. The tumbled waste fell away in waves in all directions. Blue air was darkening into purple along the bases of the hills. I shifted my knapsack, heavy with the petrified bones of long-vanished creatures, and studied my compass. I wanted to be out of there by nightfall, and already the sun was going sullenly down in the west.</p>\n<p>It was then that I saw the flight coming on. It was moving like a little close-knit body of black specks that danced and darted and closed again. It was pouring from the north and heading toward me with the undeviating relentlessness of a compass needle. It streamed through the shadows rising out of monstrous gorges. It rushed over towering pinnacles in the red light of the sun or momentarily sank from sight within their shade. Across that desert of eroding clay and wind-worn stone they came with a faint wild twittering that filled all the air about me as those tiny living bullets hurtled past into the night.</p></blockquote>\n<figure><a href=\"https://society6.com/product/warblers-from-the-edinburgh-journal-1835-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?resize=680%2C1071&amp;ssl=1\" width=\"680\" height=\"1071\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?w=900&amp;ssl=1 900w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?resize=320%2C504&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?resize=600%2C945&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?resize=240%2C378&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/02/edinburghjournal_warblers.jpg?resize=768%2C1209&amp;ssl=1 768w\" /></a><figcaption>Warblers from <a href=\"https://www.themarginalian.org/2023/02/07/edinburgh-journal-birds/\"><em>The Edinburgh Journal</em></a>, 1830s. (Available as <a href=\"https://society6.com/product/warblers-from-the-edinburgh-journal-1835-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and <a href=\"https://society6.com/brainpicker/cards?sort=new\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>There is defiance in that many-winged rush of aliveness, of pure pulsating presence — a kind of stubborn insistence on the wonder of life, transient yet eternal, against the backdrop of the ossified past in Eiseley’s bag of fossils, the stratified time beneath his feet. With the knowledge that <a href=\"https://www.themarginalian.org/2022/10/18/loren-eiseley-the-slit/\">“we are all potential fossils,”</a> he lenses through the birds the continuity of life across time, its consanguinity across the common chemistry that composes us:</p>\n<blockquote><p>It may not strike you as a marvel. It would not, perhaps, unless you stood in the middle of a dead world at sunset, but that was where I stood. Fifty million years lay under my feet, fifty million years of bellowing monsters moving in a green world now gone so utterly that its very light was traveling on the farther edge of space. The chemicals of all that vanished age lay about me in the ground. Around me still lay the shearing molars of dead titanotheres, the delicate sabers of soft-stepping cats, the hollow sockets that had held the eyes of many a strange, outmoded beast. Those eyes had looked out upon a world as real as ours; dark, savage brains had roamed and roared their challenges into the steaming night.</p>\n<p>Now they were still here, or, put it as you will, the chemicals that made them were here about me in the ground. The carbon that had driven them ran blackly in the eroding stone. The stain of iron was in the clays. The iron did not remember the blood it had once moved within, the phosphorus had forgot the savage brain. The little individual moment had ebbed from all those strange combinations of chemicals as it would ebb from our living bodies into the sinks and runnels of oncoming time.</p></blockquote>\n<figure><a href=\"https://society6.com/product/chart-from-geographical-portfolio-by-levi-walter-yaggy-1887_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=680%2C458&amp;ssl=1\" width=\"680\" height=\"458\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=320%2C216&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=600%2C405&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=240%2C162&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=768%2C518&amp;ssl=1 768w\" /></a><figcaption>Geological strata from <em>Geographical Portfolio</em> by Levi Walter Yaggy, 1887. (Available <a href=\"https://society6.com/product/chart-from-geographical-portfolio-by-levi-walter-yaggy-1887_framed-print?curator=brainpicker\" target=\"_blank\">as a print</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>Once, walking through a centuries-old gilded cathedral in a small Mexican town with a beloved companion, I found myself in tears at the thought of all the people now dead who once sat in those pews and lit candles at that altar and whispered their hopes to those saints; at the realization that we too will have been, that the sum total of our prayers and passions will one day be a votive melted in a pool of itself. </p>\n<p>It is a mercy that we walk through the world half-blind to the reality of time and transience, or we would be walking through it in tears — through the immense cathedral of time that Earth is, with its neatly lined pews of geologic strata holding the history of life, which is the history of loss. And yet the very fact that any one life exists <a href=\"https://www.themarginalian.org/2021/07/25/richard-dawkins-death/\">against the cosmic odds of eternal night and nothingness</a> is miracle enough — a triumph of the possible over the probable, a concatenation of chemistry and chance gilded with wonder. </p>\n<p>With an eye to the atomic chemistry we are and <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\">will return to</a>, with an eye to the birds now swarming with the full force of life above him, the birds that evolved from those long-dead dinosaurs, Eiseley writes:</p>\n<blockquote><p>I had lifted up a fistful of that ground. I held it while that wild flight of south-bound warblers hurtled over me into the oncoming dark. There went phosphorus, there went iron, there went carbon, there beat the calcium in those hurrying wings. Alone on a dead planet I watched that incredible miracle speeding past. It ran by some true compass over field and waste land. It cried its individual ecstasies into the air until the gullies rang. It swerved like a single body, it knew itself, and, lonely, it bunched close in the racing darkness, its individual entities feeling about them the rising night. And so, crying to each other their identity, they passed away out of my view.</p>\n<p>I dropped my fistful of earth. I heard it roll inanimate back into the gully at the base of the hill: iron, carbon, the chemicals of life. Like men from those wild tribes who had haunted these hills before me seeking visions, I made my sign to the great darkness. It was not a mocking sign, and I was not mocked. As I walked into my camp late that night, one man, rousing from his blankets beside the fire, asked sleepily, “What did you see?”</p>\n<p>“I think, a miracle,” I said softly, but I said it to myself. Behind me that vast waste began to glow under the rising moon.</p></blockquote>\n<p>Couple with Eiseley’s <a href=\"https://www.themarginalian.org/2017/06/22/loren-eiseley-muskrat/\">miraculous encounter with a muskrat</a>, then revisit Annie Dillard on <a href=\"https://www.themarginalian.org/2015/04/30/annie-dillard-pilgrim-at-tinker-creek-1/\">finding the miraculous in the mundane</a> and Helen Macdonald on <a href=\"https://www.themarginalian.org/2015/12/16/h-is-for-hawk/\">what a hawk taught her about the meaning of life</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4c2ac535dd02fb37f551e75419c0930f317c06b3fd71952d7da63a8a088f9fee","category":"default"}