{"title":"Our Investment in Glow Protocol: DePIN at the Edge of Energy Markets","link":"https://www.usv.com/writing/2024/10/our-investment-in-glow-protocol-depin-at-the-edge-of-energy-markets/","date":1730383220000,"content":"<p>At USV, we invest in networks that help coordinate human behavior at scale, particularly at the edge of large markets experiencing transformative pressure. </p>\n<p>Today we’re announcing our investment in the Glow Protocol, which incentivizes the deployment of solar infrastructure.  Glow’s approach is radically different from existing subsidy systems for green energy, drawing inspiration from Bitcoin’s open and highly competitive incentive model.</p>\n<p>Glow addresses a fundamental challenge in solar infrastructure: how to target subsidies to create additional renewable energy capacity only where it has the most climate impact. The protocol takes what might seem like an unusual approach – requiring solar farms to contribute 100% of their electricity revenue to a shared incentive pool that includes carbon credits generated by the network as well as tokens known as GLW.  This creates a self-selection mechanism where only projects that need the additional incentives will participate, since standalone profitable projects would rather keep their revenue than trade it for carbon credits and tokens.</p>\n<p>From a market perspective, the protocol’s competition for rewards creates an interesting equilibrium. The parallel to Bitcoin mining is instructive here – Bitcoin’s difficulty adjustment ensures that only the most efficient miners can profitably operate, driving the network toward increasingly efficient operations. Glow applies this same mechanism to solar deployment: farms compete for a fixed reward pool of GLW tokens and carbon credits, naturally pushing development toward the most impactful locations with the most efficient operations. Over time, this competition should drive down the cost per ton of carbon reduction, similar to how Bitcoin mining has driven dramatic advances in computing efficiency.</p>\n<p>The energy sector is under immense pressure: electrification and AI are adding tremendous demand, while the societal need for decarbonization is only increasing. Ultimately, we believe the future of climate tech will require new coordination mechanisms that can efficiently direct capital toward maximum impact. Glow represents an ambitious experiment in using crypto networks to create those mechanisms.</p>\n<p>We are proud to support David and the Glow team, alongside our co-leads at Framework Ventures, in this $30M financing that will support the continued development of the Glow protocol as well as expansion of utility-scale solar farms on Glow.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/our-investment-in-glow-protocol-depin-at-the-edge-of-energy-markets/\">Our Investment in Glow Protocol: DePIN at the Edge of Energy Markets</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"4c51c337e0276d951519c0a6fa8cb8eee979d43af838b659902700fcc69249b1","category":"Sites"}