{"title":"Shattered Glass Of Modern Media","link":"https://om.co/2024/01/26/shattered-glass-of-modern-media/","date":1706301406000,"content":"<blockquote>\n<p>“Friends don’t let friends go to <a target=\"_blank\" href=\"http://forbes.com/\">Forbes.com</a>.” — me!</p>\n</blockquote>\n\n\n\n<p>Twenty-five years ago, while working for Forbes Digital Tool, the digital offshoot of Forbes magazine, I collaborated with Adam Penenberg and many other colleagues to bring to light the story of Stephen Glass, a young journalist who turned out to be a fabulist. Glass fabricated facts for The New Republic and a handful of other publications. Back then, it was quite a scandal — in media circles — and it was eventually turned into a movie, ‘Shattered Glass.’</p>\n\n\n\n<span></span>\n\n\n<div>\n<figure><img loading=\"lazy\" width=\"696\" height=\"1024\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-696x1024.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-696x1024.jpg 696w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-204x300.jpg 204w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-768x1130.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-130x192.jpg 130w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass-380x560.jpg 380w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/ShatteredGlass.jpg 1000w\" /></figure></div>\n\n\n<p>Twenty years later, Pete Croatto, a freelance writer, decided to write a story about the movie and the events that led to the making of the film. Despite the controversy surrounding Glass’s actions, the movie is seen as a great yarn and has found its place in journalism classrooms. For me, the events and the movie are a faded footnote. </p>\n\n\n\n<p>It all came back, thanks to Croatto’s retelling of events. Pete interviewed as many, if not all, of the people involved with the saga. For whatever it is worth, the film director Billy Ray never got in touch. And neither did the Vanity Fair writer. A whole lifetime has passed since then — many more fundamentally positive and constructive events have shaped it. I have lost touch with most people from that era, barring my former boss, mentor, and now a dear friend, David Churbuck.</p>\n\n\n\n<p>It feels like a different era — a time when values, truth, and accuracy mattered. As a young reporter, I was inspired by ‘All The President’s Men,’ and how it led to the undoing of an American President. ‘Shattered Glass’ was about the sanctity of the media establishment. And even then, it pointed to a future where half-truths were becoming part of the media narrative. </p>\n\n\n\n<p>There have been many media scandals since then. The pressure to publish as quickly as possible will only push media to adopt even more shortcuts — including new AI tools. And not just media people — entrepreneurs, academics, politicians, doctors, and researchers are all faking it, or plagiarizing to get ahead in life. Fake it till you make it a popular t-shirt slogan for a reason. And if that is not enough, we are already drowning in misinformation; we are living in an age of lies and half-truths. We are dealing with machine-generated nonsense and alternative realities — and that is the shattered glass whose shards have pierced our minds and society.</p>\n\n\n\n<p><a href=\"https://www.poynter.org/reporting-editing/2024/shattered-glass-movie-hayden-christensen-new-republic/\" target=\"_blank\">Why Shattered Glass Endures, Pete Coratto, Poynter.</a></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4c9b2844419c721609225ea6067961ca3d3d1daa1472121d49b7aea4b339c3ae","category":"default"}