{"title":"Why I love Underdogs","link":"https://om.co/2024/06/25/why-i-love-underdogs/","date":1719329528000,"content":"<p>That was quite a night.</p>\n\n\n\n<p>Not surprisingly, I woke up late this morning. I simply couldn’t sleep because I was buzzing from what I had just witnessed—and I still am.</p>\n\n\n\n<p>On paper, it was a wild game of the fast-paced T20 version of cricket. But it was more than that. It was ambition and desire in a pressurized can. The game featured heroes, anti-heroes — in my book, there are no villains in sports — and even comedy.</p>\n\n\n\n<p>It was one of the most <a href=\"https://www.icc-cricket.com/tournaments/t20cricketworldcup/matches/239654/afghanistan-vs-bangladesh\">insane games</a> I have ever seen — filled with anger, joy, sadness, panic, rain, drama, emotion, and most importantly, unpredictability. The drama and emotions could put even the best Bollywood movie to shame. But most important of all, it offered the thrill-a-minute anticipation that only live sports can provide!</p>\n\n\n\n<p>It was the kind of game that makes you fall in love with “the game” all over again.</p>\n\n\n\n<p>Afghanistan, a team that was playing in the equivalent of the fifth division just over 15 years ago, is heading to the semifinals of the 2024 World Cup. We are all aware of Afghanistan’s history and reality, so I won’t go there. Today, I’m simply celebrating their win.</p>\n\n\n\n<p>The reason I love this game so much is the same reason I am passionate about startups: they represent the “underdog.” It’s difficult to root for an incumbent; as a result, I find myself predisposed to hoping that the upstarts, the underdogs, and those facing long odds will prevail.</p>\n\n\n\n<p>Every time I see a founder dreaming of making it big, I root for them to win it all. Of course, the odds are against them. But like Sisyphus, they keep at it. Occasionally, you see some of them break out and become successful. I remember chatting (and writing about) Mark Zuckerberg long before he moved out west, when the company was nothing more than a college phenomenon. No one could have imagined that one day we would call them a destroyer of worlds. Okay, I kid.</p>\n\n\n\n<p>In my first meeting with Larry and Sergey, Sergey wore mismatched socks. They were once upstarts, not assured of their multi-trillion-dollar valuations. Today, it seems hard to believe, but Facebook or Google could have been just another startup. There was nothing preordained about their destiny.</p>\n\n\n\n<p>We often forget that Myspace was bigger, cooler, and backed by deep pockets. Google couldn’t compete with Yahoo at the time. However, they were more driven. Their team was neither plodding nor mediocre; they were committed to the team, while the others — whether Myspace or Yahoo — were led by executives who prioritized their self-interests. </p>\n\n\n\n<figure><a href=\"https://images.icc-cricket.com/image/upload/t_ratio16_9-size50/prd/binibhiaovzw48jiiyqg\"><img width=\"1024\" height=\"576\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-1024x576.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-1024x576.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-300x169.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-768x432.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-192x108.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-1100x619.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll-560x315.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/AfghansWinItAll.jpeg 1280w\" /></a><figcaption>Photo Courtesy of ICC</figcaption></figure>\n\n\n\n<p>I observed a similar scenario last night with the Afghan cricket team. They were eager to capitalize on the opportunities presented to them and determined to forge their own destiny. In contrast, their rivals lacked bravery and fire.</p>\n\n\n\n<p>When I was a boy, India was a perpetual underdog in cricket. In 1983, they won the World Cup against all odds. Today, India is one of the three dominant teams in the sport. Unlike other fellow Indian immigrants, my heartstrings don’t tug so hard for the Indian cricket team, just as I don’t think as fondly of Google, Facebook, and other former underdogs who are now incumbents.</p>\n\n\n\n<p>I want Afghans to make history — to beat all odds and win it all. What better celebration of cricket could one expect? What better expression of the underdog spirit? And even if they don’t, at least I have a night to remember.</p>\n\n\n\n<p><strong><em>June 25, 2024. San Francisco.</em></strong> </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4d5f1b4621e0f2dc94354834e9640e44a2a4b8db32e04268ad6998a9247e15c0","category":"default"}