{"title":"The Great Blue Heron, Signs vs. Omens, and Our Search for Meaning","link":"https://www.themarginalian.org/2024/09/11/great-blue-heron/","date":1726086353000,"content":"<p><a href=\"https://www.amazon.com/Something-Woods-Loves-Jarod-Anderson/dp/1643262297/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"485\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?fit=320%2C485&amp;ssl=1\" alt=\"The Great Blue Heron, Signs vs. Omens, and Our Search for Meaning\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?w=990&amp;ssl=1 990w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?resize=320%2C485&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?resize=600%2C909&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?resize=240%2C364&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/somethinginthewoodslovesyou.jpg?resize=768%2C1164&amp;ssl=1 768w\" /></a></p><p>One September dawn on the verge of a significant life change, sitting on my poet friend’s dock, I watched a great blue heron rise slow and prehistoric through the morning mist, carrying the sky on her back. In the years since, the heron has become the closest thing I have to what native traditions call a spirit animal. It has appeared at auspicious moments in my life, when I have most yearned for assurance. It became the first bird I worked with in my <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\">almanac of divinations</a>. At times of harrowing uncertainty and longing for resolution, I have found in the long stillness of the hunting bird, waiting for the right moment to do <a href=\"https://www.themarginalian.org/2021/12/07/carl-jung-next-right-thing/\">the next right thing</a>, a living divination — a great blue reminder that patience respects the possible. </p>\n<p>It is naïve, of course, to believe that this immense and impartial universe is sending us, transient specks of stardust, personalized signs about how to live the cosmic accident of our lives. Still, it is as foolish to ask the meaning of a bird as it is to see it as a random assemblage of feather and bone. Reality lives somewhere between matter and meaning. One makes us, the other we make to bear our mortality and the confusions of being alive. Meaning arises from what we believe to be true, reality is the truth that endures whether or not we believe in it. That is the difference between signs and omens. Signs disrespect the nature of reality, while omens betoken our search for meaning, reverent of the majesty and mystery of the universe — they are a conversation between consciousness and reality in the poetic language of belief. </p>\n<p>A bird is never a sign, but it can become an omen if our attention and intention entwine about it in that golden thread of personal significance and purpose that gives life meaning.  </p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?w=900&amp;ssl=1 900w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=768%2C1189&amp;ssl=1 768w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-great-blue-heron-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-great-blue-heron-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>Jarod Anderson also turns to the great blue heron as a lens on our search for meaning in <a href=\"https://www.amazon.com/Something-Woods-Loves-Jarod-Anderson/dp/1643262297/?tag=braipick-20\" target=\"_blank\"><strong><em>Something in the Woods Loves You</em></strong></a> (<a href=\"https://search.worldcat.org/title/1412153457\" target=\"_blank\"><em>public library</em></a>) — his poignant meditation on surviving the darkest recesses of human nature, the strange fusion of shame and sadness that gives depression its devastating power, by turning to the luminous and numinous in nature. Emerging from the pages is a lyrical love letter to how “imaginative empathy” heals and harmonizes our relationship to ourselves, to each other, to the wonder of being alive. </p>\n<p>Reflecting on the difficulty of interpreting his own life and on the myriad symbologies of the great blue heron — among them an ancient myth in which the bird dusts the surface of the water with golden starlight to attract bluegill — Anderson writes:</p>\n<blockquote><p>The heron is exactly what the heron is to you in the moment you choose to give it meaning. It will be that meaning until you decide it means something else. That’s how meaning works. It’s a subjective act of interpretation.</p>\n<p>You might get the impression that I’m saying herons are meaningless, but that’s not what I’m saying at all. When I see a heron and interpret its behavior as a reminder for me to slow down and think about what actually matters in my life, that is what that heron means. Meaning, like many crafts, happens in collaboration between maker and materials.</p>\n<p>[…]</p>\n<p>The heron allows me to build the meaning I need for the moment I need it. Making meaning in this way is like creating harmony with two voices… The trouble starts when we forget about our participation in the creation of harmony, of meaning. When we remove our agency in meaning-making, we start to think in absolutes.</p></blockquote>\n<p>Whenever we think in absolutes, we ossify. Our freedom always lies in our flexibility, and because concepts like meaning and identity are not fixed, because, as Anderson observes, they “require our intentional participation,” they are “mercifully flexible.” They take the shape of our beliefs about who we are and what we deserve, they abide by the messages we send ourselves through the omens we make of reality. </p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/DwarfThrush_changing.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-dwarf-thrush-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-dwarf-thrush-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>Watching the herons walking his local shoreline, feeling like they are sending him “an overt message” about the power of “quiet contemplation and self-determination,” Anderson writes:</p>\n<blockquote><p>The heron only represents self-determination when I need her to. That doesn’t diminish the heron’s power. It simply highlights my own.</p>\n<p>There are objective facts in the world. Of course there are. But our concept of self, our significance, our sense of whether or not we deserve to take up space in the universe or experience joy and contentment — these are not questions of fact, they are questions of meaning.</p></blockquote>\n<p>For those of us who find consolation in the natural world, the sense of meaning has to do with contacting the numinous quality of sea and sky and songbird, of everything that makes this planet a world. You may call that contact wonder. You may call it magic. “If you don’t think herons are magic,” Anderson writes, “you need to broaden your definition of that word.” Looking back on the bleak period when depression swept away the herons from the sky of his mind and voided the world of wonder, he reflects:</p>\n<blockquote><p>There are two paths to magic: Imagination and paying attention. Imagination is the fiction we love, the truths built of falsehoods, glowing dust on the water’s surface. Paying attention is about intentional noticing, participating in making meaning to lend new weight to our world. An acorn. The geometry of a beehive. The complexity of whale song. The perfect slowness of a heron. </p>\n<p>Real magic requires your intention, your choice to harmonize. Of course it does. The heron cannot cast starlight onto the dark shallows to entrance the bluegills. Not unless you do your part. You must choose to meet her halfway. And when you do, you may find that magic isn’t a dismissal of what is real. It’s a synthesis of it, the nectar of fact becoming the honey of meaning.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/Something-Woods-Loves-Jarod-Anderson/dp/1643262297/?tag=braipick-20\" target=\"_blank\"><strong><em>Something in the Woods Loves You</em></strong></a>, Anderson goes on to lens the search for meaning through a kaleidoscope of living wonders, from the sugar maple to the red-tailed hawk to the morel mushroom. Couple it with Loren Eiseley on <a href=\"https://www.themarginalian.org/2024/02/03/loren-eiseley-birds/\">warblers as a lens on the wonder of being</a>, then revisit some of humanity’s greatest writers on <a href=\"https://www.themarginalian.org/2020/06/14/nature-depression/\">nature as an antidote to depression</a> and Terry Tempest Williams on <a href=\"https://www.themarginalian.org/2024/01/26/when-women-were-birds/\">the bird in the heart</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4e55e0c36ccf437104fdfbd166c787221f4c90468b8b9da5d30ef5e5f3fb5641","category":"Sites"}