{"title":"Apple + AI: What to Expect at WWDC 2024","link":"https://om.co/2024/06/08/apple-ai-what-to-expect-at-wwdc-2024/","date":1717869511000,"content":"<figure><img width=\"1024\" height=\"505\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-1024x505.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-1024x505.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-300x148.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-768x379.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-192x95.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-1100x542.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png-560x276.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/hero_@2x.png.jpeg 1424w\" /></figure>\n\n\n\n<p>Google and Microsoft have already shared their plans for integrating AI into their products. Now, it’s Apple’s turn. If the rumors are even remotely true, Apple will present a more pragmatic and user-centric strategy at WWDC 2024 next week. A widely cited <a href=\"https://www.google.com/search?client=safari&amp;rls=en&amp;q=Apple+Bets+That+Its+Giant+User+Base+Will+Help+It+Win+in+AI&amp;ie=UTF-8&amp;oe=UTF-8\">Bloomberg news report suggests these features</a>:</p>\n\n\n\n<ul>\n<li>Project Greymatter will likely introduce a suite of AI tools integrated into core applications such as Safari, Photos, and Notes, along with enhanced notifications in iOS 18 and macOS 15. Processing will take place on-device for less intensive tasks and in the cloud for more complex ones. The “Greymatter Catch-up” feature will offer recaps of recent notifications through Siri.</li>\n\n\n\n<li>AI enhancements are poised to enhance web searches in Safari, making them quicker and more dependable. Safari is also expected to include summaries, similar to a feature currently available in the upstart Arc Browser.</li>\n\n\n\n<li>AI features include voice memo transcription, AI-powered photo retouching, quicker Spotlight searches, enhanced Safari web searches, and auto-suggested replies for emails and messages. Additionally, on-device AI capabilities have been extended to the Apple Watch. Expect an AI emoji creator.</li>\n\n\n\n<li>More natural interactions using Apple has recently upgraded Siri, enhancing its ability to understand and respond to users more naturally using its proprietary large language models.</li>\n\n\n\n<li>Developer Tools Like Xcode will get AI makeover.</li>\n\n\n\n<li>Revamped iPhone home screen allowing custom app icon colors and placement.</li>\n\n\n\n<li>Partnership with OpenAI to integrate their advanced chatbot into iOS 18. Discussions are also ongoing with Google to potentially offer its Gemini chatbot as an option.</li>\n\n\n\n<li>AI Features Positioned as “Preview” in developer betas, suggesting the technology is still a work-in-progress.<br /></li>\n</ul>\n\n\n\n<p><a target=\"_blank\" href=\"https://appleinsider.com/articles/24/06/08/siri-is-reborn-in-ios-18----everything-apples-voice-assistant-will-be-able-to-do\">AppleInsider reports</a> that a newly improved Siri will be able to do the following:</p>\n\n\n\n<ul>\n<li>In Books, Siri can open specific books or sections, flip pages, change themes, and open the bookstore.</li>\n\n\n\n<li>With Siri, users can take pictures and videos, switch between front and rear cameras, and set ti<a href=\"http://etc.In\" target=\"_blank\">mers.</a></li>\n\n\n\n<li>In Keynote, Siri can add media to slides, create new presentations, set bulle<a href=\"http://etc.In\" target=\"_blank\">t points and more.</a></li>\n\n\n\n<li>In Mail, Siri can send and unsend emails, mark emails as junk, mute senders, summarize emails, and enable s<a href=\"http://etc.In\" target=\"_blank\">mart r</a>eplies.</li>\n\n\n\n<li>With Siri, users can now create and delete folders, add or remove tags from notes, and include audio recordings an<a href=\"http://etc.In\" target=\"_blank\">d transcriptions in Notes.</a></li>\n\n\n\n<li>In Photos, Siri will be able to search for objects/people, rotate/edit/organize photos into albums, hide photos, etc.</li>\n\n\n\n<li>In Safari, Siri can read or summarize webpages, create tab groups, including private ones.</li>\n\n\n\n<li>Siri to instantly generate smart reply suggestions in Mail, Messages.</li>\n</ul>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"677\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-1024x677.png\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-1024x677.png 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-300x198.png 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-768x508.png 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-1536x1016.png 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-192x127.png 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-1100x728.png 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-627x416.png 627w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks-560x370.png 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/AItalks.png 1790w\" /></figure>\n\n\n\n<p>On the surface, these might not be the whiz-bang offerings, but by embedding AI in its products, Apple can enhance the user experience and ease its customers into this new “AI-first” world. However, as mentioned earlier, this is all still speculation.</p>\n\n\n\n<p>Siri was first introduced as an integrated feature of the iPhone 4S on Oct. 4, 2011, before the technology world had begun to take its first baby steps into the world of large language models. George Hinton and his team of researchers made crucial breakthroughs that eventually led to the current excitement around AI.</p>\n\n\n\n<p>Siri, when introduced, was essentially a rules-based voice engine with very limited capabilities; Apple oversold it. The underlying technologies weren’t ready, and Apple’s silicon journey had just begun. (I have found that Siri seems to work better on Vision Pro and recent editions of the Apple Watch.) It didn’t help that Siri was shackled by its inability to work with third-party apps and was more restrictive than products eventually released by its rivals, Amazon and Google.</p>\n\n\n\n<p>Amazon’s Alexa, released in 2014, and Google’s Assistant have shown improvements as the underlying technologies — natural language processing (NLP) and machine learning — continue to advance, enabling them to handle complex conversational queries.</p>\n\n\n\n<p>Advances in deep learning models have enhanced recent Open AI technologies, such as GPT-4. These systems now boast the ability to engage in human-like conversational interactions, generate creative content, and perform a wide range of tasks beyond predefined commands.</p>\n\n\n\n<p>“”Siri and Alexa are kind of old now. They just need a Botox,” I said on the Trends with Friends podcast. “And I think LLMs are going to be the Botox.” My bet is that Apple might start with OpenAI, but they would work with anyone — say, Google’s Gemini — as a backfill. Apple’s own models running locally and using OpenAI to work with other services to bolster Siri.</p>\n\n\n\n<p>There has been speculation that Apple might discard Siri — a move that would be a mistake. Siri is an integral part of Apple’s brand identity. Despite being criticized for its inefficiency, it still holds significant brand cachet. A whole generation has grown up familiar with Siri and her voice. We don’t often think of voice interfaces as a “brand,” but in a future where screens and keyboards may vanish, they become a crucial part of brand identity. If Apple can enhance Siri, the early issues will be forgotten — much like the initial disaster of Apple Maps is rarely discussed now.</p>\n\n\n\n<p>This aligns with typical Apple strategy. Apple is usually not the first to adopt technological shifts and prefers to take its time entering a market. Historically, the company has lagged behind others in internet software and services. It relied on Google Maps and Google Search to enhance its products before fully committing to developing its own maps. Now, it is reportedly partnering with OpenAI, as noted recently by Daniel Raffel, a Silicon Valley veteran, on <a target=\"_blank\" href=\"https://danielraffel.me/2024/05/31/apples-potential-strategy-with-openai/\">his blog.</a></p>\n\n\n\n<blockquote>\n<p>Reflecting on Apple’s past, particularly a rumored $1 billion deal with Nuance for a perpetual license to self-host and privately fork their speech technology for Siri’s iOS launch, a pattern emerges. When Apple needed to quickly catch up, they licensed and integrated advanced technologies. This strategy allowed them to provide a cutting-edge assistant with voice recognition and speech synthesis to iPhone users. Given this history, it wouldn’t be surprising if Apple is taking a similar approach with OpenAI to offer cloud based AI offerings. It would be in character for Apple to have negotiated a perpetual license to self-host and fork as much OpenAI software as possible and to potentially license custom models.</p>\n</blockquote>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"731\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-1024x731.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-1024x731.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-300x214.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-768x549.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-1536x1097.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-2048x1463.jpg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-192x137.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-1100x786.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-560x400.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/05/Apple-M4-chip-Octane-240507-1800x1286.jpg 1800w\" /></figure>\n\n\n\n<p>It would be interesting to see how Apple tackles the challenge of AI while maintaining its public and marketing stance of prioritizing privacy. Apple has emphasized “on-device” processing and data encryption as its unique selling points, in contrast to companies like Google or Meta. About a decade ago, I examined the differing approaches of Google and Apple<a target=\"_blank\" href=\"https://www.newyorker.com/business/currency/apple-versus-google\"> in an article for The New Yorker</a>. We live in infinitely more complex times now — AI as we know it relies heavily on cloud computing, and it often compromises privacy. It absorbs data liberally from the cloud, a process necessary for personalization.</p>\n\n\n\n<p>In recent months, Apple has allowed details of all on-device research conducted by its employees to become public. I interpret these leaks as strategic marketing moves, signaling how Apple is likely to address the shift toward artificial intelligence.</p>\n\n\n\n<p>OpenAI’s partnership enables the company to apply AI directly on devices while leveraging OpenAI’s capabilities in the background — a strategy that upholds the “privacy” argument. However, it is still unclear how they manage this without diminishing the services provided.</p>\n\n\n\n<p>Nonetheless, I am pleased that Apple is beginning to adapt to this shifting paradigm. Just as smartphones revolutionized our interaction with information, AI signifies another transformation. In a recent article, I <a target=\"_blank\" href=\"https://om.co/2024/06/03/why-i-want-my-ai-tv/\">wrote</a>:</p>\n\n\n\n<blockquote>\n<p>Perhaps not today, but in the near future, we will begin to interact with information through non-textual interfaces. Until now, we have primarily used computers via keyboards (both physical and virtual) and mice. With smartphones, we started to use “touch” as a method of interaction. Whether it’s capturing receipts for Expensify or taking photos of items to shop for later, we have begun using the “camera” to capture information. As technology improves, we are increasingly using the camera as a conduit between text and ourselves. </p>\n\n\n\n<p>Cameras are already acting as non-textual conduits. Facebook’s Glasses are a good case study. We will continue to see proliferation and experimentation with new devices. Vision Pro, Ai Pin, Rabbit, or “Enter Name” are just the beginning and might become failed experiments, <a target=\"_blank\" href=\"https://om.co/2024/04/30/the-reality-optimism-of-ai-hardware/\">but there is no turning back</a>. Fast forward a decade from now — perhaps sooner — one thing is certain: the share of “keyboards” as a way to interact will be much less. A good comparison is the share of viewing minutes for linear television in the age of streaming. </p>\n\n\n\n<p>This future will indeed feature a larger presence of voice interfaces in our computing lives. The reason this hasn’t occurred so far is that the technology is not quite complete. The new AI technologies will act like Botox for voice interfaces. I discussed<a target=\"_blank\" href=\"https://www.youtube.com/watch?v=4DnMGjkygyk&amp;t=288s&amp;utm_source=www.howardlindzon.com&amp;utm_medium=referral&amp;utm_campaign=trends-with-friends-why-tech-needs-a-lesson-in-empathy-apple-stock-strategies-and-ai-optimism-with-om-malik\"> this</a> topic recently on <a target=\"_blank\" href=\"https://podcasts.apple.com/us/podcast/why-tech-needs-a-lesson-in-empathy-apple-stock/id1670692277?i=1000657295286\">Howard Lindzon’s podcast.</a> </p>\n</blockquote>\n\n\n\n<p>For me, Apple’s true strength in AI lies in its ability to drive innovations centered on core technologies. In previous discussions about <a target=\"_blank\" href=\"https://om.co/2023/10/30/apple-launches-m3-chips-with-ai/\">Apple’s chips and AI</a>, I noted that the company was slow<a target=\"_blank\" href=\"https://om.co/2023/12/06/apple-makes-a-quiet-ai-move/\"> to embrace the</a> AI revolution. However, its capability to develop chips with graphical processing and neural capabilities, and then seamlessly integrate them with its operating system and software, stands out as a distinct advantage that is often underestimated.</p>\n\n\n\n<p>Today, it may lag behind Nvidia in terms of chips needed for training, but the company can leverage its “device scale” to develop more powerful yet cheaper GPUs and neural capabilities required for on-device inference models. “Silicon” is Apple’s edge. Consequently, like everyone else, I am patiently waiting to learn what Apple will announce.</p>\n\n\n\n<p><em><strong>June 8, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"4ec325ed075ac2ce32d100e1e001c97fe59ded3295210f2e3883947cbba3804a","category":"default"}