{"title":"Jonathan Franzen on How to Write About Nature, with a Side of Rachel Carson and Alice in Wonderland","link":"https://www.themarginalian.org/2024/02/27/jonathan-franzen-spark-birds-orion/","date":1709084446000,"content":"<p><a href=\"https://orionmagazine.org/product/sparkbirds/\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"498\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sparkbirds.jpg?fit=320%2C498&amp;ssl=1\" alt=\"Jonathan Franzen on How to Write About Nature, with a Side of Rachel Carson and Alice in Wonderland\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sparkbirds.jpg?w=535&amp;ssl=1 535w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sparkbirds.jpg?resize=320%2C498&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sparkbirds.jpg?resize=240%2C373&amp;ssl=1 240w\" /></a></p><p>I grew up loving <em>Alice’s Adventures in Wonderland</em>. My grandmother read it to me before I could read. I read it to myself as soon as I could. I loved the strangeness of it, and the tenderness. As a child mathematician, I loved knowing that a grown mathematician had written it. But what I most loved about the story was Alice’s fearless curiosity and compassion as she encountered all the creatures populating Wonderland. I loved the White Rabbit and the Cheshire Cat and Bill the Lizard because Alice loved them. </p>\n<p>This is what makes Wonderland Wonderland: To its denizens, it is just their world, mundane as life. <a href=\"https://www.themarginalian.org/2012/09/12/this-is-water-david-foster-wallace/\">“This is water.”</a> What confers wonder upon it for the reader, what makes the story a story and not a vignette of ordinary life in an ordinary world, is the view through Alice’s wonder-smitten eyes as she moves through it, and wonder is the mightiest catalyst of care. </p>\n<p>We care because she cares. </p>\n<figure><a href=\"https://www.themarginalian.org/2014/07/07/best-illustrations-alice-in-wonderland/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/06/tovejansson_alice2.jpg\" /></a><figcaption>Art by Tove Jansson from <a href=\"https://www.themarginalian.org/2014/07/07/best-illustrations-alice-in-wonderland/\">a rare 1966 edition</a> of <em>Alice’s Adventures in Wonderland</em></figcaption></figure>\n<p>In the century and a half since Lewis Carroll, a lineage of writers — <a href=\"https://www.themarginalian.org/2017/09/06/richard-jefferies-beauty/\">Richard Jefferies</a>, <a href=\"https://www.themarginalian.org/tag/henry-beston/\">Henry Beston</a>, <a href=\"https://www.themarginalian.org/2022/11/30/rachel-carson-national-book-award-speech/\">Rachel Carson</a>, <a href=\"https://www.themarginalian.org/2019/08/16/underland-robert-macfarlane/\">Robert Macfarlane</a>, <a href=\"https://www.themarginalian.org/2022/06/26/richard-powers-bewilderment/\">Richard Powers</a> — have applied that method to this world, reminding us that we too are living in a wonderland, as real as it is improbable, for nowhere else across the inky vastness of spacetime strewn with billions upon billions of other star systems is there another world lush with life, as far as we yet know. </p>\n<p>“Nature writing” and “environmental writing” are odd terms, one intimating that we ourselves are not nature (which Denise Levertov captured poignantly in her poem <a href=\"https://www.themarginalian.org/2018/05/10/america-ferrera-sojourns-in-the-parallel-world-denise-levertov/\">“Sojourns in the Parallel World”</a>) and the other casting nature as something that surrounds us, in turn implying our centrality. Those writers who have gotten humanity to care about the natural world — which is the world — have done so because they themselves have moved through it with a sense of wonder, each of them an Alice making a Wonderland of Earth.</p>\n<figure><a href=\"https://www.themarginalian.org/2016/09/02/salvador-dali-alices-adventures-in-wonderland/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2016/09/salvadordali_alice3.jpg?w=1243&amp;ssl=1\" /></a><figcaption>Art by Salvador Dalí from <a href=\"https://www.themarginalian.org/2016/09/02/salvador-dali-alices-adventures-in-wonderland/\">a rare 1969 edition</a> of <em>Alice’s Adventures in Wonderland</em></figcaption></figure>\n<p>This is what Jonathan Franzen affirms in a passage from his foreword to <a href=\"https://orionmagazine.org/product/sparkbirds/\" target=\"_blank\"><strong><em>Spark Birds</em></strong></a> (<a href=\"https://search.worldcat.org/title/1394959601\" target=\"_blank\"><em>public library</em></a>) — a lovely <em>Orion</em> anthology of essays and poems celebrating the wonder of the feathered world, featuring such beloved voices as <a href=\"https://www.themarginalian.org/tag/mary-oliver/\">Mary Oliver</a>, <a href=\"https://www.themarginalian.org/tag/terry-tempest-williams\">Terry Tempest Williams</a>, and <a href=\"https://www.themarginalian.org/tag/j-drew-lanham/\">J. Drew Lanham</a>, co-edited by Franzen himself.</p>\n<p>With an eye to the basic A-to-B structure of a story propelled by a sense of purpose along the axis of its plot, he considers the challenge of creating a dramatic narrative around creatures whose primary purpose is basic survival, creatures “driven by desires the opposite of personal” and free from “ethical ambivalence or regret” — those marvelous, maddening complexities that make for the human drama. He writes:</p>\n<blockquote><p>Absent heavy-duty anthropomorphizing or projection, a wild animal simply doesn’t have the particularity of self, defined by its history and its wishes for the future, on which good storytelling depends. With a wild animal character, there is only ever a point A: the animal is what it is and was and always will be. For there to be a point B, a destination for a dramatic journey, only a human character will suffice. Narrative nature writing, at its most effective, places a person (often the author, writing in the first person) in some kind of unresolved relationship with the natural world, provides the character with unanswered questions or an unattained goal, however large or small, and then deploys universally shared emotions — hope, anger, longing, frustration, embarrassment, disappointment — to engage a reader in the journey. If the writing succeeds in heightening a reader’s interest in the natural world, it does so indirectly.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2019/06/17/the-lost-words-macfarlane-morris/\"><img src=\"https://i1.wp.com/www.themarginalian.org/wp-content/uploads/2019/06/thelostwords7.jpg?w=1200&amp;ssl=1\" /></a><figcaption>Art by Jackie Morris from <a href=\"https://www.themarginalian.org/2019/06/17/the-lost-words-macfarlane-morris/\"><em>The Lost Words</em></a> by Robert Macfarlane — a visual dictionary of poetic spells resisting the erasure of nature’s language from our cultural lexicon.</figcaption></figure>\n<p>Rachel Carson — who awakened the modern ecological conscience by making of science a magnifying lens for the inherent wonder of the natural world and rendering that wonder in the poetic language of universal emotion — conveyed this indirect enchantment in her <a href=\"https://www.themarginalian.org/2022/11/30/rachel-carson-national-book-award-speech/\">magnificent National Book Award acceptance speech</a>: “If there is poetry in my book about the sea,” she said at the ceremony where she shared a table with the poet Marianne Moore, “it is not because I deliberately put it there, but because no one could write truthfully about the sea and leave out the poetry.” In consonance with Carson’s credo that “the more clearly we can focus our attention on the wonders and realities of the universe about us the less taste we shall have for the destruction of our race,” Franzen celebrates the power of writing with feeling, with wonder, with reverence for life:</p>\n<blockquote><p>We can’t make a reader care about nature. All we can do is tell stories of people who do care, and hope that the caring is contagious.</p></blockquote>\n<p>Complement with marine biologist Andreas Weber on <a href=\"https://www.themarginalian.org/2023/12/05/biology-of-wonder-weber/\">poetic ecology and the biology of wonder</a>, then revisit Rachel Carson <a href=\"https://www.themarginalian.org/2017/08/28/rachel-carson-house-of-life-writing-loneliness/\">on writing</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"4ed3c09fdf4b5a38c1fab405246cd13ab09b8b4248b795ced80a936f2b475367","category":"default"}