{"title":"A 176-year-old mystery solved","link":"https://www.garbageday.email/p/a-176-year-old-mystery-solved","date":1730312385000,"content":"<div><div><h2>Meet The <i>Terror </i>Fan That Found James Fitzjames</h2><p><i>—by Allegra Rosenberg</i></p><p>Last month, a very specific and nerdy corner of the internet went wild at the news that the remains of James Fitzjames, third-in-command of the lost Franklin Expedition of 1845, <a href=\"https://www.nytimes.com/2024/10/04/science/franklin-expedition-cannibalism.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">had been identified</a> <a href=\"https://www.bbc.com/news/articles/cnvd51q130lo?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">thanks to a successful DNA match</a> with a <a href=\"https://www.cbc.ca/news/canada/north/franklin-expedition-descendant-dna-1.7334770?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">collateral descendant</a> found, as well.</p><p>Some outlets included the fact that the living DNA match was sought out through genealogical work done by a member of the thriving online polar exploration enthusiast community. While others framed it as the work of “a <span><i>Terror </i></span>fan,” which, while broadly accurate, doesn’t do justice to Fabiënne Tetteroo’s <a href=\"https://jamesfitzjames.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">scholarship</a> or the power <span><i>The Terror </i></span><span>has had </span>to influence people to become legitimate diehard historians. For those not in the know, <i>The Terror </i>is a 2018 AMC show with a massive — and dedicated — online fanbase. It’s currently on Netflix and highly worth your time. The 34-year-old Tetteroo is based in The Hague and I was lucky enough to catch up with her over Zoom to get the inside story. </p><p>Before diving headfirst into polar obsession, she had been an art history major. “One of my favorite historical topics was the painter Caravaggio, I was completely obsessed with that guy,” she said. “And then, about 10 years ago, I had this Richard III obsession. He was coincidentally also found under a parking lot [back then] in 2014 — with which I had nothing to do!”</p><p>Watching <i>The Terror </i>a few years after it aired because it starred Tobias Menzies and Ciaran Hinds, who had previously co-starred in HBO’s <i>Rome, </i>Tetteroo became obsessed immediately. “I didn't want to binge the whole thing in one day, so I spread it out over a few days because of the emotional damage,” she said. </p><p>She even neglected her usual practice of fact-checking historical shows on Wikipedia while watching it. Saving that for afterwards, when she picked up a handful of books on the subject, including the biography of James Fitzjames by William Battersby. The book, released in 2010, had informed Tobias Menzies’ portrayal of Fitzjames, but Tetteroo found that the real historical man was fascinating to her in a way the character wasn’t. </p><p><b>“</b>After reading [Battersby’s] book, I thought that the real Fitzjames was such a different person [than in the show], much more interesting and fun,” she said. The book’s main unanswered question was who Fitzjames’ mother was, but when Tetterroo checked to see if Battersby had written any follow-ups, she discovered that he had passed away in a plane crash in 2016. “Nobody else really seemed to be doing any Fitzjames research. So then I thought I might as well give it a go myself.”</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/407484d7-b7e0-4cc7-9766-e1e36f6a2ee6/the-terror-season-2.jpg?t=1730302573\" /><div><span><p>(Two of the internet’s favorite boys.)</p></span></div></div><p>She quickly joined the niche, but thriving online polar exploration community, as well as the overlapping fandom for <i>The Terror. </i>Very few fannish communities, historically-focused or otherwise, have this kind of material effect on actual scholarship. Polar exploration is the perfect mix of obscure (not a ton of people digging around) and complex (plenty of stuff to dig into for those few people) to allow legit discoveries to be made by anyone who puts their mind to it. The show is doing for polar history what <i>Jurassic Park </i>did for <a href=\"https://www.newsweek.com/jurassic-park-25-year-anniversary-dinosaurs-feathers-paleontology-979605?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">archaeology in the 90s</a>, basically. “Fandom had always been a sort of private thing for me,” she said. “I've never been a part of something like [this fandom before], and it’s been absolutely amazing.”</p><p>With the blessing of Battersby’s daughter, who has since become a friend, Tetterroo picked up the threads of his research and began to go in her own directions. When she managed to track down an eligible DNA match for Fitzjames’s paternal Y-chromosome — necessary in order to identify remains — she was worried that he wouldn’t want anything to do with her research. “I try to not get my hopes up about anything,” she said. “But ultimately, he was very enthusiastic, and he said he was delighted to help in any way he could.” </p><p>This genetic quest was partially inspired by work of Philippa Langley, the Richard III superfan. “I'm very much a humanities person, I have no idea how all the scientific stuff works, but I did know how they ultimately managed to find eligible DNA candidates for Richard III,” she says. “That definitely informed me on how to find a candidate for Fitzjames, because he has no direct descendants. His male siblings also didn't have sons that had sons, and most of them didn't have children at all.”</p><p>She relates especially to Langely’s unashamed emotional attachment to Richard.  “I definitely thought,<span><i> I'm having a Philippa Langley moment right now,</i></span>” she said, of the moving moment she got the news of the positive identification of Fitzjames’s remains. </p><p>She also pointed out one of my personal favorite components of the community: the focus on the biographies of the people involved. Which often, in the case of the TV show fandom, begin merely as research for fan fiction but turn into genuine historical discovery. “Most of the research has been about the expedition, about the organization, what happened after they got stuck in the Arctic, and the archeology,” she said. “But I think the actual lives of the members of the expedition have been quite overlooked. So it's amazing that people are now doing research into these people.”</p><p>Although she wasn’t one hundred percent enthusiastic about some of the news coverage of the Fitzjames find that <a href=\"https://www.theverge.com/2024/9/25/24253938/amc-the-terror-franklin-expedition-captain-james-fitzjames?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">referred to her as a fan</a>, she definitely identifies as one — with qualifications. </p><p>“The reason that I wanted to do research on the Franklin Expedition didn't come from being a fan of the show, it was just because I'd already been interested in history. It's not that I watched the show and really liked the Fitzjames character, then decided to do research. There was a step in between—and that step was reading about the actual history. But,” she says, “it's such an incredibly talented and amazing fandom, and I'm definitely so happy to be a part of it.” </p><hr /><h2>Did Anyone Ever Eat A Tide Pod?</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/70b9ccbb-4ce8-4fbe-bda1-db88a40f9a9b/tidepods.png?t=1730309479\" /></div><p>Good news everyone! It’s new Panic World day. This week we have the host of <i>Search Engine,</i> PJ Vogt, on to talk about the lasting legacy of the tide pods moral panic. Did anyone ever eat them? Did anyone ever vape them? We answer all these questions and more.</p><p><a href=\"https://podcasts.apple.com/us/podcast/panic-world/id1740187810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"><b>Hit this link right here to check out the episode on Apple Podcasts</b></a> or search “Panic World” on your podcast app of choice.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2><span>Some Good Brian Cox Content</span></h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@yevit?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\"> @yevit </a><p>I don’t think he got it @Brian Cox </p></section></blockquote><hr /><h2>Simpsons Ninjas Guy Vs. The World</h2><p><i>—by Adam Bumas</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/3ec12d14-7fcc-419d-b2a5-85afb5836761/sng.jpg?t=1730302543\" /><div><span><p>(<a href=\"https://x.com/benhugh26422354/status/1851021257640194156?s=46&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">x.com/benhugh26422354</a>)</p></span></div></div><p>For anyone not in the know, Ben Hughes has spent years on Twitter and X,<a href=\"https://www.youtube.com/watch?v=5n9e4_Pa6JE&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"> asking fan artists</a> to draw female characters from <i>The Simpsons </i>in blue ninja outfits. He doesn’t want them sexy, though — I can’t stress enough how little of a sex thing this is. Eeyore from <i>Winnie the Pooh </i>and various dinosaurs are also heavily involved for some reason.</p><p>Anyway, Ben tripped some alarms on Monday when other X users were notified he had joined a Space that had<a href=\"https://x.com/Constantinedumb/status/1851018453609824608?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"> multiple slurs in the name</a>. People were worried, but he responded immediately by leaving the space, blocking the people who invited him, and taking a bold stand against racism: “<a href=\"https://x.com/BenHugh26422354/status/1850944374190072049?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">I love my beloved husband, Eeyore. I don’t like Adolf Hitler.</a>”</p><p>Ben is <a href=\"https://x.com/BenHugh26422354/status/1851016688185081954?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">hanging tough</a>, but the lesson to take from this — such as it is — should be that this is an occupational hazard of refusing to leave X. It’s the <a href=\"https://x.com/IamRageSparkle/status/1280891537451343873?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">proverbial Nazi bar</a> now, and if you want to associate with the various scammers and creeps who have the run of the place, you’ll be associated with them. There’s no line to hold anymore. No one is safe, no one’s above suspicion if they stay. No matter how many non-sexy ninjas are on their side.</p><hr /><h2>It’s Happening Again</h2><p><i>WIRED</i> <a href=\"https://www.wired.com/story/facebook-militia-organizing-election/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">has a story</a> out this week that you need to read. Facebook is not only allowing militias to use Groups to organize anti-democracy operations ahead of next week’s election, the platform’s new AI features are auto-generating Pages for them to follow. Far-right militias are organizing ballot box burnings, recruiting supporters, and training for an armed uprising. And they are doing it on the biggest social network in the country and Meta knows about it. </p><p>The most important thing about the January 6th Insurrection was that it was organized openly, on right-wing platforms like Parler and Gab, but, most importantly, on Facebook, specifically using Facebook Events. We watched it built critical mass out in the open for months. And unless pressure is put on Meta to stop this shit right now, it’s going to happen again.</p><p>To make matters worse, <a href=\"https://www.washingtonpost.com/politics/2024/10/30/progress-2028-ads-facebook-harris-musk/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"><i>The Washington Post</i></a><a href=\"https://www.washingtonpost.com/politics/2024/10/30/progress-2028-ads-facebook-harris-musk/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"> reported</a> this morning that a swarm of ads pretending to be pro-Harris, but paid for by Elon Musk’s Super PAC are hitting Facebook right now. And, yes, Meta knows about those, as well.</p><hr /><h2>Jimmy Fallon Finally Faces The Rizzler</h2><p>A.J., Big Justice, and The Rizzler, better known as The Costco Guys, went on <i>The Tonight Show</i> this week. It was an interesting interview for several reasons! The first is that A.J., real name A.J. Befumo, is clearly just a very nice guy who likes making videos with his family. It also seems like this entire thing was built around Befumo trying to get back into professional wrestling, which also kinda rules. Smart content play tbh.</p><p>The other important revelation is that Fallon was seemed <a href=\"https://x.com/saltydkdan/status/1851434921367056438?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">genuinely frustrated</a> by the entire thing. And I have to imagine this is somewhat disorienting for him. Now that <i>The Ellen Show</i> is off the air, he’s basically the last TV host of the “Gangnam Style era” that’s still on TV. Fallon is basically living out that scene in <i>Oppenheimer</i> where Oppenheimer hallucinates the entire crowd being vaporized by an atomic bomb, but in this case it’s the lasting societal impact of professionalizing family-friendly viral content.</p><hr /><h2>The Catholic Church Has Their Own Anime Mascot Now</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5b8a8e8e-4a36-4d33-913d-7e25feb6cb99/Screenshot_2024-10-30_at_12.56.18_PM.png?t=1730307395\" /><div><span><p>(Vatican)</p></span></div></div><p>The Pope finally has a waifu, I guess. Her name is Luce and she’s supposed to be a “pilgrim\". She was created by Tokidoki, which is not a Japanese design company, but meant to look like one, run by Italian artist Simone Legno. Her name means “Light” in Italian. Excited to see what she does with a Death Note.</p><p>Luce was commissioned for the 2025 Jubilee (Catholic thing, don’t worry about it) and she’s going to be the Vatican’s mascot at an expo in Osaka, Japan.</p><p>There’s already <a href=\"https://x.com/search?q=luce&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">a lot of fan art</a> of her and even <a href=\"https://x.com/RehumanizeMaria/status/1851340102405964031?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">cosplay</a>. Hopefully Luce can finally get that <a href=\"https://soranews24.com/2024/09/03/chiitan-launches-official-cryptocurrency-chiitan%E2%98%86coin-understands-if-you-dont-want-to-buy-it/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">degenerate Chiitan</a> on the straight and narrow.</p><hr /><h2><span>A Good Halloween Post</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4aeb49d5-8fac-4330-8b40-e752535d8695/Screenshot_2024-10-30_at_11.42.55_AM.png?t=1730302992\" /><div><span><p>(<a href=\"https://x.com/emonormie/status/1850062835033731527?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">x.com/emonormie</a>)</p></span></div></div><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.thenation.com/article/culture/jon-stewart-daily-show/?utm_source=pocket_shared\" target=\"_blank\">“25 Years of Indecision With Jon Stewart”</a></p></li><li><p><a href=\"https://www.cracked.com/article_44148_the-comedy-world-has-been-waiting-to-talk-about-how-much-tony-hinchcliffe-sucks.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\">“The Comedy World Has Been Waiting to Talk About How Much Tony Hinchcliffe Sucks”</a></p></li><li><p><a href=\"https://www.thecut.com/article/bald-ann-dowd-interview-alison-sivitz.html?utm_source=tw&amp;utm_campaign=nym&amp;utm_medium=s1\" target=\"_blank\">“Who Is Bald Ann Dowd?”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://x.com/SchwayJohn/status/1851027152189145342?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=a-176-year-old-mystery-solved\" target=\"_blank\"><i>The Pingu</i></a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=c45a07cb-bfe2-4aa5-988c-46869f733d1f&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"4f07f6d1babfe8a5cc2831cc4bf37b741feda44cc2e8f8029b2462165fa826a9","category":"Sites"}