{"title":"Scraps from my notes file","link":"https://interconnected.org/home/2024/11/08/scraps","date":1731093060000,"content":"<div>\n<p>I’ve been busy this week so here you are, some scraps from my notes file.</p>\n<hr />\n<p>There’s a legal right called <em>equality of arms.</em> So both parties should have a similar right to cross-examination, for example. But also this is where legal aid comes from: the state will pay for legal representation for people it’s prosecuting because of this principle.</p>\n<p>Should we have equality of arms in elections?</p>\n<p>Give all parties their own Russia disinfo bot farm.</p>\n<hr />\n<p>My computer just pinged. Goodness only knows what about.</p>\n<p>I want to be able to point to it from across the room and yell <em>WHAT did you say?</em></p>\n<p>(And have it answer.)</p>\n<hr />\n<p>How did companies work before computers?</p>\n<p>I listened to an episode of <em>The Men from the Ministry</em> which is a middling-to-awful BBC radio comedy about government bureaucracy that ran from 1962 to 1977. (Confession: I love it.)</p>\n<p>Mildred, the secretary, gets promoted to being an acting junior executive and mentions that she now receives “action forms”. i.e. things that she has to do.</p>\n<p>“Action forms” aren’t explained so I assume this is a well-understood term of art, like saying “spreadsheet” or “email”.</p>\n<p>And I know bits and pieces of pre-computers bureaucracy – memos, runners, filing systems. But I’d love to know how it all hangs together.</p>\n<p>(Because when we’re building virtual employees with squads of AI agents, optimising rivers of flows of information and action and making it observable, we’re basically implementing high-frequency bureaucracy.)</p>\n<p>Then in today’s corporate world, we also have organs in the company body: people who “heads of” whose jobs are essentially to sit on a topic and be a combination of (a) knowledge and (b) a Schelling point – so in an organisation, if you want to know how X works, you can talk to that person, and they will also act as a requirements gathering node or router. But they’re really employed to be a single face that other people can attach to an abstract topic and have a human salience sense for information and making connections.</p>\n<p>Do we also have a typology of <em>those</em> kinds of roles?</p>\n<p>How do companies <em>actually</em> work? Old ones and new ones. Book recommendations please.</p>\n<hr />\n<p>Cereal boxes no longer say <em>\"contents may settle in transit.\"</em></p>\n<p>It always used to be printed on the side.</p>\n<p>I wonder when that phase was removed, and for what reason, and on whose say-so. And how many meetings it took.</p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"4f77b45b78c32ea27b029b8c89296e8b8c744801b3d4a71ef66629133bbb65e8","category":"Sites"}