{"title":"Twenty years ago today","link":"http://scripting.com/2024/06/17/152838.html?title=twentyYearsAgoToday","date":1718638118000,"content":"<p>I was talking with a friend over the weekend about the origins of podcasting, and how, in June of 2004, I finally decided to do an audio post, to get my feet wet, and to prove all you needed was a laptop and a little software and you could be doing radio almost as easily as writing a blog post. </p>\n<p>That was <a href=\"http://scripting.com/2004/06/11.html#When:9:13:45AM\">June 11, 2004</a>. </p>\n<p>Then it hit me, it's June <i>2024</i> now, it's been <i>twenty freaking years</i>. </p>\n<p>In hindsight, that podcast was the start of the bootstrap that saw a dozen shows by September and then hundreds and thousands, and now here we are, podcasting has been through quite a few bursts of growth and it's still as open as it was back in June 2004. </p>\n<p>Anyone with a laptop can do a podcast. That was the goal. You don't need anyone's permission. That was a breakthrough in radio. Prior to that, you had to get a lot of approval, and every step made it less real and less interesting. </p>\n<p>My partner in this at the time was <a href=\"https://www.google.com/search?q=site%3Ascripting.com+Adam+Curry\">Adam Curry</a>. Sometime in that period he started <a href=\"https://en.wikipedia.org/wiki/Daily_Source_Code\">The Daily Source Code</a>, and then we did a podcast together for a few months called <a href=\"http://secrets.scripting.com/\">Trade Secrets</a>. My own podcast was called <a href=\"http://morningcoffeenotes.com/\">Morning Coffee Notes</a>. </p>\n<p>So I thought, why not do a Serial-like podcast over the next few months, with the actual programs from 2004, along with the Trade Secrets shows. I think I have them all archived. And it would be great if Adam did the same with his shows, starting when they started. And Dawn &amp; Drew, Dave Slusher. This can go on forever if you like. (I promise mine won't.)</p>\n<p>So here's the URL for the podcast.</p>\n<p><a href=\"http://scripting.com/podcast0/rss.xml\">http://scripting.com/podcast0/rss.xml</a></p>\n<p>I'm sure there will be a lot of cringeworthy moments, but what the heck. I'll hopefully have the feed up before the end of the day, and I'll register it with Apple so will hopefully be transcripts. </p>\n<p>I hope I can count on you to spread the word, this is how the podcasting bootstrap happened. If you want to learn how two weird geek hippie types like Adam and myself, can have an idea, and then by constantly trying out new approaches, eventually it sticks and becomes a new medium that's still thriving twenty years later. </p>\n<p>It should be quite a story! :-)</p>\n<p>Here's a picture of myself and Adam at Gnomedex in the summer of 2004. And that's the laptop I used to make all these podcasts. I was living in Seattle at the time. </p>\n<p></p><div><img src=\"https://imgs.scripting.com/2024/06/17/gnomedexDaveAdam.png\" />Dave and Adam at Gnomedex in 2004.</div><p></p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"4fdf0a8cbcac14dd859088827ac9e08cea10334fea4950a2a9466e671779e0d6","category":"default"}