{"title":"Use the internet, not just companies.","link":"https://sive.rs/netskill","date":1518393600000,"content":"<p>\nI’ve been online since 1994, and seen so many companies come and go.\n</p><p>\nIn the year 2000, the place to be was mp3.com.\nEvery musician would keep all of their music and fans there.\nA few years later, it was gone — shut down — all music and fan lists deleted.\n</p><p>\nIn 2005, it was MySpace.\nAgain, musicians kept all of their music, photos, and fans there.\nA few years later, it was gone.\nNot shut down, but basically moot.\nThere was no way to communicate with all of those people, because you didn’t have their direct contact info — you only had their MySpace inbox, which nobody checked anymore.\n</p><p>\nAs I’m writing this now in 2018, it’s Facebook, YouTube, and Spotify.\nJust like with mp3.com and MySpace, people act like these websites are everything, and keep all of their music, photos, and fans there.\nBy the time you read this, they might be gone.\n</p><p>\n<strong>\nDon’t depend on a company.\nThey come and go.\n</strong>\nThink long-term.\nYou’re going to be creating stuff, making fans, and building relationships for the rest of your life — much longer than these companies will last.\n</p><p>\n<strong>\nSo have your own website.\n</strong>\nInstead of sending your fans to some company’s site, send them to yours.\nGet everyone’s direct contact information so you don’t have to go through a company to reach them.\n</p><p>\n<strong>\nYour website should be the definitive place to get everything you create.\n</strong>\nIf you put your stuff on some company’s site, have it be secondary — a copy of the stuff that’s already on your site.\nThat way you can use the popular networks without depending on them.\n</p><p>\nOnly rely on open standards that aren’t owned by any company — like email and the web.\n</p>\n<h3>\nEmail skills:\n</h3>\n<p>\nGo into your email settings, and make sure you <strong>have a signature</strong>.\nYou need this because you’re going to be emailing people who have no idea who or where you are!\nGive them some context.\nYour signature should say who, what, and where, with a URL or two.\nFor example:\n</p>\n<pre>\n--\nMaya Danubé, fragrant jazz bass clarinet, New York City\nhttp://mayadanube.com  me@mayadanube.com  (917)611-5310\nWatch &amp; listen: https://www.youtube.com/user/mayadanube\nFriend me, baby: https://www.facebook.com/mayadanube\n</pre>\n<p>\nWhen you email people, write a <strong>descriptive subject</strong>.\nNever “hey” or “booking”.\nTry “Available June 6 for showcase?” or “introduction to photographer”.\nThis is considerate.\nNow when your email is one of hundreds in an inbox, it will say exactly what is contained inside.\n</p><p>\nMake it <strong>as short as possible</strong>.\nThe shorter your email, the more likely it will get a response.\nBe direct.\nFive sentences is ideal.\nIf your email is too long, they are likely to procrastinate, and never get back to it.\n</p><p>\nUse short paragraphs.\nLeave plenty of space.\nReading a screen is different from reading a book.\n</p>\n<h3>\nWeb skills:\n</h3>\n<p>\n<strong>\nKnow how to update your website.\n</strong>\nDon’t depend on someone else to do this for you.\nKnow how to add new songs or videos, and how to make any changes.\n</p><p>\n<strong>\nKnow your URLs.\n</strong>\nTelling someone to go search for you is like telling them to look up your phone number.\nInstead, know your exact URLs (yoursite.com, twitter.com/something, facebook.com/whatever) so you can give it to people directly.\nIf you don’t, they’ll probably never bother to go search for you.\n</p><p>\n<strong>\nKnow how to make an MP3.\n</strong>\nGive it a good filename like YOUR_NAME-Song_Title.mp3 (not mix7.mp3)\nDon’t use spaces in the filename.\nEdit the ID3 tags to put your full name and URL in the info, so whoever has this MP3 knows who it is and how to find you.\n</p><p>\nSorry if these sound too basic to you.\nBut you’d be surprised by how many people don’t know these skills, and so are silently handicapped when interacting with the world.\n</p>\n<img src=\"/images/internet-skills.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"504b8c4939ed0b9aac3e26abea706d5baaed8059cb34b04eed0d80f4ade31dfe","category":"default"}