{"title":"Lessons from a Voyage","link":"https://www.usv.com/writing/2024/08/lessons-from-a-voyage/","date":1723127544000,"content":"<p>I have just returned from an exciting voyage: crossing the Atlantic on a sailboat. You can find updates from along the way on the J44 Frolic website , Twitter/X and Instagram accounts. In this post I am gathering up my lessons learned. Some of these are just about sailing, in particular passage making, and some are broadly applicable life lessons.</p>\n<p>Offshore sailing is intense. I always had great respect for offshore sailors, and in particular solo sailors, and this voyage has only deepened that. To be successful requires lots of different skills: navigation, sail trim, anchoring/docking, mechanical, plumbing, electrical (AC and DC), fishing, cooking. Not everyone on board needs all of these but it is good to have all of them as part of the crew, ideally redundant. If you want to follow exciting single handed racing, I highly recommend the upcoming Vendée Globe race . On each of these skills, experience makes a huge difference. Going into this adventure there was a lot that I understood theoretically but had never done (I had zero offshore experience). So I was thrilled to do this with my friend HL Devore who has extensive offshore experience, including two prior Atlantic crossings.</p>\n<p>Technology has made passage making much easier. The voyage also increased my respect for what it took to cross the oceans in the past with minimal technology. We had access, via Starlink, to up-to-date weather information. We had redundant chart systems including on board but also on our phones, so we knew at all times where we were and how quickly we were making progress. We had a fantastic auto pilot that was able to steer accurately even in fairly confused sea states. We were able to make fresh water on demand with an advanced filtration and desalination system. We had fresh food in a fridge and frozen food, including ice cream (!), in a freezer. We had an electric kettle for fast water heating. An ice maker to add ice cubes to our water. A hot pot for making rice and other dishes. You don’t have to go very far back to get to a time when none of this was available. And yet people crossed the oceans routinely.</p>\n<p>Clear and non-defensive communication is essential. Everything on a boat has precise terms to identify what it is and what action is supposed to be taken. It is essential to learn this language to be able to communicate quickly and precisely. There are some areas where different sailors will use different terms and so it’s good to converge on terminology for the boat. Beyond precision it also matters that communication has to be non-defensive. Everybody on board can speak up at an moment if they see or hear something that others should know. And when someone speaks to you, you always acknowledge that you have heard and understood by saying “copy.” For example you might say “small craft 5 boat lengths out at 2 o’clock” and helm will acknowledge with “copy” even if they have already seen it. So much miscommunication can be avoided simply by acknowledging what has been said.</p>\n<p>Alertness is crucial. Always be on the lookout for things that look or sound strange. A line hanging slack that is normally tight. Or a clanging noise that wasn’t there before. All of this requires a high degree of alertness and also intimate knowledge of the normal state of the boat. For example water flowing by the boat often makes a gurgling sound when you are below deck and close to the sides. But at one point I heard a gurgling sound coming from an unusual location. We investigated and it turned out that a hose had come loose and we were spilling fresh water.</p>\n<p>Know your boat inside out. Some people may be tempted to buy a new boat for an adventure like this. But every boat handles differently. And new boats often have small issues that will only bet detected while out at sea. We bought a used J44, a boat that my partner in this adventure has been sailing for over a decade. We then completely overhauled the boat and took it on several shake down cruises and races, with the ultimate pre passage shake down being the Newport Bermuda race. You also want to know the details of systems performance. For example fuel consumption of a diesel engine varies non-linearly with RPM. For example on Frolic the fuel consumption goes up by 33 percent from 1800 to 2000 RPM.</p>\n<p>Life is supported by systems. Spaceships are called ships for a reason – they are both life support systems for humans. The ocean is not quite as uninhabitable for humans as space but it is definitely not where we can live without technology. Our water maker was a great example of that. In its absence we would have needed to bring a large quantity of freshwater along (and would likely have to ration it which results in being dehydrated). Systems need redundancy in case they break and you can’t fix them. We always had some water in jugs to tide us over, but we also had a mid sized and even some handheld desalination systems).</p>\n<p>Observation matters. It is always important to complement what electronic systems spit out with what we can observe directly. Modern weather forecasts are amazingly accurate. But local weather can still differ significantly and sometimes forecasts will be wrong. It really helps to understand the weather at different scales, from the very large (the entire North Atlantic), to the region you are in (e.g. the Azores), down to the specific location. Another example of a system that helps tremendously but needs to be complemented with observation is the Automatic Identification System (AIS). It uses VHF to communicate the identities of boats, along with their location, heading, and speed. This makes it much easier to identify and avoid potential collisions. When we were approaching Portugal we had to cross through shipping lanes and it would have been much more challenging without AIS. But we did encounter two cargo ships that were not properly broadcasting. One was highly intermittent (and would only show up on our chart plotter occasionally), the other one not at all. We encountered the second one at night and had to fall back to visual observation and hailing the other vessel.</p>\n<p>Slow is fast. Take the time to talk things through, such as a spinnaker take down. This means making sure everyone understands their role and the sequence of tasks. Prepare everything that can be prepared, such as getting any lines properly coiled that need to run out or having sail ties at hand. Move deliberately around the boat . Something going wrong is not only dangerous but will usually take a lot more time to fix than getting it right in the first place. This is even true when something has already gone wrong. We did great overall but did wind up with one accidental jibe. The instinct might be to rush and fix that immediately but it is much better to take the time to make sure everyone is ok, the boat is ok, and then make a plan to jibe back in a controlled fashion.</p>\n<p>Preparation requires anticipation. We were incredibly well prepared. We had all the tools and parts on board we needed. We had all the medications on board to treat everyone on the crew for a variety of thankfully small issues. We had enough fuel to get through some of the light or no wind stretches. All of this was the case because we anticipated what the problems might be that we could encounter. You can’t get stuff onto your boat once you are in the ocean. Our planned path via the Azores is notorious for people running out of fuel or food or both because of the extent of the Azores high.</p>\n<p>Safety is not negotiable. Our default was to wear harnesses when on deck and to clip in. The only times we would not do that was during the day time in extremely calm sea state while motoring. All it takes is one wrong step for someone to go overboard. And at night or with six foot waves it is not only hard to see someone, especially when the boat is flying along at 10 knots, but also tricky and dangerous to get back to them and get them back on board. Another key rule is “one hand for yourself and one hand for the boat.” This is where the expression “single handed” sailing comes from. I violated this rule once by trying to bring two bags below at the same time (coming back to the boat at the dock). I missed the last step down the companion way, twisted around and fell backwards into the galley, hitting my head on the stove. I was lucky and came away with some scrapes and bump on the back of my head but it could have easily ended badly.</p>\n<p>Good food makes everyone happy. We were fortunate to have my son Peter Wenger on board as a chef. He had pre-cooked some meals which we carried in our freezer. But he also made many wonderful things fresh, such an incredible Mahi Mahi ceviche from a fresh catch. And of course my personal favorite: French toast for breakfast.</p>\n<p>Great on shore support really helps. There is some fear associated with being far out on the ocean where help can be a long way away. And so it is wonderful to have strong on shore support. Psychology really matters for well being and stress. When I fell down it was great to do a call with med team and get concussion assessment. We relied on Katie and Jessica from Regatta Rescue for medical support. They were terrific and also had put together an incredible med kit for us to bring along. We also got daily macro weather updates from Ken McKinley at Locusweather . Finally, it was fantastic to have family emotional support, in particular from Susan “Gigi” Danziger , who also helped with logistics, such as getting to Newport, and joined us in Bermuda, for cruising in the Azores , and in Lisbon upon arrival.</p>\n<p>All in all this passage was an incredible adventure and I feel fortunate to have been able to experience this passage. I hope this will not be my last one and am already thinking about what bringing the boat back a</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/lessons-from-a-voyage/\">Lessons from a Voyage</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"51073640629a57f0efa084a96d4a5e9153f404aa2022e4f270e4f39878ab08ac","category":"default"}