{"title":"&#8220;How First Contact With Whale Civilization Could Unfold&#8221;","link":"https://kottke.org/24/02/how-first-contact-with-whale-civilization-could-unfold","date":1708958664000,"content":"\n        <p><a href=\"https://www.theatlantic.com/science/archive/2024/02/talking-whales-project-ceti/677549/?gift=S4EwRLGNogt2Kqjs1lNdf1C5Zvy59Sc8vQ93xrMMh-I\">Ross Andersen for the Atlantic</a> on the effort to talk to sperm whales using AI tech:</p>\n\n<blockquote><p>Their codas could be orders of magnitude more ancient than Sanskrit. We don’t know how much meaning they convey, but we do know that they’ll be very difficult to decode. Project CETI’s scientists will need to observe the whales for years and achieve fundamental breakthroughs in AI. But if they’re successful, humans could be able to initiate a conversation with whales.</p>\n\n<p>This would be a first-contact scenario involving two species that have lived side by side for ages. I wanted to imagine how it could unfold. I reached out to marine biologists, field scientists who specialize in whales, paleontologists, professors of animal-rights law, linguists, and philosophers. Assume that Project CETI works, I told them. Assume that we are able to communicate something of substance to the sperm whale civilization. What should we say?</p></blockquote>\n\n<p>One of the worries about whale/human communication is the potential harm a conversation might cause.</p>\n\n<blockquote><p>Cesar Rodriguez-Garavito, a law professor at NYU who is advising Project CETI, told me that whatever we say, we must avoid harming the whales, and that we shouldn’t be too confident about our ability to predict the harms that a conversation could cause.</p>\n\n<p>The sperm whales may not want to talk. They, like us, can be standoffish even toward members of their own species-and we are much more distant relations. Epochs have passed since our last common ancestor roamed the Earth. In the interim, we have pursued radically different, even alien, lifeways.</p></blockquote>\n\n<p>Really interesting article.</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/artificial%20intelligence\">artificial intelligence</a> · <a href=\"https://kottke.org/tag/language\">language</a> · <a href=\"https://kottke.org/tag/Ross%20Andersen\">Ross Andersen</a> · <a href=\"https://kottke.org/tag/whales\">whales</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/how-first-contact-with-whale-civilization-could-unfold\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"517e472b80603272f390a2edad0b7e32acf85122e2d0c593548c5ebedbb77c35","category":"default"}