{"title":"Joining Union Square Ventures","link":"https://www.usv.com/writing/2024/01/joining-union-square-ventures-4/","date":1704378018000,"content":"<p>I am delighted to share that I have joined USV as a <a href=\"https://avc.com/2010/08/what-is-a-venture-partner-and-does-it-matter-to-you/\">Venture Partner</a> in NYC where I will lead new investments, help to support founders in our portfolio, and work with the USV team as we evolve our thesis. </p>\n\n\n\n<p>I have spent the entirety of my career immersed in the world of startups. From joining tumblr as employee number eight to founding and exiting GroupMe and Fundera and angel investing in over eighty companies and venture funds, this is all I know. There is nothing more invigorating, rewarding, and fun than building things and solving problems with people you love. </p>\n\n\n\n<p>The primary role I’ve played throughout my startup journey has been Founder. After doing it for over a decade, I took some time to reflect on whether I wanted to play a different part. There are things I have loved about it: the buck stops with you, you have control and are ultimately responsible for the outcome, and you get to build the team to solve a problem. I am also my best self when the stakes are high. But there are things that I’ve found frustrating about it, namely that you spend roughly a decade of your life maniacally focused on solving a singular problem. That level of focus and commitment is required to accomplish important and hard things, but sometimes it feels like the world can pass you by when you have your head down.</p>\n\n\n\n<p>I want to keep my head up, remain entrepreneurial, and focus on a new abstraction layer. Instead of one specific problem and solution, I am most excited about bold, thematic change and I think venture is the most powerful mechanism to fuel it. USV’s thesis-driven approach does exactly this. Being thesis-driven means that we have <a href=\"https://avc.com/2016/06/strong-views-weakly-held/\">strong opinions (weakly held)</a> about how the world will unfold in the future, and more importantly, how we’d like to see it unfold. It means we publicly talk about those things and support entrepreneurs who see similarly, but can also show us new perspectives that change our thinking and are brave enough to nudge the world in a new and better direction. It also means that when we do it well we can support many different problem-solving threads that tie together to create real change and progress for billions of people across the globe. To me, this is exhilarating and it’s the type of entrepreneurial venture I want to practice. </p>\n\n\n\n<p>It’s an honor to join the team at USV for many reasons. This site and its partners’ respective blogs (and <a href=\"https://jaredhecht.com/2021/08/30/the-world-after-capital/\">book</a>) are where I’ve turned time and time again to learn about entrepreneurship and how our world and technology intersect and progress together. It has been a constant spark and source of inspiration and knowledge for me. Throughout my interactions with the firm, the thing that has stood out most is the way the people at USV speak about and treat entrepreneurs, especially when the rest of the world isn’t listening. You cannot fake the kind of genuine reverence they have for Founders. It is infectious, authentic, and inspiring and it is embedded in every action they take. </p>\n\n\n\n<p>A couple of months ago Nick showed me the brochure Fred and Brad put together in 2004 to raise money for USV’s first fund. The first paragraph struck a powerful chord: </p>\n\n\n\n<blockquote>\n<p><em>Tommy Davis, co-founder of not one, but two successful venture capital firms – Davis &amp; Rock and the Mayfield Funds – believed that the most important factor in his investment decision was the people. In the book, The New Venturers, Davis is quoted as saying he looked for the following in entrepreneurs: integrity, motivation, market orientation, technical capability, accounting capability, and leadership. Of these characteristics, there was one he considered critical. “A [person] is entitled to set their own goals,” he said, “but when I go to the racetrack, I try to pick the horse that wants to run.” We believe that all of these characteristics are equally important in venture capitalists. We have them, but most importantly, we want to run.</em></p>\n</blockquote>\n\n\n\n<p>I want to run. I need to run. It’s how I am wired. I am here to partner with and support Founders who inspire us and are dedicating themselves to solving important problems while building products people love to use. Some of the areas within our thesis I find particularly exciting right now are in self-directed healthcare (ie empowering people to take control of their health in novel and networked ways <a href=\"https://jaredhecht.com/2023/11/27/pediatric-healthcare-and-summer-health/\">outside the constraints of the traditional healthcare system</a>), consumer fintech applications that expand access to financial well-being (particularly ones that <a href=\"https://youtu.be/VHnhWXbcBEE?si=raPUyCG1T6RUz0no\">leverage the benefits of crypto rails while abstracting away their complexity</a>), and <a href=\"https://jaredhecht.com/2022/08/01/marketplaces-lead-generation-and-brokerages/\">marketplaces</a> that unleash the power of the internet in new and unexpected places. I write about these things on <a href=\"https://jaredhecht.com/\">my blog</a> where I share lessons from building companies and working with entrepreneurs, and workshop the things I’m learning and thinking about.</p>\n\n\n\n<p>If you are an entrepreneur and you also need to run, I’d love to help you go further and faster. I’m at <a href=\"mailto:jared@usv.com\">jared@usv.com</a>.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/01/joining-union-square-ventures-4/\">Joining Union Square Ventures</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"51db7ab7bf053045cba603c502e31a46d8907bd30059d8e481467677171f38d9","category":"default"}