{"title":"The joy and freedom of harmlessly upsetting social norms","link":"https://sive.rs/nor","date":1682035200000,"content":"<p>\nMy band was playing a gig in Oslo, Norway, when I struck up a conversation with a woman who was staring at me.\nTurns out we had read many of the same books, and we were super-attracted to each other.\nWe talked all night, but just as things got physical in my hotel room, house-keeping came knocking on the door saying we needed to check out now.\nRight now.\nDamn.\n</p><p>\nI checked out of my hotel at 10am, but my ferry to Denmark didn’t leave until 4pm. \nShe and I sat in the park, swooning over each other, both wishing out loud that we could have some more physical time together.\nBut then I noticed that this park was surrounded by hotels.\nSo I suggested something that felt kind of naughty.\n<strong>\n“Why don’t we get a hotel room for a few hours?”\n</strong>\n</p><p>\nShe was pleasantly shocked, and said OK.\nBut Oslo is a small city, and she had just broken up with her ex a week before. \nShe didn’t want people to see us going in or out of a hotel together.\nSo she suggested this plan:\n<strong>\nI would check in first, then text her the room number once I was inside, and she’d come up afterwards.\n</strong>\n</p><p>\nI walked into a nice hotel and said I needed a room for the night.\nThe very polite and proper man at the front desk gave me a room, and told me where breakfast would be served.\nI thanked him and went into my room.\nShe came up a few minutes later.\n</p><p>\nA few hours later, we left separately.\nI left first, and went to the same man at the front desk to say I’m checking out early.\nHe asked if something was wrong, but I said, “No no, I’m happy to pay full price. Just a change in plans. I’m catching the 4pm ferry.”\n</p><p>\nAfter charging my card, <strong>he noticed her walking out of the elevator and out the door</strong>.\nApparently he had also noticed her walk in a few minutes after me.\n<strong>\nSuddenly he got really angry, thinking she was a prostitute and I was her client.\n</strong>\nHe yelled at me, scolding me, saying, “I do NOT like this! No! This is a respectable hotel! This is not some kind of pay-by-the-hour place! How dare you?!”\n</p><p>\nI couldn’t stop smiling.\nHe had already charged my card.\nI had done nothing wrong.\nNobody was hurt.\nThey were paid for their room.\nI hadn’t broken the law or even the rules.\n<strong>\nI didn’t need to appease him!\n</strong>\nI smiled and left.\n</p><p>\nThere was something so <strong>emancipating</strong> about this!\nWe grow up fearing getting in trouble.\nFirst from our parents, then teachers.\nAuthorities.\nSo when you come into a certain age and power yourself, it’s liberating to realize <strong>you don’t have to please these people</strong> anymore.\nEspecially in business situations, where you’ve done a fair transaction and you’re not breaking any laws.\n</p><p>\n<strong>\nWe’re not actually bound to social norms.\n</strong>\nWe don’t need permission.\nWe don’t need to please everyone.\n</p><p>\nThere are <a href=\"https://sive.rs/villain\">a few people</a> around the world that don’t like me because I’ve done something that goes against their wishes.\nBut if I haven’t harmed anyone, haven’t broken the laws, and haven’t violated my own principles, then I’m totally OK with that.\n</p><p>\nEven if people say I’m a bad person, it’s <a href=\"https://sive.rs/u\">not true</a>.\nThey’re just saying I did something they don’t like.\nIt’s OK to let a misunderstanding stay misunderstood, and move on.\n</p><p>\nSo that moment, walking out of a hotel in Oslo Norway, was a major milestone in my life.\n<strong>\nI had never felt so liberated.\n</strong>\nAnd that feeling has stayed with me since.\n</p><p><em>\n(See also: “<a href=\"https://sive.rs/villain\">Happiness is letting someone make you the villain</a>”.)\n</em></p>\n<figure>\n<a href=\"https://flickr.com/photos/mariorm/34386901630/\"><img src=\"/images/Vigeland.jpg\" alt=\"Vigeland by Mario RM\" /></a>\n<figcaption>photo from Frogner Park in Oslo Norway by <a href=\"https://flickr.com/photos/mariorm/34386901630/\">Mario RM</a></figcaption>\n</figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"520ca76df7db505f2808ab0a0a083f3995acdb7fba931e7502936384a55c1355","category":"Sites"}