{"title":"War, Peace, and Our Possible Futures: George Saunders on Storytelling the World’s Fate and the Antidote to Media Manipulation","link":"https://www.themarginalian.org/2024/01/24/george-saunders-braindead-megaphone/","date":1706127653000,"content":"<h3>“War is large-scale murder, us at our worst, the stupidest guy doing the cruelest thing to the weakest being.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Braindead-Megaphone-George-Saunders/dp/159448256X/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"496\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?fit=320%2C496&amp;ssl=1\" alt=\"War, Peace, and Our Possible Futures: George Saunders on Storytelling the World’s Fate and the Antidote to Media Manipulation\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?w=774&amp;ssl=1 774w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?resize=320%2C496&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?resize=600%2C930&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?resize=240%2C372&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/braindeadmegaphone_saunders.jpg?resize=768%2C1191&amp;ssl=1 768w\" /></a></p><p>“All the goodness and the heroisms will rise up again, then be cut down again and rise up,” John Steinbeck <a href=\"https://www.themarginalian.org/2016/12/30/john-steinbeck-new-year/\">wrote to his best friend</a> at the peak of WWII. “It isn’t that the evil thing wins — it never will — but that it doesn’t die.” </p>\n<p>This is a story many believe to be true — a story about human nature, written into the scripture of original sin, ensuring that we will go on perpetrating evil for as long as we keep telling and believing that story.</p>\n<p>We — as individuals, as a culture, as a species — rise and fall to the expectations placed upon us, most of all to the expectations we place upon ourselves. After all, our very minds are <a href=\"https://www.themarginalian.org/2023/06/20/the-experience-machine-andy-clark/\">model-fulfillment machines</a>. Bruce Lee understood this: “You will never get any more out of life than you expect,” he <a href=\"https://www.themarginalian.org/2016/08/01/bruce-lee-notebook/\">wrote to himself</a>. All expectation is a story — a story about what is true and what is possible — and a story is a model of reality. But the history of our species is the history of mistaking our models for reality, only to find them unmasoned by the sudden revelation of another region of reality, another possibility — our mathematical models of how the universe works (Einstein’s relativity upends Newton’s clockwork cosmos, and suddenly space and time are new, are one), our political models of how the world works (the French Revolution upends the feudal system, and suddenly a constellation of people’s republics lights up the possibility of liberal democracy), our personal models of how the self works (you fall in love with the most improbable person, and suddenly your entire story of who you are and what you want is rewritten).</p>\n<figure><a href=\"https://society6.com/product/secret-garden8757613_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=680%2C850&amp;ssl=1\" width=\"680\" height=\"850\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?w=1512&amp;ssl=1 1512w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=320%2C400&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=600%2C750&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=240%2C300&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=768%2C960&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?resize=1229%2C1536&amp;ssl=1 1229w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/secretgarden.jpg?w=1360&amp;ssl=1 1360w\" /></a><figcaption>Available <a href=\"https://society6.com/product/secret-garden8757613_print?curator=brainpicker\" target=\"_blank\">as a print</a>.</figcaption></figure>\n<p>All models of reality are drawn by an imagination filtered through our fears and our hopes in a proportion mediated by our conditioning, which is always the function of story. It is the stories we believe that shape what we become, shape what the world is. In an age when commercial media have become the great conditioning engine of society, selling models of reality because they are profitable and not because they are true, it matters all the more what stories we believe, and what we resist. </p>\n<p>That is what <a href=\"https://www.themarginalian.org/tag/george-saunders/\">George Saunders</a> explores throughout his prophetic 2007 essay collection <a href=\"https://www.amazon.com/Braindead-Megaphone-George-Saunders/dp/159448256X/?tag=braipick-20\" target=\"_blank\"><strong><em>The Braindead Megaphone</em></strong></a> (<a href=\"https://search.worldcat.org/title/83758981\" target=\"_blank\"><em>public library</em></a>), composed in the wake of the American invasion of Iraq and in the infancy of social media. He writes:</p>\n<blockquote><p>In the beginning, there’s a blank mind. Then that mind gets an idea in it, and the trouble begins, because the mind mistakes the idea for the world. Mistaking the idea for the world, the mind formulates a theory and, having formulated a theory, feels inclined to act.</p>\n<p>Because the idea is always only an approximation of the world, whether that action will be catastrophic or beneficial depends on the distance between the idea and the world. </p>\n<p>Mass media’s job is to provide this simulacra of the world, upon which we build our ideas. There’s another name for this simulacra-building: storytelling.</p></blockquote>\n<p>He considers the antidote to the sensationalist, manipulative, and altogether reality-warping stories comprising the basic business model of modern media — a model built on marketable antagonism and othering:</p>\n<blockquote><p>The best stories proceed from a mysterious truth-seeking impulse that narrative has when revised extensively; they are complex and baffling and ambiguous; they tend to make us slower to act, rather than quicker. They make us more humble, cause us to empathize with people we don’t know, because they help us imagine these people, and when we imagine them — if the storytelling is good enough — we imagine them as being, essentially, like us. If the story is poor, or has an agenda, if it comes out of a paucity of imagination or is rushed, we imagine those other people as essentially unlike us: unknowable, inscrutable, inconvertible.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2012/03/15/the-three-astronauts-umberto-eco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2012/03/threeastronauts12.jpg\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2012/03/15/the-three-astronauts-umberto-eco/\"><em>The Three Astronauts</em></a> — Umberto Eco’s vintage semiotic children’s book about world peace</figcaption></figure>\n<p>The challenge of telling better stories about the possibilities between us and within us is all the more urgent under the realities of war, when the aperture of compassion and understanding <a href=\"https://www.themarginalian.org/2023/11/16/about-war/\">so dangerously narrows</a>. All war, Saunders observes, requires “awareness of the law of unintended consequences” and “familiarity with the world’s tendency to throw aggressive energy back at the aggressor in ways he did not expect” — nuanced complexities absent from the sensationalist headlines of mass media and the fanged soundbites of social media. </p>\n<p>With an eye to the murderous models of reality that incite the energies of war, he envisions an alternative for our culture’s story of itself:</p>\n<blockquote><p>A culture capable of imagining complexly is a humble culture. It acts, when it has to act, as late in the game as possible, and as cautiously, because it knows its own girth and the tight confines of the china shop it’s blundering into. And it knows that no matter how well-prepared it is — no matter how ruthlessly it has held its projections up to intelligent scrutiny — the place it is headed for is going to be very different from the place it imagined. The shortfall between the imagined and the real, multiplied by the violence of one’s intent, equals the evil one will do.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2019/07/29/what-if-tallec-lenain/\"><img src=\"https://i1.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/whatif11.jpg?w=1200&amp;ssl=1\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2019/07/29/what-if-tallec-lenain/\"><em>What If…</em></a></figcaption></figure>\n<p>In another essay, Saunders finds himself rereading Kurt Vonnegut’s <em>Slaughterhouse Five</em> — a book written decades earlier in the middle of another war — and contemplating the power of storytelling, with all its capacity for nuance and complexity absent from the media model, as our best mechanism for bridging reality and possibility. An epoch after Steinbeck lamented that the evil of war will never go away, Saunders celebrates Vonnegut’s enduring gift to the world:</p>\n<blockquote><p>It is a comfort [to] be reminded that just because something keeps happening, doesn’t mean we get to stop regretting it… It’s good for us to hear someone speak the irrational truth. It’s good for us when, in spite of all of the sober, pragmatic, and even correct arguments that war is sometimes necessary, someone says: war is large-scale murder, us at our worst, the stupidest guy doing the cruelest thing to the weakest being.</p>\n<p>[…]</p>\n<p>The book didn’t stop the current war, and won’t stop the next one, or the one after that. But something in me rose to the truth in it, and I was put in proper relation to the war going on now. I was, if you will, forbidden to misunderstand it. It is what it is: massacre and screaming and confusion and blood and death. It is the mammoth projection outward of the confused inner life of a handful of men. When someone says war is inevitable, or unavoidable, or unfortunate but necessary, they may be right. Vonnegut’s war was necessary. And yet it was massacre and screaming and confusion and blood and death. It was the mammoth projection outward of the confused inner life of men. In war, the sad tidy constructs we make to help us believe life is orderly and controllable are roughly thrown aside like the delusions they are. In war, love is outed as an insane, insupportable emotion, a kind of luxury emotion, because everywhere you look, someone beloved to someone is being slaughtered, by someone whose own beloved has been slaughtered, or will be, or could be. There’s something sacred about reading a book like Slaughterhouse Five, even if nothing changes but what’s going on inside our minds. We leave such a book restored, if only briefly, to a proper relation with the truth, reminded of what is what, temporarily undeluded, our better nature set back on its feet.</p></blockquote>\n<p>Although a novel and a news story may deal with the same subject matter drawn from the same facts of life, there is a universe of difference between the stories of reality and possibility each seeds into the world. It is within our power, Saunders reminds us, to resist the media manipulation machine — the “braindead megaphone” telling us that the world is broken, war inevitable, and human beings doomed by their own nature. Urging us to “insist that what’s said through it be as precise, intelligent, and humane as possible,” he writes:</p>\n<blockquote><p>Every well-thought-out rebuttal to dogma, every scrap of intelligent logic, every absurdist reduction of some bullying stance is the antidote. Every request for the clarification of the vague, every poke at smug banality, every pen stroke in a document under revision is the antidote… We still have the ability to rise up… keep reminding ourselves that representations of the world are never the world itself.</p></blockquote>\n<p>Couple with Saunders on <a href=\"https://www.themarginalian.org/2023/04/09/george-saunders-uncertainty/\">how to love the world more</a>, then revisit Richard Powers on <a href=\"https://www.themarginalian.org/2023/01/05/richard-powers-thea/\">rewriting the history of our future</a>, May Sarton on <a href=\"https://www.themarginalian.org/2023/01/01/may-sarton-the-house-by-the-sea/\">how to live openheartedly in a harsh world</a>, and Maya Angelou’s <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">cosmos-bound poem about rising to our human potential</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"5261b61150f883d9726bd38dbc49f3d4faf65343bdf8b90e98a706eea316132d","category":"default"}