{"title":"EV charging infrastruture is a joke","link":"https://bradbarrish.com/2023/09/18/ev-charging-infrastruture-is-a-joke/","date":1695057367000,"content":"<p>I got rid of my Tesla Model 3 at the beginning of 2023. My lease was up and I didn’t want another one for a few reasons, one of which I won’t get into. The Model 3 was my first EV and was a blast to drive. The basic driving assist technology it had (Tesla Autopilot), which I used extensively, was impressive and improved over time. The audio system was fantastic. It was comfortable to drive long distances, which we did several times, though the novelty of road tripping in it wore off after the first couple of trips. All that said, it just felt cheap. The paint scratched easily. The slightest bump into the body of the car dented it. There were rattling noises that Tesla couldn’t fix that drove me absolutely insane. The wind noise, especially with a roof rack, was exceptionally loud. And at the end of the day our needs as a family had changed and we just needed more room and there weren’t affordable EV options with a third row so I leased a Kia Telluride. I love it, but I don’t feel great about having it. It’s a big car and it guzzles gas.</p>\n\n\n\n<p>My wife got rid of her non-EV car at the beginning of the summer, just before we road tripped to Colorado for a month. When we returned home we tried to manage with a single car, but it became clear we’d be a lot better off with a second car and it should probably be an EV or at least a hybrid. We ended up getting an Audi Q4 e-tron and use it a lot more than the Telluride.</p>\n\n\n\n<p>Having had a Tesla for a few years, I had certain expectations about EVs, specifically related to charging that I’ve come to discover were wildly optimistic. We live in Los Angeles where, anecdotally, it feels like there are more Teslas than Hondas or Toyotas on the road. One would assume that non-Tesla charging infrastructure might not be great, but I was simply not prepared for just how not great it actually is. And to make matters worse, the majority of EV chargers that are found on Google Maps, are either not public, require paying a fee to get into a garage or are simply out of order. Until today, I hadn’t been able to find a public EV charger close to our house that I could use to charge my wife’s car.</p>\n\n\n\n<p>When I had my Tesla, I kept it charging on the included mobile charger plugged into a normal 120v outlet on the outside of our house and, when necessary, I would use one of the many Tesla Superchargers available no matter where you go. My wife’s mobile charger doesn’t even work. Maybe it’s a faulty charger. Who knows. A few years ago we had an electrician give us a bid on installing a level 2 EV charger and it was around $600. We never pulled the trigger on it. I had two bids in the last week and the price has doubled, largely due to the 3x-4x increase in material costs, or so the electricians tell us. I have no reason not to believe them. It just isn’t an expense we’re willing to take on at the moment, even with possible government incentives.</p>\n\n\n\n<p>I had a doctor’s appointment in Santa Monica this afternoon and found a “fast charger” within walking distance. First I had to install the EVgo app, for which I had already created an account. So that didn’t take long. The first charger I tried was broken, but I didn’t find that out until after I had to add another credit card to my account because the default card configured had expired. I moved my car to the next charger over. It seemed to work but then shut off a few minutes after it started charging, which I didn’t realize until I was at the doctor’s office (no strep, no COVID). When I returned to the car I tried again on the same charger. It charged to 42% and then stopped again. I started over a third time, which only worked long enough for me to get back into the car before I had to get back out again to unplug the charger and move to a third charger, which finally worked and got me to 80%.</p>\n\n\n\n<p>It’s not just that Tesla had a significant head start on other charging infrastructure. It’s also that their chargers are clearly built better and are serviced way more often. If you have a non-Tesla EV, especially without a level 2 charger, good luck to you! I have a neighbor who has driven across the entire country and back in his EV. You could not pay me to do it with the shape of the charging infrastructure. And this isn’t just me complaining. Ask anyone who has a non-Tesla EV. They will tell you the same thing and worse. It’s so bad the Biden administration <a href=\"https://www.theverge.com/2023/9/13/23871857/ev-charger-broken-fix-biden-usdot-funding-infrastructure\">just approved $100 million</a> to fix it! While it’s awesome that there is so much more choice than when I leased my Model 3 in 2020, the charging infrastructure needs to improve dramatically.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"52a35be29b59002b7e12e45a6fc9767f2060b923b5272e24a2fb730446cbb254","category":"default"}