{"title":"Inference + Intent","link":"https://ghuneim.com/2024/04/18/inference-and-intent/","date":1713454457000,"content":"<p><img src=\"https://ghuneim.com/wp-content/uploads/2024/04/Screenshot-2024-04-18-at-11.20.36 AM-325x217.png\" width=\"325\" height=\"217\" srcset=\"https://ghuneim.com/wp-content/uploads/2024/04/Screenshot-2024-04-18-at-11.20.36 AM-325x217.png 325w, https://ghuneim.com/wp-content/uploads/2024/04/Screenshot-2024-04-18-at-11.20.36 AM-650x433.png 650w\" /></p>\n<p>AIML – Inference and intent</p>\n<p>intent<br />\n1 <em>: a usually clearly formulated or planned intention : AIM  </em><em>the director’s intent</em><br />\n2 a : the act or fact of intending : PURPOSE<br />\nb : the state of mind with which an act is done : VOLITION</p>\n<div>Inference</div>\n<div>A conclusion reached on the basis of evidence and reasoning.</div>\n<div>\n<div>“researchers are entrusted with drawing inferences from the data”</div>\n</div>\n<p><img src=\"https://nobaproject.com/images/shared/images/000/001/469/original.jpg\" alt=\"Theory of Mind | Noba\" /></p>\n<p>Intent and inference have long been integral to business processes.  AI/ML provides new opportunities as illustrated in my hand drawn diagram above. The application of AI/ML to infer intent, which is then used to personalize customer experiences and enhance operational efficiency.</p>\n<p>Google is realizing LLM’s infer intent easier, simply by the nature of the query. This poses a systemic challenge for Google to address stat (Gemini), as it affects the business’s flywheel dynamics and illustrates intent in action.</p>\n<p> </p>\n<p>Pairing this with Theory of mind.  Theory of mind (ToM) is the (alleged) ability to understand and reason about other people’s mental states. This includes understanding their beliefs, desires, intentions, and emotions. It also involves using this information to explain and predict human behavior.</p>\n<p>What could go wrong? Emergent (actual) example: agents that have agency and inferring via ToM your intent. There is the fact that <strong>intent is not action, and inferring is not understanding.</strong> This is where we are headed.<strong>  To plan is not to do. inference invites errors.</strong></p>\n<p> </p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"536978a4b747b1425469a606862b42d7db07969a1bd8ccc621ce3be45ce0242b","category":"default"}