{"title":"What’s Out There 20240429","link":"https://bradbarrish.com/2024/04/29/whats-out-there-20240429/","date":1714431855000,"content":"<p>In the spirit of trying to share more, here are some things I’ve come across over the last week or so that I think are worth sharing. Comments are open for this post.</p>\n\n\n\n<p>When 23andMe started, I was among the first to sign up. After reviewing the report and downloading my SNPs, I quickly deleted my account. I wasn’t surprised to find that I was an APOE4 carrier, the strongest known genetic risk factor for late-onset Alzheimer’s disease. Thankfully, I only have one copy of the allele. Since discovering this, I’ve increased the amount of fish, especially salmon, I consume. I ran across <a href=\"https://www.foundmyfitness.com/%E2%80%99s\" target=\"_blank\">Rhonda Patrick</a>‘s paper <a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC6338661/\" target=\"_blank\">Role of phosphatidylcholine-DHA in preventing APOE4-associated Alzheimer’s disease</a>, which suggests that DHA from food is better than supplementing fish oil (I do both) and might better support brain health and reduce AD risk in APOE4 carriers. </p>\n\n\n\n<p>I came across <a href=\"https://www.nature.com/articles/s41598-024-55637-x\" target=\"_blank\">a study about visual processing speed and its association with future dementia development</a>, which compares the Visual Sensitivity Test (VST) against some established dementia screening tests and tools. It seems the VST is less sensitive, but it could be used in combination with other tests and tools.</p>\n\n\n\n<p>There’s been a lot of talk about Jonathan Haidt lately, certainly among parents of teens, following the publishing of his new book The Anxious Generation: How the Great Rewiring of Childhood Is Causing an Epidemic of Mental Illness (<a href=\"https://bookshop.org/a/9430/9780593655030\" target=\"_blank\">Bookshop Link</a> | <a href=\"https://amzn.to/4dknolz\" target=\"_blank\">Amazon link</a>). He’s been all over the place promoting the book. I haven’t read the book yet, but I continue to read his newsletter, <a href=\"https://www.afterbabel.com/\">After Babel</a>. They recently brought an amazing writer, Freya India, into the fold and her recent newsletter, <a href=\"https://www.afterbabel.com/p/a-time-we-never-knew\" target=\"_blank\">A Time We Never Knew</a>, is such a great read. I especially loved that she introduced me to the word, <a href=\"https://en.wiktionary.org/wiki/anemoia#:~:text=anemoia%20(uncountable),place%20one%20has%20never%20known.\" target=\"_blank\">anemoia</a>, which means nostalgia for a time or a place one has never known. Her post is all about this and Gen Z.</p>\n\n\n\n<p>I’m a sucker for lists of things, especially good things and especially from smart people. <a href=\"https://sippey.com/2024/04/22/ten-good-things.html\" target=\"_blank\">Sippy did not disappoint</a>.</p>\n\n\n\n<p><a href=\"https://www.profluent.bio/blog/editing-the-human-genome-with-ai\" target=\"_blank\">AI is now editing the human genome</a>. I’m sure it’ll be great! In all seriousness, this is pretty cool.</p>\n\n\n\n<p><a href=\"https://substack.com/@ellegriffin\" target=\"_blank\">Elle Griffin</a> has an interesting post called <a href=\"https://www.elysian.press/p/no-one-buys-books\" target=\"_blank\">No One Buys Books</a> on the world of book publishing. Seems like no matter what kind of media you’re talking about, many of the trends as it relates to what sells, who gets big advances and what rights holders are looking for in authors is largely the same. It’s also no surprise that many authors are going it alone and/or doing things with indie publishers. This is a continuation or evolution of what began as direct-to-consumer and crowdfunding. Not a week goes by where I don’t reflect fondly on what we were able to accomplish at <a href=\"https://en.wikipedia.org/wiki/Topspin_Media\" target=\"_blank\">Topspin</a>. I remain interested in exploring how to empower creators of all kinds and allow many more to make a decent living. I think what <a href=\"https://www.metalabel.com/\" target=\"_blank\">Metalabel</a> is doing is at the forefront.</p>\n\n\n\n<p>Speaking of Metalabel, make sure you check out <a href=\"https://hardart.metalabel.com/introducing-hard-art\" target=\"_blank\">Hard Art</a> and pick up a copy of <a href=\"https://darkforest.metalabel.com/dfa2\" target=\"_blank\">The Dark Forest Anthology of The Internet</a> before it sells out.</p>\n\n\n\n<p><a href=\"https://om.co/2024/04/22/sometimes-a-camera-is-not-just-a-camera/\" target=\"_blank\">Om has a good post</a> about the camera company, Opal. I enjoy Om’s musings on many topics, and cameras are one of them. I ordered the <a href=\"https://opalcamera.com/opal-c1\" target=\"_blank\">C1</a> when it was announced a few years ago and for literally years, it simply didn’t work. Every few months, I would give it another shot, and it just wouldn’t work until recently when the company released <a href=\"https://opalcamera.com/opal-composer\" target=\"_blank\">Composer</a>. Now I use it when I’m at my desk with my large monitor and it’s been great!</p>\n\n\n\n<p>Paul Robertson and Michelle Larney released a new video called <a href=\"https://www.youtube.com/watch?v=zFbJ94jC1hc\" target=\"_blank\">Jimmy and Baby</a>. It might be the best pixel art video I’ve ever seen.</p>\n\n\n\n<p><a href=\"https://simonwillison.net/2024/Apr/24/erika-hall/\" target=\"_blank\">Simon Willison</a> reminded me of a great Erika Hall quote from a <a href=\"https://www.muledesign.com/blog/on-surveys\" target=\"_blank\">2015 Mule Design post</a>. I’m just going to post it in its entirety.</p>\n\n\n\n<blockquote>\n<p>A bad survey won’t tell you it’s bad. It’s actually really hard to find out that a bad survey is bad — or to tell whether you have written a good or bad set of questions. Bad code will have bugs. A bad interface design will fail a usability test. It’s possible to tell whether you are having a bad user interview right away. Feedback from a bad survey can only come in the form of a second source of information contradicting your analysis of the survey results.</p>\n\n\n\n<p>Most seductively, surveys yield responses that are easy to count and counting things feels so certain and objective and truthful.</p>\n\n\n\n<p>Even if you are counting lies.</p>\n</blockquote>\n\n\n\n<p>Most nerds probably know Bertrand Serlet from his work at Apple. In the early aughts he could be seen presenting at Apple keynotes. Seemingly out of nowhere <a href=\"https://www.youtube.com/watch?v=QwtyIDmhxh4\" target=\"_blank\">he posted some thoughts on why AI works</a>. Highly recommend watching or just listening to the entire thing. It was fun to see and hear him again.</p>\n\n\n\n<p>I love the idea of a <a href=\"https://www.simplermachines.com/why-you-need-a-wtf-notebook/\" target=\"_blank\">WTF notebook</a>.</p>\n\n\n\n<p><a href=\"https://twitter.com/DThompsonDev/status/1782446072452780347\" target=\"_blank\">Wendy’s is using FreshAI</a> in some of their drive-thru’s. Seems to do better than <a href=\"https://www.youtube.com/watch?v=kTefnhbg0Ig\" target=\"_blank\">Siri</a>.</p>\n\n\n\n<p><a href=\"https://silv.blog/llm-fusion-your-research-supercomputer/\" target=\"_blank\">Multi-model AI</a> is fascinating. Not sure it’s actually a $60 (per month) supercomputer, but maybe that’s not far off. I’m still paying for ChatGPT as my daily driver, but I’ve been considering a switch to Claude.</p>\n\n\n\n<p>Lots of coverage about <a href=\"https://azure.microsoft.com/en-us/blog/introducing-phi-3-redefining-whats-possible-with-slms/\" target=\"_blank\">Phi-3</a>, a small and highly-capable model that can run on your pocket computer. I’m convinced that small models like Phi-3 are what we’ll see replacing the dumb assistants on our phones. They’ll communicate with larger models running in the cloud.</p>\n\n\n\n<p>It feels like I read a post every few years about when people stop finding new music. <a href=\"https://www.statsignificant.com/p/when-do-we-stop-finding-new-music\" target=\"_blank\">This is one of those posts</a>. If you know much about me, there are two hungers I can never seem to satisfy – discovering new music and discovering things on the Internet. I plan to continue both quests with abandon until the day I die.</p>\n\n\n\n<p>Ozzie and I finished listening to <a href=\"https://www.audible.com/pd/Shoe-Dog-Audiobook/B01CRM17MS?source_code=ASSORAP0511160006&amp;share_location=library_overflow\" target=\"_blank\">Shoe Dog</a>. It was my second listen and solidified it as one of the greatest business books ever written. <a href=\"https://overcast.fm/+42OLfDopg\" target=\"_blank\">Pat Metheny’s appearance on Questlove Supreme</a> was a blast of a listen. Funny enough, as I was organizing my physical ticket stubs, I came across a stub from seeing the <a href=\"https://album.link/i/1680823624\" target=\"_blank\">Secret Story</a> tour, which I saw with my parents, both of whom were big Pat Metheny fans and knew his parents somehow.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"53d1dfeefe853117ed7f1309bfa47a36f0837bad8429d5212c512fada2eca771","category":"Sites"}