{"title":"Is Your Life a Fairy Tale, a Novel, or a Poem?","link":"https://www.themarginalian.org/2024/07/23/fairy-tale-novel-poem/","date":1721749089000,"content":"<p>When reality fissures along the fault line of our expectations and the unwelcome happens — a death, an abandonment, a promise broken, a kindness withheld — we tend to cope in one of two ways: We question our own sanity, assuming the outside world coherent and our response a form of madness; or we assume ourselves sane and accuse the external — the other person, the situation, the world — of madness. Both are stories we tell ourselves about what is true, how things are, and how things should be. Like all storytelling, both are works of the imagination.</p>\n<p>It always takes imagination to understand what is real, for in the human sphere reality is a collaborative condition. It takes imagination to understand what it is like to be anybody else, what the other’s reality might be in the situation we share, and it takes imagination to consider what may live in our blind spots. </p>\n<figure><a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/arthurrackham_grimm5.jpg\" /></a><figcaption>Art by Arthur Rackham for a <a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\">rare 1917 edition</a> of the Brothers Grimm fairy tales. (Available <a href=\"https://society6.com/product/art-by-arthur-rackham-from-a-rare-1917-edition-of-the-brothers-grimm-fairy-tales_print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p><strong>G.K. Chesterton</strong> (May 29, 1874–June 14, 1936), who <a href=\"https://www.themarginalian.org/2022/06/12/g-k-chesterton-dandelion/\">thought deeply and originally about the meaning of life</a>, frames these two storytelling responses to reality and the problem of sanity as the fairy tale and the novel. In a fragment from his essay collection <a href=\"https://www.amazon.com/dp/1447467876/?tag=braipick-20\" target=\"_blank\"><strong><em>Tremendous Trifles</em></strong></a> (<a href=\"https://search.worldcat.org/title/426917753\" target=\"_blank\"><em>public library</em></a> | <a href=\"https://www.amazon.com/Tremendous-Trifles-Gilbert-Keith-Chesterton-ebook/dp/B00849044Q/?tag=braipick-20\" target=\"_blank\"><em>free ebook</em></a>), he writes:</p>\n<blockquote><p>Folk-lore means that the soul is sane, but that the universe is wild and full of marvels. Realism means that the world is dull and full of routine, but that the soul is sick and screaming. The problem of the fairy tale is — what will a healthy man do with a fantastic world? The problem of the modern novel is — what will a madman do with a dull world? In the fairy tales the cosmos goes mad; but the hero does not go mad. In the modern novels the hero is mad before the book begins, and suffers from the harsh steadiness and cruel sanity of the cosmos.</p></blockquote>\n<p>But while it always takes imagination to understand what is real, it also takes imagination to see beyond the models of reality handed down to us by the world as we know it. (“Everything is in an attitude of mind,” Chesterton conceded.) Perhaps there is a third way beyond this dualism, one that recognizes consciousness as something beyond sanity and madness, one in which being a hero of one’s own life is not a battle between reality and sanity, between self and other, but a matter of peaceful accord with the cosmos, a cosmos capable of consciousness. </p>\n<p>Perhaps that is the way of the poem. Perhaps the best way to face reality — especially when it betrays our hopes and expectations — is by being a living poem. “Re-examine all you have been told at school or church or in any book, dismiss whatever insults your own soul,” Whitman wrote in his <a href=\"https://www.themarginalian.org/2016/05/31/walt-whitman-leaves-of-grass-preface/\">timeless advice on living a vibrant and rewarding life</a>, “and your very flesh shall be a great poem.” A poem is not a captive of narrative, has no need for resolution, is not a message but an opening. A poem makes its own meaning. </p>\n<figure><a href=\"https://society6.com/product/we-found-our-own-o-my-soul-in-the-calm-and-cool-of-the-daybreak_framed-print?sku=s6-8967204p21a12v52a13v54?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=680%2C883&amp;ssl=1\" width=\"680\" height=\"883\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=240%2C312&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=320%2C415&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=768%2C997&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=600%2C779&amp;ssl=1 600w\" /></a><figcaption>One of English artist Margaret C. Cook’s illustrations for <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a stunning 1913 edition of <em>Leaves of Grass</em></a>. (Available <a href=\"https://society6.com/product/we-found-our-own-o-my-soul-in-the-calm-and-cool-of-the-daybreak_framed-print?sku=s6-8967204p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>Complement with Nobel-winning poet Wisława Szymborska on <a href=\"https://www.themarginalian.org/2016/04/22/wislawa-szymborska-fairy-tales-fear/\">fairy tales and the necessity of fear</a>, then revisit Lucille Clifton on <a href=\"https://www.themarginalian.org/2023/10/21/lucille-clifton-poetry-interview/\">how to be a living poem</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"53e438509603eaf3e2fe122ec26d498828a0e8f52db0dcc8644d6dd459b5f27b","category":"default"}