{"title":"Neglected Projects","link":"https://blog.webb.page/2017-07-27-neglected-projects.txt","date":1501113600000,"content":"<p>The name of my company is \"Ideas Never Cease\" (!NC) because with me, it's\ntrue. Ideas, never <em>ever</em> cease. I am unable to turn my mind off and it has\nbeen this way since I was eight. At 29 now, stopping isn't remotely possible\nand I like that.</p>\n<p>The downside, of course, is that…ideas never cease. This means I get super\nfocused on a great idea and work on it for some time and <em>juuuuust</em> when\nthings are starting to get interesting, I get distracted by another great idea\nand the cycle continues. What does <em>not</em> continue, obviously, is progress on\nthose previous ideas…until six months to a full year later. Sometimes, even\nlonger than that!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/neglected-projects-a.jpg\">The notebook my fiancé bought for me</a></p>\n<p>My fiancé recently bought me a dot grid notebook because it has gold and\nmarble on the cover, which matches my laptop<a href=\"/2017-01-07-macbook-pro-review.txt\">1</a> a bit. I decided to use that\nnotebook to keep track of my weekly duties and the thought occurred to me to\nwrite down my neglected projects. Then I figured I'd share with the world\nbecause, why not? I've been busy with redesigning BeautyLynk<a href=\"https://beautylynk.com\">2</a> and building\nBeachfrontDigital<a href=\"https://beachfront.digital\">3</a> so that's my excuse for not working on these projects.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/neglected-projects-b.jpg\">Some of my neglected projects</a></p>\n<h2>DSGN</h2>\n<p>I want to start a small web design and development firm so I can make 1) my\nown hours and 2) more money so I can spend more time on passion projects that\nI <em>really</em> want to work on and not expect a profit from them. To do that, I\nneed to actually <em>design</em> and code the new website<a href=\"https://dsgn.io\">4</a>.</p>\n<p>The good news is that BeautyLynk and BeachfrontDigital will make great initial\ncase studies.</p>\n<h2>FRSH×BTS</h2>\n<p>Man, I haven't created music in <em>years</em>. My claim to fame is that when I\nreleased \"Music from the Love Lounge Vol. 1\", people in Barcelona/Belize were\njamming to it. Or at the very least, one person and their friend was.\n\"FRSH×BTS\" is the production name I go by, \"the Wibby\" and \"Spaceman Fresh\"\nbeing my rap aliases.</p>\n<p>I have my music on Bandcamp<a href=\"https://thewibby.bandcamp.com\">5</a> at the moment because I never got around to\ncreating the perfect website for <code>frsh.fm</code>. In addition to that, I want to\nremaster <em>all</em> my old work. This means getting a Windows machine, installing\nWindows 7 and Acid Pro, inspecting the arrangements, and replicating them in\nStudio One. I have a boatload of tracks in progress that are great jump off\npoints for new songs and I don't want to lose those. As you can imagine,\ngetting my catalogue remastered is quite the undertaking.</p>\n<p><em>Le sigh</em>.</p>\n<p>Oh, and I still haven't released \"Waveform\", my debut album. When I listen to\nit though, the only glaring issues I hear are vocal quality and leveling.</p>\n<h2>WEÖM</h2>\n<p>Short for \"Wisdom Escapes Ordinary Minds\", WEÖM<a href=\"https://weom.space\">6</a> is a space-centric\nlifestyle brand I started a few years ago. People seem to like the snapback I\ndesigned better than the t-shirt and I can understand why. The hat is dope and\nI wear it everyday!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/neglected-projects-c.jpg\">Lakeisha and Sarah wearing WEÖM gear</a></p>\n<p>I have done a <em>shitty</em> job of advertising it and generating buzz. Obviously,\nthat's the only way I'm going to sell all the stock I have but I have a hard\ntime being a salesperson. Ideally, someone else would be doing this for me and\ntaking a cut of the profits. Also, I need to design more products. Again, I\nhave ideas for them but haven't gone further than sketches.</p>\n<h2>!NC</h2>\n<p>I created a web browser, dubbed \"Aries\", a few years ago just to see if I\ncould do it and it actually worked. Not only that, but people reached out to\nme to tell me how much they liked the design and how it worked. Then…I moved\nonto another project. I was using Opera as my main browser back then and now\nI'm using Vivaldi but I still have plenty of interesting ideas to challenge\nthe way we think of desktop web browsers.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/neglected-projects-d.png\">Aries screenshot</a></p>\n<p>\"Hermes\" is the name I'm giving the desktop email client I intend to work on\nat some point. Back when the latest iPhone was 5, I used a neat mobile email\napp called \"SquareOne Mail<a href=\"https://techcrunch.com/2014/03/05/squareone-for-iphone-organizes-your-email-gives-you-better-control-over-notifications\">7</a>\" and I friggin' <em>loved</em> it. You could train the\napp to put your email into categories you created so only the <em>most</em> important\nmessages appeared in your inbox. I've heard that Gmail can do something\nsimilar with filters but I run my own email server. The team behind SquareOne\ngot investors and were persuaded to pivot into something (IMHO quite)\nboring…I don't even remember what it was. Anyhoo, Hermes would be an evolved\nversion of the original.</p>\n<h2>SciLab</h2>\n<p>I've saved the best for last. Prepare for a lot of backstory.</p>\n<p>If you follow me on social media or other online networks, you may have\nwondered at some point what a \"NetOp\" or \"NetOperator\" is. Well, that comes\nfrom a beloved video game series, called \"Megaman Battle Network\" (MMBN).\nThere are six main games in the series and the timeline is set in the year\n20XX…yes, like other Megaman games. In this future, everyone has an A.I.\ncompanion called an \"Internet Navigator\", or \"NetNavi\" for short. The people\nwho operate these A.I.s are often referred to as NetOperators. So, combined\nwith my rap alias you read earlier, NetOperator Wibby became my online handle\nof choice.</p>\n<p>Also in this future? A 3D Internet and a futuristic device (Personal Terminal,\nor PET) that is basically a smartphone. Not so revolutionary-sounding but when\nthe first game came out (2001), it was mind-blowing and captured my\nimagination. Can you see where I'm going with this? <em>The ideas never ceased.</em></p>\n<p>It became quite clear to me that this awesome-sounding future had to exist\nbecause…reasons. Like…it's awesome. But, how was <em>I</em> going to make this\nhappen? I was only 13 at the time with a <em>lot</em> of time on my hands.\n<em>Good grief, I spent 16 years thinking about this stuff</em> 😰</p>\n<p>When I (briefly) attended college, I enrolled in Software Engineering for the\n<em>sole purpose</em> of learning how to write an operating system, even if it was\nfrom a middle-aged man with <em>impeccable</em> bright white facial hair and a\ntendency to accidentally spit on students in the front row. However, I was\nforced to leave because I found out I couldn't afford college. That dashed my\ndreams a bit but I taught myself web design and development, got an\napprenticeship, and eventually landed good-paying jobs and skills that led me\nto think, \"What if I just…<em>wrote</em> an 'operating system' in HTML/CSS/JS?\". This\nis how <em>hikari OS<a href=\"https://hikar.io\">8</a></em> was born! For those keeping score at home, \"hikari\" is\nthe creator of the 3D Internet and NetNavis in MMBN. Hey, innovation is a\nfamily business.</p>\n<p><em>hikari is an Electron app that will be designed to boot from a minimal Linux\ndistro in fullscreen on a Raspberry Pi.</em> It's like Chrome OS in a way. Anyhoo,\nI worked on hikari for awhile and got distracted, of course.</p>\n<p>For my NetNavi project, I'd need a good voice recognition/synthesis library\nand currently, Google is the best for that and I don't consider them an option\nbecause they are beyond terrible with user privacy. I'm not sure why they need\nto store your voice commands on their servers for an unspecified amount of\ntime but hey, that's what happens when things are free. I'm not expecting my\nNetNavi project to be considered \"real A.I.\". Siri, Cortana, and everything\nelse are just elaborate <code>if</code>/<code>then</code>/<code>else</code> statements. The PET is low priority\nbecause the base being a Raspberry Pi makes things super easy (like, creating\na dock station, &amp;c).</p>\n<p>Lastly, the 3D Internet. In my research, I got downvoted to hell across a\ncouple StackExchange sites (I was told to ask a different site, at least four\ntimes). In hindsight, that's what I get for going there for useful advice.</p>\n<p>With regard to \"NetCity\" in the MMBN anime, I sketched a process that would\nallow for the automatic generation of buildings based on how deep a website's\nlinks went. Take this site for example! I have four main links in the header.\nEach of those links would represent a different floor. Each page's contents\nwould be represented on each floor depending on what it was. Blog posts would\nbecome eBooks, mp3s would become a CD, and so on. Just like search engine bots\nvisit your website every now and then, so would this 3D 'Net bot and it would\nreport changes that would update your generated building.</p>\n<p>This 3D 'Net would be accessed via \"the Network\", which is effectively an\nMMORPG where your NetNavi is your avatar. Aries would have a built-in viewer\nfor this, although I'd probably just use three.js.</p>\n<p>…This is going off the rails, I understand that. This is also going to cost a\n<em>fuck</em> ton of money. Yes, the fuck was necessary because unless I become super\nrich in the next 10 years, what I'm seeing in my head will never see the light\nof day until I'm 60…y'know what, that's around the age Grandpa Hikari created\nthe Internet. Also, I just realized that he looks like a chubby Vint Cerf.</p>\n<h2>&amp;c</h2>\n<p>I could go on and on about my project backlog. Here's a couple more that are\nin the incubation stage of my ideation process:</p>\n<ul>\n<li>social network that doesn't suck, enables better communication, provides\nways for users to deal with harassment, and makes money without selling user\ndata.</li>\n<li>an outlet that showcases black excellence, positivity, and training\nresources to aid small business owners and aspiring freelancers.</li>\n<li>an eCommerce platform that allows for true customization, doesn't treat you\nlike you're dumb, and has a self-hosted option.</li>\n<li>a curated site for lefties that doesn't look like it was built in 1999 and\nstayed that way.</li>\n</ul>\n<p>I'll get to these projects some day. I've attempted to work on things on a\nschedule but my mind/enthusiasm doesn't work that way. I'm using a dot grid\nnotebook as a weekly planner instead of the weekly planner I bought months\nago, simply because predefined lines and boxes make me feel constrained. I'm\nnot quite sure what the solution is but I think if I had more time (hah, don't\nwe all want this?) and made my own hours, I could figure this thing out. Or at\nthe very least, start knocking things out one by one. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"54f2c31df56d9ba1483188082fe37e21d83e966fde8f79cb2d4b3f1121f9d6d4","category":"Sites"}