{"title":"Board Meeting Suggestions","link":"https://www.usv.com/writing/2024/07/board-meeting-suggestions/","date":1720521087000,"content":"<p>I wrote the email below to a founder doing his first board meeting.</p>\n<p>Board meetings can provide a leadership team with a perspective on the business that can be very helpful.</p>\n<p>But many Board meetings are simply reporting sessions. That is a wasted opportunity in my view.</p>\n<p>So setting them up right and getting feedback in real time makes all the difference.</p>\n<p>Here’s what I suggested to him:</p>\n<p>Send out a pre-read that allows everyone to come into the meeting knowing all of the important stuff. I would try to send that out at least two or three days before the meeting so that everyone has time to read it before the meeting</p>\n<p>I would include all of this in the pre-read</p>\n<p>– sales update, pipeline, key accounts, projections for wins in the next 3-6 months</p>\n<p>– technology update, key priorities, key things shipping in the next 3-6 months</p>\n<p>– manufacturing update, key partners and progress on them</p>\n<p>– financial update – balance sheet, P&amp;L, cash forecast for the rest of the year</p>\n<p>– people update, key hires made, key hires planned, any departures</p>\n<p>there are probably other key things to include but these are the most typical</p>\n<p>I would then schedule 30-60 mins to go over the pre-read material with the board. ideally you would spend that time discussing the pre-read and not presenting it as you should assume and expect everyone will have read it</p>\n<p>I would then spend the rest of the meeting on 1-2 key strategic topics that you are spending a lot of your time thinking about. use this time to get the board’s feedback and input on these topics</p>\n<p>I would encourage you to bring your key management team members to part but not all of the meeting. i think they should be there when you go over the pre-read and probably the strategic topics</p>\n<p>I always suggest a CEO start and end the meeting with an executive session with just the CEO and the board. that’s an opportunity to set up the meeting and explain what you most need help with (at the start) and to get feedback at the end of the meeting on how it went and any concerns that came up</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/board-meeting-suggestions/\">Board Meeting Suggestions</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"5517596a546e8e8c560151395d341981a8b5fa62c9cb0b6998a6adc7619ed60c","category":"default"}