{"title":"Chilito candy","link":"https://kottke.org/24/03/chilito-candy","date":1711733424000,"content":"\n        <p><a href=\"https://www.texasmonthly.com/food/inside-the-red-hot-rise-of-chilito-candy\">This article about the pandemic-fueled of homemade rise of chilito candy sold by social media</a> has been in my tab attic since 2021 just waiting around to be shared because I’m a sucker for the journalistic arts applied to candy. I introduced my kids to Tajín-coated peach gummies after a trip to Oakland in 2018, and my two year called them Fire Cheerios because all round foods were Cheerios then. Tajín is also good on mango ice cream, or anything really. </p>\n\n<blockquote><p>Mexican chilito candies, or dulces enchilados, have been making the mouths of Texans pucker for at least as long as we’ve been hitting piñatas. A colloquial catchall for a variety of sweets, chilito refers to the spice of chamoy, a traditional Mexican paste made from pickled fruits and spices. Chilito can come as a condiment, like on fruit bowls or elote; with the addition of powdered sugar, it can be thick and sticky, perfect for coating hard candy. Dulceros, or candymakers, also control the degree of spice—from a pleasant pop on the tastebuds to a fiery shock—by manipulating the amount and types of chiles in the chamoy. It’s as acidic as it is addictive, and a favorite amongst Tejano snackers. “Customers go crazy for it,” says Rick Samame, one of the owners of Alamo Candy Company in San Antonio, the largest purveyor of all things chilito in the state. </p></blockquote>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/chilitospicatemucho.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/chilitospicatemucho.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/chilitospicatemucho.jpg 1200w\" loading=\"lazy\" alt=\"chilitospicatemucho.jpg\" /></p>\n\n<blockquote><p>Take the chilito Gusher, a prime example of Mexican American confectionary fusion. Officially branded as Fruit Gushers, the Betty Crocker–owned snack has been synonymous with American childhood since the famous ’90s commercials that featured teens’ heads turning into various fruits after popping Gushers in their mouths. One could imagine a similar commercial for chilito Gushers, except the teens’ watermelon- and raspberry-shaped heads would now also be on fire. The soft, chewy candies filled with sugary fruit juice are addictive enough, but with the added heat and texture of the spiced chamoy and chili powder, they’re transformed into something entirely new, something that is both Mexican and American.</p></blockquote>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/candy\">candy</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/chilito-candy\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"551c09922a60ea0a8670dc82b964933ac0d96d92a67d6cbec7be57196a925c46","category":"default"}