{"title":"Easy deployment with Vagrant","link":"https://blog.webb.page/2017-12-05-easy-deployment-with-vagrant.txt","date":1512432000000,"content":"<blockquote>\n<p>Vagrant<a href=\"https://www.vagrantup.com\">1</a> provides easy to configure, reproducible, and portable work\nenvironments built on top of industry-standard technology and controlled by\na single consistent workflow to help maximize the productivity and\nflexibility of you and your team.</p>\n</blockquote>\n<p>This is fine and dandy but, I'm not on a team with my side projects. I just\nwant to quickly push my code to a server and keep it moving. Here's how I\ndid it.</p>\n<h2>Installation</h2>\n<p>Head on over to HashiCorp's download page for Vagrant<a href=\"https://www.vagrantup.com/downloads.html\">2</a> and select the build\nfor your OS flavor of choice. After the installation is complete, open a\nTerminal and type <code>vagrant -v</code> to ensure installation was successful. If you\nsee a version number, you're good to go.</p>\n<h2>Setup</h2>\n<p><code>cd</code> into the folder you want to deploy and initialize a Vagrant deployment\nscript with <code>vagrant init</code>. This will automatically generate a <code>Vagrantfile</code>\nand it is in here that you'll customize your deployment strategies. Here<a href=\"https://www.vagrantup.com/docs/push/ftp.html\">3</a>\nare all the parameters you can use for SFTP (which is the way I'm deploying\nmy projects). There's documentation for Heroku and inline scripts as well.\nHere's my deployment script for <code>thewebb.blog</code>:</p>\n<pre><code>Vagrant.configure(\"2\") do |config|\n  config.vm.box = \"base\"\n\n  config.push.define \"ftp\" do |push|\n    push.host = \"thewebb.blog\"\n    push.username = \"root\"\n    push.password = \"~/.ssh/id_rsa\"\n    push.secure = true\n    push.destination = \"/var/www/twb\"\n    push.exclude = \".DS_Store\"\n    push.exclude = \".git\"\n    push.exclude = \".gitignore\"\n    push.exclude = \".sass-cache\"\n    push.exclude = \"[documents]\"\n    push.exclude = \"node_modules\"\n    push.exclude = \"package-lock.json\"\n    push.exclude = \"Vagrantfile\"\n  end\nend\n</code></pre>\n<p>You can probably guess what's going on here, but I'll walk you through it\nanyway.</p>\n<p>I'm connected to <code>thewebb.blog</code> via secure FTP, or SFTP, with an SSH key\n(because passwords are lame). The directory I want to push data to on\n<code>thewebb.blog</code> has a path of <code>/var/www/twb</code>. There are a couple of files and\nfolders I don't want/need on my server (mostly the contents of my\n<code>.gitignore</code>, along with that file itself).</p>\n<p>Please refer to the documentation<a href=\"https://www.vagrantup.com/docs/index.html\">4</a> for in-depth descriptions about other\nparameters like <code>config.vm.box</code> (this line is required btw).</p>\n<h2>Takeoff</h2>\n<p>I use Node.js for practically everything I do so I added a nifty deploy\ncommand to my <code>package.json</code>. Here's the relevant bit:</p>\n<pre><code>{\n  \"scripts\": {\n    \"deploy\": \"vagrant push\"\n  }\n}\n</code></pre>\n<p>And that's it!</p>\n<p>To be quite honest, me using Vagrant feels like the equivalent of buying an\niMac Pro to browse the Internet but, their tagline is \"Deployment environments\nmade easy\". And guess what? It works <em>damn good</em>. What's easier than\n<code>npm run deploy</code>?</p>\n<h2>One more thing</h2>\n<p>When you deploy your project, you'll see a message in Terminal stating what's\nhappening, but nothing else. It would be <em>nice</em> to have a progress bar to\nindicate…well, progress but it doesn't take too long (for my projects). Also,\nautomatic reading of my <code>.gitignore</code> file so I don't have to manually include\nwhat I want excluded.</p>\n<p>Another thing that would be nice is something where my server could detect\nchanges and run commands. For example, let's say I add new modules to this\nblog. I'll have to install them on my server as well. Currently, I have to SSH\ninto it and run whatever extra steps to ensure updates and I <em>reeeeeally</em>\ndon't feel like doing that. You could argue that I could just use HashiCorp's\nother tools like Nomad and Consul but 1) it was too confusing to set up and I\nrealized 2) those tools are <em>definitely</em> overkill for what I work on.</p>\n<p>SO! I have caused myself <em>much</em> pain to create a system that allows these\nautomatic updates to happen. Just deploy and your server will take care of the\nrest. During my failed attempts at utilizing other tools, I was inspired by\nthe ease with which I deployed with Vagrant via a simple file. It's still in\ndevelopment but I've been working on it for the past day and a half. Great\nprogress has been made, stay tuned! 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"551e2841b5b474f11aa896a18a94534f47fb8b67c8718cc1ad3d16512ecaf283","category":"Sites"}