{"title":"Marie Howe’s Stunning Hymn of Humanity, Animated","link":"https://www.themarginalian.org/2024/04/04/marie-howe-hymn/","date":1712256238000,"content":"<h3>“It began as an almost inaudible hum…”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/New-Selected-Poems-Marie-Howe/dp/1324075031/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"479\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?fit=320%2C479&amp;ssl=1\" alt=\"Marie Howe’s Stunning Hymn of Humanity, Animated\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?w=802&amp;ssl=1 802w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?resize=320%2C479&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?resize=600%2C898&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?resize=240%2C359&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/mariehowe_newandselected.jpg?resize=768%2C1149&amp;ssl=1 768w\" /></a></p><p>I remember singing Beethoven’s “Ode to Joy” in the choir of the Bulgarian Math Academy as a child. I remember my awe at learning that across centuries of warring nationalisms, this piece of music, based on an old Schiller poem and <a href=\"https://www.themarginalian.org/2022/05/17/beethoven-ode-to-joy/\">born of Beethoven’s unimaginable trials</a>, had become the official Hymn of Europe — a bridge of harmony across human divides. I remember wondering as I sang whether music is something we make or something we are made of. </p>\n<p>That is what Pythagoras, too, wondered when he <a href=\"https://www.themarginalian.org/2021/03/02/pythagoras-sappho-music/\">laid the foundation of Western music</a> by discovering the mathematics of harmony. Its beauty so staggered him that he thought the entire universe must be governed by it. He called it <em>music of the spheres</em> — the idea that every celestial body produces in its movement a unique hum determined by its orbit. </p>\n<p>The word <em>orbit</em> did not exist in his day. It was Kepler who coined it two millennia later, and it was Kepler who resurrected Pythagoras’s music of the spheres in <em>The Harmony of the World</em> — the 1619 book in which he formulated his third and final law of planetary motion, revolutionizing our understanding of the universe. For Kepler, this notion of celestial music was not mere metaphor, not just a symbolic organizing principle for the cosmic order — he believed in it literally, believed that the universe is singing, reverberating with music inaudible to human ears but as real as gravity. He died ridiculed for this belief. </p>\n<p>Half a millennium after his death, our radio telescopes — those immense prosthetic ears built by centuries of science — detected <a href=\"https://www.nytimes.com/2023/06/28/science/astronomy-gravitational-waves-nanograv.html\" target=\"_blank\">a low-frequency hum</a> pervading the universe, the product of supermassive black holes colliding in the early universe: Each merging pair sounds a different low note, and all the notes are sounding together into this great cosmic hum. We have heard the universe singing. </p>\n<p>To me, this is what makes music so singular — the way it bridges the cosmic and the human, the ephemeral and the eternal. It is at once the most abstract of the arts, made of mathematics, feeling, and time, and the most concrete in its inescapable embodiment — we sing because we have a body, this bittersweet reminder that we are mortal, and we sing to celebrate that we are alive. Alongside love, music may be our best way of saying “yes” to life, and to our life together — I know from the most etymologically passionate person in my life that the Latin root of the word <em>person</em> means “to sound through,” in turn implying a listener: We sound through <em>to</em> something other than ourselves. When we speak, when we sing, when we channel this sound wave of the soul, we reach beyond the self and partake of the great harmonic of belonging.</p>\n<p>That harmonic comes alive with uncommon beauty and ecstatic tenderness in Marie Howe’s poem “Hymn.” </p>\n<p>Found in her altogether magnificent <a href=\"https://www.amazon.com/New-Selected-Poems-Marie-Howe/dp/1324075031/?tag=braipick-20\" target=\"_blank\"><strong><em>New and Selected Poems</em></strong></a> (<a href=\"https://search.worldcat.org/title/1379265778\" target=\"_blank\"><em>public library</em></a>) and animated here by the talented <a href=\"https://oharahale.com\" target=\"_blank\">Ohara Hale</a> (who has previously animated <a href=\"https://www.themarginalian.org/2022/02/24/dark-matter/\">Patti Smith reading Rebecca Elson</a> and <a href=\"https://www.themarginalian.org/2022/02/04/universe-in-verse-bloom/\">Joan as Police Woman singing Emily Dickinson</a>), the poem is an “Ode to Joy” for our own time and for the epochs to come, sonorous with what is best in us, sounding through the possible. </p>\n<p></p>\n<blockquote><p><strong>HYMN</strong><br />\n<em>by Marie Howe</em></p>\n<p>It began as an almost inaudible hum,<br />\nlow and long for the solar winds<br />\n     and far dim galaxies, </p>\n<p>a hymn growing louder, for the moon and the sun,<br />\na song without words for the snow falling,<br />\n     for snow conceiving snow </p>\n<p>conceiving rain, the rivers rushing without shame,<br />\nthe hum turning again higher — into a riff of ridges<br />\n     peaks hard as consonants, </p>\n<p>summits and praise for the rocky faults and crust and crevices<br />\nthen down down to the roots and rocks and burrows<br />\n     the lakes’ skittery surfaces, wells, oceans, breaking </p>\n<p>waves, the salt-deep: the warm bodies moving within it:<br />\nthe cold deep: the deep underneath gleaming: some of us rising<br />\n     as the planet turned into dawn, some lying down </p>\n<p>as it turned into dark; as each of us rested — another woke, standing<br />\namong the cast-off cartons and automobiles;<br />\n     we left the factories and stood in the parking lots, </p>\n<p>left the subways and stood on sidewalks, in the bright offices,<br />\nin the cluttered yards, in the farmed fields,<br />\n     in the mud of the shanty towns, breaking into</p>\n<p>harmonies we’d not known possible. finding the chords as we<br />\nfound our true place singing in a million<br />\n     million keys the human hymn of praise for every</p>\n<p>something else there is and ever was and will be:<br />\n     the song growing louder and rising.<br />\n          (Listen, I too believed it was a dream.)</p></blockquote>\n<p>Complement with Marie Howe’s stunning poem <a href=\"https://www.themarginalian.org/2020/04/23/singularity-marie-howe-animated/\">“Singularity,”</a> honoring Stephen Hawking, then revisit the poetic physicist Alan Lightman on <a href=\"https://www.themarginalian.org/2022/08/15/alan-lightman-mr-g-music/\">music and the universe</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"554c591b41a1b52a4070a713cbd9ee0673d03c0b9d69c772f767cb6b998b9b6c","category":"default"}