{"title":"10 more blogs for your newsreader","link":"https://bradbarrish.com/2023/12/29/10-more-blogs-for-your-newsreader/","date":1703904445000,"content":"<p>Inspired by <a href=\"https://interconnected.org/home/2023/12/29/recommendations\">Matt Webb’s latest post</a>, I wanted to put together a post that walks through my RSS setup and suggests some feeds, whether you’re just dipping your toes into RSS, or you’re just looking for some high-quality sites to add. If you are new to RSS and want to know a little more information, check out <a href=\"https://aboutfeeds.com/\">Matt’s explainer site</a>.</p>\n\n\n\n<p>As of this post, I currently subscribe to 2124 feeds, which may sound like a lot, but the way I go through my feeds, it’s not as overwhelming as it sounds, though I do at least skim the headlines</p>\n\n\n\n<p>Here’s my setup:</p>\n\n\n\n<ul>\n<li>I use <a href=\"https://www.reederapp.com/\">Reeder</a> on my iPhone and iPad and have been using <a href=\"https://feedbin.com/\">Feedbin</a> in a browser when I’m on my Mac, but have also been testing <a href=\"https://www.goldenhillsoftware.com/unread/\">Unread</a> lately.</li>\n\n\n\n<li>I pay $50/year to Ben and Todd at <a href=\"https://feedbin.com/\">Feedbin</a> to keep all of my feeds synced across devices, use the included secret email address when I subscribe to newsletters so they don’t appear in my email inbox and for saved searches across all of my feeds. This comes in handy for tracking topics in which I am especially interested.</li>\n</ul>\n\n\n\n<p><strong><a href=\"https://interconnected.org/\">Interconnected</a></strong> by Matt Webb, is a thoughtful personal blog that focuses on technology, design and society. (<a href=\"https://interconnected.org/home/feed\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://marginalrevolution.com/\">Marginal Revolution</a></strong> by Tyler Cowan and Alex Tabarrok isn’t just about economics. Their interests, particularly Tyler’s, are broad and cover a lot of other things in which I’m interested. (<a href=\"https://feeds.feedblitz.com/marginalrevolution\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://seths.blog/\">Seth’s Blog</a></strong> by Seth Godin is published daily and is one of a few blogs that I read every single day. His writing is always thought-provoking and he covers topics such as marketing, leadership, and personal development. (<a href=\"http://sethgodin.typepad.com/seths_blog/atom.xml\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://kottke.org/\">Kottke.org</a></strong> by Jason Kottke is one of the oldest blogs on the web, covering topics such as art, technology, science, design, music, endless nonsense and tons of great stuff. (<a href=\"http://feeds.kottke.org/main\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://waxy.org/\">Waxy.org</a></strong> by Andy Baio is largely focused on Internet culture, art and technology. (<a href=\"https://waxy.org/feed/\">RSS link</a>)</p>\n\n\n\n<p><a href=\"https://www.themarginalian.org/\"><strong>The Marginalian</strong></a> by Maria Popova is “a one-woman labor of love” exploring big existential questions through literature. (<a href=\"https://feeds.feedburner.com/brainpickings/rss\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://sive.rs/\">Derek Sivers</a></strong> is the blog of author, Internet sage, founder, musician and maker extraordinaire. (<a href=\"https://sive.rs/en.atom\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://om.co/\">Om</a></strong> by Om Malik is a reflective and personal blog focused on technology, the future, science, life and introspection and often includes wonderful photography. (<a href=\"https://om.co/feed/\">RSS link</a>)</p>\n\n\n\n<p><a href=\"https://stephango.com/\"><strong>Steph Ango</strong></a> is the personal blog of Obsidian’s CEO that covers life, design, learning, writing, startups, AI and other topics (<a href=\"https://stephango.com/feed.xml\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://www.afterbabel.com/\">After Babel</a></strong> by Jonathan Haidt is a newsletter by a social psychologist who studies morality. His personal mission is to “conduct research on moral psychology and use those findings to help people understand each other, and to help important institutions work better.” (<a href=\"https://www.afterbabel.com/feed\">RSS link</a>)</p>\n\n\n\n<p><strong><a href=\"https://buttondown.email/clivethompson\">The Linkfest</a></strong> by Clive Thompson is billed as “opposite of doomscrolling” and is a collection of links that cover culture, technology, art and science by a longtime science and tech reporter and author. (<a href=\"https://buttondown.email/clivethompson/rss\">RSS link</a>)</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"55a5435cb5c591d47081e19b72e4572c3fc50f2c258ce751cc0dbf9d5deae48d","category":"default"}