{"title":"Build for Yourself","link":"https://www.usv.com/writing/2024/06/build-for-yourself/","date":1719415865000,"content":"<p>I believe that creating a successful consumer product can be attributed to somewhere between 70-90% luck and 10-30% executing against that luck. A lot of things have to go right: timing, product, distribution, zeitgeist, etc. So much of it is stumbling your way into capturing lightning in a bottle or indestructible product market fit .</p>\n<p>This may seem disheartening, but the good news is that it’s possible to optimize for getting lucky . When building consumer products, I think one of the best ways to increase the chance of doing this is by building for yourself. Building products and companies is hard, so if you’re building a consumer internet application, you might as well build something you want to use yourself. That way, by the end of the day, you are making yourself happy. And that’s a win.</p>\n<p>Building for yourself means that you are your target customer. You can prioritize the features that you find most useful or fun. Your roadmap is all the things you want to exist. Nobody knows your product or the problem you’re trying to solve better than you. And if the product you’re building can’t make you happy or satisfy your needs, there’s little chance it will do so for others.</p>\n<p>I’ve seen a lot of people think about building or trying to build consumer internet applications by drastically overthinking things. They’re midwitting their way into a problem that doesn’t exist, a product nobody cares about, or an idea they think the world needs based on some hole they perceive to exist in Facebook Marketplace or Events or fill in the blank. This is not the way. Build something you want to exist and use yourself, not something that appears to be some opportunistic arbitrage.</p>\n<p>Many durable consumer products take some time to truly inflect, and it takes even longer to figure out how to build and scale the business. On top of that, it’s difficult to maintain your energy over that period of time. So you better be enjoying the ride and the product you’re building. Build for yourself.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/06/build-for-yourself/\">Build for Yourself</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"55add4238e5d7d9f76c00d14780b9471369d3a1ef2ef9f3e64812129d0d0f245","category":"default"}