{"title":"Winners of the 2024 Bulwer-Lytton Fiction Contest","link":"https://kottke.org/24/08/winners-of-the-2024-bulwer-lytton-fiction-contest","date":1724101146000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/bulwer-lytton-2024.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/bulwer-lytton-2024.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/bulwer-lytton-2024.jpg 1200w\" loading=\"lazy\" width=\"1195\" height=\"339\" alt=\"She had a body that reached out and slapped my face like a five-pound ham-hock tossed from a speeding truck.\" /></p>\n\n<p>Since 1982, the Bulwer-Lytton Fiction Contest has celebrated the opening lines of imagined horrible novels. <a href=\"https://www.bulwer-lytton.com/2024\">The winners of the 2024 competition have been announced</a> and there are some real doozies in there, starting with the overall winner:</p>\n\n<blockquote><p>She had a body that reached out and slapped my face like a five-pound ham-hock tossed from a speeding truck.</p></blockquote>\n\n<p>Here are a few of my other favorites:</p>\n\n<blockquote><p>Mrs. Higgins’ body was found in the pantry, bludgeoned with a potato ricer and lying atop a fifty-pound sack of Yukon golds, her favorite for making gnocchi, though some people consider them too moist for this purpose.</p></blockquote>\n\n<blockquote><p>That sweltering Friday evening she not so much walked but slithered into my shabby strip mall P.I. office, showing off all her curves, and I knew then I was in for a weekend of trouble because Dave’s Reptile Emporium next door, from which the ball python had escaped, was closed until Monday.</p></blockquote>\n\n<blockquote><p>Sir Arthur Pendragon, High King of the Britons, son of King Uther Pendragon, nephew of King Aurelius Ambrosius, who was in turn the son of a long list of people who weren’t kings and thus don’t matter, only slept with his sister once, but boy did it come back to bite him in the ass.</p></blockquote>\n\n<blockquote><p>His burnt flesh sizzling like a burger on the grill, blood pouring from his wounds like an overshaken cola, and sweat as salty as French fries pouring down his face, John knew that after this mission was over, he was getting McDonald’s for dinner.</p></blockquote>\n\n<blockquote><p>“I do enjoy turning a prophet,” said Torquemada, as he roasted the heretic seer on a spit.</p></blockquote>\n\n<p><a href=\"https://www.bulwer-lytton.com/2024\">You can check out the whole wretched bunch here</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/best%20of\">best of</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/08/winners-of-the-2024-bulwer-lytton-fiction-contest\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"55cef5d4bd0d423746d36273ecb55b529d9ff33f8e0c8c83dab8ba6a56211b0b","category":"Sites"}