{"title":"The Political &#8220;Center&#8221; Between Fascism and Democracy Is Fascism","link":"https://kottke.org/24/08/the-political-center-between-fascism-and-democracy-is-fascism","date":1723471102000,"content":"\n        <p><a href=\"https://www.the-reframe.com/what-center-is-that-exactly/\">What “Center” Is That, Exactly?</a> A.R. Moxon on the continuing pleas from political “centrists” for the Democratic Party to find common ground with a party dedicated to extremist white Christian nationalism and whose party members joyously brandish MASS DEPORTATION NOW signs at party conventions.</p>\n\n<blockquote><p>It must be a center that exists between two points one of which pretty clearly reads MASS DEPORTATION NOW, and I suppose Chait would have it that the other point is apparently so far to the right of basic acts of governance like feeding hungry schoolchildren that such acts don’t appear in between. The center is apparently now a cruel enough place that decency doesn’t live there, and Chait, who has never believed that Democrats should ever do anything other than seek the votes of those who hate decency, now believes that Democrats should once again run away from decency, as a strategic matter.</p>\n\n<p>So maybe “the center” isn’t a position. Maybe it’s an alignment, one that sees unity as a constant and never-changing agreement with supremacists, a certification that supremacists and only supremacists are part of “us,” and any attempt to make common cause with unwanted groups that supremacists consider to be their enemies represents polarization and disunity, in a way that supremacist violence itself never will.</p>\n\n<p>Maybe “the center” is just whatever no-man’s land currently happens to occupy the space between the worst atrocities we can imagine, and however far we’ve travelled toward those committing them to try to get them on our side, a journey we undertook so that we won’t have to do the work of opposing them.</p>\n\n<p>I think it might be that.</p>\n\n<p>Such a center is a center that will make itself comfortable with any atrocity, because comfort is its only goal.</p></blockquote>\n\n<p>Moxon is echoing Rebecca Solnit here, who wrote <a href=\"https://lithub.com/rebecca-solnit-on-not-meeting-nazis-halfway/\">On Not Meeting Nazis Halfway</a> back in November 2020.</p>\n\n<blockquote><p>Nevertheless, we get this hopelessly naive version of centrism, of the idea that if we’re nicer to the other side there will be no other side, just one big happy family. This inanity is also applied to the questions of belief and fact and principle, with some muddled cocktail of moral relativism and therapists’ “everyone’s feelings are valid” applied to everything. But the truth is not some compromise halfway between the truth and the lie, the fact and the delusion, the scientists and the propagandists. And the ethical is not halfway between white supremacists and human rights activists, rapists and feminists, synagogue massacrists and Jews, xenophobes and immigrants, delusional transphobes and trans people. Who the hell wants unity with Nazis until and unless they stop being Nazis?</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/A.R.%20Moxon\">A.R. Moxon</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Rebecca%20Solnit\">Rebecca Solnit</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"569d8e962c966d456ecaee5078282c9366c8eccf008c0debcb40999d1d54c019","category":"default"}