{"title":"The Fragmentation of Search","link":"https://www.usv.com/writing/2024/02/the-fragmentation-of-search/","date":1709219303000,"content":"<p>The market structure for Search is currently being reshaped. Horizontal and LLM-based “search <em>agents</em>” like ChatGPT and Perplexity are placing unprecedented pressure on search engines<em> </em>like Google. Cracks are beginning to form, from which new possibilities of search are rapidly germinating. </p>\n\n\n\n<p>USV expects this fragmentation to continue and for new opportunities in Search to rise up as a result. We’re particularly intrigued by opportunities that give agency to consumers and web publishers that have traditionally felt at odds with the conventional Google model, or who may already feel uneasy with the idea of search agents becoming the new gatekeepers of our information.</p>\n\n\n\n<p>BC (‘before ChatGPT’), Google was synonymous with Search. Its concentrated market power meant it could make unilateral decisions that could adversely impact the consumers, web publishers, and advertisers that transacted on it.</p>\n\n\n<div>\n<figure><img width=\"994\" height=\"608\" src=\"https://www.usv.com/wp-content/uploads/2024/02/Screenshot-2024-02-29-at-9.41.20 AM.png\" srcset=\"https://www.usv.com/wp-content/uploads/2024/02/Screenshot-2024-02-29-at-9.41.20 AM.png 994w, https://www.usv.com/wp-content/uploads/2024/02/Screenshot-2024-02-29-at-9.41.20 AM-300x184.png 300w, https://www.usv.com/wp-content/uploads/2024/02/Screenshot-2024-02-29-at-9.41.20 AM-768x470.png 768w, https://www.usv.com/wp-content/uploads/2024/02/Screenshot-2024-02-29-at-9.41.20 AM-45x28.png 45w\" /></figure></div>\n\n\n<p>We strove to find businesses with a robust counter positioning to Google. <a href=\"https://www.usv.com/writing/2011/10/duck-duck-go/\">DuckDuckGo</a> was one of them and was able to build a great business protecting consumer privacy online, <a href=\"https://duckduckgo.com/about\">now generating over 3 billion searches a month</a>. However, Google held firm and its search engine remained the dominant leader.</p>\n\n\n\n<p>Now LLM-based search agents are causing all new kinds of upheaval. By providing easy answers upfront to questions I once would have had to google and scroll through a click-bait article for, search agents have unlocked a shortcut for consumers <em>seeking</em> information that obfuscates the publisher entirely. This is inevitably peeling away queries from engines like Google and Bing, as well as displacing web publishers who lose traffic to ChatGPT despite providing the data on which it’s trained.</p>\n\n\n\n<p>And it’s not just ChatGPT. It’s Perplexity, Arc Search, Pi and a multitude of others building on top of a variety of different LLMs that are all competing to be the trusted brand for horizontal search agents. In the past, a single tab sufficed for my internet searches, but now I routinely operate with three or more tabs open.</p>\n\n\n\n<p><em>BC:</em></p>\n\n\n\n<figure><img src=\"https://lh7-us.googleusercontent.com/QKmtMHpAd61WJWIibpushSUqq-3vGK8HAFjxNAYBiQIj9ixMRgzVrKN2yNQBppXND3Ksi3-Dxxb28WnG7pAhZ-g6lR55MX4V52pEzKdZhWBPQMysYYdNyS6LCJBsiXeGMFUXy_290nBUkWqkzxhiXaw\" /></figure>\n\n\n\n<p><em>AC:</em></p>\n\n\n\n<figure><img src=\"https://lh7-us.googleusercontent.com/H_ZMTwiVvE9WFFcuib2cOoLuIUkzDm5bX23wBuC6mXWpqbRjqhBVPm_stDsGMipYiHTYGLq7MvJ5c7zAyFX_VtYZRYwTRqz8ugDua5OjhmsaISWoUWiCStf0L4xliVJIfWhT5oVjIEJ0VtxVExTCFF4\" /></figure>\n\n\n\n<p>This splintering of search raises a number of key questions:  </p>\n\n\n\n<p>1/ What business model will horizontal search agents come up with to stem the<a href=\"https://www.msn.com/en-us/news/technology/ais-pricey-reality-microsofts-chatgpt-costs-a-staggering-700k-per-day-to-operate/ar-BB1h1zr0\"> heavy losses</a> piling in compute and inference cost? Particularly once the AI hype bubble subsides, and the billions of venture capital dollars propping up these platforms does too.</p>\n\n\n\n<p>2/ Are consumers willing to pay for Search? And if not, how long till we see targeted ads creep up in those search agent responses?</p>\n\n\n\n<p>3/ Will web publishers and content creators struggle to survive if search engines go away, and the SEO and advertising dollars along with them? Is this a “print newspaper” moment for digital publications?</p>\n\n\n\n<p>4/ Will horizontal search agents eventually starve off their own information supply if they refuse to cut publishers into the economics?  </p>\n\n\n\n<p>5/ Even if search agents do <a href=\"https://www.theverge.com/2024/2/17/24075670/reddit-ai-training-license-deal-user-content\">agree to AI royalties</a>, why should <a href=\"https://www.garbageday.email/p/ai-search-doomsday-cult\">publishers bother making new websites if no one’s ever going to actually see them</a>? Will the introduction of financial incentives change the kind of content we’re used to seeing on the internet?</p>\n\n\n\n<p>Search will have to confront these questions and will continue to splinter off into new behaviors and platforms as result. As with DuckDuckGo, we’re excited about platforms that can counter position themselves to Google and Microsoft by creating business models that neither can compete with without fundamentally cannibalizing their own businesses.</p>\n\n\n\n<p>We can imagine platforms that reward publishers and content creators for generating the content that keeps the internet <a href=\"https://www.usv.com/writing/2024/01/weird/\">weird</a>. This could be through financial rewards like subscriptions, though we think there’s an even bigger opportunity for crypto to invent <a href=\"https://avc.xyz/the-native-business-model-for-content\">new monetization models for AI-native content</a>. Crypto tokens, buying NFTs, and low / no-cost minting will all function as <a href=\"https://www.usv.com/writing/2024/01/nfts-have-evolved-nfts-endure/\">acts of patronage</a>. These rewards could also not be financial at all, instead creating a network of content creators that runs on social currencies like respect and community.</p>\n\n\n\n<p>There’s going to be more consumer-centric models, too. We envision personal knowledge agents that enable consumers to curate their own unique data sets, which they can revisit, mine, and explore over time.</p>\n\n\n\n<p>Different kinds of AI-native vertical search platforms will emerge that lean into the stochastic nature of LLMs and emphasize exploration as a feature. This will happen in domains like travel, music, books, fashion, second-hand goods and interior design. Today text-based chat serves as the main user interface for Search. But we anticipate an increasing shift towards diverse and integrated form factors like photo, audio, video, and even biometric data. In the same way that iNaturalist allowed us to query birdsong, new platforms will leverage advanced technologies to interpret richer forms of data to offer personalized and immersive search experiences.</p>\n\n\n\n<p>All to say, it’s an interesting time to be in the Search business. LLMs are changing the game and opening doors to new ways of accessing and interacting with information. We’re excited by what we might find.</p>\n\n\n<p>The post <a href=\"https://www.usv.com/writing/2024/02/the-fragmentation-of-search/\">The Fragmentation of Search</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Grace Carney","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"58454551c9dde7ab0972920884f77c851f69a8dfb977a24da3705bdbe2548147","category":"default"}