{"title":"Here’s how to live: Intertwine with the world.","link":"https://sive.rs/htl06","date":1638748800000,"content":"<p>\nWe’re all cousins.\n<br />\nEverybody on Earth, no matter how far apart, has a surprisingly recent common ancestor.\n<br />\nGo meet your family in the Middle East, in Asia, in Africa, in the Americas, and in Europe.\n<br />\nUnderstand that there is no “them”.\n<br />\nIt’s just “us”.\n<br />\nFeel those connections.\n</p><p>\nYou have kindreds scattered around the world.\n<br />\nPeople who are weird like you are spread out everywhere.\n<br />\nOne of the best feelings in life is to meet someone who grew up in an opposite culture but has your same humor, thoughts, or taste.\n</p><p>\nIf you want a successful network of connections, what matters is not how many people you know but how many different kinds of people you know.\n<br />\nBuilding relationships worldwide brings more opportunity, more variety, and more chance for circumstance.\n</p><p>\nMoving across the world makes you smarter, because you stop thinking you’re always right.\n<br />\nThose who shout, “my country is the best!” are those who have never left.\n<br />\nIn Icelandic, the word for “idiot” means “one who has never left home to journey abroad”.\n<br />\nOnly idiots think they’re always right.\n</p><p>\nYou can’t see your own culture while you’re inside of it.\n<br />\nOnce you get out and look back, you can see which parts of your personality actually come from your environment.\n</p><p>\nTraveling makes you better at communicating, since you can’t assume familiarity, and must speak simply and clearly.\n<br />\nYou’ll get used to speaking with people of different religions, worldviews, and communication styles.\n<br />\nYou’ll know when to be formal, when to joke, when to reference tradition, and when to swear.\n</p><p>\nHow far should you travel?\n<br />\nLook to nature’s example of floating dandelion seeds and sticky burrs.\n<br />\nPlants and trees spread their seeds as far as possible.\n<br />\nAnd so should you.\n<br />\nSpread your DNA worldwide.\n<br />\nNot just your biological DNA, but the other things that make you who you are: your ideas, values, and relationships.\n</p><p>\nTo live a full and rewarding life, intertwine yourself with the world.\n</p><p>\nMove somewhere far away.\n<br />\nPlan to stay.\n<br />\nBring no baggage.\n<br />\nLeave your expectations and certainties behind.\n</p><p>\nThis new strange place will feel wrong.\n<br />\nYou’ll find fault in most of its ways.\n<br />\nThe clothes you arrive in are not suited for its climate.\n<br />\nThe beliefs you arrive with are not suited for its culture.\n<br />\nReplace both with locally-made clothes and beliefs.\n<br />\nEventually, they’ll fit you well.\n</p><p>\nAsk questions until you understand why things are the way they are.\n<br />\nCulture is often historical.\n<br />\nLike a person’s outlook on life is shaped by what they’ve been through, a culture’s values are shaped by its recent history.\n<br />\nLearn the local mindset.\n<br />\nDon’t ask how “they” do things.\n<br />\nAsk how “we” do things.\n<br />\nThat small difference is important.\n<br />\nThis is your new home.\n</p><p>\nOnce a place really feels like home, move somewhere new.\n<br />\nPick a confusing or scary place that you don’t understand.\n<br />\nRepeat the process.\n<br />\nMake it your home.\n<br />\nTry to make the connection official by getting visas, residency, and citizenship.\n<br />\nDo this until no part of the world feels foreign.\n</p><p>\nFrom Brazil, learn to live in the present, and embrace every stranger as a friend.\n<br />\nLeave before you forget about the future.\n</p><p>\nFrom Germany, learn rationality and directly honest communication.\n<br />\nLeave before you start scolding strangers.\n</p><p>\nFrom Japan, learn deep consideration for others, social harmony, and intrinsic perfection.\n<br />\nLeave before you get so considerate that you can’t express yourself or take action.\n</p><p>\nFrom China, learn pragmatism and the multi-generational mindset.\n<br />\nLeave before you get superstitious or prioritize social status.\n</p><p>\nFrom France, learn idealism and resistance.\n<br />\nLeave before you oppose everything in theory.\n</p><p>\nFrom America, learn expressive rebellious individualism.\n<br />\nLeave before thinking you’re the center of the world.\n</p><p>\nFrom India, learn to improvise and thrive in complexity.\n<br />\nLeave before feeling a divide between what’s inside versus outside your circle.\n</p><p>\nIn all cultures, avoid the madness of the crowd.\n</p><p>\nHave a child with someone from Asia, Africa, the Americas, and Europe.\n<br />\nThe greater the variety of races, the better.\n<br />\nRaise your kids with many influences, many parents, and many families.\n<br />\nHelp raise other people’s kids for the same reason.\n<br />\nMake voluntary families.\n<br />\nMake wider and inclusive families.\n</p><p>\nSome say “blood is thicker than water,” as if only your immediate relatives have blood.\n<br />\nBut everyone has blood, and you’re related to all of them.\n</p><p>\nIf you eventually need a permanent home, choose the place you’d want to be if everything goes wrong.\n<br />\nChoose a culture that values what you value.\n</p><p>\nWhen you die, you leave behind your genes and ideas.\n<br />\nThe atoms in your cells will disassemble and become plants, animals, dirt, and oceans.\n<br />\nBits of you will eventually become part of the whole world.\n<br />\nThe way to live is to spread your seeds widely before you die.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"58800cef07fd2cd0b89e83131df269336921af46feb1b453608f50e3c9098f2c","category":"default"}