{"title":"VK One","link":"https://om.co/2024/03/17/vk-one/","date":1710724224000,"content":"<p>A few days ago, Vinod Khosla got into a war of words with Marc Andreessen. Or was it Elon? It was an argument over OpenAI and “open” AI. It might have felt like a bunch of capitalist leviathans butting their big heads, but for me, this was classic Vinod.</p>\n\n\n\n<p>Always speaking his mind, and batting a 1000 percent for the companies he has backed. Standing his ground, giving his reasons like the rat-a-tat of a Tommy gun, argumentative and not giving an inch.</p>\n\n\n\n<p>I couldn’t resist diving into the recent spat between Vinod and other tech leaders. It took me back to the late 90s when I interviewed the legendary VC for a Red Herring cover story.</p>\n\n\n\n<p>Here’s my take on the man.</p>\n\n\n\n<p>As a reporter for Forbes and Red Herring, I wrote about broadband and everything that powered the network. Not surprisingly, there was no getting away from Vinod. He had so many big bets on so many parts of the network that I was constantly calling him as a reporter. It was as if he had a cheat code for the broadband future.</p>\n\n\n\n<p>When I joined Red Herring, then-editor Jason Pontin (now at DCVC) assigned me to do a cover story about Vinod. And I did. The inside headline of the story was “Vinod’s Time” but the cover rightfully dubbed him “The Number one VC on the planet.” And he, thanks to a string of multi-billion dollar exits and public offerings, was outshining his colleagues at Kleiner Perkins.</p>\n\n\n\n<p>It was one of the most grueling assignments, but also the most satisfying. While reporting for the story, I talked to countless people and of course, got to spend time with Vinod. Not a lot of what we discussed made it to the magazine. We talked at length about Dynabook, Go Computing, and 3DO. We also discussed Nexgen.</p>\n\n\n\n<p>Of course, only a few people remember those startups, because Silicon Valley only remembers the outcomes, not the process. Anyway, there is one comment that made it into the story.</p>\n\n\n\n<blockquote>\n<p>“To be ahead of the market you can’t be a follower. You can’t be following what is hot. You have to have your own belief system. But to me risk is a religion, and I think if you want to go after the big market, you need to take it.</p>\n</blockquote>\n\n\n<div>\n<figure><img width=\"745\" height=\"1024\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover-745x1024.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover-745x1024.jpg 745w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover-218x300.jpg 218w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover-140x192.jpg 140w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover-407x560.jpg 407w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/03/RedHerringNumberOneVConThePlanetCover.jpg 750w\" /></figure></div>\n\n\n<p>That quote has stayed with me. It is not only my personal mantra, but also a reminder of what makes a really good entrepreneur and very good capitalist, venture or otherwise.</p>\n\n\n\n<p>These days, it is pretty common to hear venture capitalists wax eloquent about “AI”. But before the “official” launch of “OpenAI” and its sudden rise to prominence, most of the new experts were busy diddling around with crypto and web3. Buzzword bingo is a popular sport for the investor crowd. </p>\n\n\n\n<p>Despite the growing ranks, very few real <em>venture</em> capitalists really roam the proverbial Savannah that we call Silicon Valley. Vinod was, and is one of those. His early bet on OpenAI is a worthy testimonial.</p>\n\n\n\n<p>My favorite part of writing the story about Vinod could be summed up in two lines. I wanted to figure out a way to emphasize his impact (beyond just financial returns). So, I came up with an analogy that would make sense to non-technology people: the number of jobs created by the companies he started or funded.</p>\n\n\n\n<blockquote>\n<p>In the 24 years he has spent in the United States he has helped create 40 companies, business which have produced a total of 150  billion in market value. Directly or indirectly, his efforts have created six jobs for every day he has lived in the United States. </p>\n</blockquote>\n\n\n\n<p>This might have seemed like such a throwaway line to the editors — I had to argue hard to keep it in — but it meant a lot to me. Both as an immigrant and one who believes in capitalist ideology. I thought that was the best way to illustrate a success story. Especially because I had grown up in a quasi-socialist society where the rich hoarded their wealth.</p>\n\n\n\n<p>I believed that a capitalist’s true mettle was not in the amount of wealth they accumulated, but in how much downstream wealth they helped create and propagate. That meant a thriving ecosystem where everything was growing. Of course, society seems to have lost sight of that ideology since. Capitalism has metastasized into what it wanted to replace. That’s a topic to consider later.</p>\n\n\n\n<p>Anyway, back to Vinod. Social Media is the best thing that has happened for him because nothing (and no reporter for sure) can capture his true essence than what he shares on Twitter.</p>\n\n\n\n<p>Happy Sunday!</p>\n\n\n\n<p><strong><em>March 17, 2024. San Francisco</em></strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"5885ed318733168f82847624e35ba21ac0469391d1b613e5a4c955c6105a6f39","category":"default"}