{"title":"Mountain Bike Flips on a Moving Train","link":"https://kottke.org/24/09/mountain-bike-flips-on-a-moving-train","date":1726167908000,"content":"\n        <p></p>\n\n<p>In a collaboration with Red Bull &amp; Prada (uh, ok) and with the help of the Polish State Railways, Dawid Godziek rode a mountain bike on a ramps course on top of a moving train, performing tricks &amp; flips between cars. The train and rider moved at the same speed in opposite directions, which made it seem as though, from the perspective of someone on the ground next to the train, that the rider is nearly horizontally stationary.</p>\n\n<p>The result is trippy &amp; counterintuitive and also a demonstration of Newton’s laws of motion &amp; frames of reference. But since Godziek was not riding in a vacuum, there were <a href=\"https://www.redbull.com/us-en/dawid-godziek-interview-red-bull-bike-express\">some real world details to contend with</a>:</p>\n\n<blockquote><p>We observed something interesting — the lack of air resistance. In theory, this could have made it easier, but the opposite was true. The air resistance creates a tunnel that somehow keeps me in a straight line and doesn’t allow me to shift right or left. Luckily on the recordings we had, the headwind gave me artificial air resistance, which helped me to get a feel for the flight on classic hops. On the tests, the wind was blowing weaker or in a different direction, making shooting tricks difficult. Not bad, right? We’re always complaining about air resistance, and when it wasn’t there, we found that it was impossible to fly without it.</p></blockquote>\n\n<p>See also <a href=\"https://www.youtube.com/watch?v=ZH7GpYJoptU\">Mythbusters shooting a soccer ball out of the back of a moving truck</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/cycling\">cycling</a> · <a href=\"https://kottke.org/tag/Dawid%20Godziek\">Dawid Godziek</a> · <a href=\"https://kottke.org/tag/physics\">physics</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/sports\">sports</a> · <a href=\"https://kottke.org/tag/trains\">trains</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/09/mountain-bike-flips-on-a-moving-train\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"5890b8cf29f6d9f692196582d2828cd69900912883e5ce958499949a82638946","category":"Sites"}