{"title":"Daily run, part one","link":"https://sive.rs/run","date":1664323200000,"content":"<p>\nEvery day you go on a long run through the forest.\n</p><p>\nYou picture a <strong>pot of gold</strong> at the end.\nIt helps you finish when you feel like quitting.\n</p><p>\nOne day you pretend there’s a <strong>tiger</strong> right behind you.\nIt makes you much faster, so you keep using this approach.\n</p><p>\nA running expert suggests you try acting like you’re running on <strong>hot coals</strong>, to keep you on the front of your feet.\nYou try it, and it improves your stamina and energy.\n</p><p>\nSometimes, to shake things up, you try running barefoot, or with your eyes closed, or with your arms out like an airplane.\nEvery time you hear or think of a new way to run, you try it to see how it <strong>works</strong> and how you <strong>feel</strong>.\nThe variety is fun.\n</p><p>\nEventually you realize you could make this path better for others, so you bring a <strong>shovel</strong> to smooth out bumps and fill in holes.\nYou imagine future runners being thankful for whoever did this.\n</p><p>\nOne day, when filled with money frustrations at home, you run while picturing that <strong>pot of gold</strong> again, and are surprised to find it now makes you run faster than ever.\n</p><p>\nA new book declares that the single best way to run, after hundreds of scientific experiments by the experts, is, in fact, to act as if a <strong>tiger</strong> is behind you.\nMillions of readers (they call themselves “tigerists”) are happy that tigerism has the answer.\n</p><p>\nSo, can we say that one of these ways to run is <strong>true</strong>?\n<strong>\nPlease <a href=\"https://sive.rs/run2\">read part two</a> now.\n</strong>\n</p>\n<figure><img src=\"/images/run.jpg\" alt=\"trail through forest\" /><figcaption>photo © <a href=\"https://www.flickr.com/photos/72616463@N00/38672745471/\">Josephine Stenudd</a></figcaption></figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"58cec59aabb237a34a73de558e81eb866e7a41fd0288866b3ab2948e9c444bae","category":"default"}