{"title":"China vs US: Social Media Edition","link":"https://om.co/2024/04/19/china-vs-us-social-media-edition/","date":1713552920000,"content":"<p><br />There is a good chance that you might have missed the most important technology news of the day — at least in my opinion. China has asked Apple to remove WhatsApp, Threads, Telegram and Signal from its app store in the country. </p>\n\n\n\n<p>The Wall Street Journal, which has the exclusive, <a target=\"_blank\" href=\"https://www.wsj.com/tech/apple-removes-whatsapp-threads-from-china-app-store-on-government-orders-a0c02100?st=mjijkzg2og31ug5&amp;reflink=desktopwebshare_permalink\">reports</a>: </p>\n\n\n\n<blockquote>\n<p>Apple said it was told to remove certain apps because of national security concerns, without specifying which. “We are obligated to follow the laws in the countries where we operate, even when we disagree,” an Apple spokesperson said.</p>\n\n\n\n<p>The Cyberspace Administration of China asked Apple to remove WhatsApp and Threads from the App Store because both contain political content that includes problematic mentions of the Chinese president, according to a person familiar with the matter. The Apple spokesperson said that wasn’t part of the reasoning.</p>\n\n\n\n<p>The move shrinks the number of foreign chat apps Chinese internet users can use to communicate with those outside of the country, a further tightening of internet controls by Beijing, which is sensitive to uncensored information circulating.</p>\n</blockquote>\n\n\n\n<p>This surgical move is in sharp contrast to the United States and its continued dithering over TikTok, which has been (rightfully) accused of being China’s propaganda pipeline in the U.S. I translate this simply —our politicians are being short-sighted in thinking that there is a chance that Chinese will allow Bytedance to sell off their US app by extending the deadline. And as far as the general US population is concerned, <a target=\"_blank\" href=\"https://nymag.com/intelligencer/article/explain-to-me-why-china-has-to-control-tiktok.html\">they are already infected by the TikTok mind virus</a>. Axios <a target=\"_blank\" href=\"https://www.axios.com/newsletters/axios-pro-rata-beeae5dc-51a9-4331-b2b4-aa2386a18b6c.html?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosprorata&amp;stream=top\">put it succinctly</a>: </p>\n\n\n\n<blockquote>\n<p>It may be wishful thinking from Congress that with more time it will see a TikTok sale to U.S. owners — but there’s no real sign from the Chinese tech giant that it wants to do that.</p>\n\n\n\n<p>TikTok would face a ban if it doesn’t sell to American owners — but members of Congress have also faced backlash from constituents who don’t want to lose the app, both for entertainment and business reasons.</p>\n</blockquote>\n\n\n\n<p>As it stands, TikTok is a perfect way for the Chinese <a target=\"_blank\" href=\"https://theweek.com/tech/tiktok-an-agent-of-chinese-propaganda\">to shape</a> public opinion in the US. There have been enough testimonials of it becoming a major source of disinformation. And they could come in very handy when it comes time to taking control of Taiwan in the near future. </p>\n\n\n\n<p>Chinese are happy to take decisive and swift action when it comes to controlling their own self-interests. And what is Apple going to do? Say no? And lose access to Chinese market, see revenues evaporate and stock price shrink? No one — especially since it is a stock that is indirectly owned by most Americans. </p>\n\n\n\n<p>As an aside, while China considers all its tech companies (like Bytedance) as part of its national strategic infrastructure,the United States (and its allies) think of Apple and other technology companies as public enemies. </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"59700c5c08b2c8863e196fa81d206081cd18022e70ce5e24f44ca2ca1bbf13d6","category":"default"}