{"title":"Delight Between Science and Magic: Euler’s Disk and the Sound of the Singularity","link":"https://www.themarginalian.org/2024/11/26/eulers-disk/","date":1732645492000,"content":"<p>One afternoon in the late 1980s, sitting in the company cafeteria, aerospace engineer Joseph Bendik found himself so bored that he took a coin out of his pocket and began spinning it atop the table. In a testament to the eternal paradox of boredom and wonder as two sides of the same coin — <a href=\"https://www.themarginalian.org/2023/05/10/iain-mcgilchrist-the-matter-with-things/\">the currency of life that is attention</a> — he was suddenly wonder-smitten by the exquisite elegance of the physics making the coin seem to levitate, spinning faster and faster rather than slower and slower before shuddering to a stop. </p>\n<p>Here was a demonstration of laws undergirding everything from the motions of planets to the photosynthesis of plants — the conservation of angular momentum and the conservation of energy — a demonstration made not in equations but in sheer delight. </p>\n<p>Bendik realized that if he toyed with a few variables — the smoothness of the surface, the mass of the spinning disk, the width of its edge — he could magnify the delight and make the science border on magic. And so he turned the mathematics — that most splendid plaything of the mind — into a toy: a heavy disk spinning into near-infinity atop a mirror surface.</p>\n<p><a href=\"https://www.amazon.com/gp/product/B000239E6Q/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?resize=680%2C325&amp;ssl=1\" width=\"680\" height=\"325\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?w=1473&amp;ssl=1 1473w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?resize=320%2C153&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?resize=600%2C287&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?resize=240%2C115&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?resize=768%2C367&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/EulersDisk.jpg?w=1360&amp;ssl=1 1360w\" /></a></p>\n<p>He named it <a href=\"https://www.amazon.com/gp/product/B000239E6Q/?tag=braipick-20\" target=\"_blank\">Euler’s Disk</a> for Leonhard Euler, who had died two centuries earlier to be remembered by many as the greatest mathematician to ever live. </p>\n<p>Along with a copy of <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a> and a baby lemon tree planted from a seed, Euler’s Disk may be my favorite <a href=\"https://www.amazon.com/gp/product/B000239E6Q/?tag=braipick-20\" target=\"_blank\">gift to give</a>, and the one most certain to bring unalloyed delight. Here is a gleeful demonstration of it by my former partner turned best friend upon receiving it:</p>\n<p></p>\n<p>This is how it works: Holding the disk upright on the mirror, you give it a hard manual spin that adds kinetic energy its potential energy. Once in motion, the disk relies on its angular momentum to try to remain upright as gravity pulls it downward and the mirrored base exerts an upward counterforce. These opposing tugs make it spins faster and faster, appearing to levitate, its sound whirring at a higher and higher frequency as the disk’s points of contact with the mirror make a circle oscillating with a constant angular velocity. </p>\n<p>If there were no friction, this motion would continue forever — the product of a power law modeling what is known as finite-time singularity. But the mirror, smooth though it is, still provides some fiction. Coupled with resistance from the air — the same air drag central to <a href=\"https://www.themarginalian.org/2024/11/22/how-birds-fly/\">the physics of how birds fly</a> — it eventually causes the whirring disk to sigh to a sudden stop: the sound of the singularity.</p>\n<p>Couple with the story of <a href=\"https://www.themarginalian.org/2022/03/25/dirge-without-music-emmy-noether/\">how Emmy Noether illuminated the conservation of energy</a> (a story crowned with an Edna St. Vincent Millay poem), then revisit <a href=\"https://www.themarginalian.org/2024/05/05/cicadas/\">the poetic science of how cicadas sing</a> — the sound of a living singularity.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"598575d182a425440201960d48915d7a953db753f4bec05951c8a33f09d9d8ef","category":"Sites"}