{"title":"AI Aesthetics","link":"https://www.usv.com/writing/2024/02/ai-aesthetics/","date":1706803812000,"content":"<p><img width=\"549\" height=\"313\" src=\"https://lh7-us.googleusercontent.com/qFvEIAkBUcqllMsfM3LZMjLBVnz5M5Yy75jYryDnJClM_WFaAMRUBkmGj2-WswbQvdGIJDk9W90Qo3flN4bnxARrVQggJc78SCoZJYX9wJ1Xy5rii17fo4rqwHt4q4q3ex00yKrQOc2SByRoebGoTsE\" /></p>\n\n\n\n<p>The word “technology” comes from the Greek word <em>techne</em>, which refers to an art or skill or practice. Plato writes a lot about the concept, often making reference to artists such as flute players as canonical examples of those engaged in a <em>techne</em>. Though today we are inclined to contrast technology and art (eg STEM vs the humanities), classical thinkers saw them as profoundly intertwined. In order to understand the connection, one has to recognize that art is not and cannot be self-expression <em>tout court</em>. Art is always mediated by the tools we have at our disposal for communicating, and the nature of those tools is determined by the technical capabilities of the time.</p>\n\n\n\n<p>Tech companies of the last 25 years like Netflix, YouTube, and TikTok might look like merely new media distribution channels. This is the wrong way to think about them. New technologies unlock entirely new kinds of art. They change the terms of who can create art and what constitutes a work of art by changing the media through which we can express ourselves. Streaming has changed the pacing of TV shows as audiences are now inclined to binge content instead of parceling them out over weeks and months.  More dramatically, if you showed a <a href=\"https://www.youtube.com/watch?v=Hwybp38GnZw\">Mr. Beast</a> YouTube video or <a href=\"https://www.youtube.com/shorts/hVM7mCbeDAo\">Savanah Moss</a> TikTok to someone 25 years ago, they wouldn’t even have the conceptual framework to understand what they were watching.</p>\n\n\n\n<p>AI is probably the most important technology of our era, and like previous technological revolutions, it will change our relationship to art – how we create art, what kind of art we create, and what we even consider to be art.</p>\n\n\n\n<p>First, we are already seeing AI lower the barrier to the creation of art. On my <a href=\"https://matthewmandel.com/\">personal blog</a>, I now add custom images to each new post, something I would be wholly incapable of without image models. Runway has empowered the OG Matt at USV to make <a href=\"https://x.com/mattcynamon/status/1737530330226049168?s=20\">wonderful trailers</a>. Music apps like <a href=\"https://splice.com/sounds/create\">Splice</a> and Suno mean people with no musical training can easily express themselves through song – and not just through the <em>curation</em> of songs but through their <em>creation</em>. If the iPhone meant anyone could capture reality with the camera in their pocket, AI means anyone can depict and interpret reality in any medium they choose.</p>\n\n\n\n<p>AI will also unlock entirely new kinds of art. <a href=\"https://apps.apple.com/us/app/plots-stories-reinvented/id6463803522\">Plots</a> is creating a new kind of storytelling where humans direct character-based AI chatbots. Our portfolio company Bright Moments has developed the “Dream Machine”, which continuously generates new images based on the previous image it came up with and vocal prompts from users (or should I say creators? or consumers?). USV had the good fortune to have one installed in our office, and it’s been amazing to see how much fun people have with it. The hallmarks of these new AI-enabled media are interactivity and serendipity, perhaps in a way we would normally associate with videogames. Humans offer a vision, are surprised and amused at what is conjured up, and respond with a new prompt in turn, further expanding the work. </p>\n\n\n\n<p>Perhaps most interestingly, we’ll see the creation of art that is mostly inspired by AI prompting itself (ie as opposed to more hands-on human prompting). It’s a fine line between works in this third category and those in the second, but projects like <a href=\"https://www.twitch.tv/watchmeforever\">Nothing Forever</a> and <a href=\"https://huggingface.co/spaces/jbilcke-hf/ai-tube\">AI Tube</a> feel more AI-<em>driven</em> than AI-<em>enabled</em>. If YouTube/Twitch/TikTok reflect something deep about the human experience by showing the more mundane details of one person’s life, what might we learn about ourselves from relatively unconstrained systems trained on the entirety of humanity’s self-expression? What happens when “<a href=\"https://www.usv.com/writing/2023/06/hallucinations-as-a-feature-not-a-bug/\">hallucinations as a feature, not a bug</a>” is taken to its artistic extreme?</p>\n\n\n\n<p>I’m excited about these new approaches to art. They’ll be <a href=\"https://www.usv.com/writing/2024/01/weird/\">weird</a>, like <a href=\"https://www.youtube.com/@Rambalac\">Rambalac</a> is weird. Or, as Damien Chazelle <a href=\"https://www.youtube.com/watch?v=LI6TR5Wd28A\">captures</a> so well in his masterpiece <em>Babylon</em>, like <em>The Wizard of Oz</em>, <em>Jurassic Park</em>, and <em>Avatar</em> are weird from the perspective of early Hollywood. </p>\n\n\n\n<p>But how wonderful they all are.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/02/ai-aesthetics/\">AI Aesthetics</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Matt Mandel","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"59af8af7895c610b7cf856f4db7a996646f40fde34428980d7620a331be082c0","category":"default"}