{"title":"Socii Dispatch 04","link":"https://blog.webb.page/2018-04-17-socii-dispatch-04.txt","date":1523923200000,"content":"<p>In the almost two months since my last dispatch I moved my life from New\nEngland to Tennessee, started working on a new product, and learned of a couple\nother social networks in development. This might be a long read, make yourself\ncomfortable.</p>\n<h2>Why Move?</h2>\n<p>The rent was too damn high! Also, with my skills I can work anywhere. Why not\nlive in a place where the weather is (generally) better and the price of living\nis more agreeable?</p>\n<h2>New Product</h2>\n<p>While working on Socii, I made the conscious decision not to add an analytic\nscript for two reasons:</p>\n<ol>\n<li><em>I</em> use ad blockers and it is safe to assume that the people who would join\nSocii do too. Therefore, my analytic script would be blocked. Why bother\nadding one in the first place?</li>\n<li>Gauges (the analytics provider for all my other sites) has been sold at\nleast three times. They could get sold to Google or Facebook at some point\nand I am fundamentally opposed to using their products.</li>\n</ol>\n<p>However, this became a hindrance at some point because Socii would error on a\nroute and crash (unhandled promise rejections are bad!). I started thinking\nabout having a service that could plug into my codebase with <em>minimal change</em>\nwhile also showing me where things happen.</p>\n<p>Enter Chew (analytics you can count on)!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-04-a.png\">Homepage of Chew</a></p>\n<p>It works by capturing the request object in your (Express 4) middleware and\nsending the relevant data to Chew. I spent a couple weeks working on this and\nit's <em>just about</em> ready for private testing (basically, me using it on my own\nsites and fixing bugs that occur). All you need to get started is a free Chew\naccount and two lines of code in your Express-based app: importing the Chew npm\npackage and a single line in your middleware.</p>\n<p>As usual, I learned some things along the way and I look forward to applying\nthese new learnings to Socii. I tend to refactor (and write more code comments)\nas I develop so I can help my future self when something needs fixing (or\nremoval, I love when I can remove code).</p>\n<p>Naturally, I used Socii as a base for Chew and came up with a very basic SaaS\nboilerplate:</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-04-b.png\">My SaaS boilerplate, 1.0</a></p>\n<p>The left side refers to self-explanatory services while the right side shows\nyou the URLs each service would be reachable at.</p>\n<p>The admin console is new to me and I haven't actually created one yet but I\nlike the idea of a master interface being made available to admin users,\ninstead of embedding admin controls inside the app. Separation of concerns,\nyes. More stuff to manage? Of course! The tradeoff is worth it to me.</p>\n<p>Thanks to the power of Nginx and reverse proxies, you can run all of these on\nthe same physical server! Probably shouldn't have the CDN there though. For\nSocii, I have a service that optimizes images before placing them in storage\n(DigitalOcean Spaces, their version of Amazon S3).</p>\n<p>Once I have Chew launched and the notifications feature launched in Socii, I'll\nstart working on open-sourcing my SaaS boilerplate. I just realized this is a\ngreat time to segue.</p>\n<h2>Social Networks</h2>\n<p>I frequent HackerNews and commented on a post<a href=\"https://news.ycombinator.com/item?id=16821172\">1</a> where someone listed their\nsocial network feature wishlist. Of course, I plugged Socii because it will\nmatch (most of) what they want when it is feature-complete. I fully expect\ndownvotes and was pleasantly surprised to see the opposite occur! Furthermore,\nother people working on social networks reached out to me via LinkedIn and\nemail. Unfortunately, aside from initial introductions I haven't conversed with\nthese folks. I hope that changes soon, we could all learn from each other.</p>\n<p>It is quite obvious that \"social\" is on the mind of everyone and I'm glad that\npeople are trying their hand at improving the Internet. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5a602db4296445292767ecc85549c5aaa93651c5b07daef591bb88d6c8463e71","category":"Sites"}