{"title":"What Makes a Compassionate World: Sophie de Grouchy’s Visionary 18th-Century Appeal to Parents and Teachers","link":"https://www.themarginalian.org/2024/01/18/sophie-de-grouchys-sympathy/","date":1705594546000,"content":"<p><a href=\"https://www.amazon.com/Sophie-Grouchys-Letters-Sympathy-Engagement/dp/0190637080/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"509\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?fit=320%2C509&amp;ssl=1\" alt=\"What Makes a Compassionate World: Sophie de Grouchy’s Visionary 18th-Century Appeal to Parents and Teachers\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?w=855&amp;ssl=1 855w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?resize=320%2C509&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?resize=600%2C954&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?resize=240%2C382&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/lettersonsympathy_degrouchy.jpg?resize=768%2C1222&amp;ssl=1 768w\" /></a></p><p>The morning after the 2016 presidential election, I awoke to terrifying flashbacks of my childhood under a totalitarian dictatorship. Desperate for assurance that the future need not hold the total moral collapse of democracy, I reached out to my eldest friend for perspective. Months shy of 100, <a href=\"https://www.themarginalian.org/2018/12/18/a-velocity-of-being-helen-fagin/\">Helen</a> had been born into a world war, survived the Holocaust, and fled from Poland to America without speaking a word of English before becoming a professor of English literature for half a century. </p>\n<p>I asked her what to do, where the hope lies. </p>\n<p>Her response was simple, profound.</p>\n<p>“The most hideous crime against humanity,” she reminded me, began with a legal election. It is not, therefore, purely on the level of politics that we avert the unconscionable. It begins deeper, she said: in the moral foundation of the people, which is laid early in life; it begins with the impulses we nurture in our young. </p>\n<p>Half a century earlier, the pioneering scientist and peace activist Kathleen Lonsdale had arrived at the same conclusion in her <a href=\"https://www.themarginalian.org/2022/03/06/is-peace-possible-kathleen-lonsdale/\">superb manifesto for what makes peace possible</a>. But it was another woman of uncommon brilliance and moral courage, writing amid the bloodiest revolution the world had yet seen, that first articulated the urgency of planting the seeds of compassion, out of which all social harmony blooms, in the fallow hearts of children. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?resize=680%2C845&amp;ssl=1\" width=\"680\" height=\"845\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?resize=320%2C398&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?resize=600%2C746&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?resize=240%2C298&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/SophieDeGrouchy_TheMarginalian.jpg?resize=768%2C955&amp;ssl=1 768w\" /><figcaption>Sophie de Grouchy, self-portrait, 1790s</figcaption></figure>\n<p>Born in an era when women were barred from formal education and all institutions of political, intellectual, and creative life, <strong>Sophie de Grouchy</strong> (April 8, 1764–September 8, 1822) was still a girl when she learned English, Latin, Italian, and German by sitting in on her brothers’s studies, not being allowed to have a tutor of her own; soon, she was teaching the boys herself. By the time she was a teenager, her bedtime reading was Marcus Aurelius, whose <a href=\"https://www.themarginalian.org/2022/06/01/marcus-aurelius-meditations-kindness/\">teachings on kindness</a> left a deep impression.</p>\n<p>Determined to grow both intellectually and morally, Sophie made frequent visits to the local poor with her mother and her sister to offer compassion and comfort. In this living laboratory of sympathy, she came to see how entwined the wellbeing of others is with one’s own, how enmeshed we are in what Martin Luther King, Jr. would call <a href=\"https://www.themarginalian.org/2015/03/18/martin-luther-king-letter-from-birmingham-city-jail/\">“an inescapable network of mutuality</a> a quarter millennium later. </p>\n<figure><a href=\"https://www.themarginalian.org/2022/05/27/the-boy-the-mole-the-fox-and-the-horse/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/theboythemolethefoxandthehorse_charliemackesie16.jpg?w=768&amp;ssl=1\" /></a><figcaption>Art by Charlie Mackesy from <a href=\"https://www.themarginalian.org/2022/05/27/the-boy-the-mole-the-fox-and-the-horse/\"><em>The Boy, the Mole, the Fox and the Horse</em></a></figcaption></figure>\n<p>After discovering philosophy — Voltaire, Diderot, Rousseau — she grew disenchanted with the unprovable promises of religion. Upon announcing her atheism, her mother burned all of Sophie’s books. </p>\n<p>She was twenty-two when she met the philosopher and mathematician Nicolas de Condorcet, twice her age. He was as taken with Sophie’s intellect as he was with her moral courage — in one of their first encounters, he watched her throw herself between a rabid dog and a boy she was tutoring. Within weeks, they were married. After helping Condorcet set up a new lyceum where celebrated philosophers and scholars taught, she devoured the curriculum herself, studying mathematics, botany, history. She started taking painting lessons. She joined one of the first anti-slavery clubs. </p>\n<p>And then she began writing. </p>\n<p>While most of her writing is now lost, one masterwork survives — her translation of Adam Smith’s <em>Theory of Moral Sentiments</em>. Published to earn money when her husband was killed in the Reign of Terror and she lost all her property, it embodies what the poet Wisława Szymborska would call “that rare miracle when a translation stops being a translation and becomes…. a second original.” Appended to it is her entirely original <a href=\"https://www.amazon.com/Sophie-Grouchys-Letters-Sympathy-Engagement/dp/0190637080/?tag=braipick-20\" target=\"_blank\"><strong><em>Letters on Sympathy</em></strong></a> (<a href=\"https://search.worldcat.org/title/1049575955\" target=\"_blank\"><em>public library</em></a>) — Sophie de Grouchy’s leap from the springboard of Smith’s theories into her own singular moral cosmogony. </p>\n<p>Although it appeared as an afterword to her translation of Smith in 1798, Sophie had been working on <em>Letters on Sympathy</em> for seven years, beginning when she was only twenty-seven and the French Revolution was raging around her. Rising from its pages are ideas epochs ahead of their time: Not long after Descartes declared nonhuman animals mere automatons, and very long before Jane Goodall lit the dawn of understanding animal consciousness, she insisted that animals are “sensitive beings” capable of empathy; two centuries before the discovery of mirror neurons, she wrote of how our sympathy is activated “when we see a sensible being suffer.” At the heart of her theory is the recognition that we are endowed with “a secret impulse to understand the troubles of others as soon as we suspect their existence,” but that this impulse atrophies if we fail to nourish it from the start and exercise it regularly. </p>\n<figure><a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/07/lionandbird_dubuc.jpg?w=680&amp;ssl=1\" /></a><figcaption>Illustration by Marianne Dubuc from <a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><em>The Lion and the Bird</em></a></figcaption></figure>\n<p>Anchoring her argument is an impassioned appeal to parents and educators — one just as urgent today, and perhaps even more so in our age of competitive parenting that scars children’s souls with the tyranny of achievement and trains them to measure themselves by the trappings of outward success rather than by the scope of their sympathy. She writes:</p>\n<blockquote><p>It seems clear that the more we exercise our sensitivity, the stronger it becomes… When it is not exercised, sensitivity tends to weaken… How important it must be, therefore, to exercise children’s sensitivity to the point where it will continue to develop as much as it is capable of — so that it can no longer be dulled by those things in life that tend to lead sensitivity astray. These things lead us far from nature and ourselves by focusing our sensitivity on vain and selfish passions, leading us away from simple tastes, and from those natural leanings in which the happiness of each person resides, the kind of happiness that does not require the sacrifice of others and that benefits all. Fathers, mothers, teachers — you nearly have in your hands the destiny of the next generation! How guilty you are if you allow your children to abort these precious germs of sensitivity which require, for their development, nothing more than the sight of suffering, the example of compassion, the tears of gratefulness, and an enlightened hand leading and moving them! How guilty you are if you care more about your children’s success than about their virtue, if you are more impatient to see them gain popularity in their circle than to see their heart brim with indignation for an injustice, their faces turn pale at the sight of suffering, their hearts treat all men as brothers!</p></blockquote>\n<p>She offers a timeless recipe for cultivating that vital sensitivity in children:</p>\n<blockquote><p>Teach them to be easily remorseful, delicately proud, and honest; let them not see suffering without being tormented by the need to bring relief. No less is needed in the midst of these oppressive barriers, raised between man and man from need, strength, and vanity, but that they should fear at each step to hurt rights or to neglect to repair some ancient wrong! That the sweet habit of doing good should teach them that it is through the heart that they will find happiness, and not through titles, luxury, dignities, or riches!</p></blockquote>\n<p>Complement with Kahlil Gibran’s <a href=\"https://www.themarginalian.org/2019/09/09/on-children-kahlil-gibran/\">poignant advice on parenting</a> and the great cellist Pablo Casals on <a href=\"https://www.themarginalian.org/2016/03/10/pablo-casals-joys-and-sorrows-jfk/\">how to make this world worthy of its children</a>, then — because books are the finest instrument we have invented for magnifying empathy — revisit Mary Shelley’s philosopher-father William Godwin, writing in Sophie de Grouchy’s day, on <a href=\"https://www.themarginalian.org/2020/01/17/how-to-raise-a-reader-william-godwin/\">how to raise a reader</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"5ab8d95763b650d0939c32806c30d58b7e850997b81650a9116e88eddbc4b19e","category":"default"}