{"title":"I'm done with Kickstarter","link":"https://blog.webb.page/2017-08-19-im-done-with-kickstarter.txt","date":1503100800000,"content":"<p>Kickstarter is a great place for people to financially support those with a\ngreat idea and a prototype, but need a little assistance to make that idea a\nreality. This is why I signed up for the platform in 2012. Five years later\nand I'm sick of the bullshit that seems to emanate from the projects I back.</p>\n<p>Of the 39 projects I have contributed money to, 10 are delayed (some are\ndelayed by about a year or more). <em>Good thing I'm not holding my breath.</em>\nLet's take a look at those projects, starting with the oldest.</p>\n<h2>Star Citizen</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-a.jpg\">Star Citizen on Kickstarter</a></p>\n<p>This game<a href=\"https://www.kickstarter.com/projects/cig/star-citizen\">1</a>, by Cloud Imperium Games Corporation, was successfully funded on\nNovember 19th, 2012. I backed at the $37 tier (Digital Scout) for:</p>\n<ul>\n<li>a digital copy of the finished game (PC)</li>\n<li>RSI Aurora spaceship ready to fly</li>\n<li>1,000 Galactic Credits</li>\n<li>exclusive access to the Alpha + Beta</li>\n</ul>\n<p>The estimated delivery date for this was November 2014. Of the unfulfilled\nprojects I backed, I am the <em>least</em> sore about Star Citizen because 1) I can\nplay the Alpha when I get a PC (I have a Mac) and 2) there are regular\nupdates. Not just, \"Oh hey guys, here's a wall of text and a pic or two\", it's\nactual gameplay and something I can interact with.</p>\n<p>I think the CEO got overly ambitious but at least it's not No Man's Sky-tier\nof fuckedupness.</p>\n<h2>Mighty No. 9</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-b.jpg\">Mighty No. 9 on Kickstarter</a></p>\n<p>This game<a href=\"https://www.kickstarter.com/projects/mightyno9/mighty-no-9\">2</a>, by comcept, is currently the laughing stock of the gaming world\nand a cautionary tale for game developers looking to create a Kickstarter for\ntheir game. It was successfully funded on October 1st, 2013. I backed at the\n$60 tier for:</p>\n<ul>\n<li>a physical game box (Western/Japanese style)</li>\n<li>printed retro-style game manual (English/Japanese)</li>\n<li>exclusive in-game golden hero (backer-exclusive color variation of Beck,\nthe game's hero)</li>\n</ul>\n<p>The estimated delivery date for this was April 2015. I just got the physical\nrewards a week or two ago. The Nintendo 3DS version? Still waiting for it. I\nhave a Switch now…</p>\n<h2>Sa: The Umbrella Reimagined</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-c.jpg\">The Sa umbrella on Kickstarter</a></p>\n<p>This umbrella<a href=\"https://www.kickstarter.com/projects/860103721/satm-the-umbrella-reimagined\">3</a>, by Justin Nagelberg and Matthew Waldman, was successfully\nfunded on December 1st, 2014. I backed at the $69 tier for:</p>\n<ul>\n<li>one Sa (early limited special)</li>\n</ul>\n<p>The estimated delivery date was March 2015. Since being successfully funded,\nbackers have gotten u̶p̶d̶a̶t̶e̶s̶ essays twice a year about why shipping has\nbeen delayed two years. Basically, because the umbrella is so different that\nfactories have to be taught how to work on components. Factories is plural\nbecause they've gone through a couple because of shutdowns. Who the hell knows\nwhen I'm gonna get this thing.</p>\n<ul>\n<li>2017/09/14 update<ul>\n<li>another essay, but with TL;DR version!</li>\n<li>fully functioning prototype</li>\n<li>noticed weird things with prototype, fixes for those things is in progress</li>\n<li>shipping has been pushed back to Winter/Spring 2018</li>\n</ul>\n</li>\n</ul>\n<p>To quote a backer, \"Great to see that after nearly 3 years you nearly have a\nworking prototype\".</p>\n<h2>The Light Phone</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-d.jpg\">The Light Phone on Kickstarter</a></p>\n<p>This phone<a href=\"https://www.kickstarter.com/projects/thelightphone/the-light-phone\">4</a>, by Light, was successfully funded on June 27th, 2015. I backed\nat the $25 tier for:</p>\n<ul>\n<li>The Light Book. It documents the process of building the Light Phone and\nincludes photos, drawings, and essays. It will cover the entire story from\nideation to insights into the manufacturing process.</li>\n</ul>\n<p>The estimated delivery date was June 2016. I messaged the founders last month\nabout the book and this was the response:</p>\n<blockquote>\n<p>Not yet. We would like to include our entire journey of the Light Phone and\nwe believe that there is more to come. We will email backers when we plan to\nrelease the book. Thank you for asking!</p>\n</blockquote>\n<p>I'm not sure how much more of \"the journey\" needs to be documented but I hope\nI get it before the end of 2018.</p>\n<ul>\n<li>2018/02/28 update<ul>\n<li>creators are launching a new campaign for Light Phone 2, but on\nIndiegogo<a href=\"https://www.indiegogo.com/projects/light-phone-2-smartphone-design\">5</a> this time</li>\n</ul>\n</li>\n</ul>\n<p>Here's what they had to say about backers that pledged for the book:</p>\n<blockquote>\n<p>We have users that pledged for a process book in our original campaign, and\nwe want to acknowledge that we have not at all forgotten about you. We've\ncontinued to document the process and want the book to encompass the Light\nPhone journey in its entirety, through this second generation as well. We\nwill offer the book as a pledge in the next campaign as well (a $50\ndonation). We have a few ideas for ways to make this even more special for\nthose of you who originally donated with a limited edition bonus too.</p>\n</blockquote>\n<p>The end of the Indiegogo campaign is scheduled to end April 2019. The\nKickstarter campaign ended June 2015. I was supposed to get the book\nJune 2016.</p>\n<h2>D̶a̶s̶ ̶K̶e̶y̶b̶o̶a̶r̶d̶ ̶5̶Q̶ GOT IT</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-e.jpg\">Das Keyboard 5Q on Kickstarter</a></p>\n<p>This keyboard<a href=\"https://www.kickstarter.com/projects/1229573443/das-keyboard-5q-the-cloud-connected-keyboard\">6</a>, by Das Keyboard, was successfully funded on July 30th, 2016.\nI backed at the $139 (early bird) tier for:</p>\n<ul>\n<li>one Das Keyboard 5Q for $90 off the $229 retail price.</li>\n</ul>\n<p>The estimated delivery date was January 2017. I have a regular Das Keyboard\n(Mac version) at home and I love it. What drew me to the 5Q was the ability to\nwrite scripts to mod the keyboard. You can create light shows, make certain\nkeys change color due to a specified event, and so on. Super customizable!\nAnyhoo, people are pissed off because the company makes keyboards for a living\nand we <em>still</em> don't have ours.</p>\n<p>Welp.</p>\n<ul>\n<li><p>2017/08/25 update</p>\n<ul>\n<li>Typhoon Hato damaged a factory in Hong Kong</li>\n<li>no injuries</li>\n<li>raw materials and critical production equipment were protected from damage</li>\n</ul>\n</li>\n<li><p>2017/08/31 update</p>\n<ul>\n<li>5Q pilot production will begin in a couple days</li>\n<li>full production schedule for the end of September</li>\n<li>Kickstarter fulfillment in October, barring any pilot production issues</li>\n</ul>\n</li>\n<li><p>2017/09/25 update</p>\n<ul>\n<li>solder quality for mechanical switches failed QA</li>\n<li>incorrect product packaging</li>\n<li>National Day in China for the first week of October</li>\n<li>production will start the week of October 30th</li>\n</ul>\n</li>\n<li><p>2018/02/28 update</p>\n<ul>\n<li>keyboards are shipping!</li>\n<li>Mac/Linux support is nonexistent…seriously</li>\n<li>105-key layout (international) keyboards have damaged switches</li>\n<li>according to a Superbacker and another backer who got theirs already, the\nkeyboard is straight <em>trash</em> from the hardware to the software</li>\n</ul>\n</li>\n<li><p>2018/03/13 update</p>\n<ul>\n<li>I opened a ticket with Das Keyboard's support channel to get the address\nfor the 5Q to be changed to one of my best friends. I bought WASD's CODE\nkeyboard<a href=\"http://www.wasdkeyboards.com/index.php/products/code-keyboard/code-104-key-mechanical-keyboard-2923.html\">7</a> instead.</li>\n<li>Roughly 15 months to deliver what appeared to be a lackluster keyboard of\nquestionable quality. <em>Sigh</em></li>\n</ul>\n</li>\n</ul>\n<p>With each update, backers become less enthusiastic or get angry. I think it's\nsafe to say that the Das Keyboard team isn't going to make another crowdfunded\nproduct for a long time, if ever. E̶a̶r̶l̶i̶e̶r̶ ̶t̶h̶i̶s̶ ̶s̶u̶m̶m̶e̶r̶,̶ ̶I̶ ̶j̶o̶k̶e̶d̶ ̶a̶b̶o̶u̶t̶ ̶g̶e̶t̶t̶i̶n̶g̶\nm̶y̶ ̶5̶Q̶ ̶i̶n̶ ̶t̶i̶m̶e̶ ̶f̶o̶r̶ ̶C̶h̶r̶i̶s̶t̶m̶a̶s̶.̶ ̶A̶t̶ ̶t̶h̶i̶s̶ ̶r̶a̶t̶e̶,̶ ̶t̶h̶a̶t̶ ̶l̶o̶o̶k̶s̶ ̶t̶o̶ ̶b̶e̶ ̶t̶h̶e̶ ̶c̶a̶s̶e̶.̶ Keep in\nmind that these people are in the business of producing keyboards and have\nbeen doing so since 2005.</p>\n<h2>T̶M̶A̶-̶2̶ ̶M̶o̶d̶u̶l̶a̶r̶ ̶H̶e̶a̶d̶p̶h̶o̶n̶e̶ ̶S̶y̶s̶t̶e̶m̶ GOT IT</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-f.jpg\">TMA-2 Modular Headphone System on Kickstarter</a></p>\n<p>This wireless headphone system<a href=\"https://www.kickstarter.com/projects/1733579622/the-wireless-tma-2-modular-headphone-system\">8</a>, by AIAIAI, was successfully funded on\nDecember 15th, 2016. I backed at the $65 tier (early bird) for:</p>\n<ul>\n<li>H05 Smart Headband</li>\n</ul>\n<p>The estimated delivery date was May 2017. AIAIAI's TMA-2 is a modular\nheadphone system which means if something on my headphones breaks, I can just\nreplace a module or two and not the entire thing. I already own the TMA-2 so\nwhat I paid for was the headband to make my headphones wireless. T̶h̶e̶ ̶l̶a̶t̶e̶s̶t̶\nu̶p̶d̶a̶t̶e̶ ̶s̶a̶i̶d̶ ̶t̶h̶i̶s̶ ̶w̶a̶s̶ ̶g̶o̶i̶n̶g̶ ̶t̶o̶ ̶s̶h̶i̶p̶ ̶a̶t̶ ̶t̶h̶e̶ ̶e̶n̶d̶ ̶o̶f̶ ̶t̶h̶i̶s̶ ̶m̶o̶n̶t̶h̶.̶ ̶W̶e̶ ̶s̶h̶a̶l̶l̶ ̶s̶e̶e̶.̶</p>\n<p>I'm tired of using Apple's shitty ear buds and I've gone through two aux\ndongles already.</p>\n<ul>\n<li><p>2017/08/21 update</p>\n<ul>\n<li>mass production has been moved to September 11th</li>\n<li>Kickstarter orders (1436 of 'em) will ship out September 18th - October\n6th</li>\n<li>I've already confirmed with them that orders will ship in order of\npledges (I'm backer 46)</li>\n</ul>\n</li>\n<li><p>2017/09/13 update</p>\n<ul>\n<li>mass production started but minor things needed to change on assembly line</li>\n<li>7-10 day delay</li>\n</ul>\n</li>\n<li><p>2017/09/27 update</p>\n<ul>\n<li>headphones are shipping (̶h̶o̶p̶e̶ ̶t̶o̶ ̶u̶p̶d̶a̶t̶e̶ ̶t̶h̶i̶s̶ ̶p̶o̶s̶t̶ ̶i̶n̶ ̶a̶ ̶c̶o̶u̶p̶l̶e̶ ̶d̶a̶y̶s̶)̶!̶</li>\n</ul>\n</li>\n<li><p>2017/10/18 update</p>\n<ul>\n<li>I got it! 5 MONTHS LATER</li>\n</ul>\n</li>\n</ul>\n<h2>Indie Microblogging</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-g.png\">Indie Microblogging on Kickstarter</a></p>\n<p>This social network and eBook<a href=\"https://www.kickstarter.com/projects/manton/indie-microblogging-owning-your-short-form-writing\">9</a>, by Manton Reece, was successfully funded on\nFebruary 1st, 2017. I backed at the $10 tier for:</p>\n<ul>\n<li>PDF and ePub versions of the book, plus early access to Micro.blog</li>\n</ul>\n<p>These are some of the book topics:</p>\n<ul>\n<li>how to adapt blogging tools like WordPress and Tumblr to work with\nmicroblogs.</li>\n<li>the important role of cross-posting to Twitter, and the best tools out\nthere.</li>\n<li>tips for integrating a microblog into an existing weblog.</li>\n<li>architecture for microblogs, with a behind-the-scenes look at how Micro.blog\nwas built.</li>\n<li>overview of the latest IndieWebCamp and W3C proposals for indie\nmicroblogging, such as Webmention and Micropub.</li>\n<li>Manton's personal stories on why it matters so much to preserve content on\nthe Internet.</li>\n</ul>\n<p>The estimated delivery date was March 2017. Like Star Citizen, I'm not sore\nabout my eBook reward being delayed. Manton is creating an entire social\nnetwork by himself and managing a Slack group for backers. I haven't setup\nthis blog with micro.blog yet either so it looks like we're both delayed,\nhaha! He's actively working on finishing the book though.</p>\n<h2>J̶a̶c̶k̶:̶ ̶M̶a̶k̶e̶ ̶A̶n̶y̶ ̶H̶e̶a̶d̶p̶h̶o̶n̶e̶s̶ ̶W̶i̶r̶e̶l̶e̶s̶s̶ GOT IT</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-h.jpg\">Jack on Kickstarter</a></p>\n<p>This Jack adapter<a href=\"https://www.kickstarter.com/projects/podolabs/make-any-headphones-wireless-jack-by-podo-labs\">10</a>, by Podo Labs, was successfully funded on February\n25th, 2017. I backed at the $25 (early bird) tier for:</p>\n<ul>\n<li>one Jack adapter</li>\n</ul>\n<p>The estimated delivery date was June 2017. The latest update promises that\nI'll get this by the end of October at the latest. You might be wondering why\nI backed two Kickstarters that are headphone-focused. I like music and I'm\nbeginning to despise wires. Should the battery on my H05 run out, I can attach\na cable to it and that cable to the Jack. I'll have to stuff the cord in my\nbag or someplace but it'll still be wireless!</p>\n<ul>\n<li><p>2017/10/06 update</p>\n<ul>\n<li>Delays of course, but the team makes it seem as though they were\nblindsided by a Chinese holiday. This isn't their first KS and from the\ncomments, they have a history of making promises they can't keep, having\ntons of delays, and announcing new projects before the current one is\nfulfilled.</li>\n<li>\"Production\" unit shown doesn't match prototype, and while understandable\nto a degree it's disappointing.</li>\n</ul>\n</li>\n<li><p>2019 May update</p>\n<ul>\n<li>This was sent to my old address so it took a couple weeks to get to me.\nEighteen friggin' months for this thing? SMH. They even had the nerve to\nadvertise new Kickstarter campaigns while I waited.</li>\n</ul>\n</li>\n</ul>\n<h2>S̶t̶e̶a̶d̶i̶c̶a̶m̶ ̶V̶o̶l̶t̶ GOT IT</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-i.jpg\">Steadicam Volt on Kickstarter</a></p>\n<p>This smartphone stabilizer<a href=\"https://www.kickstarter.com/projects/tiffencompany/steadicam-volt-smartphone-stabilizer-shake-free-vi\">11</a>, by The Tiffen Company, was successfully funded\non March 5th, 2017. I backed at the $139 (early bird) tier for:</p>\n<ul>\n<li>Steadicam Volt for $60 off the planned $199 retail price</li>\n</ul>\n<p>This includes:</p>\n<ul>\n<li>Steadicam Volt Stabilizer</li>\n<li>5x magnetic and 1x starter balance weight</li>\n<li>2x batteries</li>\n<li>battery charger</li>\n<li>Micro-USB cable</li>\n<li>quickstart guide</li>\n<li>carrying pouch</li>\n</ul>\n<p>The estimated delivery date was June 2017. Because retailers like B&amp;H received\nSteadicam Volts before backers, we all get a premium carrying case for free.\nNot bad, but I expected to get the Volt before this month so I could get\nawesome beach footage of my kids. It's now the middle of August so that plan\nwas ruined. When companies show prototypes that are <em>super</em> close to the\nfinished product and show they have years of experience doing things, and\nyadda x3, I expect to get rewards in a relatively short timeframe. Like the\nDas Keyboard, this is not the case here. Apparently, shipping is supposed to\nstart this month.</p>\n<ul>\n<li><p>2017/09/08 update</p>\n<ul>\n<li>shipping warehouse is overbooked</li>\n<li>shipping will start on the 11th</li>\n<li>everyone should get tracking information shortly</li>\n</ul>\n</li>\n<li><p>2017/09/14 update</p>\n<ul>\n<li>I don't have tracking info</li>\n</ul>\n</li>\n<li><p>2017/09/21 update</p>\n<ul>\n<li>I got it! THREE MONTHS LATER</li>\n</ul>\n</li>\n</ul>\n<h2>B̶l̶a̶c̶k̶ ̶I̶n̶k̶ WOMP</h2>\n<p>📸[Black Ink on Kickstarter<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-j.jpg\">IMG10</a></p>\n<p>This film<a href=\"https://www.kickstarter.com/projects/1750747889/black-ink-people-of-color-in-comics\">12</a>, by Craig Rippon, was successfully funded on April 21st, 2017.\nI backed at the $25 tier for:</p>\n<ul>\n<li>Black Heroes Matter t-shirt</li>\n</ul>\n<p>This includes:</p>\n<ul>\n<li>movie ticket code for advance online screening</li>\n<li>my name listed in the \"Thank You\" section of the film</li>\n<li>link to the 2nd trailer for the film when it's completed</li>\n<li>BLACK INK computer wallpaper</li>\n</ul>\n<p>The estimated delivery date was May 2017 (for the t-shirt, not the film) and\nCraig has been unresponsive.</p>\n<ul>\n<li><p>2017/10/11 update</p>\n<ul>\n<li>Craig has been dealing with a LOT of family health issues, one of which is\nserious.</li>\n<li>The company he was working with to get the books didn't honor the apparent\ndiscount agreement they had. Maybe time ran out for that?</li>\n<li>The film <em>should</em> be out in February.</li>\n</ul>\n</li>\n<li><p>2019 May update</p>\n<ul>\n<li>I don't care anymore.</li>\n</ul>\n</li>\n</ul>\n<p>I was a bit miffed when I didn't hear anything for months but not anymore,\nCraig can take all the time he needs.</p>\n<h2>Honorable mention</h2>\n<p>With the exception of Star Citizen and Indie Microblogging (and as of October\n11th, Black Ink), all this has been rather annoying. Honorable mention goes\nout to Massdrop for the MiTo Canvas XDA Custom Keycap Set<a href=\"https://www.massdrop.com/buy/massdrop-x-mito-canvas-xda-custom-keycap-set\">13</a> I've yet to\nreceive. The drop completed on February 1st, 2017. I paid $72.97 (shipping\nincluded) for the Bauhaus Icon Modifiers and Betas. This is what it'll look\nlike:</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/im-done-with-kickstarter-k.jpg\">MiTo Canvas XDA Custom Keycap Set on Massdrop</a></p>\n<p>The estimated ship date was June 2nd, 2017 and the new one is now October.\n<em>Kanye shrug</em> I plan on putting these awesome keys on my existing Das\nKeyboard…I just noticed I'll need to purchase additional keys for my number\npad.</p>\n<h2>Conclusion</h2>\n<p>The moral of this story? It used to be that you could pledge for something on\nKickstarter and expect to get the product on or damn close to the promised\ndelivery date. I love the idea of supporting promising businesses but I think\nI'll just wait until whatever product is available on Amazon before parting\nwith my money. Who wants to be constantly let down all the time? Not me, not\nanymore. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5b0213b090016e1e6af8e12909ea231dbfbf58a6e5619b091886d1d2c1630035","category":"Sites"}