{"title":"The Wound Is the Gift: David Whyte on the Relationship Between Anxiety and Intimacy","link":"https://www.themarginalian.org/2024/12/03/david-whyte-consolations-intimacy/","date":1733239253000,"content":"<p><a href=\"https://www.amazon.com/Consolations-II-David-Whyte/dp/1932887598/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"495\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?fit=320%2C495&amp;ssl=1\" alt=\"The Wound Is the Gift: David Whyte on the Relationship Between Anxiety and Intimacy\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?w=970&amp;ssl=1 970w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?resize=600%2C928&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/davidwhyte_consolations2.jpg?resize=768%2C1188&amp;ssl=1 768w\" /></a></p><p>It takes a long time to know a person — to unbutton the costume of personality and unlace the corset of coping mechanisms in order to touch the naked soul. It is a process delicate and difficult, riven by anxiety and absolutely terrifying to both, requiring therefore great courage and great vulnerability — a process the hard-won product of which we call intimacy. “There is no terror like that of being known,” Emerson anguished in his journal while trying to navigate <a href=\"https://www.themarginalian.org/2019/06/05/ralph-waldo-emerson-margaret-fuller-letters-figuring/\">his deep and complicated relationship with Margaret Fuller</a>. It is a wise terror, for it knows that there is no greater pain than the pain of intimacy severed — by betrayal, by distance, by death. To triumph over that terror in order to know and be known on the level of the naked soul is an act of faith — perhaps the greatest act of faith there is. Because all faith requires a surrender to something we cannot control, all faith begins with the anguishing anxiety that prefaces the leap. </p>\n<p>Poet and philosopher <a href=\"https://www.themarginalian.org/tag/david-whyte/\">David Whyte</a> explores the terrifying and transcendent work of intimacy in <a href=\"https://www.amazon.com/Consolations-II-David-Whyte/dp/1932887598/?tag=braipick-20\" target=\"_blank\"><strong><em>Consolations II</em></strong></a> — the <a href=\"https://www.themarginalian.org/2015/04/29/david-whyte-consolations-words/\">second volume</a> of his short, splendid essays, each reckoning with the deeper meaning of some ordinary and overused word to reveal its unexamined emotional etymology. In “Intimacy,” he writes: </p>\n<blockquote><p>Intimacy is presence magnified by our vulnerability, magnified by increasing proximity to the fear that underlies that vulnerability. Intimacy and the vulnerabilities of intimacy are our constant, invisible companions, yet companions who are always wishing to make themselves visible and touchable to us, always emerging from some deep interior, to ruffle and disturb the calm surface of our well apportioned lives. Intimacy is a living force, inviting me simultaneously from the inside as much as the outside. Something calling from within that wants to meet something calling in recognition from without. Intimacy is the art and practise of living from the inside out.</p>\n<p>[…]</p>\n<p>Our need and our fear of intimacy is felt through an ever present almost volcanic force emerging from some unknown origin inside us, exhibiting to all and sundry, our previously hidden unspoken desires, flowing out against all efforts to the contrary, through our unconscious and conscious behaviours.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Swamp-Warbler_Balance.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>.</figcaption></figure>\n<p>And yet intimacy is haunted by a central paradox: </p>\n<blockquote><p>To become intimate is to become vulnerable not only to what I want and desire in my life, but to the fear I have of my desire being met.</p></blockquote>\n<p>This is the paradox of longing: Because longing can be an addiction, because no active addict ever wants to give up their addiction — or can without a great deal of suffering — it can be terrifying and almost unbearably vulnerable to surrender to an intimacy so amply fulfilling that it leaves nothing to long for. And yet in that vulnerability lies our power and our freedom to transform a relationship from a tether of dependency into a slender cord of grace. </p>\n<p>David writes:</p>\n<blockquote><p>Intimacy cannot occur without a robust sense of vulnerability, and is tied to the sense of being pulled along in the gravitational field of any newly felt openness. In that new openness we feel as if we are pulled through the very doorway of our needs for something we desire deeply but cannot fully identify, partly because what we are about to identify is intimately connected with our own ability or inability to love.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=600%2C928&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>.</figcaption></figure>\n<p>Ultimately, he observes, intimacy is an instrument of discovery and self-discovery — a way of turning the walls between us and within us into sunlit windows through which to see and be seen:</p>\n<blockquote><p>Intimacy always carries the sense of something hidden about to be felt and known in surprising ways; something brought out and made visible, that previously could not be seen or understood. In intimacy what is hidden will become a gift, discovered and rediscovered again and again in the eyes of both giver and receiver.</p>\n<p>[…]</p>\n<p>To become human is to become visible, while carrying what is hidden as a gift to others.</p></blockquote>\n<p>Because what is visible is vulnerable, because what can be seen can be touched and what can be touched can be wounded, he adds:</p>\n<blockquote><p>Intimacy is intimately related to our sense of having been wounded, and the startling intuition that my way forward into life, or into another person’s life will be through the very doorway of the wound itself. Intimacy invites me to learn to trust the way being wounded has actually made me more available, more compassionate and possibly more intimate with the world, by being opened in ways I never realised it was possible to be open… Intimacy is always calibrated by the letting go of or the taking on of fear. Almost always our fear is experienced as an intimate invitation to understand and feel fully our particular form of wounded-ness.</p>\n<p>[…]</p>\n<p>Intimacy finds its ultimate expression in all the forms of surrender human beings find difficult to embrace.</p></blockquote>\n<p>The difficulty of that surrender almost always takes shape as anxiety — a word to which David devotes another of the book’s essays. Anxiety, he observes, is often an avoidance mechanism and a dissociation device — “a protection against real intimacy, real friendship and real engagement with our work,” a way not to feel “the full vulnerability of being visible and touchable in a difficult world.” In anxiety, we disallow ourselves “the ability to stop and rest and the spacious silence needed for… a new understanding” — and all true intimacy opens into a new understanding of ourselves, so that “we learn that what we thought we knew is not equal to what we are discovering… that who we thought we were is not who we are now.”</p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Yellow-WingedWoodpecker.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>.</figcaption></figure>\n<p>By allowing true intimacy on the smallest scale of personal love — the bond between one and one — we open into the largest scale of belonging, into cohesion with what Margaret Fuller, inspired by Goethe, called <a href=\"https://www.themarginalian.org/2021/12/26/margaret-fuller-the-all/\">the All</a>. David writes:</p>\n<blockquote><p>The need for intimacy in a human life and in a human social life is as foundational as our daily hunger and our never ending thirst, and needs to be met in just the same practical way, every day, just as necessarily and just as frequently: in touch, in conversation, in listening and in seeing, in the back and forth of ideas; intimate exchanges that say I am here and you are here and that by touching our bodies, our minds or our shared work in the world, we make a world together… Intimacy is our evolutionary inheritance, the internal force that has us returning to another and to the world from our insulated aloneness again and again, no matter our difficulties and no matter our wounds.</p></blockquote>\n<p>Couple these fragments of the thoroughly soul-slaking <a href=\"https://www.amazon.com/Consolations-II-David-Whyte/dp/1932887598/?tag=braipick-20\" target=\"_blank\"><strong><em>Consolations II</em></strong></a> — other essays in which explore such overused, underexamined words as <em>shame</em>, <em>time</em>, <em>love</em>, <em>burnout</em>, and <em>end</em> — with a wonderful read on <a href=\"https://www.themarginalian.org/2024/03/27/an-ecology-of-intimacies/\">lichens as a lens on intimacy</a>, Kahlil Gibran on <a href=\"https://www.themarginalian.org/2016/09/27/kahlil-gibran-the-prophet-love-marriage/\">love’s difficult balance of intimacy and independence</a>, and Eric Berne on <a href=\"https://www.themarginalian.org/2022/08/13/eric-berne-intimacy/\">the key to true intimacy</a>, then savor this <a href=\"https://www.whereshallwemeet.xyz/2372295/episodes/16173131-on-consolations-with-david-whyte\">excellent interview with David</a> by one of my oldest friends.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"5b60523dfb24b57b8d1d69306073dd611845d9b6021037474f30b5a09a1d98e2","category":"Sites"}