{"title":"Your explanations are not true","link":"https://sive.rs/confab","date":1663632000000,"content":"<p>\nWe all confabulate without realizing it.\n</p><p>\nTo confabulate is to create an explanation that you believe to be true.\n“Con” means together, and “fabula” means story or fable, so: to put together a story.\nConfabulate.\nTo fabricate.\nWhen you don’t know why you did something, your subconscious invents <strong>an explanation that you think is a fact</strong>.\n</p><p>\nThe clearest example comes from people who have a disconnect between the left and right hemispheres of their brain.\n</p><p>\nA researcher shows a patient a message in his right eye, saying, “Please close the window.”\nThe patient gets up and closes the window.\nThen the researcher shows a question to that patient’s left eye, “Why did you close the window?”\nThe patient says he chose to do it because he was cold.\n</p><p>\nA researcher says, to only one ear, “Please walk.”\nThe patient starts walking.\nThen they ask the other ear, “Why did you walk?”\nThe patient says she was walking because she felt like getting a drink.\n</p><p>\nThe patients don’t think they are inventing explanations.\n<strong>\nThey completely believe that those are the real reasons.\n</strong>\n</p><p>\nThat’s confabulating.\nSimilar to rationalizing: to justify and explain with a rational-sounding reason.\nWe all do it all the time.\n<strong>\nWe think our reasons are true.\n</strong>\n</p><p>\nConsidering this, what should we do?\n</p><p>\nStop asking people for explanations, and ignore the ones given.\nSince our reasons are unknowable, focus on actions.\n</p><p>\nDoubt your own reasons, no matter how true they seem.\nGet curious about what your other hidden explanations may be.\n</p><p>\n<strong>\nWhat else?\n</strong>\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"5b984ef5714b77fac22b11e11588949025019d2f672ffa138399fcb6f0efc746","category":"default"}