{"title":"Genuary Art:  Generative Coding Challenge","link":"https://ghuneim.com/2024/01/12/genuary-generative-art-coding-challenge/","date":1705076768000,"content":"<p><strong>It’s Genuary! </strong> The annual event that brings together artists, coders, and enthusiasts of generative art from around the globe. It focuses on the creation of art through algorithms, coding, and computational methods. The event typically runs throughout January, offering a unique prompt each day to inspire participants. Genuary is more than just a challenge; it’s a community-driven initiative that celebrates creativity, innovation, and the intersection of art and technology.</p>\n<p>Genuary, which first emerged in 2021, was born from a compelling and straightforward vision: to kick off each new year with a wave of creativity within the generative art scene.  Daily prompts, released each day of January. These prompts are deliberately broad, inviting a variety of interpretations and creative outputs. Artists and coders, regardless of their experience level, are welcomed to take part. The event is accessible and inclusive, with no entry fees or formal sign-ups required. Submissions predominantly find their home on social media platforms such as Twitter and Instagram, where they’re tagged with #Genuary2024, allowing others to easily find and engage with the work.  I have been archiving each day and concatenate them into a single video reel. Example below Genuary 05 2024 In the style of Vera Molnár (1924 2023). Today’s prompt is – Genuary 11 – <a href=\"https://twitter.com/search?q=genuary11&amp;src=typed_query\">In the style of Anni Albers (1899-1994)</a> Just incredible, come on!</p>\n<p>For those interested in exploring or participating in Genuary check <a href=\"https://genuary.art/\" target=\"_new\">Genuary Official</a>,  the primary hub for prompts, guidelines, and a gallery of submissions. On social media, following the hashtag #Genuary2024 on<a href=\"https://twitter.com/search?q=%23genuary%20&amp;src=typed_query&amp;f=live\"> Twitter</a> and <a target=\"_new\">Instagram. </a></p>\n<p> </p>\n<p></p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"5bd7ae75b23a465abf86a122f293c96ea848ca76dff6d4d1301ec1ba65e99e2f","category":"default"}