{"title":"Cranberry Bogs Use Spiders Instead Of Pesticides","link":"https://kottke.org/24/11/cranberry-bogs-use-spiders-instead-of-pesticides","date":1732742456000,"content":"\n        <p>Hey what are you doing, let’s talk about cranberries! Surely you know, the cranberry is the Official Berry of my wonderful Commonwealth. The tart berry is one of only a few native North American fruits, like the <a href=\"https://en.wikipedia.org/wiki/Asimina_triloba\">pawpaw</a>. The previous sentence has a lie because cranberries aren’t <a href=\"https://en.wikipedia.org/wiki/Drupe\">drupes</a>, and I know that because I just learned what a drupe is. Cranberries are, in fact, epigynous or false berries, something else I just learned about and about which we’re not going to talk about anymore because this post is about making nightmares not destroying dreams, which are in fact two different actions. (Unrelated, North Carolina can’t decide on an official berry and has both an official state red berry and an official state blue berry. (You’ll never guess the official blue berry of NC.)) </p>\n\n<p>Massachusetts boasts<a href=\"https://ag.umass.edu/news-events/highlights/university-of-massachusetts-cranberry-station#:~:text=Massachusetts%20is%20home%20to%2030,%241.4%20billion%20in%20the%20state.\"> 30% of global cranberry acreage</a>, which is a lot and also a very nice and real fact. Most cranberry products come from Oceanspray, a farmer owned cooperative with 700 member owners. This is a neat and less capitalistic model than most corporate juice production, which may make Oceanspray products taste a little sweeter. <a href=\"https://www.tiktok.com/@420doggface208/video/6876424179084709126?lang=en\">You remember this TikTok</a> which increased sales for both <a href=\"https://finance.yahoo.com/news/how-the-viral-ocean-spray-tik-tok-video-transformed-a-90-yearold-company-overnight-173804141.html\">Oceanspray products</a> and <a href=\"https://www.digitalshelfinstitute.org/blog/ocean-spray-viral-tiktok#:~:text=Sales%20for%20Fleetwood%20Mac's%20song,capitalize%20on%20this%20viral%20opportunity.\">Fleetwood Mac</a>. </p>\n\n<p>Cranberries are grown in bogs, but since bogs can’t generally support a large person’s weight, farmers harvest cranberries by flooding the bog and corralling the cranberries together like so many tart reddish sheep. In this analogy, cranberry sauce is the wool of those tart sheep. And below here is where the nightmares start, so consider not advancing if you’re of gentle disposition. </p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/cranberry-bog.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/cranberry-bog.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/cranberry-bog.jpg 1200w\" loading=\"lazy\" width=\"1200\" height=\"900\" alt=\"cranberry-bog.jpg\" /></p>\n\n<p>All this was needless preamble to get to what I really want to tell you about which is, <a href=\"https://www.reddit.com/r/CuratedTumblr/comments/1ctf3vh/cranberry_bog_spiders/\">according to this lost Tumblr post</a>, if you try to get a job at a cranberry bog you might get asked how you feel about spiders and that’s a weird interview question and you might consider not telling the truth because what you want to do is wake up early and be one with the (false) berry. What you want to do is go back to your boggy roots. What you want to do is farm cranberries like a cranberry farmer. But if you do have a problem with spiders and you don’t say anything it’s going to be another problem, and buddy, it’s gonna to be a big one. You see, cranberry farms have been moving towards more organic farming methods which preclude the use of pesticides and so to keep the insect population down, the farmers encourage wolf spiders to live in the bogs. I’m sorry, I meant WOLF SPIDERS. And when they flood the bogs to harvest the cranberries, the WOLF SPIDERS, who are probably called WOLF SPIDERS because they look like little 8 legged wolves, don’t ask me, I’m not an arachnobiologist, flee the deluge for higher ground, because while they can swim like Michael Phelps, they do not prefer to. So they seek higher ground and guess what the higher ground is, Joann, it’s you. You’re the higher ground. </p>\n\n<p>And so the cranberry farmers will ask you how you feel about spiders before hiring you because you might have dozens of swimming WOLF SPIDERS climbing out of the water up your waders and into your hair, but you’ve got to be fine with it because the WOLF SPIDERS are your fellow cranberry bog employees and everyone, even WOLF SPIDERS deserve a safe work environment. Wear a turtleneck or something. Maybe you’re thinking, it’s fine, WOLF SPIDERS don’t bite, and if they do, they’re not venomous, but they do bite and they are venomous, but maybe it all works out if you let them use you for higher ground.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/Massachusetts\">Massachusetts</a> · <a href=\"https://kottke.org/tag/spiders\">spiders</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/11/cranberry-bogs-use-spiders-instead-of-pesticides\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"5becbf795f85bb492b422cecb566dd72424d4214fb17e19a5ba398dc50362451","category":"Sites"}