{"title":"SVB Crisis: A Year Later","link":"https://om.co/2024/03/11/svb-bank-collapse-one-year-later/","date":1710168300000,"content":"<p>Let’s file this one under the #TimeFlies category!</p>\n\n\n\n<p>It is hard to imagine that it was a year ago that Silicon Valley faced an existential crisis. Its premier financial institution, Silicon Valley Bank, was taken over by the federal regulators. It was one of the most difficult weekends of my working life as it threatened the Silicon Valley way of doing things. </p>\n\n\n\n<span></span>\n\n\n\n<p>Of course, the industry is not big on remembering or learning the lessons from the past, so it is hardly a surprise we didn’t hear much on social media. In her weekend <a href=\"https://www.axios.com/newsletters/axios-pro-rata-e649209d-4d53-4b2d-81ab-b91f566131f5.html?utm_source=newsletter&amp;utm_medium=email&amp;utm_campaign=newsletter_axiosprorata&amp;stream=top\">newsletter</a>, Axios’ Kia Kokalitcheva pointed out that “81% of SVB’s clients from a year ago are still banking with SVB.” Of course, it is not really SVB.</p>\n\n\n\n<p>After SVB, we saw another Silicon Valley-focused bank, First Republic, being subsumed by a larger bank. The regional bank crises keep popping up. The inherent risks in the financial system are still there. But we can pretend that nothing is wrong — until the next disaster.</p>\n\n\n\n<p>While nothing might have changed on the surface, the reality is that it is sufficient time to change how you feel about a brand, a company or an entity. SVB, the brand is starting to go missing. The statements come from First Citizens. The logo and the (substandard) apps and web experience is from First Citizens. No matter how much the company might insist, it is SVB — <em><strong>it isn’t</strong></em>. It <em><strong>will never be</strong></em>. I don’t foresee many locals getting riled up over First Citizens should trouble come to it in the future. I know, I will be ready to leave at the first hint of trouble.</p>\n\n\n\n<p>PS: Talking about short-term memory, it has been nine years since my original blog <a href=\"https://om.co/2015/03/09/a-statement-about-gigaom/\">vanished into the great ether</a>. A good reminder, that nothing is permanent, not even the archives and back-ups on the Internet. </p>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/03/11/svb-collapses-founders-face-a-tough-road-ahead/\">A Tough Weekend</a></blockquote>\n</div></figure>\n\n\n\n<p><strong>March 11, 2024. San Francisco</strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"5c4d721e91be13d3eae74d9980c962b5387755a54635f3a570979289a96d6d72","category":"default"}