{"title":"Artificial Intelligence Policy Act – Enacted (UT)","link":"https://ghuneim.com/2024/02/29/artificial-intelligence-policy-act-enacted-ut/","date":1709212116000,"content":"<p>AI Utah Law as of May 1. 2024</p>\n<p>ARTIFICIAL INTELLIGENCE AMENDMENTS 2024 GENERAL SESSION STATE OF UTAH</p>\n<p>The law introduces the <a href=\"https://le.utah.gov/%7E2024/bills/static/SB0149.html\">Artificial Intelligence Policy Act,</a> defining terms related to AI and establishing legal liabilities for its misuse.</p>\n<p>It creates an Office of Artificial Intelligence Policy, a regulatory AI analysis program, and mandates AI disclosures in regulated occupations. The act also sets up an AI Learning Laboratory Program for technology assessment and policy evaluation, granting rulemaking authority over AI programs and regulatory exemptions.</p>\n<p>The bill emphasizes consumer protection in AI interactions and outlines penalties for violations, aiming to balance innovation with regulatory oversight, effective May 1, 2024.</p>\n<p>These include</p>\n<ul>\n<li>\n<p><strong>Disclosure:</strong> The bill requires businesses to disclose when consumers are interacting with AI. This is intended to help consumers understand who they are interacting with and what information is being collected about them.</p>\n</li>\n<li>\n<p><strong>Liability:</strong> The bill establishes liability for businesses that misuse AI. This could include cases where AI is used to discriminate against consumers, make false or misleading statements, or invade consumers’ privacy.</p>\n</li>\n<li>\n<p><strong>Regulatory office:</strong> The bill creates a new Office of Artificial Intelligence Policy. This office will be responsible for overseeing the implementation of the bill and developing new regulations for AI.</p>\n</li>\n</ul>\n<p>A provision exists that allows participants who use or plan to use artificial intelligence technology in Utah to apply for “regulatory mitigation.”</p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"5c9b483d3a6c005fea772576b4ca63ca4e18638b59dadf641b00a989f1702886","category":"default"}