{"title":"Decentralization, Privacy, and Everything Between","link":"https://blog.webb.page/2018-05-17-decentralization-privacy-and-more.txt","date":1526515200000,"content":"<p>This post is a combination of at least <em>three</em> different posts I intended to\nwrite and publish over the past year. They inevitably came to the similar\nconclusions and it makes sense. In my mind, decentralization and privacy are\nmutually beneficial. In the wake of exposure to privacy violations by Google,\nFacebook, &amp;c to the general public, it seemed like now would be a great time\nto share my thoughts.</p>\n<h2>Privacy</h2>\n<blockquote>\n<p>If you are not paying for it, you're not the customer; you're the product\nbeing sold. — Andrew Lewis (blue_beetle)<a href=\"https://www.metafilter.com/95152/Userdriven-discontent#3256046\">1</a></p>\n</blockquote>\n<p>This oft-referenced quote was posted on MetaFilter on August 26th, 2010. It's\nbeen nearly a decade since then and clearly, that quote is timeless. The\nincreasingly parasitic advertising industry is fed by a never-ending supply of\nuser-data gathered and sold by almost every ̶o̶n̶l̶i̶n̶e̶ o̶f̶f̶l̶i̶n̶e̶ service. Oh yeah,\nthat's right; you can be tracked o̶f̶f̶l̶i̶n̶e̶. The data gatherers are your usual\nsuspects: Facebook, Google, Twitter, as well as unknown data brokers of which\nnew ones are launching seemingly weekly. Have you looked at the blacklist of\nyour favorite ad blocker? It's a <em>mess</em>.</p>\n<p>The aforementioned data gatherers are in the business of keeping your\nattention. The visual redesigns, additional features, and so on are not\ncreated to make a better product for your perusal. Oh no, these changes are\nA/B tested and analyzed to ensure that you spend as much time using those\nproducts as possible. Why? So that app can send usage data and patterns back\nto the mothership to collect your info to update their algorithms and sell to\nadvertisers for a pretty penny and the cycle continues.</p>\n<p>Before this year, casual Internet users would roll their eyes at everything\nI've said thus far, <code>¯\\_(ツ)_/¯</code>, and say something inane like, \"It is what it\nis.\" or, \"I have nothing to hide.\"</p>\n<blockquote>\n<p>Arguing that you don't care about the right to privacy because you have\nnothing to hide is no different than saying you don't care about free speech\nbecause you have nothing to say. — Edward Snowden</p>\n</blockquote>\n<p>Frustrating as those eye rolls may be, you cannot force someone to care about\nsomething <em>you</em> think is important. I've been harping on about privacy to my\nfriends for years and some of them are starting to come around. The tech (and\nmainstream) media's continued coverage about the evils of (mostly) Facebook\nand Google has become a roar too loud to ignore.</p>\n<p>FINALLY.</p>\n<p>People have realized (or are starting to realize) that they can no longer\ndepend on the kindness of corporations offering free things on the Internet…\nwhen you think of it that way, it's kind of surprising that we would think\nthere wouldn't be strings attached. Huh. Anyhoo, getting away from Facebook is\n<em>relatively</em> easy. Ironically, if you have a lot of relatives on the platform,\nleaving is quite difficult.</p>\n<h2>Cancel Facebook</h2>\n<p>Your entrenchment level with Facebook varies with the next person and most\nlikely with me too. I'll share what I did leading up to and after my leave\nfrom Facebook in 2016.</p>\n<ol>\n<li>I requested a backup of my data.</li>\n<li>After downloading my data, I went to my profile page and spent a couple\ndays deleting posts. This was tedious as hell and I never actually\nfinished. I think I got through my first three years and then my recent two\nyears before calling it quits with that task.</li>\n<li>I also deleted integrations with other services and took the time to delete\naccounts with services I barely remembered using prior the integration\ndeletion.</li>\n<li>I told close friends, family, and my girlfriend (now wife) my plans and why\nI was doing so. I have several family members on Facebook but I also own a\nphone. I had zero interest with staying in contact with people I knew from\nhigh school, those were all passive \"friendships\" at that point.</li>\n</ol>\n<h2>Cancel Google</h2>\n<p>Hoo boy, this one's a <em>doozy</em>. Entire livelihoods, businesses, and lifestyles\nrely on Google in some shape or form…especially if your daily mobile driver\nis an Android device. I grew weary of Google long before my divorce from\nFacebook and I found an email replacement in Mail-in-a-Box<a href=\"https://mailinabox.email\">2</a>, a self-hosted\nemail solution that also has calendar and address book capabilities. For\nsearch, I use DuckDuckGo<a href=\"https://duckduckgo.com\">3</a>. I'm on iOS/macOS so Apple Maps is a suitable\nGoogle Maps replacement for me (btw, Apple Maps is <em>fantastic</em> in Japan).</p>\n<p>At this point in time, YouTube is nigh-impossible to replace. Nintendo\ndoesn't upload their videos to Vimeo. MKBHD or any other super profitable\nYouTube creator isn't leaving the platform anytime soon either so it's a total\ncrapshoot. I'm no longer logged-in to YouTube but I still get email\nnotifications when a channel I'm interested in uploads a video. For videos I\n<em>really</em> want to see again, I download them with youtube-dl<a href=\"https://rg3.github.io/youtube-dl\">4</a>, an awesome\ncommand line program that is capable of downloading videos from pretty much\nany video sharing site (not just YouTube). Here's my configuration file\n(located at <code>~/.config/youtube-dl/config</code>):</p>\n<pre><code>-f bestvideo+bestaudio\n-o ~/Movies/%(title)s.%(ext)s\n</code></pre>\n<p>It automatically downloads the best audio and best video sources for whatever\nvideo URL you supply and combines them to create a single file. That file then\ngets saved to my <code>~/Movies</code> folder. I alias the <code>youtube-dl</code> command in my\n<code>.zshrc</code> config so I can type <code>yt</code> followed by a URL for a super-quick\nworkflow.</p>\n<p>Unfortunately, Google Apps for Work exists and that means I have not fully\nescaped their ecosystem. When it comes to most businesses, familiarity and\ncost-savings often take precedence over ideals. Make no mistake, finding\n(worthy) alternatives to every single one of Google's offerings is expensive\nin either time spent searching or cost for a single app. Sometimes both!\nHowever, I think the upfront cost is worth the longtime gain. You will have to\nbe careful though. There is no shortage of startups with compelling products\nthat are merely skins on top of Google's existing services (last year I\ninterviewed for such a company that I thought was creating a compelling email\nclient only to learn that it was really Gmail underneath AND there would be no\nIMAP support…the conversation made our misalignment apparent).</p>\n<h2>Decentralization</h2>\n<p>As my concerns about online privacy grew, so did my interest in\ndecentralization. The core premise of decentralization is basically\nself-hosting any online service you may need, yourself. The open-source\ncommunity is <em>fantastic</em> for that. You may find some projects with plenty of\nissues in their git repos and design/code quality of varying degrees of\nexcellence but they are <em>all</em> great bases to get started from.</p>\n<p>One of my favorite aspects of decentralization is discovering a codebase\nsomeone shared eons prior and finding out that a particular function (or even\nthe entire codebase) fits in perfectly with whatever I'm working on. It\nsometimes feels like spelunking. You'll never know what you find but treasures\nawait! My other favorite aspect of it is knowing that <em>I</em> am in control of my\ndata. There's no ambiguity there. I don't have to trust a third-party, I can\ntrust myself. After all, I wrote the code (or adapted it after I read through\nit).</p>\n<p><em>A key aspect of decentralization that scares non-tech-savvy people is\nself-hosting.</em> Of course I can say that it's no big deal but that's because\nI've been doing this for years. Some tech-savvy people just don't want to deal\nwith server updates and the like. I totally get that because maintenance <em>can</em>\nbe a drag. You've really got to decide what you want for yourself. Personally,\nI think self-hosting is important and I advise everyone to try it at least\nonce. Even if it's just to get over that fear of purchasing (well, <em>leasing</em>)\na $5/month server from DigitalOcean<a href=\"https://www.digitalocean.com\">5</a> or Exoscale<a href=\"https://www.exoscale.com\">6</a> to hack on and test\nthings with.</p>\n<p>Here's a list of things I self-host:</p>\n<ul>\n<li>CMS: Noto<a href=\"https://git.inc.sh/IdeasNeverCease/Noto\">7</a> (super simple Markdown-based \"CMS\" I created that runs the blog\nyou're reading right now)</li>\n<li>Email: Mail-in-a-Box<a href=\"https://mailinabox.email\">8</a> (this is <em>super</em> simple to setup)</li>\n<li>Git: Gitea<a href=\"https://gitea.io\">9</a> (MUCH lighter than GitLab and more customizable too)</li>\n</ul>\n<p>If self-hosting is not your thing, you can sign up and/or join servers other\npeople have created. For example, Mastodon<a href=\"https://mastodon.social\">10</a> is a decentralized Twitter-like\nsocial network. You can fire up your own Mastodon instance or you can sign up\nfor one and start chatting with people. I'm taking the opposite approach with\nthe social network I'm developing but I intend to add decentralized features\nto it, like PubSub support.</p>\n<p>Speaking of which, I am working on a social network and an analytics service\nbecause 1) I was not able to find exactly what I was looking for, and 2) if\nyou want something done right you gotta do it yourself. I've already detailed\nmy reasons for starting a social network<a href=\"/2017-12-30-who-creates-social-networks.txt\">11</a> before but I never published\nanything about the analytics service.</p>\n<p>Plain and simple, I abhor trackers. However, I enjoy viewing stats that tell\nme how many people visit my site, the most popular link visited today, and so\non. I was using Gauges<a href=\"https://gaug.es\">12</a> prior to creating Chew<a href=\"https://chew.sh\">13</a> and one of my tech-savvy\nfriends expressed to me that while he knows who I am and can trust me, he\nwasn't going to go through the trouble of whitelisting my blog. I don't blame\nhim, the advertising industry is to blame. With more people utilizing ad\nblockers, how would anyone get accurate analytics? I realized that I could\nutilize the middleware function in Express<a href=\"https://expressjs.com\">14</a> to get my analytics. I may go\ndeeper into my thought-process and inspiration for Chew at a later date but\nfor now, you check it out<a href=\"https://chew.sh\">13</a> and use it in your own apps!</p>\n<h2>What now?</h2>\n<p>Getting your family, friends, and community onboard with what you've just\nlearned is an uphill battle. You can lead by example though, so <em>do not feel\ndiscouraged</em> if/when they don't care about the privacy implications of staying\nwith w̶e̶l̶l̶deceptively-designed services. We did not arrive at this clusterfuck\nof invasiveness and moral ambiguity overnight…it took some time and it will\nlikely take some time to free ourselves from it.</p>\n<p>Good luck. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5cc7657e9910bc25eb9ffce19f4a45775bcad5d3513534c2aebd510ec9196bbc","category":"Sites"}