{"title":"Our Investment in Anon","link":"https://www.usv.com/writing/2024/04/our-investment-in-anon/","date":1714408727000,"content":"<p>In the original designs for the World Wide Web, there was a clear line drawn between the services people interacted with (websites), and the software they used to access those websites (browsers).  An important distinction was that while the websites were under the control of the publishers, the browsers were under the control of the users themselves. In fact, as far back as the original specification for HTTP, the Hyper Text Transfer Protocol, the browser was referred to as the “user agent”. </p>\n\n\n\n<p>Over time, we’ve drifted away from that original vision. Today’s web and mobile app ecosystem is <a href=\"https://www.theverge.com/2023/1/19/23562947/twitter-third-party-client-tweetbot-twitterific-ban-rules\">increasingly</a> characterized by closed platforms that don’t allow third-party clients or user agents controlled by users.  This paradigm shift was driven both by the needs of advertising business models, and also by the need for apps to be secure and convenient on mobile devices.  But as we now look towards an AI-enabled future, this approach has clear limitations. To fully unlock the value of AI bots and agents that work on behalf of users, we will need a new approach.</p>\n\n\n\n<p>Today, we’re thrilled to announce our investment in <a href=\"http://anon.com\">Anon</a>, a startup working to restore user agency to the modern internet. Anon provides the “user agent” infrastructure to allow AI applications to programmatically access sites and services on behalf of users, even when those sites don’t provide open APIs.</p>\n\n\n\n<p>Anon’s platform handles the complex details of authentication, security, account management, and site integration across sites that lack APIs. Developers simply embed Anon’s SDK, which gives their AI app the ability to securely log in and execute actions within user accounts in a fully permissioned way.  One way to think about Anon is as a Plaid/Stripe/Twilio-like dev platform for digital identity – creating a modern developer interface to a critical legacy system.  Anon’s first product is an API for messaging, which allows developers to build applications that programmatically send and receive messages on behalf of users, across a variety of popular messaging platforms.  Developers can learn more about how to use Anon to build novel app experiences at the <a href=\"https://docs.anon.com/docs/general/overview\">Anon developer docs</a>.</p>\n\n\n\n<p>We believe this concept of a dedicated “identity layer” to enable AI user agents is critical infrastructure for the next era of the internet. Just as we couldn’t have a user-controlled web without web browsers in 1990, we can’t have an AI-augmented digital experience without robust user agent capabilities like Anon provides.  This is something that we’ve believed in at USV for a <a href=\"https://continuations.com/post/180985743645/world-after-capital-bots-for-all-of-us\">long time</a>.</p>\n\n\n\n<p>We’re incredibly excited to support <a href=\"https://twitter.com/dgmason\">Daniel</a>, <a href=\"https://www.linkedin.com/in/kai-aichholz-70839282/\">Kai</a> and the rest of the team at Anon – in partnership with our friends at Abstract Ventures, Impatient Ventures, and ex/ante – as they work to re-decentralize the internet and return control to users and their AI user agents.  And of course, Anon is <a href=\"https://jobs.ashbyhq.com/Anon\">hiring</a>.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/04/our-investment-in-anon/\">Our Investment in Anon</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"5cd05e81e31b32591aa35f8ebd373b9b3857eb9ceb0a7191e4d4c8e48403bfbf","category":"default"}