{"title":"Listening to Sand: The Sound Design of Dune","link":"https://kottke.org/24/05/listening-to-sand-the-sound-design-of-dune","date":1716905532000,"content":"\n        <p></p>\n\n<p>From the SoundWorks Collection, this is a 30-minute featurette on the sound design of Dune, in which the film’s sound teams talks about how they created the sounds of the Arrakis desert, the sandworm, ornithopters, spice, and the voice of the Bene Gesserit.</p>\n\n<blockquote><p>That’s something which - I learned a trick from Lee Scratch Perry, who I worked with in Switzerland about 10 years ago. He’s the pioneer of dub reggae, which must be the genre of music with the most bass. And one of the tricks that he used was to record a bass line and then to play it back through a huge speaker in a room that’s resonant…and record that. So it enhances the resonance of the bass. You also hear something of the shaking of the room. So that was one of the tricks that we used to give a sort of a very tactile sense to this spiritual adventure that Paul’s going on.</p></blockquote>\n\n<p>There are several other videos on this topic should you desire to rabbit-hole: <a href=\"https://www.youtube.com/watch?v=Gkf_rdROyWw\">The Sounds of Dune</a>, <a href=\"https://www.youtube.com/watch?v=-v2pbKWIV_g\">How The Sounds of Dune Were Made</a>, <a href=\"https://www.youtube.com/watch?v=-KHcbp8szrY\">Dune Sound Design Explained</a>, <a href=\"https://www.youtube.com/watch?v=eWV3Om6oHCM\">Director Denis Villeneuve and Sound Team on Dune</a>, and <a href=\"https://www.youtube.com/watch?v=76GrBO7sYec\">Dune: Part Two | Deeper into the Desert: The Sounds of the Dune</a>:</p>\n\n<p></p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Dune\">Dune</a> · <a href=\"https://kottke.org/tag/film%20school\">film school</a> · <a href=\"https://kottke.org/tag/movies\">movies</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/listening-to-sand-the-sound-design-of-dune\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"5cfef46e57453c35594915150e5232c81f5ddb91bb3335147034574b1e1f69b2","category":"default"}