{"title":"From the Labor Camp to the Pantheon of Literature: How Dostoyevsky Became a Writer","link":"https://www.themarginalian.org/2024/09/01/dostyevsky-general-letter/","date":1725206338000,"content":"<h3>“I have nothing, except for certain, and perhaps very minor, literary abilities.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Complete-Letters-1832-Fyodor-Dostoevsky/dp/0882338978/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"482\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?fit=320%2C482&amp;ssl=1\" alt=\"From the Labor Camp to the Pantheon of Literature: How Dostoyevsky Became a Writer\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?resize=240%2C362&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?resize=320%2C482&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?resize=768%2C1157&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/12/dostoevskyletters_meyer.jpg?resize=600%2C904&amp;ssl=1 600w\" /></a></p><p>Aristotle believed that everyone’s true calling lies at the crossing point of their natural talent and the world’s need. But this simple, seductive equivalence breaks down as soon as we account for the myriad factors that go into the cultivation of natural talent and the myriad doors of opportunity that may open or close between the gifted and the world. “I am, somehow, less interested in the weight and convolutions of Einstein’s brain than in the near certainty that people of equal talent have lived and died in cotton fields and sweatshops,” <a href=\"https://www.themarginalian.org/tag/stephen-jay-gould/\">Stephen Jay Gould</a> sniped at our crude conception of genius as pure natural endowment rather than a constellation of biological, psychosocial, and cultural conditions. </p>\n<p>Every once in a while, a particular life renders vivid the roulette of what-ifs that determine whether a person of genius will leave a mark on the world with their gift or perish unrealized in a cage of circumstance. </p>\n<p><strong>Fyodor Dostoyevsky</strong> (November 11, 1821–February 9, 1881) — who was still a teenager when his mother died of tuberculosis and who grew up to believe that “in a person’s life here are many, many sorrows, much woe, and many joys” — was twenty-seven when he was arrested and sentenced to death for belonging to a literary society deemed dangerous by the tsarist regime. His sentence was repealed at the last moment, prompting him to send his brother an <a href=\"https://www.themarginalian.org/2019/12/05/dostoyevsky-execution-life/\">ecstatic letter about the meaning of life</a>. But he was not set free — instead, he served four years in a hard labor camp in Siberia. </p>\n<figure><a href=\"https://www.amazon.com/Complete-Letters-1832-Fyodor-Dostoevsky/dp/0882338978/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/11/dostoyevsky1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Portrait of Fyodor Dostoyevsky by Vasily Perov, 1871</figcaption></figure>\n<p>When he was finally released, Dostoyevsky remained in Siberia, conscripted into compulsory military service as the lowest-ranking officer. He worked hard but anguished with the knowledge that this work was not his calling. At thirty-four, no longer able to bear the disconnect, he breached all permissible military conduct and broke rank to write directly to the head of his military unit, with whose brother he had once shared an apartment. </p>\n<p>Appealing not to the general’s authority but to his humanity, Dostoyevsky recounts his plight in Siberia:  </p>\n<blockquote><p>Four years of grievous, horrible time. I lived with thieves, with people lacking human feelings, with perverted principles; I did not see and could not see for all of these four years anything cheerful, besides the blackest, most hideous reality. I had not a single being at my side with whom I could exchange even a single sincere word; I experienced hunger, cold, illnesses, work that was beyond my strength and the hate of my thieving comrades… But… there was no suffering for me greater than when I realized… that I was cut off from society, an exile, and could not be useful to the extent of my energy, desire and capabilities.</p></blockquote>\n<p>Feeling deeply what artist Agnes Martin would observe a century and a half later — <a href=\"https://www.themarginalian.org/2013/03/22/agnes-martin-1997-interview/\">“Doing what you were born to do [is] the way to be happy.”</a> — Dostoyevsky adds:</p>\n<blockquote><p>Military service is not my field… My one dream is to be released from military service and enter the civil service… But I do not consider the service to be the main goal of my life… I have always considered the calling of the writer to be a most noble, useful calling. I am convinced that only on that path could I truly be useful, perhaps, I would attract at least some attention too, I would acquire a good name for myself again, and at least somewhat provide for my existence, because I have nothing, except for certain, and perhaps very minor, literary abilities.</p></blockquote>\n<figure><a href=\"https://society6.com/product/i-want-i-want-by-william-blake-1793_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=680%2C988&amp;ssl=1\" width=\"680\" height=\"988\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=320%2C465&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=600%2C872&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=240%2C349&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=768%2C1116&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Iwant_blake.jpg?resize=1057%2C1536&amp;ssl=1 1057w\" /></a><figcaption>Etching by William Blake, 1793. (Available as <a href=\"https://society6.com/product/i-want-i-want-by-william-blake-1793_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/i-want-i-want-by-william-blake-1793_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>An epoch later and a culture apart, Gabriel García Márquez would observe with an eye to <a href=\"https://www.themarginalian.org/2015/03/06/marquez-living-to-tell-the-tale/\">his own improbable literary path</a>: “If you’re going to be a writer you have to be one of the great ones… After all, there are better ways to starve to death.” At the heart of Dostoyevsky’s impassioned plea to his general is the recognition that his very soul would starve to death if he did not follow his path as a writer. </p>\n<p>And then, in a defiance of military rank both bold and touching in its intimacy, he adds:</p>\n<blockquote><p>I will not conceal from you that in addition to a sincere desire to exchange my lot for another, one more suitable to my energies, a certain circumstance, upon which, perhaps, depends that entire happiness of my life (a purely personal circumstance), has induced me to be so bold…</p></blockquote>\n<p>That circumstance was that Dostoyevsky <a href=\"https://www.themarginalian.org/2022/10/22/dostoyevsky-in-love/\">was in love</a> — and love, at its truest, wings the soul to live into its highest potential. </p>\n<p>He ends by acknowledging overtly just how daring his plea is, what a violation of code, what an act of hope:</p>\n<blockquote><p>I know that by writing this letter I have committed a new crime against the service. A simple soldier writing to an adjutant-general! But you are magnanimous and I entrust myself to your magnanimity.</p></blockquote>\n<p>His trust was not misplaced. The general was moved by his case and on Valentine’s Day 1854, Dostoyevsky was released to begin his life as a writer. And yet, had he not endured those difficult years, he may never have written the kind of literature he did, literature that has moved the world. No experience is ever wasted and all of our suffering is but raw material for art, for creation, for greater fulness of being. An AI could never write <em>Crime and Punishment</em> because an AI could never suffer a labor camp or a heartbreak. </p>\n<p>Couple with Dostoyevsky’s account of <a href=\"https://www.themarginalian.org/2014/11/11/dostoyevsky-dream/\">the day he discovered the meaning of life in a dream</a>, then revisit the story of <a href=\"https://www.themarginalian.org/2014/12/01/van-gogh-purpose-letter/\">how Van Gogh found his purpose</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"5d0c31ddc1fbdb3a2ad9f3a3886c13375e34170e1a439b2a69d14675a89b088d","category":"Sites"}