{"title":"Mediaeater Digest Vol.30, No. 185  (video editing tools)","link":"https://ghuneim.com/2024/07/03/mediaeater-digest-vol-30-no-185-video-editing-tools-update/","date":1720013336000,"content":"<p><strong>AI, Synthetic Data &amp; Media</strong></p>\n<p><a href=\"https://www.ft.com/content/ddddc4e7-fb0e-4f4c-bcc0-e5ffd54a9bd9\">Transcript: Robo DJ — YouTube invests in AI-generated music</a> (ft) “So YouTube is trying to make it bigger and make it a proper product. It’s about kind of enticing people to Shorts and making them want to stay there and watch videos there and make videos for Shorts. They have recently kind of come to these big music coming in and said, what if we just pay you, you know, a lump sum of money in exchange for bringing more of your artist into this and allowing more of their music to be used to train our AI. ”   (“lump sum”  -ed)</p>\n<p><a href=\"https://www.theverge.com/2024/7/1/24190026/meta-instagram-facebook-made-with-ai-info-label-metadata\"><span>Instagram’s ‘Made with AI’ label swapped out for ‘AI info’ after photographers’ complaints</span></a><span>  (verge) “Made with AI” label to “AI info”.  While YouTube has <a href=\"https://blog.youtube/news-and-events/disclosing-ai-generated-content/\">added reporting and context feedback</a></span></p>\n<p><a href=\"https://archive.is/20240702044226/https://www.bloomberg.com/opinion/articles/2024-07-02/ai-is-failing-on-facts-but-crushing-it-on-creative-work\"><span>AI’s Brain Fog Won’t Stop a Reckoning for the Arts </span></a><span> (bloomberg) It will take a few more years for banks and health-care firms to solve AI’s hallucination problem, but creative industries already face some harsh disruptions.  (Been saying this for two years -ed)</span></p>\n<p><a href=\"https://apnews.com/article/brazil-tech-meta-privacy-data-93e00b2e0e26f7cc98795dd052aea8e1\"><span>Brazil data regulator bans Meta from mining data to train AI models</span></a><span> (apnews) The decision stems from “the imminent risk of serious and irreparable or difficult-to-repair damage to the fundamental rights of the affected data subjects,” the agency said in the nation’s official gazette.</span></p>\n<p><a href=\"https://www.threads.net/@pvieito/post/C85NVV6hvF6\"><span>The OpenAI ChatGPT app on macOS is not sandboxed</span></a><span> (threads) and stores all the conversations in **plain-text** in a non-protected location:</span><span> </span></p>\n<p><a href=\"https://www.nytimes.com/interactive/2024/07/02/world/gps-threats.html\">Why GPS Is Under Attack</a>  (nyt) The American GPS network that was once the gold standard is at risk of becoming a relic as Chinese, Russian and European systems modernize.</p>\n<p><a href=\"https://www.computerworld.com/article/2511301/ai-washing-silicon-valleys-big-new-lie.html\">AI washing: Silicon Valley’s big new lie</a> (mikeelgen) The cumulative effect of AI washing is that it leads both the public and the technology industry astray. It fuels the delusion that AI can do things it cannot do. It makes people think AI is some kind of all-purpose solution to every problem — or a slippery slope into dystopia, depending on one’s worldview.</p>\n<p> </p>\n<p><strong>Provenance</strong></p>\n<p><a href=\"https://fairchain.art/\">The Fairchain platform will be closing, effective August 1.</a>  (fairchain)  All records and documentation stored on Fairchain will remain accessible for existing clients until this date, including certificates of title for artworks and sales contracts, the terms of which will continue to be upheld. Effective immediately, no new accounts will be able to be created on the platform.   (yada yada yada block chain artists yada- ed)</p>\n<p> </p>\n<p><strong>Video Editing Tools </strong></p>\n<p><a href=\"https://runwayml.com/blog/introducing-gen-3-alpha/\"><span>Runway   Gen-3 Alpha:</span></a><span>    text-to-video model</span></p>\n<p><a href=\"http://pikimov.com\"><span>pikimov.com</span></a><span> This non AI video editor is open, web based and never once asked me to login. I am in shock. This is the lesson for every startup out there – every time users hit a speed bump they hit next and forget your product for good. I shared, used and bookmarked this for its utility + their powerful demonstration and understanding of UI + UX</span></p>\n<p><a href=\"https://www.capcut.com/\"><span>CapCut </span></a><span>Free all-in-one video editor for everyone to create anything anywhere</span></p>\n<p> </p>\n<p><strong>Privacy</strong></p>\n<p><a href=\"https://blog.cloudflare.com/declaring-your-aindependence-block-ai-bots-scrapers-and-crawlers-with-a-single-click\">Cloudflare rolls out feature for blocking AI companies’ web scrapers</a> (cloudefare)</p>\n<p><a href=\"https://www.ft.com/content/8cde8937-9110-4263-bad3-0c57cfa326ad\">Forget privacy, young internet users want to be tracked</a> (ft) This is not because they are blind to the importance of online privacy. It is because they are realistic about the privacy that is available. They know that if you own a smartphone and don’t want to disable useful things like maps then your location is already being watched.</p>\n<p>OpenAI updates its ChatGPT macOS app to encrypt locally stored conversations, a<a href=\"https://www.threads.net/@pvieito/post/C85NVV6hvF6\">fter a user discovered that the app was storing chats in plain text </a>  (threads) OpenAI = untrusted -ed</p>\n<p>Ticketmaster at this point has a standing, un-dated <a href=\"https://help.ticketmaster.com/hc/en-us/articles/26110487861137-Ticketmaster-Data-Security-Incident\"> we have been owned</a> statement online = evergreen,</p>\n<p> </p>\n<p><strong>Lexicon </strong></p>\n<p><em>“self-inflated feedback loops”</em></p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"5d0f4c9a06e1e1a8bfd3bc55524060899a8c035d82245a9bf2feecf4858d0a7d","category":"default"}