{"title":"Open Models","link":"https://ghuneim.com/2024/03/20/open-models/","date":1710964790000,"content":"<p>Open-source AI is important because it….</p>\n<ol>\n<li>Fosters innovation and broad participation – Open-source AI allows developers and researchers globally to contribute, experiment and build on existing models without being blocked by proprietary barriers. This democratizes access and spurs wider innovation.</li>\n</ol>\n<ol>\n<li>Increases transparency and trust. –  With open codebases, models can be audited for potential biases, safety issues or unintended behavior by anyone. This scrutiny increases accountability and public trust.</li>\n</ol>\n<ol>\n<li>Prevents monopolization – AI development requires massive computing power. If only big tech giants have access to the largest models, it concentrates expertise and power. Open alternatives can level the playing field.</li>\n</ol>\n<ol>\n<li>Ethical development – Principles like privacy, fairness and social responsibility can be better embedded into open-source models that are collaboratively built versus corporate black boxes.</li>\n</ol>\n<ol>\n<li>Cumulative progress – Open models avoid duplicative efforts as others can directly build on prior work instead of starting from scratch behind closed doors.</li>\n</ol>\n<blockquote><p>\nFrom a dialog with  ChatGPT after getting blocker after blocker on publicly available info: I could not get it to provide alignment on the second part of the question after repeated prompting.</p>\n<p>You<br />\nyou are trained on works that have copyrights and you are preventing access to public domain works as part of your design is that a fact – yes or no.</p>\n<p>ChatGPT</p>\n<p>Yes, my design incorporates training on a wide range of materials, including copyrighted works, but I’m programmed to respect copyright laws and guidelines. My responses aim to balance providing useful information and guidance while adhering to these principle</p>\n<p> </p></blockquote>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"5d5769ad6e14073f8563a77ce99af0fdd97dd7c0e4788667fe043568e058bb41","category":"default"}