{"title":"Socii Dispatch 03","link":"https://blog.webb.page/2018-02-24-socii-dispatch-03.txt","date":1519430400000,"content":"<p>I have been cranking out features and improvements over the past month. As I\ngear up for a major feature release, I'd like to quickly run through what's in\nproduction now and what I've learned since my last dispatch.</p>\n<h2>Top 8</h2>\n<p>From the ashes of Myspace comes a feature I've missed dearly in every social\nnetwork since. Why is this important to me? Well, sometimes I forget my\nfriends' usernames. I never forget a face. With Socii you can change your\nusername whenever you want so for people you <em>really</em> want to keep in contact\nwith (outside of real-life phone numbers and such), adding them to your top 8\nis the way to go.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-03-a.jpg\">🎶 I'm bringing Myspace back, yeah!</a></p>\n<h2>Performance</h2>\n<p>Three notable changes fall under this section.</p>\n<p>First, I got rid of the WebP decoder<a href=\"https://hub.socii.network/NetOpWibby/status/jdnns5gm000zhxbk97iymsgc\">1</a> (and fixed an issue that arose on\naccount of me doing too much in one commit). It was a bit slow in development\nwhich should have made me realize it'd be MUCH too slow for production (even\nthe WebAssembly-based/-compiled decoder I found wasn't good enough).\nBlink-based browsers (Chrome, Opera, Vivaldi, &amp;c) were unaffected but Firefox\nand Safari suffered <em>greatly</em>. Personally, I use Firefox as my main browser so\nI felt this pain and <em>hated</em> it.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-03-b.jpg\">Bye bye WebP…for now</a></p>\n<p>Second, I implemented pagination. Prior to this, the hub (homepage of the\nactual network<a href=\"https://hub.socii.network\">2</a>, not the marketing site<a href=\"https://socii.network\">3</a>) was loading every. Single. Post.\nIt was a friggin' <em>mess</em> tbh. Now, I'd like to have done this in my GraphQL\nservice but I don't understand enough about it to implement cursor-based\npaging so the solution I came up with is kinda hacky. It works <em>for now</em> but\nI'm on the lookout for tutorials or code samples that implement <em>proper</em>\nGraphQL pagination with <code>graphql.js</code> (even the official \"how to<a href=\"https://www.howtographql.com\">4</a>)\" site is\ndevoid of this information).</p>\n<p>Finally, I created a custom script bundler to minify and combine front-end\nJavaScript so there would be far less render-blocking scripts to deal with.\nAll the bundling frameworks like Rollup, Webpack, &amp;c, do too much while also\nnot being flexible enough to do what I wanted to do.</p>\n<p>I'm still working on improving performance. No one wants to visit a sluggish\nsite, it's a waste of your time.</p>\n<h2>Timelines</h2>\n<p>You can now toggle between the global timeline and your top 8 timeline (well,\nif you've <em>added</em> anyone to that list).</p>\n<h2>Responsiveness</h2>\n<p>As a front-end designer, it hurt me to publish something that didn't work well\nat smaller browser widths/breakpoints. I was <em>finally</em> able to get a <em>lot</em> of\nthe stylistic things that were bothering me taken care of. Looking at these\nscreenshots though, I gotta rethink the post footer. It looks too fat, I think\nboth bits of info can fit on the same line.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-03-c.jpg\">Ooh, dat sweet responsive network</a></p>\n<h2>Things I've learned</h2>\n<ol>\n<li>Ship small features often. Not only do you get a sense of progression, but\nyou can find issues quickly should you accidentally push errors into\nproduction.</li>\n<li>Image uploading i̶n̶ ̶a̶ ̶p̶e̶r̶f̶o̶r̶m̶a̶n̶t̶[̶5̶]̶ ̶w̶a̶y̶ that performs well with WebSockets\nis harder than I thought. I <em>think</em> I have something figured out but I have\nsome non-Socii work to catch up on before I test my theory.</li>\n</ol>\n<p>That's all for now, see ya! 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5ef78fac4de3cb11d0e71c7d8f1f78bec76a29d28a74ad64d5e7aedc8adf389a","category":"Sites"}