{"title":"The World&#8217;s Loudest Sound","link":"https://kottke.org/24/09/the-worlds-loudest-sound-1","date":1726251510000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/krakatoa-sound-01.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/krakatoa-sound-01.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/krakatoa-sound-01.jpg 1200w\" loading=\"lazy\" width=\"1000\" height=\"564\" alt=\"Krakatoa Sound 01\" /></p>\n\n<p>The sound made by the Krakatoa volcanic eruption in 1883 was so loud it ruptured eardrums of people 40 miles away, travelled around the world four times, and <a href=\"http://nautil.us/blog/the-sound-so-loud-that-it-circled-the-earth-four-times\">was clearly heard 3,000 miles away</a>.</p>\n\n<blockquote><p>Think, for a moment, just how crazy this is. If you’re in Boston and someone tells you that they heard a sound coming from New York City, you’re probably going to give them a funny look. But Boston is a mere 200 miles from New York. What we’re talking about here is like being in Boston and clearly hearing a noise coming from Dublin, Ireland. Travelling at the speed of sound (766 miles or 1,233 kilometers per hour), it takes a noise about 4 hours to cover that distance. This is the most distant sound that has ever been heard in recorded history.</p></blockquote>\n\n<p>A much much smaller eruption occurred recently in Papua New Guinea. From the video, you can get a tiny sense of the sonic damage unleashed by Krakatoa:</p>\n\n<p></p>\n\n<p>Holy smoking Toledos indeed. <a href=\"https://www.reddit.com/r/space/comments/2h9y9g#ckr6mev\">On Reddit</a>, a user details how loud a Saturn V rocket is and what the effects would be at different distances. At very close range, the sound from the Saturn V measures an incredible 220 db, loud enough to melt concrete <em>just from the sound</em>.</p>\n\n<blockquote><p>At 500 meters, 155 db you would experience painful, violent shaking in your entire body, you would feel compressed, as though deep underwater. Your vision would blur, breathing would be very difficult, your eardrums are obviously a lost cause, even with advanced active noise cancelling protection you could experience permanent damage. This is the sort of sound level aircraft mechanics sometimes experience for short periods of time. Almost twice as “loud” as putting your ear up to the exhaust of a formula 1 car. The air temperature would drop significantly, perhaps 10-25 degrees F, becoming suddenly cold because of the air being so violently stretched and moved.</p></blockquote>\n\n<p>Even at three miles away, the sound is loud enough to cause permanent hearing damage. But that’s <em>nothing</em> compared to the Krakatoa sound. The Saturn V sound is ~170 db at 100 meters away while the Krakatoa explosion was that loud 100 miles away! What happens at 170 db?</p>\n\n<blockquote><p>…you would be unable to breathe or likely see at all from the sound pressure, glass would shatter, fog would be generated as the water in the air dropped out of suspension in the pressure waves, your house at this distance would have a roughly 50% chance of being torn apart from sound pressure alone. Military stun grenades reach this volume for a split second… if they are placed up to your face. Survival chance from sound alone, minimal, you would certainly experience permanent deafness but probably also organ damage.</p></blockquote>\n\n<p>The word “loud” is inadequate to describe how loud that is. (thx, david)</p>\n\n<p><strong>Update:</strong> <a href=\"http://fivethirtyeight.com/features/the-loudest-sound-in-the-world-would-kill-you-on-the-spot/\">Sperm whales are loud!</a> 200 decibels in water and 174 in air.</p>\n\n<blockquote><p>But the whale is not really as loud as the rocket, she told me. Because water is denser than air, sound in water is measured on a different decibel scale. In air, the sperm whale would still be extremely loud, but significantly less so - 174 decibels. That’s roughly equivalent to the decibel levels measured at the closest barometer, 100 miles away from the Krakatoa eruption, and is loud enough to rupture people’s ear drums. Suffice to say, you probably don’t want to spend a lot of time swimming with the sperm whales.</p></blockquote>\n\n         <p><em>[This is a vintage post originally from Oct 2014.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/audio\">audio</a> · <a href=\"https://kottke.org/tag/Krakatoa\">Krakatoa</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/volcanoes\">volcanoes</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"5f09d22bbf4c6c1c47be25da1ba5e8b3d40055479508b71b54f9ac81bc82650d","category":"Sites"}