{"title":"Books I plan to read this year","link":"https://blog.webb.page/2017-01-01-books-i-plan-to-read-this-year.txt","date":1483228800000,"content":"<p>My girlfriend and I are in competition to see who can read the most books this\nyear. Before going through my list, let's have a look at my bookshelf.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/books-i-plan-to-read-this-year-a.jpg\">My bookshelf has more than books on it</a></p>\n<p>As you can see, I have a <em>lot</em> going on. Eagle-eyed observers will see that\nsome books have red dot stickers on them. Those are there to symbolize which\nbooks I have not read yet, or <em>started</em> but haven't finished. In alphabetical\norder, they are:</p>\n<ul>\n<li>1̶9̶8̶4̶ ̶—̶ ̶G̶e̶o̶r̶g̶e̶ ̶O̶r̶w̶e̶l̶l̶ <a href=\"/2017-09-03-1984-review.txt\">1</a></li>\n<li>The 48 Laws of Power — Robert Greene</li>\n<li>A Culture of Innovation: Insider accounts of computing and life at BBN — David\nWalden and Raymond Nickerson</li>\n<li>The Art of Profitability — Adrian Slywotzky</li>\n<li>The Art of the Start — Guy Kawasaki</li>\n<li>Astronomy 101 — Carolyn Collins Petersen</li>\n<li>Brave New World — Aldous Huxley</li>\n<li>Bring the Outdoors In — Shane Powers and Gentl &amp; Hyers</li>\n<li>Business Model Generation — Alexander Osterwalder and Yves Pigneur</li>\n<li>The Cold Between — Elizabeth Bonesteel</li>\n<li>Connectography — Parag Khanna</li>\n<li>Cosmos — Carl Sagan</li>\n<li>C̶o̶u̶n̶t̶ ̶Z̶e̶r̶o̶ ̶—̶ ̶W̶i̶l̶l̶i̶a̶m̶ ̶G̶i̶b̶s̶o̶n̶ <a href=\"/2017-02-07-count-zero-review.txt\">2</a></li>\n<li>Designing News — Francesco Franchi</li>\n<li>Easy Origami — John Montroll</li>\n<li>The Fabric of the Cosmos — Brian Greene</li>\n<li>Getting Things Done — David Allen</li>\n<li>HOLO 2 — Various Artists/Writers</li>\n<li>Humans Of New York stories — Brandon Stanton</li>\n<li>Illuminations: Wisdom From This Planet's Greatest Minds — Illuminatiam</li>\n<li>Isaac Newton's Principia Mathematica Reissue — Kronecker Wallis</li>\n<li>The Mandibles: A Family, 2029-2047 — Lionel Shriver</li>\n<li>The Mission Chinese Food Cookbook — Danny Bowien and Chris Ying</li>\n<li>Mona Lisa Overdrive — William Gibson</li>\n<li>NASA Graphic Standards Manual reissue — Jesse Reed &amp; Hamish Smyth</li>\n<li>The Nature of Code — Daniel Shiffman</li>\n<li>NES/Famicom: a visual compendium — Sam Dyer</li>\n<li>NLP: The New Technology of Achievement — NLP Comprehensive and Steve Andreas</li>\n<li>Operating Systems: Design and Implementation — Andrew S Tanenbaum and Albert\nS Woodhull</li>\n<li>A People's History of the United States — Howard Zinn</li>\n<li>Physics of the Future — Michio Kaku</li>\n<li>Rayla 2212 — Ytasha L Womack</li>\n<li>The Remnants of Trust — Elizabeth Bonesteel</li>\n<li>The Secret Recipes — Dominique Ansel</li>\n<li>Selling the Invisible — Harry Beckwith</li>\n<li>Snowcrash — Neal Stephenson</li>\n<li>Space Chronicles — Neil deGrasse Tyson</li>\n<li>Universal Principles of Design — William Lidwell and Kritina Holden</li>\n</ul>\n<p>That's 38 books in total. Of those, two of them aren't actually in my\npossession <em>yet</em>. \"Isaac Newton's Principia Mathematica Reissue\" and\n\"NES/Famicom: a visual compendium\" are both Kickstarter-backed books that\nshould be delivered sometime this year.</p>\n<p>To hold myself accountable <em>and</em> make sure I retain the information I read,\nI'm going to do book reports on this blog which will basically be reviews. My\ngirlfriend is going to do the same thing on her\nblog<a href=\"http://sincerelyshantelle.com\">3</a>, so be sure to check that out.</p>\n<p>I am most excited to read \"Count Zero\" and \"Mona Lisa Overdrive\" because I\nabsolutely <em>love</em> \"Neuromancer\" (all three of these books were written by\nWilliam Gibson). I've read it a few times already. Funny story, while still in\nhigh school I visited a Borders bookstore (RIP) to buy Neuromancer. The store\nclerk thought I said \"New Romancer\" and wasted 10 minutes trying to find the\nincorrect book. In hindsight, I'm surprised that wasn't a real book in the\nstore.</p>\n<p>Anyhoo, the book I am reading right now is \"A Culture of Innovation: Insider\naccounts of computing and life at BBN\". I am <em>fascinated</em> about the\nbeginnings of the Internet. To think that it didn't always exist and now it's\nin the very fabric of our lives thanks in part to the people at\n\"Bolt Beranek and Newman\" is so cool to me. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5f1cd3bee0cc5b0b642a91611dbb57729c05a9eea2a71a368b25e1b2d1e1bf04","category":"Sites"}