{"title":"The great silent majority of American basicness","link":"https://www.garbageday.email/p/the-great-silent-majority-of-american","date":1704747642000,"content":"<div><div><h2>The Stanley Cup Madness</h2><p>I first noticed the prevalence of the Stanley Quencher H2.0 FlowState™ tumbler last April <a href=\"https://www.garbageday.email/i/114319196/alright-whats-going-on-with-the-water-tiktok-thing?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">when I wrote about</a> #WaterTok. I’m still unclear what to make of #WaterTok, but I eventually settled on the idea that it’s several subcultures overlapping — weight-loss communities, Mormons, and those people who don’t like the “taste” of water. But in the majority of the #WaterTok videos I watched, people were using Stanley’s Quencher to carry around their liquid Jolly Ranchers. And the ubiquity of the cup has sort of haunted me ever since. </p><p>I grew up in the suburbs, but I don’t live there anymore. So every time the great silent majority of American basicness summons a new totem to gather around, I can’t help but try and make sense of it. Was this a car thing? A college football tailgate thing? An EDM thing? Cruise ships? <i>Barstool Sports</i> was of no help here, so I filed it away until this Christmas when it exploded across the web and forced me to finally figure out what the heck was going on. And it turns out, the Stanley cup’s transformation into a must-have last year is actually, in many ways, the story of everything now.</p><p>CNBC put together a <a href=\"https://www.youtube.com/watch?v=RADEfBJmtk4&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">great explainer</a> on this. Stanley, a manly hundred-year-old brand primarily aimed at hikers and blue-collar workers, was rediscovered in 2019 by the bloggers behind a women’s lifestyle and shopping site called The Buy Guide. They told CNBC that even though the Quencher model of the cup was hard to find, no other cup on the market had what they were looking for. Which is a bizarrely passionate stance to take on a water bottle, but <a href=\"https://thebuyguide.com/home/the-story-of-the-cup/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">from their post</a> about the cup, those attributes were: “Large enough to keep up with our busy days, a handle to carry it wherever we go, dishwasher safe, fits into our car cupholders, keeps ice cold for 12+ hours, and a straw.”</p><p>The Buy Guide team then sent a Quencher to Emily Maynard Johnson from <i>The Bachelor </i>after she had a baby because “there is no thirst like nursing mom thirst!” Johnson posted about it on Instagram and it started to gain some traction. The Buy Guide then connected with an employee at Stanley, bought 5,000 Quenchers from the company directly, set up a Shopify site, and sold them to their readers. According to The Buy Guide, they sold out in five days. All of these things are very normal things to do when you discover a cool bottle.</p><p>After mom internet started buzzing about the tumbler — a corner of the web that is to dropshipping what dads are to Amazon original streaming shows — Stanley hired Terence Reilly, the marketer credited for reinventing Crocs. Reading between the lines of what Reilly has said about his work at Stanley, it seems like his main strategy for both Crocs and the Quencher was <a href=\"https://abc7.com/stanley-cup-fire-tumblers-viral-tiktok-videos/14082972/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">capitalizing</a> on internet buzz and growing it into otaku product worship. Or as <i>Inc.</i> phrased it in <a href=\"https://www.inc.com/ali-donaldson/this-marketing-pro-got-crocs-on-every-celebrity-from-bad-bunny-to-justin-bieber-now-hes-the-one-behind-the-stanley-tumbler-you-cant-escape.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">their feature</a> on him, he uses a “scarcity model” to whip up interest. Cut to three years later, now we’re seeing <a href=\"https://twitter.com/USATODAY/status/1742636720191856906?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">mini-riots</a> over limited edition Stanleys at Target. </p><p>My reference point for this kind of marketing is the Myspace era of music and fashion, when record companies and stores like Hot Topic and Spencer’s Gifts were using early social media to identify niche fandoms and convert them into mainstream hits. In this allegory, Target has become the Hot Topic of white women with disposable income. And their fingerless gloves and zipper pants are fun water bottles and that one perfume everyone in Manhattan is wearing right now.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/50949575-a31a-4940-82f5-993f478b9cee/7634c7ce-8fd5-4bd4-97d7-2096b6451bf4_1214x723.png?t=1705691548\" /></div><p>I’m always a little wary about giving someone like Reilly credit for single-handedly jumpstarting a craze like this — and I am extremely aware that he is a male executive getting credit for something that was, and still is, actually driven by women content creators — but this is the second time he’s pulled this off. Which, to me, says he’s at least semi-aware of how to pick the right fandoms. He may not be actively involved in the horse race, but he clearly has an eye for betting on them. And, yes, the Stanley craze is very real.</p><p>It’s turned into a reported $750 million in revenue for Stanley and both Google Trends and TikTok’s Creative Center show massive growth in interest around the bottle between 2019 and now. With a lot of that growth happening this year. On TikTok, the hashtag #Stanley has been viewed a billion times since 2020 and more than half of that traffic happened in the last 120 days. </p><p>And with all viral phenomenon involving things women do, there are, of course, a lot of men on sites like Reddit and X adding to the discourse about the Quenchers with posts that essentially say, “why women like cups?” And if you’re curious how that content ecosystem operates, you can check out <a href=\"https://www.youtube.com/watch?v=dh5G2-8O0Vw&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">my video about it here</a>. But I’m, personally, more interested in what the Stanley fandom says about how short-form video is evolving.</p><p>Over the last three years, most major video sites have attempted to beat TikTok at its own game. All this has done, however, is give more places for TikToks to get posted. And so, the primarily engine of TikTok engagement — participation, rather than sharing — has spread to places like Instagram, YouTube, and X. If the 2010s were all about sharing content, it seems undeniable that the 2020s are all about making content in tandem with others. An internet-wide flashmob of Ice Bucket Challenge videos that are all, increasingly, focused on selling products. Which isn’t an accident.</p><p>TikTok has spent years trying to bring <a href=\"https://www.voguebusiness.com/consumers/short-form-video-platforms-are-luxurys-new-playground-in-china?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">Chinese-style social e-commerce</a> to the US. In September, the app <a href=\"https://apnews.com/article/tiktok-online-shopping-65470c109c80408f05875d8678fe5072?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">finally launched</a> a tool to sell products directly. If you’re curious what all this looks like when you put it together, here’s one of the most unhinged Stanley cup videos I’ve seen so far. And, yes, before you ask, there are affiliates links on <a href=\"https://www.amazon.com/shop/heysweetkay?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">the user’s Amazon page</a> for all of these.</p><div></div><p><i>[Ed. note: A previous version of this essay did not take into account the existence of hockey, which may have influenced some Google Trends data I referenced lol. It has been updated accordingly.]</i></p><hr /><h2>Think About Subscribing To Garbage Day!</h2><p>It’s $5 a month or $45 a year and you get exclusive content and Discord access. If you pay $150 a year, you get all of that, plus monthly insights reports. If you upgrade to the $150 tier, you only pay the difference. Hit the green button below to find out more.</p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\"><span> Subscribe now </span></a></div><hr /><h2>How The Monoculture Gets Made</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/aef8de32-8130-46ab-b6c0-9cbb2e5c7574/76010101-d3de-41d6-ad04-324a485460b0_1218x1116.png?t=1705691549\" /></div><p>I saw this X post from writer Dean Kissick going around X over the holidays and I had initially intended to cover it here (pretty sure I didn’t, I checked lol). Kissick’s screenshots are from media brand-run Spotify playlists, which all feature the same handful of songs from artists like Lana Del Rey, Ice Spice, and Olivia Rodrigo. Kissick, incorrectly, said this was an example of a “cloying, suffocating monoculture,” when they, actually, reveal the opposite.</p><p>Writer Emilie Friedlander had a good response to this, <a href=\"https://twitter.com/adhocemilie/status/1739714321209262358?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">writing</a>, “If you've ever sat in a room where these lists are made you know they're less a rendering of what people on staff actually think than a very carefully constructed branding/traffic exercise based on projecting an ideal reader's taste... problem is, every publication's going after the same people.”</p><p>It’s been a few years since I was last part of one of these “branding/traffic exercises,” but this was what I saw, as well. The logic from most culture editors I’ve seen goes like this: You can’t pick truly huge hits because everyone knows them, you can’t pick truly underground stuff because no one knows them, and you can’t pick what actual human beings are listening to because it’s tacky and undermines your own expertise as a cultural arbiter. For instance, one of biggest stories in music right now, at least based on number of listeners impacted, is probably Slipknot’s implosion. Have you read anything about it?</p><p>The reason all of this is notable now is because this coastal elite poptism, perfected by outlets like <i>Pitchfork</i> and <i>VICE</i> in the 2010s, looks really silly now! And even less reflective of pop culture than it used to. Especially in the context of a Spotify playlist! It’s like going to Whole Foods and trying to find hidden gems.</p><hr /><h2>New Level Of X Rot Achieved</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/bb5b29ba-9376-4626-82b2-a3bb59740e12/9f09edb7-a81e-43cb-904a-239688e4dc40_1220x1622.png?t=1705691551\" /></div><p>An X account called Historic Vids screwed up over the weekend and accidentally posted a video without any sound. This wouldn’t be that big of a problem except the whole “joke” of the video was the audio. In the actual video, it’s a Kazakhstani news anchor doing a tongue twister.</p><p>So you’d expect that Historic Vids’ video would have flopped without the audio. Except it didn’t. It has 30 million “views” and almost two thousand retweets. And the hundreds of replies beneath the video are all from other verified novelty accounts promoting their own content.</p><p>This has led to a bunch of people sharing the <a href=\"https://twitter.com/knowyourmeme/status/1744372543048257764?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">“dead internet” theory</a>, which argues that majority of the web is actually just bots talking to each other. I don’t think that’s true for the whole web, but I am beginning to think that it is probably true for X.</p><hr /><h2>Yesterday Was Mega Man Day</h2><div></div><p>This is one of those memes I tried to cover here over and over, but it’s just never made the final draft. If you have never seen this video before, it’s a promo for a song called “Mega Man” by the rapper Jay Eazy. It’s slowly taken on a life of its own with a ton of remixes and memes. Obviously, my favorite is the <a href=\"https://twitter.com/nauseousgirl/status/1742726812977815588?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">emo version</a>.</p><p>Yesterday was January 7th, the one-year anniversary of “Mega Man” dropping and Jay Eazy performed the song (along with some help from a <i>Kingdom Hearts</i> cosplayer) at the Luminosity Makes BIG Moves <i>Super Smash Bros. Ultimate</i> tournament in Manhattan. The videos <a href=\"https://twitter.com/search?q=jay+eazy+lmbm&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">are really wonderful</a>.</p><hr /><h2>The <i>TENET</i> Powerpoint</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/1256d905-b57b-4c54-b880-2f19bc7cde15/e2e18a52-da1d-4556-98ef-695cf31df563_1214x768.png?t=1705691553\" /></div><p>I don’t know how to explain it, but I was very surprised that the guy who <a href=\"https://twitter.com/jasonjoyride/status/1744043873025036424?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">read out his </a><i><a href=\"https://twitter.com/jasonjoyride/status/1744043873025036424?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">TENET</a></i><a href=\"https://twitter.com/jasonjoyride/status/1744043873025036424?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\"> Powerpoint</a> on a date and filmed it was from San Fransisco. The whole thing feels extremely 2014-London-coded. Anyways, the video is sort of cringe and the Powerpoint is fine. In case you’ve missed why we’re talking about <i>TENET</i> right now, it’s because a director Christopher Nolan’s Peloton instructor <a href=\"https://variety.com/2024/film/news/christopher-nolan-peloton-apology-tenet-1235864434/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">roasted</a> him over it.</p><p>I love <i>TENET</i> and it’s one of the only movies I have ever watched where I immediately sat back down and just watched it again. But I also don’t think it’s that complicated of a movie once you wrap your head around the inversion stuff. Though, I’m from the Reddit-guides-to-<i>Primer</i> microgeneration. So maybe I’m just more used to timey-whimey stuff. Make a Powerpoint about Netflix’s <i>Dark</i> and read THAT on a first date. </p><hr /><h2>Here Are The Three Most Important Texts From The Insurrection</h2><p>The two-year anniversary of the Insurrection was over the weekend. In an effort to preserve important commentary from the day, here are the three most important posts about January 6th, according to me.</p><p>First, here’s the <a href=\"https://twitter.com/dinosmash_69/status/1743709044827725963?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">“Mr. Blue Sky” video</a>. Second, here’s the Azealia Banks “meth behavior” <a href=\"https://twitter.com/rottenindenmark/status/1743728469287297339?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">screenshot</a>. And, finally, here’s a 4chan post that is, arguably, the best political writing of the 21st century.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/22515713-0ffe-40a7-9155-3222e1068f16/3394fc1e-2d89-468e-a63a-edc96c3bff53_828x1069.jpeg?t=1705691553\" /></div><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.vox.com/future-perfect/2024/1/3/24022864/elections-democracy-2024-united-states-india-pakistan-indonesia-european-parliament-far-right-voting?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">“2024 is the biggest global election year in history”</a></p></li><li><p><a href=\"https://www.newyorker.com/tech/annals-of-technology/what-we-lost-when-twitter-became-x?utm_source=pocket_reader\" target=\"_blank\">“What We Lost When Twitter Became X”</a> (I make a little cameo in this)</p></li></ul><hr /><p>P.S. here’s a <a href=\"https://www.tumblr.com/rongzhi/736165471966117888/english-added-by-me?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-great-silent-majority-of-american-basicness\" target=\"_blank\">good Douyin video</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=9a74c8a0-6573-453e-8e38-833f11bd268c&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"5f27a290e956e8454e50a2677c96bf7103a0472a23bd0fd625bd79c32ed7b53e","category":"default"}