{"title":"Year in Review","link":"https://blog.webb.page/2019-12-29-year-in-review.txt","date":1577577600000,"content":"<p>In my last \"Year in Review\" post I stated that Socii would have photo\nfunctionality. It does…it just isn't reliable, haha. I haven't cracked that\nbit quite yet and I've also been spending time on getting other projects up to\nspeed. Anyhoo, let's dig into what has happened this year!</p>\n<h2>Visited Disney World</h2>\n<p>My wife and I never had the opportunity to visit when we were kids so we\ndecided to treat our own kids to a family trip there. My son threw my phone\ninto a shallow pool and I heard it hit the bottom…that's when I knew enough\nwater had gotten in. Sure enough, my phone was out of commission for almost\nthe entire trip. Luckily there are Apple Stores everywhere so I got a\nreplacement during some downtime.</p>\n<p>The lockscreen background<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-g.jpg\">1</a> on my phone is <em>still</em> an amazing shot I got\nof the EPCOT ball at night.</p>\n<p>In addition, the entire family got sunburnt. I had it the <em>worst</em> since I\nwasn't wearing a shirt at the beach. It was an interesting experience, one\nthat I'd rather not repeat. Melanin-enriched or not, sunscreen is good\nfor you.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-a.jpg\">Yummy Disney snacks</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-b.jpg\">The EPCOT ball in daytime</a></p>\n<h2>Went bald 😱</h2>\n<p>I grow facial hair quite easily but on <em>top</em> of my head? Umm, let's just say\nit doesn't fill out like it used to. I blame the stresses of my 20s. And\npossibly wearing hats a lot. Anyhoo, I was always scared to do so because I\nwasn't sure how my head would look. Turned out great!</p>\n<p>Also, my son had his first (barbershop) haircut! He took it a lot better than\nwe expected.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-c.jpg\">My boy was a trooper!</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-d.jpg\">He kept rubbing his head, not used to the buzz</a></p>\n<h2>Attended Comic-Con</h2>\n<p>I've been to PAX East a couple times so I was excited to finally check out\nComic-Con and…it's not my thing. I like comic books but not as much as I like\nvideo games. Still, it was a good experience. Also, since my trip to Japan in\n2017 I have been <em>craving</em> a wonderful drink called Mitsuya Cider<a href=\"https://www.asahiinryo.co.jp/mitsuya-cider/sp/cm\">2</a>. One of\nmy best buddies and I trekked to at least <em>three</em> different Japanese shops in\nNew York City before stopping for ramen. While in the restaurant I asked the\nowner if he knew where we could find some and he gave us directions to a\nstrange market with an elevator. Sure enough, the drink was there!</p>\n<p>I don't do checked baggage when I'm on short trips so I had to guzzle all\nthree bottles I purchased in the remaining amount of time I had in the city.</p>\n<h2>Warmed up to an abandoned kitten</h2>\n<p>My daughter came home from her bus stop one day cradling a kitten we later\nlearned was roughly a week or two old. It was also wet and cold outside so she\nand a classmate each took a kitten home. My wife did most of the work of\nnursing \"Chi Chi\" back to health and then put her up for adoption after a few\nweeks. Sadly, we just don't have the space for a pet at the moment and our\ndaughter wasn't pulling her weight in taking care of the kitten she brought\nhome. Fortunately, Chi Chi grew into a gorgeous lil' cat and was promptly\nadopted. Turns out, she was quite popular amongst families visiting the animal\nshelter so I'm glad she'll have the space and care she needs to explore\nand grow.</p>\n<p>When we move into a bigger place I definitely want to get a similar-looking\ncat. After I get my Dalmatian.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-e.jpg\">Yung Chi Chi</a></p>\n<h2>Made it \"big\" on Hacker News</h2>\n<p>I love checking out Hacker News (HN)<a href=\"https://news.ycombinator.com\">3</a> as I find all sorts of neat projects\nand learn of interesting articles through it. I've been checking out\nLobsters<a href=\"https://lobste.rs\">4</a> lately too (and got an invite as I drafted what you're reading).</p>\n<p>I shared my recent post<a href=\"/2019-12-02-a-personal-api.txt\">5</a> about a \"personal API\" there and to my pleasant\nsurprise it was well-received<a href=\"https://news.ycombinator.com/item?id=21684949\">6</a> (with 156 points)! The post inspired some\npeople to check out my other online webpages and projects and even encouraged\nsome signups for Socii, to my horror (it's not ready for prime-time). I've\nalso received requests for collaboration so that should be interesting.</p>\n<p>The other feedback I got from HN was <em>intense</em> negativity about the horizontal\nscrolling so I quickly created a toggle to disable it. Apparently, Windows\nusers have a horrible experience with it. Coming from a macOS background and\nwith huge trackpads, horizontal scrolling is actually quite pleasant for me so\nI never did further testing when I initially implemented it. 😬</p>\n<p>As I proofread the post you're reading, reception<a href=\"https://lobste.rs/s/mgpx3w/personal_api\">7</a> on Lobsters is quite good\ntoo. I spend more time coding than I do writing but when I <em>do</em> write I get\nmore ideas and knowledge due to feedback. Note to future Paul: keep doing this\nwriting thing!</p>\n<h2>Started learning TypeScript</h2>\n<p>TypeScript<a href=\"https://www.typescriptlang.org\">8</a> is a layer on top of JavaScript that basically helps prevent you\nfrom making mistakes in your code, which helps create more robust\napplications. Initially I decided to learn Flow so I could incrementally add\nstatic types to a small API project but after an interview I decided to jump\nright into TypeScript. Man, I wish I did so earlier instead of mucking around\nin Flow. I'm still no expert but I'm having fun with it and I found egregious\ncode patterns in existing projects thanks to TypeScript.</p>\n<h2>Released a couple projects</h2>\n<ul>\n<li><code>chronver.org</code><a href=\"https://chronver.org\">9</a>: A date-based versioning specification that makes more\nsense to me these days than SemVer.</li>\n<li><code>lefty.world</code><a href=\"https://lefty.world\">10</a>: A fun site for left-handed people. I intend to do more\nwith this in 2020.</li>\n<li><code>webb.page</code><a href=\"https://webb.page\">11</a>: My new homepage and probably the best domain I own.</li>\n</ul>\n<h2>FIN</h2>\n<p>As is customary, here are some of my favorite pics I snapped this year. 🕸</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/year-in-review-f.jpg\">Some of my favorite photos from this year</a></p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"5f35d87566aaf32dc44d9ea920d97e3753437501309d93b873f7e76ce76de678","category":"Sites"}