{"title":"Right-wing social networks don't work","link":"https://www.garbageday.email/p/right-wing-social-networks-don-t-work","date":1731959471000,"content":"<div><div><h2>The Culture War Finally Comes To Bluesky</h2><p>I had some readers balk at <a href=\"https://www.garbageday.email/p/bluesky-s-the-new-twitter-probably?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">my declaration</a> last week that Bluesky was probably going to be Twitter’s true cultural successor, rather than Threads. Which, you know, fine. I’m not even sure I agree with it lol. But if I had to define each platform right now, I’d say that Bluesky, though still small, has clearly grabbed a lot of post-election political clout in the US. While Threads seems to be some kind of algorithmic holding pen for anyone who has ever eaten a Sweetgreen salad in Salesforce Park.</p><p>And you can see the proof of Bluesky’s ascendant political value in how quick right-wing users on X have been to ridicule it. There is already a Libs Of TikTok-style X account called <a href=\"https://x.com/Libsofbluesky?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">LibsOfBluesky</a>. And Bluesky is also beginning to attract Twitter’s political grifter class, who thrive off engagement-hacking genuine discourse. This could be happening on Threads, as well, but Meta seems dead set on Threads users never being able to see what’s happening on the platform for some reason. Meanwhile, a Bluesky user named <a href=\"https://bsky.app/profile/numb.comfortab.ly?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">@numb.comfortab.ly</a> created a custom feed called “<a href=\"https://bsky.app/profile/did:plc:pmyqirafcp3jqdhrl7crpq7t/lists/3lam62tvlqz2l?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Blue Anon</a>,” which includes accounts they describe as “Resistor grifters and conspiracy theorists.” Some of the more prominent names on the feed are Keith Olbermann, Brianna Wu, and Louise Mensch. </p><p>All that said, though, I will tell you, based on Garbage Day’s internal metrics, Bluesky right now is traffic poison. No one wants to read about it and if we put “Bluesky” in our subject lines, the issue will underperform significantly. (Which is why we didn’t put it in the subject line today. Haha got you!)</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4bf43cbe-68e9-47e6-acfa-e2bcb94c15a8/Screenshot_2024-11-18_at_12.37.28_PM.png?t=1731951466\" /><div><span><p>(Leftists are being crazy online, you say? A shocking development.)</p></span></div></div><p>I assume proper right-wing users will start showing up on Bluesky soon because X is going to get very boring for them, very quickly. One of the ideas <a href=\"https://www.garbageday.email/p/a-republican-social-network-filled?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">I’ve repeated</a> the most often in Garbage Day over the years is my firm belief that conservative-only social networks don’t work in the long term. The online right, post-2014, is completely powered by cyberbullying and cruelty and without an easily accessible Other to torment, they either devolve into irrelevant spam or start fighting with each other. This is why Gab, Parler, and even Truth Social have never materialized into anything other than unofficial directories for the FBI of would-be domestic terrorists.</p><p>Host of the <i>Western Kabuki</i> podcast Juniper <a href=\"https://bsky.app/profile/junlper.bsky.social/post/3lazppgcejk2e?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">wrote last week</a>, “It’s pretty funny watching the right, who thrive online off of hate and ‘triggering the libs,’ migrate here because people are abandoning twitter. The online right can’t exist without people to antagonize.”</p><p>I’ve also definitely started to notice the discourse on X starting to lose its focus. Last week, X users randomly started complaining about New Zealand’s parliament Haka. My assumption is that they will continue to surface bizarre, racist discourses that go nowhere as the site fully transforms into a right-wing echo chamber. It doesn’t make the site less dangerous, but it will impact its ability to work with real advertisers. There’s a reason why the only ads on 4chan are for hentai sites and crypto startups!</p><p>But I think I’ve seen enough to settle on a prediction for 2025. Threads will continue to “grow” and gain “users” but it will never create any kind of real meme or news story — the fact it hasn’t yet is, in my opinion, damning — and will eventually be cannibalized by Instagram and re-integrated somehow back into the app. While Bluesky will have its first big internet-wide viral moment and become the new tiny social network that guides the rest. And, finally, as Elon Musk starts to understand that the people who made Twitter important politically and socially enough to buy have left it, he’ll try to use his proximity to President-elect Donald Trump to put pressure on competitors like Bluesky. </p><p>Excited to come back in a year and see how I did.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/d2c0129b-fa3e-4d45-a637-496a5188b140/600x300.png?t=1731957927\" /></div><p><b>Make your details harder to find online</b></p><p>The most likely source of your personal data being littered across the web? Data brokers. They're using and selling your information — home address, Social Security Number, phone number and more. And Incogni helps scrub this personal info from the web and gives you peace of mind to keep data brokers at bay. </p><p>Protect yourself before the spam madness gets even worse! Try <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Incogni</a>. It takes three quick minutes to set up and you’ll be able to get your data off 180+ data brokers' and people-search sites automatically. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Incogni</a> offers a full 30-day money-back guarantee if you're not happy ... But you will be.  </p><p><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\"><b>Black Friday Special:</b></a><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\"> Unlock 58% off annual plans with code </a><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\"><b>DAYDEAL</b></a><a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\"> at checkout.</a></p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2>A Powerful Video</h2><blockquote><a href=\"https://www.instagram.com/reel/DCV1OkQSnlw/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\"><p> Instagram post by @onusichan </p></a></blockquote><p>This was dropped in the Garbage Day Discord by odoyleghouls.</p><hr /><h2>This Study Seems To Show That X Is Boosting Right-Wing Accounts</h2><p>The Queensland University of Technology released a new study this month titled “A computational analysis of potential algorithmic bias on platform X during the 2024 US election,” which analyzed around 55,000 posts on X during the lead up to the election. You can read the <a href=\"https://eprints.qut.edu.au/253211/1/A_computational_analysis_of_potential_algorithmic_bias_on_platform_X_during_the_2024_US_election-4.pdf?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">whole thing here</a>, and here’s a link to a <a href=\"https://bsky.app/profile/chriso-wiki.bsky.social/post/3lb2payb2c624?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Bluesky thread</a> that collects a few of the takeaways.</p><p>The study was organized into two phases, with the first being focused on Musk’s account, specifically, and the second comparing engagement on Republican and Democrat accounts. </p><p>“Overall, the results imply that while some aspects of engagement on the platform appear to have been enhanced broadly, specific visibility advantages may have been selectively applied,” the study concludes.</p><p>Now, this is not exactly surprising, but it does lead to some deeper questions that the study doesn’t seem to account for. It’s possible that X’s algorithm has some kind of political slant, but it feels more likely that X’s For You tab is just incentivizing lowest common denominator content meant to enrage users. And it’s also likely that there are more conservatives using X than there used to be. The study also found that the structural changes they’re arguing happened occurred right after Musk endorsed Trump in July. Which would have significantly changed the site’s demographics, thus resulting in more growth and interest around right-wing content.</p><hr /><h2>A Lot Of People Watched, Were Disappointed, By The Paul/Tyson Fight</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e728aa85-d244-4bfc-a776-845ee5db4a1b/Screenshot_2024-11-18_at_1.39.43_PM.png?t=1731955195\" /><div><span><p>(Photography is my passion.)</p></span></div></div><p>I watched the big Mike Tyson/Jake Paul fight from a bar in Brooklyn last week and much to my — and the crowd around me’s — disappointment, Tyson did not send Paul to <a href=\"https://x.com/LolOverruled/status/1857661570848809009?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">the hospital</a>. Even worse, Paul “won”. <i>Slate</i>’s Luke Winkie summed up the general consensus of the fight pretty well, <a href=\"https://x.com/luke_winkie/status/1857661821710172513?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">writing</a>, “Rapidly approaching cultural rock bottom. Actually gives me hope we can rebound into something cool. It can’t go on like this.” (At least I think he was talking about the fight, he posted it right as the fight ended. Even if it’s not about the fight, though, I think it applies lol.) <i>Defector</i> also wrote a <a href=\"https://defector.com/tyson-paul-was-a-boxing-match-that-felt-like-netflix?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">big piece</a> about the fight this week, calling out the general “unreality” of the whole thing.</p><p><i>New York Magazine</i>’s<i> </i>Josef Adalian reported that Netflix <a href=\"https://x.com/TVMoJoe/status/1857915763077894278?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">estimates</a> about 60 million accounts, or 20% of its total audience globally, streamed the fight. Netflix tends to assume every view <a href=\"https://www.inverse.com/entertainment/zack-snyder-netflix-distribution-model-streaming-numbers-inflation?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">counts as two</a>, but maybe they’re right this time, since a lot of people seemed to watch the fight together. Either way, it was a big enough audience to constantly crash the stream — the bar I was in had to refresh the app at least six times.</p><p>Hopefully, Netflix’s <a href=\"https://gizmodo.com/netflixs-beyonce-christmas-nfl-halftime-show-2000525799?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">next foray</a> into live programming, an NFL halftime show featuring Beyoncé, goes a bit better. </p><hr /><h2>A Good Mom Text</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/890ff71c-926d-425f-81b2-bcc9c1cb5092/Screenshot_2024-11-18_at_2.01.37_PM.png?t=1731956517\" /><div><span><p>(<a href=\"https://x.com/HeronEmoji/status/1858230118294134857?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">x.com/HeronEmoji</a>)</p></span></div></div><hr /><h2><i>Pokémon Go</i> Will Power The Murderous AI System Of The Future</h2><p>Uh, so here’s something interesting. Niantic, the company behind <i>Pokémon Go</i>, published a <a href=\"https://nianticlabs.com/news/largegeospatialmodel?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">long blog post</a> last week outlining a new project they’ve been working on called a Large Geospatial Model, essentially a Large Language Model but for visualizing and mapping physical space. They’re calling it the Visual Positioning System, or VPS, and they plan to use it for future augmented reality products and robotics. The idea of <a href=\"https://theconversation.com/pokemon-go-wants-to-make-3d-scans-of-the-whole-world-for-planet-scale-augmented-reality-experiences-is-that-good-140636?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">mapping the whole world</a> has been a big priority for Niantic over the last few years.</p><p>One new feature for <i>Pokémon Go </i>that uses VPS is called Pokémon Playgrounds and it lets a user place a virtual Pokémon on a location and other players will find that Pokémon where they left it. </p><p>Though, as Elise Thomas, over at the Institute for Strategic Dialogue, pointed out, it seems almost undeniable that this will not just power fun game mechanics. “It's so incredibly 2020s coded that Pokemon Go is being used to build an AI system which will almost inevitably end up being used by automated weapons systems to kill people,” Thomas <a href=\"https://x.com/elisethoma5/status/1858285812552704204?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">wrote</a>.</p><p>Probably worth <a href=\"https://theintercept.com/2016/08/09/privacy-scandal-haunts-pokemon-gos-ceo/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">dropping a link here</a> to the long-running surveillance conspiracy theories that have been following Niantic around since <i>Pokémon Go</i> first launched in 2016.</p><hr /><h2>News “Influencers” Actually Lean Right</h2><p>Contrary to the popular idea of an influencer you might have in your head — liberal TikTokers or progressive Instagrammers making chatty social clips and pastel-infused infographics — a new study out this week <a href=\"https://www.engadget.com/social-media/americas-news-influencers-skew-conservative-pew-report-finds-150002876.html?src=rss&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">from </a><i><a href=\"https://www.engadget.com/social-media/americas-news-influencers-skew-conservative-pew-report-finds-150002876.html?src=rss&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Pew</a></i> has found that “news influencers” are actually overwhelmingly conservative.</p><p>Now, the first thing to hit here is how <i>Pew </i>is defining “news influencer”. They looked at 500 creators with more than 100,000 followers on platforms like Facebook, Instagram, TikTok, YouTube, and X, which I actually think skews things quite a bit. The term “influencer” has been gendered for years and I, honestly, don’t really think that, say, a Gen Z TikToker making videos about trans healthcare as part of the same industry or same potential audience as Tim Pool making (allegedly) Russian-funded YouTube ragebait. But perhaps that paradigm needs to shift.</p><p>Especially because if you do gather up every individual creator making current event and political content online and throw them into the same bucket, you discover, as <i>Pew</i> did, that about a fifth of the country and close to half of Americans between 18-29 are watching aggressively right-wing content made by insane men.</p><p>As Taylor Lorenz <a href=\"https://www.usermag.co/p/the-majority-of-news-influencers?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">wrote in </a><a href=\"https://www.usermag.co/p/the-majority-of-news-influencers?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\"><i>User Mag</i></a> today, “If we don't fight for change and build systems to amplify more women and progressive voices online, we will be stuck with a media landscape that continues to exacerbate inequality and warps our political landscape for the worse.”</p><hr /><h2><span>A Good Post</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/4a743c1d-61d9-4b92-b3f4-a904e2a000b1/Screenshot_2024-11-18_at_11.02.02_AM.png?t=1731945740\" /><div><span><p>(<a href=\"https://bsky.app/profile/krang.bsky.social/post/3lb76okvjqc2a?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">bsky.app/profile/krang.bsky.social</a>)</p></span></div></div><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://embedded.substack.com/p/manosphere-gentle-guy-internet?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">“Did the manosphere really eat the internet?”</a></p></li><li><p><a href=\"https://www.theatlantic.com/family/archive/2024/11/dog-lamb-chop-toy-obsession/680691/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">“Why Are Dogs So Obsessed With Lamb Chop?”</a></p></li><li><p><a href=\"https://www.newyorker.com/news/the-lede/republican-victory-and-the-ambience-of-information?utm_source=pocket_shared\" target=\"_blank\">“Republican Victory and the Ambience of Information”</a></p></li><li><p><a href=\"https://www.hearingthings.co/this-compilation-is-a-dream/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">“This Compilation Is a Dream”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://www.tiktok.com/@milkdrinker73/video/7436814750736010539?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=right-wing-social-networks-don-t-work\" target=\"_blank\">Rebecca</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=ee7cc54d-5a60-4cb8-9505-9e730bf8d23e&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"60a64505005759d74814e277053b8be4370e12bddb058ef7223068e613fe62e5","category":"Sites"}