{"title":"MED Vol.30, No. 139","link":"https://ghuneim.com/2024/05/18/med-vol-30-no-139/","date":1716029995000,"content":"<p>Songs I listened to compiling this:<br />\n<a href=\"https://www.youtube.com/watch?v=P-wEq6T-ngY\" target=\"_new\">Quarters of Change – Turn It Away</a>  (youtube)<br />\n<a href=\"https://www.youtube.com/watch?v=cIgm1CeD2mQ&amp;t=9s\" target=\"_new\">Rosie Tucker – All My Exes Live In Vortexes</a> (youtube)<br />\n<a href=\"https://www.youtube.com/watch?v=_3pEI2k7BZ0\" target=\"_new\">Remi Wolf – Cinderella</a> (youtube)<br />\n<a href=\"https://www.youtube.com/watch?v=hiDwFq7t_D0\" target=\"_new\">Bottle Rockets – Community Service</a> (youtube)</p>\n<p><a href=\"https://www.ft.com/content/8772d32b-99df-497f-9bd7-4244f38d0439\"><span>The race for an AI-powered personal assistant</span></a><span>  (FT)  “In the new future every single interaction with the digital world will be through an AI assistant of some kind. We will be talking to these AI assistants all the time. Our entire digital diet will be mediated by AI systems,” (editors note: assistant’s are gateways to twinning. You don’t own your digital twin)</span></p>\n<p><a href=\"https://x.com/soniajoseph_/status/1791604177581310234\"><span>To the journalists contacting me about the AGI consensual non-consensual (cnc) sex parties—</span></a><span> (@soniajoseph) There is nothing wrong imo with sex parties and heavy LSD use in theory, but combined with the shadow of 100B+ interest groups, leads to some of the most coercive and fucked up social dynamics that I have ever seen. The climate was like a fratty LSD version of 2008 Wall Street bankers, which bodes ill for AI safety.</span></p>\n<p><a href=\"https://www.hollywoodreporter.com/movies/movie-news/hollywood-ai-artificial-intelligence-cannes-1235900202/\"><span>Hollywood at a Crossroads: “Everyone Is Using AI, But They Are Scared to Admit It</span></a><span>” (HR) Some sectors of the industry are already threatened with extinction. “Dubbing and subtitling employment in Europe is finished,” says Kavanagh. ./. Over the next three years, it is estimated that nearly 204,000 positions will be adversely affected. Concept artists, sound engineers, and voice actors stand at the forefront of that displacement. Visual effects and other postproduction work were also cited as particularly vulnerable.</span></p>\n<p><a href=\"https://www.sonymusic.com/sonymusic/declaration-of-ai-training-opt-out/\"><span>Declaration of AI Training Opt Out</span></a><span>  (sonymusic) SMG’s affiliates, Sony Music Publishing (SMP) and Sony Music Entertainment (SME), on behalf of themselves and their wholly owned or controlled affiliates, are making this affirmative, public declaration confirming that, except as specifically and explicitly authorized by either SME or SMP, as the case may be, each of them expressly prohibits and opts out of any text or data mining, web scraping or similar reproductions, extractions or uses (“TDM”) of any SME and/or SMP content (including, without limitation, musical compositions, lyrics, audio recordings, audiovisual recordings, artwork, images, data, etc. </span></p>\n<p><a href=\"https://news.artnet.com/art-world/ai-photo-london-2487330\"><span>New A.I. Works Fuse Fantasy and Memory at Photo London</span></a><span> For those hoping to determine what new directions the medium might be taking, the fair is littered with pieces that show how photography keeps evolving as it feeds into and emerges out of all manner of artistic practices. On show are textiles, sculptural pieces, and paintings, alongside an increasingly prominent yet still controversial presence: A.I. Here are some of the most interesting examples on show.</span></p>\n<p><span>Director Quentin Dupieu’s ‘</span><a href=\"https://www.festival-cannes.com/en/f/le-deuxieme-acte/\"><span>The Second Act’ debuted at Cannes</span></a><span> a a movie-within-a-movie about making movies.  Léa Seydoux, Vincent Lindon, Louis Garrel and Raphaël Quenard play actors making the first film directed by AI.</span></p>\n<p><a href=\"https://www.politico.com/news/magazine/2024/05/06/media-journalism-swagger-00154659'\"><span>The Collapse of the News Industry Is Taking Its Soul Down With It</span></a><span> (Politico)The decline of the media is sapping journalism of a crucial tool. “For the next generation, the future is dismal. And the youth know it. With an eye on the shrinking industry, fewer and fewer students now collect bachelor’s degrees in journalism, according to numbers collected by MIT Media Lab’s DataUSA site. Sensing the trend, schools like the University of New Hampshire, Ohio Wesleyan, Arkansas State University and others have ended their journalism programs in the last academic year or cut way back. “</span></p>\n<p><span> </span><span>In this weeks<em> ‘the worst people’</em> section </span></p>\n<p><span><a href=\"https://www.theguardian.com/technology/article/2024/may/17/ai-weapons-palantir-war-technology\">I’m the new Oppenheimer!’: my soul-destroying day at Palantir’s first-ever AI warfare conference</a> (The Guardian)  But Karp, who’s known as a provocateur, aggressively condoned violence, often peering into the audience with hungry eyes, palpably desperate for claps, boos or shock. He began by saying that the US has to “scare our adversaries to death.   </span></p>\n<p> </p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"60dc2f5ae0cd91c50b0da33f6451233f69e4ae9e54ce1a0697db7c66f8d83413","category":"default"}