{"title":"AI Can Ruin Movies Now, Too","link":"https://kottke.org/24/06/ai-can-ruin-movies-now-too","date":1718050479000,"content":"\n        <p></p>\n\n<p>YouTuber Nerrel takes James Cameron to task for releasing 4K remasters of Aliens and True Lies that have been, well, ruined by using AI to clean them up.</p>\n\n<blockquote><p>The best 4k releases tend to follow a pretty simple template: clean and scan the negative, repair any obvious signs of damage, and restore the colors to match the original grading, with as little meddling beyond that as possible. The process should not be about modernizing the style or forcing film to look like digital video. 35mm film was capable of incredible picture quality, and 4k is the first home format capable of delivering most of that detail — that should be enough. A well done 4k is like having a pristine copy of the original negative to watch in your own home, with the full data from that celluloid — grain and detail alike — digitally preserved forever. And that’s the problem with deep learning algorithms — they can’t preserve details. They make their best guess about what an object is supposed to be, then pull new details out of their digital assholes and smear them across the screen.</p></blockquote>\n\n<p>If Hollywood and one of its best directors don’t care enough about their movies to do them right, how are they supposed to convince us to care about their movies?</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/artificial%20intelligence\">artificial intelligence</a> · <a href=\"https://kottke.org/tag/film%20school\">film school</a> · <a href=\"https://kottke.org/tag/Hollywood\">Hollywood</a> · <a href=\"https://kottke.org/tag/James%20Cameron\">James Cameron</a> · <a href=\"https://kottke.org/tag/movies\">movies</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/06/ai-can-ruin-movies-now-too\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"6194a3b8a55f8c39230d5912cee3112854f3bfee5783fb3bd9d15de3f85b1a55","category":"default"}