{"title":"Living according to your hierarchy of values","link":"https://sive.rs/vls1","date":1571702400000,"content":"<p>\nMy “daily” blog was silent the last four days, because I took my kid on a spontaneous trip to another country.\n<a href=\"https://sive.rs/tp1\">No phone</a>.\nNo computer.\nI gave him my full attention every day from when he woke me in the morning to when we fell asleep together at night.\nIt was great.\n</p><p>\nI thought for a minute about the importance of my commitment to post here daily.\nBut nope, <strong>being with him is more important than writing</strong>.\n</p><p>\nUpon returning, I considered heading off by myself on a 10-day trip, balancing writing and exploring another culture.\nBut after <a href=\"https://sive.rs/slow\">sleeping on it</a>, I realized that no, <strong>writing is more important than exploring</strong>.\n</p><p>\nOnce you realize that one value is more important to you than another, <strong>you have to ask yourself if you’re living accordingly</strong>.\n</p><p>\nWhat’s ultimately more important to you?\n</p><ul><li>\nLearning? Or creating?\n</li><li>\nMoney? Or time?\n</li><li>\nExpanding? Or focusing?\n</li><li>\n(… etc.)\n</li></ul><p>\nOnce you know which takes top place, consider <a href=\"https://sive.rs/sauna\">taking it to an extreme</a>, to its logical conclusion, and <strong>optimizing your entire life around that top priority, letting go of almost everything else</strong>.\n</p><p>\nIf the idea sounds unfulfilling, try re-ordering your priorities, and do the thought experiment again.\n</p><p>\n<em>\n(That’s the subject of my next book, “<a href=\"https://sive.rs/h\">How to Live</a>”, which is my top writing priority right now, and so much fun!)\n</em> ☺\n</p>\n<img src=\"/images/pyramid1.jpg\" alt=\"pyramid of values\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"6274bb7a9246f78de589d7d092d94db98ed2d6571c47146c366eeaa23bb0cea3","category":"default"}