{"title":"one big choice shapes a hundred more","link":"https://sive.rs/ripple","date":1733788800000,"content":"<p>\nI was 36, and had been living in Portland for two years.\nI saw an amazing house for sale — <em>really</em> amazing — stunning design, ideal location on the edge of the city, and its backyard was the start of a huge state park.\nI had a visceral reaction.\n</p><p>\nFor a minute, I daydreamed about living the rest of my life in that house.\nFind a wife, and raise a family in that house.\nA bunch of grandkids, and that house would be a multi-generational axis.\n</p><p>\nThen I snapped out of it.\nWhat was I thinking?\nThat’s not the life I want!\n</p><p>\n<strong>\nIn 50 years, what would I rather be saying?\n</strong>\n</p><p>\n“I bought this house 50 years ago, and I’ve been here ever since!”\n</p><p><em>\n… or …\n</em></p><p>\n“Hey honey, what year did we move to Berlin?”\n<br />\n“2030, after Buenos Aires. Because in 2040 we moved to Bangalore.”\n<br />\n“Oh right. Our bungalow in Bali was the year before Beijing.”\n</p><p>\nNow <em>that’s</em> the life I want!\nNothing against the <a href=\"https://www.rogerebert.com/reviews/great-movie-its-a-wonderful-life-1946\">settled life</a> for others, but it’s not for me.\nI want to live in every corner of the world.\n</p><p>\nWe make a big choice, like a house, job, spouse, or dog.\nWe think about the thing itself: the look of the house, what the job pays, what a sweet dog.\n<strong>\nBut a choice has so many cascading consequences.\nOne big choice shapes a hundred little others.\n</strong>\nI try to imagine the ripple effects — the later details that make the day-to-day difference.\n</p><p>\nThen I think in reverse.\n<strong>\nKnowing the consequences I want, what choice would create them?\nWhat big choice would nudge a hundred others that way?\n</strong>\n</p><p>\nWithin an hour of seeing that house, picturing the two different paths, it was clear I wanted to leave America forever, so I booked a flight to London.\nI didn’t know the details, but I knew this big first choice would send me in the right direction.\n(And it has.)\n</p><p>\nAtomic habits?\nDecision fatigue?\nOne big choice shapes a hundred more.\nSo it helps to daydream implications.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"6290ab29e4c7a8ca0ba93bd062643df1cf08a59251de948ecd10686c4469263d","category":"Sites"}