{"title":"The Work of Art: Inside the Creative Process of Beloved Artists, Poets, Musicians, and Other Makes of Meaning","link":"https://www.themarginalian.org/2024/05/01/the-work-of-art-adam-moss/","date":1714565533000,"content":"<p><a href=\"https://www.amazon.com/Work-Art-Something-Comes-Nothing/dp/059329758X/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"399\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?fit=320%2C399&amp;ssl=1\" alt=\"The Work of Art: Inside the Creative Process of Beloved Artists, Poets, Musicians, and Other Makes of Meaning\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?w=1204&amp;ssl=1 1204w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?resize=320%2C399&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?resize=600%2C748&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?resize=240%2C299&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/theworkofart_moss.jpg?resize=768%2C957&amp;ssl=1 768w\" /></a></p><p>“The true artist,” Beethoven wrote in his <a href=\"https://www.themarginalian.org/2017/05/18/beethoven-emilie-letter/\">touching letter of advice</a> to a young girl aspiring to be an artist, “is sad not to have reached that point to which his better genius only appears as a distant, guiding sun.” The choreographer Martha Graham called this particular shade of sadness <a href=\"https://www.themarginalian.org/2015/10/02/martha-graham-creativity-divine-dissatisfaction/\">“divine dissatisfaction.”</a> It is something quite different from the small mean voice of the internal critic — it is rather a matter of “making your unknown known,” as Georgia O’Keeffe wrote in her magnificent <a href=\"https://www.themarginalian.org/2014/12/08/georgia-okeeffe-sherwood-anderson-letters/\">letter of advice on the creative life</a> to the young Sherwood Anderson, “and keeping the unknown always beyond you”; a matter of unselfing into something larger while remaining authentically oneself. Creativity, after all, is just our best sensemaking mechanism for what this is and what we are. We create — a poem or a theorem, a novel or a song — in order to explain the world to ourselves and explain ourselves to the world. </p>\n<p>Because we are half-opaque to ourselves, because we are bathing in the mystery and confusion of consciousness amid a universe governed by forces beyond the reach of our control and comprehension, the work of art is cratered with exasperation and self-doubt, with failures and false starts. And yet the very existence of this cathedral of truth and beauty we call culture is evidence that somehow, again and again, through depressions and wars, pandemics and heartbreaks, artists have managed to keep faith in the creative process, to keep showing up for the mundane work that makes the magic, that makes the meaning, that makes life livable and more alive. </p>\n<figure><a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/exupery_morgan11.jpg?w=680&amp;ssl=1\" /></a><figcaption>One of Antoine de Saint-Exupéry’s <a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\">preliminary drawings for <em>The Little Prince</em></a>, 1943. (Morgan Library and Museum.)</figcaption></figure>\n<p>The strange self-salvation by which artists do that is what magazine editor turned painter Adam Moss explores in <a href=\"https://www.amazon.com/Work-Art-Something-Comes-Nothing/dp/059329758X/?tag=braipick-20\" target=\"_blank\"><strong><em>The Work of Art: How Something Comes from Nothing</em></strong></a> (<a href=\"https://search.worldcat.org/title/1390776395\" target=\"_blank\"><em>public library</em></a>) — a revelatory window on the creative process at the crossing point of the mystical and the methodical through conversations with and reflections by some of the most beloved artists of our time — poets, painters, novelists, musicians, filmmakers, playwrights, architects, chefs — each centered on how a particular work came to be. What emerges is “a celebration of the art that happens when instinct meets rigor,” resinous with the passion and persistence necessary for making any idea come aflame with life. </p>\n<p>A century after Graham Wallace pioneered <a href=\"https://www.themarginalian.org/2013/08/28/the-art-of-thought-graham-wallas-stages/\">the first systematic theory of the stages of the creative process</a>, Moss — a self-admitted “freak for the zealous pursuit of the better” — reflects on the psychological common thread across these investigations: </p>\n<blockquote><p>Art requires access to the imagination, a notoriously difficult place to visit. The imagination fuels an idea. The artist acts urgently, often impulsively, on that idea but brings conscious rigor to the evaluation of what the imagination has spewed. Ultimately, experience, intellect, insight, and drive enable them to shape the work and then to edit it over and over, until that idea has been turned into a finished work. Each stage — the imagining, judging, and shaping — is important; one way or another, each entered these conversations… Influences are absorbed and thrown over… Constraints and circumstances (timing, luck, allies) create structures that allow accidents to happen. Along the way, there is making and destroying, self-sabotage, doubt and despair, but the unifying fact of this book is that successful creators do not give up, even when the thwarting seems insurmountable.</p></blockquote>\n<p>This unrelenting persistence is what prompted Albert Camus to write as passionately as he did about <a href=\"https://www.themarginalian.org/2023/08/22/albert-camus-writing/\">the importance of stubbornness of creative work</a>, which Nobel laureate Louise Glück echoes in speaking with Moss about the making of her strange and splendid poem <a href=\"https://www.themarginalian.org/2024/04/29/louse-gluck-wild-iris/\">“The Wild Iris”</a> shortly before her death:</p>\n<blockquote><p>The really hard thing about writing is how much patience you need to have. I mean, you can will things, but whenever I’ve tried to do that, the poem just goes to hell. Becomes a contrivance. An arrangement made with a mind instead of a discovery. If you want a discovery that will surprise you, too, you just have to wait… What’s needed is not diligence or intelligence. What’s needed is an intervention of something outside yourself, better than yourself, but with access to yourself… The gift I have is stubbornness. And patience.</p></blockquote>\n<figure><a href=\"https://mairakalman.com/shop/p/limited-edition-still-life-with-remorse\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?resize=680%2C677&amp;ssl=1\" width=\"680\" height=\"677\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?w=1010&amp;ssl=1 1010w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?resize=320%2C319&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?resize=600%2C598&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?resize=240%2C239&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/remorse_Maira_Virginia.jpg?resize=768%2C765&amp;ssl=1 768w\" /></a><figcaption>Virginia Woolf’s writing table by Maira Kalman from <a href=\"https://www.themarginalian.org/2024/02/13/maira-kalman-still-life-with-remorse/\"><em>Still Life with Remorse</em></a></figcaption></figure>\n<p>Because, as the psychiatrist <a href=\"https://www.themarginalian.org/2022/07/12/eric-berne-games-people-play/\">Eric Berne</a> observed, “the eternal problem of the human being is how to structure his waking hours,” and because, as Borges knew, <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">time is the substance of we are made of</a>, one thing that emerges again and again is the importance of <a href=\"https://www.themarginalian.org/2012/05/11/internal-time-till-roenneber/\">understanding your chronobiology</a> and putting it in the service of the work. (The question of how artists structure their time is <a href=\"https://www.themarginalian.org/tag/daily-routines/\">its own canon</a>, sending an entire branch of social science in search of <a href=\"https://www.themarginalian.org/2014/08/25/the-psychology-of-writing-daily-routine/\">the psychology of the ideal daily routine for creative work</a>). Michael Cunningham considers a temporal structure common to many writers:</p>\n<blockquote><p>I need to write first thing in the morning. I need to segue from sleep and dreams directly into this invented world of mine because part of the deal is maintaining, for several years, your belief in this world, and if I were to even run a few errands before I got to work, I’d get derailed. I’d get so lost in the realness of the real world that when I turned on the computer and looked at what I’d been writing, I’d think, ‘Well, this isn’t as deep as the dry cleaner’ — or the drugstore, or wherever else I’ve just been. </p>\n<p>I write for about four, five hours, after which there’s nothing there anymore. But I also learned that for me it was going to be much more helpful to think in terms of time spent, as opposed to page limit — because if you just have to produce words and you write too much of what you know isn’t working — and there are those days — then you are in danger of losing faith in your book. But if I am in my chair, ready to write whatever arrives — ten pages or one sentence — I’ve fulfilled my commitment.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?resize=680%2C817&amp;ssl=1\" width=\"680\" height=\"817\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?w=883&amp;ssl=1 883w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?resize=320%2C385&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?resize=600%2C721&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?resize=240%2C288&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/ofraamit_universeinverse_emily.jpg?resize=768%2C923&amp;ssl=1 768w\" /></a><figcaption>Emily Dickinson at work. Detail from art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a>.</figcaption></figure>\n<p>Although there are unifying themes, each conversation offers a particular tessera for the psychic mosaic of creative work — from poet Marie Howe (who discusses the making of her stunning poem <a href=\"https://www.themarginalian.org/2020/04/23/singularity-marie-howe-animated/\">“Singularity”</a>), the urgency of self-forgetfulness as an antidote to the self-consciousness at the root of our suffering; from musician Moses Sumney, the transmutation of loneliness into fuel for the creative force on the other end of which is connection; from novelist Michael Cunningham, the capacity for self-surprise and the willingness to let the work take you where you couldn’t have willfully gone; from composer Stephen Sondheim, the fusion of “meticulous precision with a remarkable flexibility”; from artist Kara Walker, the importance of feeling new to yourself at the outset of each project, however predicated on your expertise it may be; from broadcaster Ira Glass, the wearying but necessary will to be always at war with mediocrity; from filmmaker Sofia Coppola, the inevitability of self-doubt and the willingness to endure it in order to better understand yourself through the creative process; from chef Samin Nosrat, the vital balance of beginner’s mind and pattern recognition honed on experience; from composer Nico Muhly, the importance of embracing your particularity and finding your own planet, even if it is “a planet most people will never live on.”</p>\n<figure><a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/01/thelittleprince_morgan7.jpg\" /></a><figcaption>Another of Antoine de Saint-Exupéry’s <a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\">preliminary drawings for <em>The Little Prince</em></a>. (Morgan Library and Museum.)</figcaption></figure>\n<p><a href=\"https://www.amazon.com/Work-Art-Something-Comes-Nothing/dp/059329758X/?tag=braipick-20\" target=\"_blank\"><strong><em>The Work of Art</em></strong></a> is a magnificent read in its entirety, lush with ephemera from the understory of creativity — discarded drafts, handwritten journal pages, preliminary sketches and prototypes, notes from the subconscious scribbled in the middle of the night. Complement it with Nick Cave on <a href=\"https://www.themarginalian.org/2023/10/07/nick-cave-faith/\">the role of faith in creativity</a>, Lucille Clifton on <a href=\"https://www.themarginalian.org/2023/10/21/lucille-clifton-poetry-interview/\">the vital balance of intellect and intuition in making art</a>, Rilke on <a href=\"https://www.themarginalian.org/2021/06/29/rilke-letters-to-a-young-poet-macy-barrows/\">the relationship between love, eros, solitude, and creativity</a>, and David Bowie’s <a href=\"https://www.themarginalian.org/2022/11/24/david-bowie-creativity-advice/\">advice to artists</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"62a02df8fd2af92b8c0378d0d43639c4b551a00b38d1a4d7e478ac5792aadc23","category":"default"}