{"title":"End of Tech’s Easy Growth","link":"https://om.co/2024/06/07/techs-end-of-easy-growth/","date":1717782810000,"content":"<p>I was recently invited to participate in the Trends with Friends podcast, co-hosted by long time friend Howard Lindzon. The podcast primarily focuses on “markets” and less on “technology,” as I understand it. Howie and his co-hosts were eager to discuss Apple, AI, and the significant changes sweeping our industry. My overarching message for them was that the days of easy growth are over for Silicon Valley’s biggest players — and you can see it in their actions.</p>\n\n\n\n<p>Whether it’s Apple, Google, or Amazon, most of these companies are facing the tyranny of large numbers. But if you are a regular reader, <a target=\"_blank\" href=\"https://om.co/2024/05/09/apple-is-primed-to-stumble/\">you already knew that</a>. Apple is looking at “services” to boost its revenues. “Apple is reporting revenue of $90.8 billion for the March quarter, including an all-time revenue record in Services,” said Tim Cook, Apple’s CEO,<a target=\"_blank\" href=\"https://www.apple.com/newsroom/2024/05/apple-reports-second-quarter-results/\"> when</a> announcing the company’s quarterly earnings. Services grew 8% on an annual basis, while hardware sales were down. The good news is that Apple continues to push and innovate on the core technology front — the latest M4 chip being a good example.</p>\n\n\n\n<p>Mega-Growth for Apple and others is now in the rearview mirror. “If you’re making hundreds of billions of dollars in revenue, you can’t really double it every year,” I said on the podcast. This is a natural evolution for the industry, as companies reach a point where their sheer size makes it difficult to maintain the rapid growth rates that investors have come to expect.</p>\n\n\n\n<p>This new reality for technology giants such as Apple, Amazon, Google, and Microsoft involves grappling with the challenges of being mature companies that have massive existing revenue streams. There are no more markets to conquer — these companies are the market. AI will definitely make these companies more profitable by enhancing efficiency and reinforcing their advantages. However, it is not quite clear how the market will eventually evolve.</p>\n\n\n\n<p>The increasing need for growth is why companies are resorting to desperate measures. Amazon, for instance, is pushing hard on advertising for revenue. It has decided to introduce ads on its Prime Video service, despite already charging users a subscription fee for Prime. I interpret this as Amazon lacking new “growth engines or growth levers.” It will definitely make for interesting few years ahead.</p>\n\n\n\n<p>Listen to the podcast: </p>\n\n\n\n<p><a href=\"https://podcasts.apple.com/us/podcast/why-tech-needs-a-lesson-in-empathy-apple-stock/id1670692277?i=1000657295286\">Apple</a>, <a href=\"https://open.spotify.com/episode/18rX5rSmJGF3BgGzryrHh3?si=wBausnboSm-XXk5ocIEXlw\">Spotify</a> or <a href=\"https://youtu.be/4DnMGjkygyk?si=301lmelQl_zRsAOS\">YouTube</a></p>\n\n\n\n<figure><div>\n<div></div>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6333f4a9e2d552101840e52ffddd579627038b0c2928b9adc0803498d7e35661","category":"default"}