{"title":"Conversations with Tyler Cowen","link":"https://sive.rs/tyler","date":1674950400000,"content":"<p>\n<a href=\"https://conversationswithtyler.com/\">Tyler Cowen</a> is my favorite interviewer of all-time.\nHis interviewing style has spoiled me for all others.\nHe creates a tasting feast for the mind.\n</p><p>\nFirst he finds brilliant accomplished people that he wants to learn from — people that are not too famous so they are not too polished in their answers.\n</p><p>\nThen he does a ton of research in advance of each interview, reading all of their books and all of their previous interviews, searching for interesting topics that haven’t been explored enough.\nSo he knows that when he asks the Portuguese economist about the food in Djibouti, or the novelist about French versus Russian ballet, that they'll have an interesting opinion.\n</p><p>\nHe’s asking questions for himself, not us.\nBecause he doesn’t pander down to the audience, we get to rise up.\nHe’ll dive straight into a question about the Saramaccan language of Suriname, or the location of every Hieronymus Bosch painting, without stopping to explain.\nIf the question and answer interests you, you can find out later what that was about.\n</p><p>\nHe encourages his guests to answer succinctly so they can have time to cover many subjects.\nSo it's never a whole conversation about Irish history or the synthesis of Spinoza and Sufism or any one topic.\nHe jumps right into the next surprisingly specific question, always keeps it moving, and skips the conversational fluff.\n</p><p>\nAs an example, here are a few of my favorite conversations, and just a few of the topics they cover.\n</p>\n<h3><a href=\"https://conversationswithtyler.com/episodes/dana-gioia/\">Dana Gioia</a></h3>\n<ul><li>\nthe best art museum you’ve never heard of\n</li><li>\nthe optimism of the Beach Boys\n</li><li>\nthe Jungianism of Star Trek\n</li><li>\nwhy narrative is necessary for coping with life’s hardships\n</li><li>\nwhy we stopped building cathedrals\n</li></ul>\n<h3><a href=\"https://conversationswithtyler.com/episodes/katherine-rundell/\">Katherine Rundell</a></h3>\n<ul><li>\nthe thrills and dangers of rooftop walking\n</li><li>\nwhy children should be more mischievous\n</li><li>\nwhat it’s like to eat tarantula\n</li><li>\nthe power of memorizing poetry\n</li><li>\nthe Kafka book she gives to toddlers\n</li></ul>\n<h3><a href=\"https://conversationswithtyler.com/episodes/john-mcwhorter/\">John McWhorter</a></h3>\n<ul><li>\nIndonesian should be the world’s universal language\n</li><li>\nwhy Mandarin won’t overtake English as the lingua franca\n</li><li>\ncircumstances that create Creole languages\n</li><li>\nthe decline of American regional accents\n</li><li>\nwhy Shakespeare needs an English translation\n</li></ul>\n<p>\nThese conversations inspired me to read The Odyssey, the <a href=\"https://sive.rs/bible\">Bible</a>, a <a href=\"https://sive.rs/book/OpenBorders\">great comic book about immigration</a>, and many other books on my reading queue now.\n</p><p>\nThese conversations made me want to learn Swahili and Indonesian, try the vegetables in Chennai, and probably twenty other actions I’ve taken from their various topics.\n</p><p>\nIf you like to broaden your horizons, you’re going to love this.\n</p><p>\n<strong>\nGo to <a href=\"https://conversationswithtyler.com/\">ConversationsWithTyler.com</a> and subscribe to the podcast.\n</strong>\nOr click “<a href=\"https://conversationswithtyler.com/episodes/\">all episodes</a>” at the top of the page to browse the archive.\n</p><p>\nI also like his blog, “<a href=\"https://marginalrevolution.com/\">Marginal Revolution</a>”, and his books, “<a href=\"https://sive.rs/book/StubbornAttachments\">Stubborn Attachments</a>”, and “<a href=\"https://sive.rs/book/InnerEconomist\">Discover Your Inner Economist</a>”.\n</p>\n<img src=\"/images/tyler.jpg\" alt=\"Conversations with Tyler logo\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"633525b12306fc7b143be522c55acbf610e170db261ed8005a46e78807c8b84b","category":"default"}