{"title":"Appalling vs. a Whole Other Level of Appalling","link":"https://kottke.org/24/07/appalling-vs-a-whole-other-level-of-appalling","date":1720448778000,"content":"\n        <p>Rebecca Solnit: <a href=\"https://www.theguardian.com/commentisfree/article/2024/jul/06/biden-trump-race-rebecca-solnit\">Why is the pundit class so desperate to push Biden out of the race?</a></p>\n\n<blockquote><p>I am not usually one to offer diagnoses of people I’ve never met, but it does seem like the pundit class of the American media is suffering from severe memory loss. Because they’re doing exactly what they did in the 2016 presidential race — providing wildly asymmetrical and inflammatory coverage of the one candidate running against Donald J Trump.</p>\n\n<p>They have become a stampeding herd producing an avalanche of stories suggesting Biden is unfit, will lose and should go away, at a point in the campaign in which replacing him would likely be somewhere between extremely difficult and utterly catastrophic. They do this while ignoring something every scholar and critic of journalism knows well and every journalist should. As Nikole Hannah-Jones put it: “As media we consistently proclaim that we are just reporting the news when in fact we are driving it. What we cover, how we cover it, determines often what Americans think is important and how they perceive these issues yet we keep pretending it’s not so.” They are not reporting that he is a loser; they are making him one.</p></blockquote>\n\n<p>I’ve been watching this play out over the last few weeks and whatever the media (especially the NY Times) and pundits are doing here is much more alarming to me than Biden’s poor debate performance. Especially considering:</p>\n\n<blockquote><p>Speaking of coups, we’ve had a couple of late, which perhaps merit attention as we consider who is unfit to hold office. This time around, Trump is not just a celebrity with a lot of sexual assault allegations, bankruptcies and loopily malicious statements, as he was in 2016. He’s a convicted criminal who orchestrated a coup attempt to steal an election both through backroom corruption and public lies and through a violent attack on Congress. The extremist US supreme court justices he selected during his last presidential term themselves staged a coup this very Monday, overthrowing the US constitution itself and the principle that no one is above the law to make presidents into kings, just after legalizing bribery of officials, and dismantling the regulatory state by throwing out the Chevron deference.</p></blockquote>\n\n<p>*hair-tearing-out sounds*</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Joe%20Biden\">Joe Biden</a> · <a href=\"https://kottke.org/tag/journalism\">journalism</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Rebecca%20Solnit\">Rebecca Solnit</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"636d4b7ec510e20782208b847fa184621c2f1ed4d768be2f200b9ebaa6d0cd7b","category":"default"}