{"title":"Mass Deportations, a Culture of Denunciation, and an Altered America","link":"https://kottke.org/24/10/mass-deportations-a-culture-of-denunciation-and-an-altered-america","date":1729553794000,"content":"\n        <p>Historian Timothy Snyder (<a href=\"https://www.amazon.com/exec/obidos/ASIN/0804190119/ref=nosim/0sil8\">On Tyranny</a>), who studies forced population movements, <a href=\"https://snyder.substack.com/p/twelve-million-deportations\">thinks we aren’t taking the Trump/Vance deportation plans seriously enough</a>. (I agree.) The effects will be familiar to anyone who has read anything about totalitarian regimes and/or caste-based societies (like these very United States):</p>\n\n<blockquote><p>An attempt to rapidly deport twelve million people will also change everyone else. As Trump has said, such an action will have to bring in law enforcement at all levels. Such a huge mission will effectively redefine the purpose of law enforcement: the principle is no longer to make all people feel safe, but to make some people unsafe. And of course the diversion of law enforcement resources to deportation means that crimes will not be investigated or prosecuted. So some people will be radically less safe, but everyone regardless of status will in fact be less safe.</p>\n\n<p>Such an enormous deportation will requires an army of informers. People who denounce their neighbors or coworkers will be presented as positive examples. Denunciation then becomes a culture. If you are Latino, expect to be denounced at some point, and expect special attention from a government that will demand your help to find people who are not documented. This is especially true if you are a local civic or business leader. You will be expected to collaborate in the deportation effort: if you do, you will be harming others; if you do not, you risk being seen as disloyal yourself. This painful choice can be avoided not at a later point but only now, by voting against mass deportations.</p></blockquote>\n\n<p>The Trump campaign is <a href=\"https://www.washingtonpost.com/politics/2024/10/03/who-does-trump-plan-deport-who-trump-wants-deport/\">telling us straight out that this is their plan</a> — they are not hiding it! at all! — and historians are letting us know what has happened in similar situations in the past and it’s just not all that confusing or complicated to understand. Even if they try and don’t succeed, it’s going to be absolutely brutal. Those are the stakes.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Timothy%20Snyder\">Timothy Snyder</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"637c2c34547e26e607a7100aa4db87f81a2714abde95c621de0f97f98a240e2d","category":"Sites"}