{"title":"How to Tell Love from Desire: José Ortega y Gasset on the Chronic Confusions of Our Longing","link":"https://www.themarginalian.org/2024/04/24/ortega-love-desire/","date":1713981148000,"content":"<h3>“Loving is perennial vivification… a centrifugal act of the soul in constant flux that goes toward the object and envelops it in warm corroboration, uniting us with it and positively affirming its being.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Love-Aspects-Single-Theme/dp/1614273383/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"451\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?fit=320%2C451&amp;ssl=1\" alt=\"How to Tell Love from Desire: José Ortega y Gasset on the Chronic Confusions of Our Longing\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?resize=320%2C451&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?resize=600%2C846&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?resize=240%2C338&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?resize=768%2C1083&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/ortegaygasset_onlove.jpg?resize=1089%2C1536&amp;ssl=1 1089w\" /></a></p><p>It is a strange thing, desire — so fiery yet so forlorn, aimed at having and animated by lack. In its restlessness and its pointedness, so single of focus, it shares psychic territory with addiction. Its Latin root — <em>dē</em> + <em>sidus</em>, “away from one’s star” — bespeaks its disorientation, its rush of longing, which we so easily mistake for love. And yet, when unplugged from the engine of compulsion and possession, desire can be a powerful clarifying force for the hardest thing in life: <a href=\"https://www.themarginalian.org/2015/10/16/milan-kundera-unbearable-lightness-of-being/\">knowing what we want</a> and wanting it unambivalently, with wholehearted devotion and fully conscious commitment. In this aspect, desire is not a simulacrum of but scaffolding for love. It shares a strand of that same Latin root with <em>consider</em>, for it is only through consideration — of our own soul’s yearnings and the sovereign soul of the other — that we can truly love.</p>\n<p>How to tell love from desire and how to make of desire a stronghold of love is what the Spanish philosopher <strong>José Ortega y Gasset</strong> (May 9, 1883–October 18, 1955) explores in <a href=\"https://www.amazon.com/Love-Aspects-Single-Theme/dp/1614273383/?tag=braipick-20\" target=\"_blank\"><strong><em>On Love: Aspects of a Single Theme</em></strong></a> (<a href=\"https://www.worldcat.org/title/on-love-aspects-of-a-single-theme/oclc/1031851786&amp;referer=brief_results\" target=\"_blank\"><em>public library</em></a>) — the posthumous collection of his superb newspaper essays challenging our standard narratives and touching self-delusions about who we are and what we want, anchored in the recognition that “people are the most complicated and elusive objects in the universe.” </p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/leemiller_manray.jpg?resize=680%2C893&amp;ssl=1\" alt=\"'Lee Miller and Friend' by Man Ray. Paris, 1930.\" width=\"680\" height=\"893\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/leemiller_manray.jpg?w=1170&amp;ssl=1 1170w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/leemiller_manray.jpg?resize=240%2C315&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/leemiller_manray.jpg?resize=320%2C420&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/09/leemiller_manray.jpg?resize=600%2C788&amp;ssl=1 600w\" /><figcaption><em>Lee Miller and Friend</em> by Man Ray. Paris, 1930.</figcaption></figure>\n<p>In a passage that calls to mind Auden’s <a href=\"https://www.themarginalian.org/2016/05/10/w-h-auden-commonplace-book-doubt-truth-enchantment/\">haunting meditation on true and false enchantment</a>, Ortega considers how our slippery grasp of reality shapes our experience of love:</p>\n<blockquote><p>It would be outlandish to conclude that, after being consistently wrong in our dealings with reality, we should hit the mark in love alone. The projection of imaginary qualities upon a real object is a constant phenomenon… To see things — moreover, to appreciate them! — always means to complete them… Strictly speaking, no one sees things in their naked reality. The day this happens will be the last day of the world, the day of the great revelation. In the meantime, let us consider our perception of reality which, in the midst of a fantastic fog, allows us at least to capture the skeleton of the world, its great tectonic lines, as adequate. Many, in fact the majority, do not even achieve this… They lead a somnambulant existence, scurrying along their delirium. What we call genius is only the magnificent power… of piercing a portion of that imaginative fog and discovering behind it a new authentic bit of reality, quivering in sheer nakedness.</p></blockquote>\n<p>Love, Ortega argues, can uniquely pierce the veil of delirium and reveal a greater truth, unlike “inactive sentiments” like joy and sadness, to which desire is akin:</p>\n<blockquote><p>[Joy and sadness] are a sort of coloration which tinges the human being. One “is” sad or he “is” happy, in complete passiveness. Joy, in itself, does not constitute any action, although it may lead to it. One the other hand, loving something is not simply “being,” but acting toward that which is loved… Love itself is, by nature, a transitive act in which we exert ourselves on behalf of what we love.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2015/02/23/the-velveteen-rabbit-komako-sakai/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/02/velveteenrabbit_sakai2.jpg\" /></a><figcaption>Illustration by Japanese artist Komako Sakai for <a href=\"https://www.themarginalian.org/2015/02/23/the-velveteen-rabbit-komako-sakai/\">a special edition of <em>The Velveteen Rabbit</em></a></figcaption></figure>\n<p>In consonance with Iris Murdoch’s magnificent definition of love as <a href=\"https://www.themarginalian.org/2022/01/08/iris-murdoch-the-sublime-and-the-good/\">“the extremely difficult realisation that something other than oneself is real,”</a> Ortega observes that the essence of love is an “intense affirmation of another being, irrespective of his attitude toward us.” With an eye to all the things we mistake for it — “desire, curiosity, persistence, madness, sincere sentimental fiction” — he admonishes against the culturally conditioned error of measuring the magnitude of love by the intensity of violent emotion it stirs in us, drawing a crucial distinction between falling in love, as a transient altered state of consciousness drunk on dopamine, and loving, as a continuous mode of being:</p>\n<blockquote><p>Love is a much broader and profound operation, one which is more seriously human, but less violent. All love passes through the frantic zone of “falling in love”; but, on the other hand, “falling in love” is not always followed by genuine love. Let us, therefore, not confuse the part with the whole.</p>\n<p>[…]</p>\n<p>The more violent a psychic act is, the lower it is in the hierarchy of the soul, the closer it is to blind physical mechanism, and the more removed from the mind. And, vice versa, as our sentiments become more tinged with spirituality, they lose violence and mechanical force. The sensation of hunger in the hungry man will always be more violent than the desire for justice in the just man.</p></blockquote>\n<p>We are always, of course, <a href=\"https://www.themarginalian.org/2024/04/12/dictionary-of-obscure-sorrows/\">trapped by the limitations of language in communicating the limitless</a>. Observing the difficulty of using a single term to encompass “the most varied fauna of emotions” — the love of science or art, the love of a lover or a child, the love of a country or a cause — and the fact that any term becomes unwieldy when tasked with conveying too many disparate things, Ortega considers what the defining feature of love might be: </p>\n<blockquote><p>Love, strictly speaking, is pure sentimental activity toward an object, which can be anything — person or thing. As a “sentimental” activity, it remains, on the one hand, separated from all intellectual functions — perception, consideration, thought, recall, imagination — and, on the other hand, from desire, with which it is often confused. A glass of water is desired, but is not loved, when one is thirsty. Undoubtedly, desires are born of love; but love itself is not desire. We desire good fortune for our country, and we desire to live in it because we love it. Our love exists prior to these desires, and the desires spring from love like the plant form the seed.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/09/bigwolflittlewolf8.jpg\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><em>Big Wolf &amp; Little Wolf</em></a></figcaption></figure>\n<p>Desire is often so difficult to distinguish from love because it is rooted in longing, but longing exists only in absence and evaporates at the moment of attainment, while love grows more saturated the more presence and energy it is given. A generation before the poet J.D. McClatchy contemplated <a href=\"https://www.themarginalian.org/2018/04/26/j-d-mcclatchy-love-speaks-its-name/\">the contrast and complementarity of desire and love</a>, Ortega writes:</p>\n<blockquote><p>Desiring something is, without doubt, a move toward possession of that something (“possession” meaning that in some way or other the object should enter our orbit and become part of us). For this reason, desire automatically dies when it is fulfilled; it ends with satisfaction. Love, on the other hand, is enterally unsatisfied. Desire has a passive character; when I desire something, what I usually desire is that the object come to me. Being the center of gravity, I await things to fall down before me. Love… is the exact reverse of desire, for love is all activity. Instead of the object coming to me, it is I who go to the object and become a part of it. In the act of love, the person goes out of himself. Love is perhaps the supreme activity which nature affords anyone for going out of himself toward something else. It does not gravitate toward me, but I toward it… Love is gravitation toward that which is loved.</p>\n<p>[…]</p>\n<p>In loving we abandon the tranquility and permanence within ourselves, and virtually migrate toward the object. And this constant state of migration is what it is to be in love.</p></blockquote>\n<p>And yet, he concedes, desire can bloom into love:</p>\n<blockquote><p>One may sometimes grow to love what he desires: we desire what we love, <em>because</em> we love it.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/arthurrackham_grimm5.jpg\" /></a><figcaption>Art by Arthur Rackham for a <a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\">rare 1917 edition</a> of the Brothers Grimm fairy tales. (Available <a href=\"https://society6.com/product/art-by-arthur-rackham-from-a-rare-1917-edition-of-the-brothers-grimm-fairy-tales_print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>The distinction between desire and love, Ortega observes, goes beyond that between the static and the active. Even more crucially, there is the distinction between possession and affirmation, between greed and generosity:</p>\n<blockquote><p>Desire enjoys that which is desired, derives satisfaction from it, but it offers nothing, it gives nothing, it has nothing to contribute… Love, on the other hand, reaches out to the object in a visual expansion and is involved in an invisible but divine task, the most active kind that there is: it is involved in the affirmation of its object.</p>\n<p>[…]</p>\n<p>Loving is perennial vivification, creation and <em>intentional</em> preservation of what is loved… a centrifugal act of the soul in constant flux that goes toward the object and envelops it in warm corroboration, uniting us with it and positively affirming its being.</p></blockquote>\n<p>Couple with Ortega on <a href=\"https://www.themarginalian.org/2021/06/25/jose-ortega-y-gasset-on-love/\">how the people we love reveal us</a>, then revisit French philosopher Alain Badiou on <a href=\"https://www.themarginalian.org/2015/10/26/alain-badiou-in-praise-of-love/\">why we fall and how we stay in love</a>, Thich Nhat Hanh on <a href=\"https://www.themarginalian.org/2015/03/31/how-to-love-thich-nhat-hanh/\">how to love</a>, and Hannah Arendt on <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">love and how to live with the fundamental fear of loss</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"63ee207da6ef8d4107269d049c31574e9e21da533edf25b88cb1678394d07dac","category":"default"}