{"title":"The philosophy of great customer service","link":"https://sive.rs/cs","date":1404000000000,"content":"<p>\nI was honestly surprised that my company, CD Baby, was such a runaway success.\nBut I was even more surprised to find out why.\n</p><p>\nCD Baby had lots of powerful well-funded competitors, but after a few years they were all but gone, and we dominated our niche of selling independent music.\n150,000 musicians, 2 million music-buying customers, $139 million in revenue, $83 million paid directly to musicians.\n</p><p>\n<strong>\nWhat was the secret to CD Baby’s success?\n</strong>\nI never did any marketing.\nEveryone came by word-of-mouth.\nBut why?  I honestly didn’t know.\n</p><p>\nSo whenever I was out talking with my musician clients, I’d ask them.\nFor years, I asked hundreds of clients why they chose CD Baby instead of the alternatives.\nOr I’d just listen as they’d rave to others nearby about why they loved it.\n</p><p>\nWas it the pricing?  The features?  Nope.\nThe #1 answer, by far, almost every time someone raved about the company, was this:\n</p><p>\n<strong>\n“You pick up the phone!  I can reach a real person.”\n</strong>\n</p><p>\nThey called and got a real person on the 2nd ring, instead of an automated call-routing system.\nOr they emailed and got a surprisingly helpful personal reply, instead of an impersonal scripted FAQ response.\n</p><p>\n<strong>\nAnd that was it.\n</strong>\nWho could have guessed?\nThat despite all efforts put into features, pricing, design, partnerships, and more, <strong>clients would choose one company over another mainly because they liked their customer service</strong>.\n</p><p>\nI structured the business to match this priority.\nOut of 85 employees, 28 people were full-time customer service.\n</p><p>\nSince then, many entrepreneurs and interviewers have asked for my customer service tips and tricks, but I recently realized it’s not something you can add on top, it’s really a philosophy — a mindset that has to come from the core.\n</p><p>\nI’m no expert on the subject, but I’ve learned a few things from 16 years of experience, so here are the 6 key mindsets that I think guide great customer service:\n</p><p>\n<em>\n(Actually, I prefer the term <strong>“client care”</strong>, since <strong>“client” implies a relationship, instead of “customer”, which is transactional.</strong>\nBut I’ll use the normal term instead of confusing things by using mine.)\n</em>\n</p>\n<hr />\n<h3>\n#1: You can afford to be generous\n</h3>\n<p>\nThe #1 most important mindset to start with, underlying everything, before engaging in communication with a customer or client, is that <strong>your business is secure</strong>.\n</p><p>\nEven if it’s not, you have to feel that it is.\nMoney is coming your way.\nYou are doing well.\nYou are one of the lucky ones.\nMost are not so fortunate.\nYou can afford to be generous.\n</p><p>\n<strong>\nAll great service comes from this feeling of generosity and abundance.\n</strong>\n</p><p>\nThink of all the examples of great service you’ve encountered.\nFree refills of coffee.\nLetting you use the toilets even if you’re not a customer.\nExtra milk and sugar if you need it.\nA employee that spends a whole hour with you to help answer all your naive questions.\n</p><p>\nContrast it with all of the bad experiences you’ve had.\nNot letting you use the toilets without making a purchase.\nCharging an additional 50 cents for extra sauce.\nSalespeople who don’t give you a minute of their time because you don’t look like big money yet. \n</p><p>\n<strong>All bad service comes from a mindset of scarcity</strong>, feeling like they’ll go out of business if they don’t fiercely guard their bottom line.\n</p><p>\nThey say the reason those in poverty so often stay in poverty is that short-term thinking of desperate survival doesn’t leave room to think of long-term solutions.\n</p><p>\nIf you really feel secure, abundant, that you have plenty to share, then this feeling of generosity will flow down into all of your interactions with customers.\nShare.\nBe nice.\nGive refunds.\nTake a little loss.\nYou can afford it. \n</p><p>\nOf course <strong>it’s also just smart business</strong>.\nLosing 10 cents on extra sauce can mean winning the loyalty of a customer who will spend $1000 with you over the next 10 years, and tell 20 friends that you’re awesome.\n</p>\n<hr />\n<h3>\n#2: The customer is more important than the company\n</h3>\n<p>\nThink of a time where you had to make a big decision.\nFor example, the choice between a job that pays more money versus another that pays less but gives more freedom.\n</p><p>\nDo you remember how it felt when you were conflicted between these two choices?\nWeighing pros and cons, going back and forth?\n</p><p>\nThe way you resolved this was to finally <strong>decide which value was more important to you</strong>.\nFor example: more money or more freedom.\n</p><p>\nMost of us don’t decide which value is most important to us until we’re forced to make this decision.\n</p><p>\nBut if you want great customer service, you need to <strong>make this value choice up-front, and decide that your customer’s happiness is your top priority</strong>, above company profitability, then make sure that everyone in the company knows this and acts upon it.\n</p><p>\nYou can’t micro-manage the details of every possible scenario, so make sure everyone in the company knows that whenever they have to make decision about what is the right thing to do,<strong>always do what’s best for the customer, what would make them the happiest, and don’t worry about the company</strong>.\nThe customer is more important than the company.\n</p>\n<hr />\n<h3>\n#3: Customer service is a profit center\n</h3>\n<p>\nCompanies put so much energy into sales — getting people to buy — but they don’t put as much effort into the customer experience <strong>after people buy</strong>.\n</p><p>\nAnyone can see the reason to focus on getting customers to buy.\nIt’s obvious profit.\nBut it takes some wisdom, experience, and long-term thinking to understand that <strong>\nkeeping your existing customers thrilled is even more profitable\n</strong>.\n</p><p>\n<strong>\nCustomer service is not an expense to be lessened.\nIt’s a core profit center, like sales.\n</strong>\nIt’s something you <strong>put the best people on</strong>, not the cheapest.\n</p><p>\nYou’ve heard the old business truism that <strong>it’s 5 times harder to get a new client than it is to get repeat business from an existing client</strong>, so this is where you put it into practice.\n</p><p>\nHire the sweetest most charming people and make sure they have all the time in the world to spend with your clients, making sure they’re so heard, and so happy with your service, that they’ll tell everyone they know.\n</p><p>\nHire enough people so that they have the time to pick up the phone, instead of routing people into an automated system.\nIf they’re so busy that their communications are getting too succinct, it’s time to hire another.\nIt’s worth it.\n</p>\n<hr />\n<h3>\n#4: Every interaction is your moment to shine\n</h3>\n<p>\nProbably only 1% of your customers or clients ever bother to make a customer service interaction.\n</p><p>\nSo when they do, this is your time to shine.\n<strong>\nThree minutes spent talking with them is going to shape their impression of your company more than your name, price, design, website, or features all combined.\n</strong>\nThis is your shining moment to be the best you can be, to <strong>blow them away with how cool it was to contact you</strong>.\n</p><p>\nIf your customer service is taught to be <strong>efficient</strong>, it sends the message, “I don’t really want to talk with you. Let’s get this over with quick.”\n</p><p>\nSince that’s what everyone else does, do the opposite.\n<strong>\nTake a few inefficient minutes to get to know anyone who contacts you.\n</strong>\n</p><p>\nFor example, at CD Baby, if someone would call, saying, “I’d like to talk with someone about selling my music through you,” we’d say, “Sure. I can help. What’s your name? Cool. Got a website? Can I see it? Is that you on the home page there? Very cool. Is that a real Les Paul? Awesome. Here, let me listen to a bit of the music. Nice, I like what you’re doing. Very syncopated. Great groove. Anyway... so... what would you like to know?”\n</p><p>\nFrom my own experience of being a self-promoting musician for 15 years, I can tell you that it’s very hard to get anyone to listen to your music.\nSo when someone takes even a couple minutes to listen to you, it’s so touching that you remember it for life.\n</p><p>\nThis isn’t some sales technique, <strong>it’s just good human behavior</strong>.\nIt makes life better.\nIt makes work more fun.\nIt’s the right thing to do.\nAnd it pays off.\n</p><p>\nWhen people would call to buy music, we’d ask them where they heard of the artist, not in some monotonous scripted way, but as part of engaging the customer in a little conversation, sincerely interested in the details, maybe asking if they often discover new music that way, or whatever.\nThen we’d include these details in the order on the backend, so the musician could see it, too.\nIt helped the musician be more connected to their fans, and helped both them and us understand why people were buying music.\n</p><p>\n<strong>\nImagine what you’d do if Paul McCartney called\n</strong>.\nYou’d drop everything, gush some praise, be thrilled that he’d contact you at all, and give him all the time in the world for whatever he wants.\nSo that’s how we should treat everyone that contacts us.\nWhy not?\nYou don’t have time?\nMake time.\n<strong>\nIt’s how everyone deserves to be treated.\n</strong>\n</p><p>\nYou know there’s research that says that we don’t smile because we’re happy.\nWe smile first, and the physical act of smiling makes us happy.\nSo I think the act of acting your best, being sincerely interested in others, taking the time to make each person happy, even if you weren’t in the mood at first, is a great way of actually being your best.\n</p>\n<hr />\n<h3>\n#5: Lose every fight\n</h3>\n<p>\nCustomer service often starts when someone has a problem, and is upset.\n</p><p>\nBut kind of like you need to feel secure for your business to be generous, you need to feel secure enough to lose every fight.\n</p><p>\nWhenever they’re upset, let them know that they were right, and the company was wrong.\nThey win.\nYou lose.\nAnd you’re prepared to <strong>do whatever it takes to make them happy again.</strong>\n</p><p>\nI’m saying this, but let’s admit that it’s so hard to turn off our human nature to feel things are directed at us — to lash back, and show them they’re wrong, to not lose this fight.\nOccasionally, still, I start typing a response that’s not so nice, but after years of getting burned for doing that, I catch myself, and replace it with something angelic instead.\n</p><p>\nBut you know that scene in the movies, where someone is saying something nasty or secret, and then realizes their microphone is on, so they immediately straighten up, correct themselves, and say the publicly-acceptable thing instead?\n</p><p>\nWell, <strong>your microphone is on</strong>.\nThere is no private communication in customer service.\nAnything you say is likely to be put onto someone’s blog or Facebook, retweeted, and seen by everyone.\n</p><p>\nSo you must <strong>be the best version of yourself</strong>.\nYou must let them win every fight.\nYou must humbly bow to your superior, and make them happy.\nAnd kinda like I said about how smiling makes you happy, I think the act of doing this every day is very peaceful.\nIt feels like <strong>daily empathy practice</strong>.\n</p><p>\nOver the years, my company had some huge evangelists: people who loudly told everyone they met that they absolutely must use CD Baby to sell or buy their music.\nFunny thing is, when I’d look back through that person’s history of communication, I’d often find out that the first time they contacted us, they were loudly upset about some problem.\nI think the lesson learned is that <strong>loud people are loud people, whether complaining or praising</strong>, so when you get some loud complaint, take it as an opportunity to do whatever it takes to make them so happy that they become a loud evangelist.\n</p>\n<hr />\n<h3>\n#6: Rebelliously right the wrongs of the world\n</h3>\n<p>\nYou know there’s this little passive-aggressive move we all do, when we don’t like how someone is behaving, we instinctively “take the high road” to show them how to behave?\n</p><p>\nLike if someone is talking too loudly in a quiet place, you speak extra-quiet to them.\nIf someone is being a complete slob, you clean up your zone before confronting them.\n</p><p>\nIt’s a kind of defiant act that says, “No. You’re doing it wrong. Here. Watch me. I’ll show you how it’s done.”\n</p><p>\nWell, I think <strong>your business is your little part of the world where you can right all the wrongs of the world, and show them all how it’s done.</strong>\n</p><p>\nTo do this, you need to be rebellious.\n<strong>\nDon’t follow norms.\n</strong>\nDon’t do what the other businesses are doing.\nInstead, think of the worst you’ve experienced, and do the opposite.\nShow them how wrong they were.\nIt’s very cathartic.\n</p>\n<hr />\n<p>\nWhat do you think?\nDid I miss any important ones?\nI’d love to hear any suggestions.\n</p>\n<img src=\"/images/onphone.jpg\" alt=\"girl on phone by Mark Roy\" />\n<div>(Photo by <a href=\"https://www.flickr.com/photos/electricnerve/3136696489\">Mark Roy</a>.)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"64429daa5e093369c2cba42137bfabc0bd507970464d0a8878ced8ab1859e057","category":"default"}