{"title":"Getting out of a bad state of mind","link":"https://sive.rs/bad","date":1422748800000,"content":"<p>\nThe last time I was in really bad state of mind, I used these five steps to get out of it.\nI’ve shared this with a few friends in a similar situation, and they said it helped.\nI hope it works for you too.\n</p>\n<p><strong>\n1.\nAsk myself what’s wrong in this very second.\n</strong></p><p>\nAm I in physical pain or danger?\nNo.\nI’ve got mental pain, but that’s just me imagining things or remembering things.\nNone of it is real.\n</p><p> If I put aside the mental torture I’m giving myself, the only thing that’s real is this physical moment.\nIs it so bad?\nNo.\nIt’s not perfect, but not horrible.\nI look around and appreciate that I’m not in hell.\nIt’s a nice place, nice trees, nice food, and has some nice people.\n</p><p>\nOf course the mental anguish is still there, but this question is a nice reminder that the pain is all in my head.\n</p>\n<p><strong>\n2.\nObserve now. Act later.\n</strong></p><p>\nWhen I’m feeling cloudy, my decisions and actions will be cloudy too.\nSo I wait a few days before acting on anything.\nI watch the emotions pass by like a thunderstorm.\nAnd the longer I wait, the <a href=\"https://sive.rs/walkways\">smarter I get</a>.\n</p>\n<p><strong>\n3.\nRaise standards.\nSay no to anything less than great.\n</strong></p><p>\nWhen I’m down, I avoid anyone who doesn’t rejuvenate me.\nThey’re not allowed in my life right now, not even for a minute.\nNo big explanation needed.\nNo compromise.\nNo favors.\n</p><p>\nEverything I’m doing that isn’t good for me.\nEverything I’m eating or drinking that isn’t making me more healthy.\nPeople who are “fine” or who I “kill time” with, but don’t actually love and enjoy?\nNope.\nNot good enough.\nI say no.\n</p><p>\nRaising the bar not only gives me a huge feeling of self-worth, but also empties my time.\nEmpty time helps me think clearly, because there’s more time to process and reflect.\n</p><p>\nEmpty time has the potential to be filled with great things.\nTime filled with little things has little potential.\n</p>\n<p><strong>\n4.\nFocus on my goal\n</strong></p><p>\nThe empty space from #3 helps me remember what I’m really doing with my life.\n</p><p>\nCreating, learning, improving, whatever.\nIt’s the ten-year-plan type of stuff.\nClearing the clutter helps me see the horizon.\n</p><p>\nIt’s a huge energy-filled feeling of “Oh yeah! That’s where I’m going! I had forgotten! I can see it now! Let’s go!”\n</p><p>\nFocus helps me say no, because once you can clearly see where you’re heading, you’re less likely to let anything get in your way.\n</p>\n<p><strong>\n5.\nDo all the necessary stuff\n</strong></p><p>\nWhen I’m upset, I don’t feel like doing anything but wallowing in it.\n</p><p>\nBut despite feeling that way, I brush my teeth, make healthy meals, take the kid out to play, do the dishes, pay the bills, take my vitamins, clean up, and go to bed early.\n</p><p>\nThese tasks are so mundane, but they help me to feel on top of things.\nWhen everyday responsibilities are done, my mind is less distracted.\n</p><p>\nWhen I ask, “What’s wrong right now?” — and I see this clean house, paid bills, and happy child — I can answer “nothing!”\n</p><p>\nGoing through the motions, even though I don’t feel like it, is peaceful.\nI think and process in the background as going about real life.\n</p><p>\nIt’s a great reminder that I have to eat, even if I’m not feeling hungry.\nI have to clean the house, even if my mind is a mess.\nI have to sleep, no matter what!\n</p><p>\nLike #1, above, this step separates the mental anguish from the physical reality.\nIt keeps me focused on what’s real versus what I’m just imagining.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"64d95ba732b7f694209b2344fefa2259c04b653bfab94a1abd16d3991905baaa","category":"Sites"}