{"title":"Intermittent Social media fasting","link":"https://om.co/2024/07/30/intermittent-social-media-fasting/","date":1722386560000,"content":"<p>As a diabetic, my life is a constant balance between hypoglycemic and hyperglycemic levels—and proper food consumption is key to maintaining steady blood sugar levels. Work, travel and access to the right kinds of food determine how successfully I can keep my sugar levels in my desired range. </p>\n\n\n\n<p>At the start of the pandemic lockdown, I decided to embrace intermittent fasting. Losing weight wasn’t the primary motive; instead, I wanted to bring some discipline to when and how much I ate during the day. Using the simple methods of eating first in an 11-hour window and then extending the fast to 16 hours and reducing my eating window to 8 hours, I found an optimum place where my blood sugar levels are always in the preferential range. Every so often I extend the fast to 18 hours or even 20 hours.</p>\n\n\n\n<p>I haven’t lost significant weight — just a few pounds here and there. Of course, other factors have helped me get off insulin, but the biggest benefit has been control. The real advantage of intermittent fasting has been my ability to manage when I eat, how much I eat and, most importantly, what I eat.</p>\n\n\n\n<p>I have been wondering if “intermittent fasting” as a concept can be applied to “information diet.” It’s an idea worth exploring, and this coming week is perfect to try it out. I’m traveling for a small photo adventure and will have spotty coverage. That means I can’t reach for the phone for anything other than listening to audiobooks or music. I don’t have any social apps on my phone. And I’m not traveling with my laptop — just my iPad, which will stay in the room. This should help me limit my use of the internet, social media and everything frivolous. </p>\n\n\n\n<p>I am hoping my blog is my primary conduit — including sharing some photos. I hope you are subscribed to my photo email newsletter. Anyway, why am I thinking about “fasting” from social media? Or rather all of “media”? It’s because social media is an “engagement” game driven by “dunking” and derision. Even people I respect and listen to have started to sound tinny. Most of us aren’t self-aware enough to realize that the more we speak, the less we say. </p>\n\n\n\n<p>It’s starting to be infested with misinformation and AI-generated content. The utility is rapidly declining, and I think controlling or avoiding it altogether is a good way to keep my mind fresh. I use Readwise’s Reader app, and it surfaces many long-form reading recommendations daily. </p>\n\n\n\n<p>I follow enough bloggers to find good, in-depth articles to read and enjoy. I have my own information flows. My plan is to completely eschew news and just focus on editorial outputs that educate, inform and make me think. </p>\n\n\n\n<p>Bob Lefsetz in <a target=\"_blank\" href=\"https://lefsetz.com/wordpress/2024/07/29/the-united-states-of-cults/\">his latest newsletter gives</a> a very good reason to opt out of popular media (conventional and social). </p>\n\n\n\n<blockquote>\n<p>Have you listened to Joe Rogan’s podcast? Can you name two songs from Taylor Swift’s latest album? Can you name one member of BTS? Are you even on Twitter/X, never mind eating up every word Elon Musk utters? Are you one of the 130,000 on the Kamala Harris Zoom call?</p>\n\n\n\n<p>Odds are you can’t or you aren’t. Large odds. The above represent cults, and they get overblown coverage in traditional media, giving an inaccurate picture of what is truly going on. And if you question anything about the object of devotion, you will be excoriated, to the point where most people don’t even try, because they can’t endure the hate.</p>\n</blockquote>\n\n\n\n<p>This is what dominated our media. It doesn’t matter if it’s a third-rate AI rewriting website or The New York Times. </p>\n\n\n\n<p>** </p>\n\n\n\n<p>I am excited to try this “information intermittent fasting” experiment. Let’s see how it goes. </p>\n\n\n\n<p><strong>July 29, 2024. The Palouse, Washington </strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"65b01f7539c01d8cb31d53c8ae230062c1bb110554e6e98a0bced70a02875d29","category":"default"}