{"title":"What feels real enough to share","link":"https://www.garbageday.email/p/what-feels-real-enough-to-share","date":1728324217000,"content":"<div><div><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/2b824f67-6e73-43c0-83c9-80ff90182b46/ELECTION_ROSTER.png?t=1728323107\" /></div><p>We’re inching closer to the Garbage Day Live election special!!! Over the next few issues, I’ll be announcing a new guest. First up is Magdalene Taylor, writer and culture critic. She’s contributed for places like <i>GQ</i>, <i>New York Mag</i>, and <i>VICE</i> and she has a <a href=\"https://magdalene.substack.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">great newsletter</a> you should already be reading. </p><p>If you haven’t picked up tickets for Garbage Day Live, <b><a href=\"https://www.eventbrite.com/e/garbage-day-presents-america-the-final-season-tickets-1020816809557?aff=odwdwdspacecraft&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">here’s a link</a></b>! Tickets are moving pretty fast. It’s <b>October 23rd</b> at the <b>Bell House in Brooklyn</b>. I’ve got a lot of fun surprises lined up. Plus, this specific show is about the election so it’s literally never going to happen again. <b><a href=\"https://www.eventbrite.com/e/garbage-day-presents-america-the-final-season-tickets-1020816809557?aff=odwdwdspacecraft&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">Here’s that link again!</a></b></p><hr /><h2>It Doesn’t Matter If It Isn’t Real</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/705bc8d5-57a0-448d-8c3d-52acf85b35f1/Screenshot_2024-10-07_at_10.24.41_AM.png?t=1728311093\" /><div><span><p>(Facebook)</p></span></div></div><p>Late last week, a set of AI-generated images of a little girl and a dog being rescued from a flood — and one of the dog <a href=\"https://www.facebook.com/ThePaducahInsider/posts/pfbid02D9dCGb1pk8i5YEBt1LTa8BJhXQSjiSNs24Z2H5awS97wu9GMFuSFF63JfCMYhZmdl?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">rescuing</a> the little girl — started going viral on Facebook and quickly spread to other social networks like X and YouTube. Meta, to give them a modicum of credit here, started cracking down on these specific images, which now have an “altered photo” warning and a fact-check widget you have to read before looking at it.</p><p>Before they were thoroughly fact-checked, though, they were <a href=\"https://x.com/O_Rob1nson/status/1841851124770332967?ref_src=twsrc%5Etfw&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">shared by</a> a bunch of prominent right-wing users, including Laura Loomer, author Buzz Patterson, and RNC committeewoman Amy Kremer. With Kremer <a href=\"https://x.com/AmyKremer/status/1841928828576272548?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">writing</a> on X, “This picture has been seared into my mind. My heart hurts.”</p><p>In case you’re out of the loop on right-wing talking points, Republicans — including former President Donald Trump — are using the current devastation from Hurricane Helene <a href=\"https://www.nbcnews.com/politics/donald-trump/false-claims-fema-disaster-funds-migrants-pushed-trump-rcna173955?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">as a political wedge</a>, going after FEMA relief efforts and flooding the zone with misinformation. So these AI images fit nicely into their broader narrative.</p><p>Finding out where these images originated proved pretty impossible. Facebook search is very bad and, now, so is Google reverse image search. But it’s likely they were generated as an engagement hack and first surfaced in Facebook’s <a href=\"https://www.facebook.com/hashtag/northcarolina?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">#NorthCarolina tag page</a>. Which, along with other state-level tag pages for the region, has turned into an information hub for recovery and rescue efforts. Which is unfortunate because the tag page is also full of more, unlabeled AI slop, misattributed videos of other natural disasters, and unhinged conspiracy theories. There’s a particularly prevalent one that started on TikTok and is now <a href=\"https://www.facebook.com/reel/890033189303811?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">being shared</a> on Reels claiming that the flooding was not from the hurricane, but actually man-made because, uh, idk something about lithium deposits and AI companies. It doesn’t matter. There’s <a href=\"https://www.facebook.com/TheNCBeat/posts/pfbid02bXoeETuiSJDzSAhukmjJeB1BArbVKmFezB2go7zHJAAAbWPWGhKyErtHa7ohvXvkl?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">another version</a> going around claiming it’s the federal government that did the flooding, etc., etc. Like I said, it doesn’t matter.</p><p>And it doesn’t matter because the users sharing both the AI-generated photos and the conspiracy theories truly do not care if they’re actually real. For instance, after Kremer’s X post got a community note she got both defensive and dismissive about it, <a href=\"https://x.com/AmyKremer/status/1841938191454240782?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">writing</a>, “I’m leaving [the image up] because it is emblematic of the trauma and pain people are living through right now.” Which is basically how most Republicans have been dealing with any kind of fact check since 2015: “This thing I saw online that manipulated my emotions and tricked me into sharing it as real may not be real, but it represents something that is real so who cares.” Writer Parker Molloy <a href=\"https://x.com/ParkerMolloy/status/1842007949922758888?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">has a good collection</a> of other conservatives all posting the same thing more or less.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/9f359847-05ba-4583-a472-7643f3ea22c1/Screenshot_2024-10-07_at_11.11.06_AM.png?t=1728313878\" /><div><span><p>(Facebook)</p></span></div></div><p>Beyond the vibes-based view of reality that many Facebook users have seemingly adopted over the last decade, there is another issue with fact-checking this kind of content. For the people who share these posts, the fact check is only proof that “they” don’t want you to see it. Whoever “they” is. For instance, there’s another image circulating on Facebook (which also now has an “altered photo” warning) that has been shared over 160,000 times, depicting Trump wading through flood waters personally helping residents. And the caption on it, of course, reads, “I don't think Facebook wants this picture on Facebook. They have been deleting it.”</p><p><i>The Verge</i>’s Nilay Patel recently summed up the core tension here, <a href=\"https://www.threads.net/@reckless1280/post/DAr7oVvIaze/?xmt=AQGzUQsLoH4lMdVccGuF5qgfGteopxk1oMPiX7_idZDwLA&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">writing on Threads</a> about YouTube’s own generative-AI efforts, “Every platform company is about to be at war with itself as the algorithmic recommendation AI team tries to fight off the content made by the generative AI team.” And it’s clear, at least with Meta, which side is winning the war. This week, Meta proudly <a href=\"https://ai.meta.com/research/movie-gen/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">announced </a>a new video-generating tool that will make AI misinfo even more convincing — or, at least, better at generating things that <i>feel</i> true. </p><p>And there’s really only one way to look at all of this. Meta simply does not give a shit anymore. Facebook spent most of the 2010s absorbing, and destroying, not just local journalism in the US, but the very infrastructure of how information is transmitted across the country. And they have clearly lost interest in maintaining that. Users, of course, have no where else to go, so they’re still relying on it to coordinate things like hurricane disaster relief. But the feeds are now — and seemingly forever will be — clogged with AI junk. Because you cannot be a useful civic resource and also give your users a near-unlimited ability to generate things that are not real. And I don’t think Meta are stupid enough to not know this. But like their own users, they have decided that it doesn’t matter what’s real, only what feels real enough to share.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2><span>Some Good T-Pain Content</span></h2><blockquote><p></p><p>Auto What??</p><p></p><a href=\"https://twitter.com/tpain/status/1842233864992764257?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\"><p> — T-Pain (@TPAIN) <br /> 4:02 PM • Oct 4, 2024 </p></a></blockquote><hr /><h2>We’ve Hit The Influencer Stage Of The Election</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/f1d0ca2e-7381-46c6-a436-06fee999c28b/Screenshot_2024-10-07_at_12.41.00_PM.png?t=1728319270\" /><div><span><p>(<a href=\"https://x.com/antii__dote/status/1842888007973536087?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">x.com/antii__dote</a>)</p></span></div></div><p>Over the weekend, Trump brought Elon Musk out at a rally in Butler, Pennsylvania, where Musk did a fucked up <a href=\"https://x.com/margbaramerica/status/1842713100807524586?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">little weird jump</a> and made the already rancid vibe much worse. As comedian W. Kamau Bell <a href=\"https://x.com/wkamaubell/status/1842759943214317886?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">wrote</a> of Musk’s horrid nerd dance, “The world suffers because this giant dork doesn’t feel comfortable being like this all the time… a lonely nerd who was born on third base but still had to buy friends.” </p><p>Getting Musk to join Trump on stage is a big coup for the Republicans, though, not just because the two men actually seem to hate each other personally. Musk, after shattering his reputation as the benevolent “I fucking love science” guy, is, ostensibly, just an influencer now, arguably the biggest right-wing influencer in the world. And so, he’s doing exactly what an influencer would do, and is now running a <a href=\"https://x.com/elonmusk/status/1843133043961381178?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">scammy payola scheme</a> to pay people to register to vote in swing states.</p><p>The Democrats have also decided to finally call in the heavies. The Harris campaign is on a full media blitz this week, as well, with appearances on <i>The View</i>, <i>The Late Show With Stephen Colbert</i>, <i>The Howard Stern Show</i>, and, most importantly, the <i>Call Her Daddy</i> podcast.</p><p>Harris’ <i>Call Her Daddy</i> interview has not being well-received by the “daddy gang,” who, I imagine, all threw their phones down in disgust when they got the notification at their various tailgate parties yesterday. A swarm of women all seemingly named Kiley<a href=\"https://www.instagram.com/p/DAy67oZKdNV/?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\"> are roasting</a> the episode in the comments on Instagram. Jokes aside, it’s a big deal. <i>Call Her Daddy</i> is one of the biggest podcasts in the country and easily the <a href=\"https://x.com/maxwelltani/status/1843321013691683041?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">biggest concentrated</a> bipartisan audience of young women Harris is going to find. Though, the daddy gang’s accusations of the episode being “propaganda” aren’t entirely unfounded. I largely agree with <i>New York Mag</i> writer EJ Dickson, <a href=\"https://x.com/ejdickson/status/1843337093633982687?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">who wrote</a>, “It was both a good interview, and not a real interview. Both of these things can be true at the same time.”</p><p>Either way, while we can’t really know how effective the interview was at moving the needle, it has, at least, <a href=\"https://www.thedailybeast.com/fox-and-friends-ainsley-earhardt-worries-kamala-sounded-too-good-on-call-her-daddy?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">worried</a> some of the hosts of <i>Fox &amp; Friends</i>. Which is nice, I guess. </p><hr /><h2>Let’s Talk About The Fandom Focus Groups</h2><p><i>Variety</i> <a href=\"https://variety.com/2024/tv/news/star-wars-lord-of-the-rings-bridgerton-toxic-fans-hollywood-response-1236166736/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">published</a> a huge story last week about “superfan focus groups” that different movie studios are organizing to figure out how to deal with their aging franchises. There aren’t a ton of details about what these focus groups are actually doing, but there was one interesting nugget in the piece: Several studios have engaged with fans during production and altered things to appease them. The piece also makes clear that we’re not talking about canon or lore, but things like queer representation or the casting of people of color in lead roles.</p><p>I <a href=\"https://www.garbageday.email/p/marques-brownlee-s-hot-new-app?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">wrote about this</a> recently, but I think the ship is already beginning to turn when it comes to appeasing online fans. I think the largest franchises and studios will take the longest to shift, mainly because they can’t admit the gold rush is over and they’re too big to react quickly. (Which is why they’re now bringing in fans to rescue these projects.) Though, the Funko Pop era of mass entertainment might come crashing down faster than you’d think, seeing as how <i>Joker 2 </i><a href=\"https://www.thewrap.com/joker-folie-a-deux-crashes-to-morbius-level-40-million-box-office-opening/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">is doing worse</a> at the box office than <i>Morbius</i> or <i>The Marvels</i>. Should’ve brought the fans in for that one, I guess.</p><hr /><h2>Fat Bear Week Has Taken A Dark Turn</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/935c34e8-c17f-41e6-85de-b1c3038f7107/Screenshot_2024-10-07_at_1.18.38_PM.png?t=1728321528\" /><div><span><p>(<a href=\"https://explore.org/fat-bear-week?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">explore.org/fat-bear-week</a>)</p></span></div></div><p>Fat Bear Week, the annual competition held by Katmai National Park in Alaska, had to take a brief delay last week after one of the fat bears, 469, ate another one of the fat bears, 402. I guess, I did not know that bears eat other? But apparently, it’s a thing.</p><p>Making things worse for Fat Bear Week, the bear-on-beer violence was caught on the competition’s official livestream. If that’s something you’d like to learn more about, <a href=\"https://www.npr.org/2024/10/01/nx-s1-5134907/fat-bear-week-start-delayed-bear-killed?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">this NPR article</a> has an embed of the stream. Rangers at Katmai confirmed to NPR that they don’t plan on punishing the cannibal bear, which would, obviously, be weird if they did because it’s a bear and it does not know that it’s in an internet competition.</p><hr /><h2>It’s All Kicking Off In The Snoopy Fandom</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/e4595ba1-8748-4288-8597-febb89226584/GZS6k2VX0AA47JZ.jpeg?t=1728321850\" /><div><span><p>(<a href=\"https://x.com/snoopyweekly?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">x.com/snoopyweekly</a>)</p></span></div></div><p>A fan account on X for Snoopy posted, and then deleted, an endorsement for Trump over the weekend. They also <a href=\"https://x.com/AGoldmund/status/1843304036210192796?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">shared AI-generated art</a> of Snoopy shaking hands with a <i>Peanuts</i>-ified Trump.</p><p>This has sent shockwaves through the apolitical Snoopy fandom. As podcaster Jamie Loftus <a href=\"https://x.com/jamieloftusHELP/status/1843171932860248409?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">pointed out</a>, if you’re looking for a good, not right-wing Snoopy fan account to follow, you should be following <a href=\"https://x.com/DailySnoopys?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">@DailySnoopys</a>, which has not entered the culture war yet.</p><hr /><h2><span>A Good Post</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/641419dd-8505-4d55-96e3-fcafea137c0d/Screenshot_2024-10-07_at_9.50.43_AM.png?t=1728309060\" /><div><span><p>(<a href=\"https://x.com/corcorancommons/status/1842286693413474329?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">x.com/corcorancommons</a>)</p></span></div></div><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.statsignificant.com/p/does-avatar-have-no-cultural-footprint?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">“Does </a><a href=\"https://www.statsignificant.com/p/does-avatar-have-no-cultural-footprint?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\"><i>Avatar</i></a><a href=\"https://www.statsignificant.com/p/does-avatar-have-no-cultural-footprint?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\"> Have No Cultural Footprint? A Statistical Analysis”</a></p></li><li><p><a href=\"https://www.gq.com/story/galaxy-gas-brainrot-era?utm_source=pocket_shared\" target=\"_blank\">“How Galaxy Gas Became the Defining High of the Brainrot Era”</a></p></li><li><p><a href=\"https://pitchfork.com/features/article/the-lost-promises-of-hyperpoptimism/?utm_source=pocket_shared\" target=\"_blank\">“The Lost Promises of Hyperpoptimism”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://www.tiktok.com/@chestergeroo/video/7417985844986039598?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=what-feels-real-enough-to-share\" target=\"_blank\">furry opera</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=a2b120fc-2989-47f0-b470-32fc08cf7dd7&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"663a42302463520ae7ce0b00dedfd2211227bc0a63d627a195ff1c08c2fc3247","category":"Sites"}