{"title":"How to Give Away a Fortune","link":"https://kottke.org/24/06/how-to-give-away-a-fortune","date":1719251750000,"content":"\n        <p>Marlene Engelhorn inherited millions from her family and <a href=\"https://guterrat.info/en/\">decided to give much of it away</a> (€25 million). She formed an independent council called Guter Rat für Rückverteilung (“good council for redistribution”) made up of 50 randomly selected Austrians chosen to reflect the makeup of the Austria’s population, and they decided <a href=\"https://guterrat.info/en/die-ergebnisse/\">where to direct the money</a>. <a href=\"https://guterrat.info/en/mission-statement/\">Engelhorn’s mission statement</a> is worth a read:</p>\n\n<blockquote><p>Democracy is about cultivating relationships: a society works on doing well. And a society is doing well when the people in that society are doing well. At the moment, this does not apply to everyone: wealth, assets and property are distributed unequally and unfairly. And so is the power in our society.</p>\n\n<p>In Austria, the richest one percent of the population hoards up to 50 percent of the net wealth. This means that one hundredth of society owns just under half of the wealth. And 99 percent of people have to make do with the other half. Almost four million households struggle to get by every day. And the one percent? Most of them have simply inherited.</p>\n\n<p>We are talking about dynasties that amass wealth and power over generations. They then withdraw from our society as if it were none of their business. I also come from such a dynasty. My wealth was accumulated before I was even born. It was accumulated because other people did the work, but my family was able to inherit the ownership of an enterprise and thus all claims to the fruits of its labour.</p>\n\n<p>Wealth is never an individual achievement. Wealth is always created by society. A few people get rich because they buy other people’s time and profit from it. Because they have a patent on a product that others urgently need. Because they buy a piece of land that increases in value and because society builds infrastructure around it. In the process, they destroy the environment to harvest the resources.</p></blockquote>\n\n<p>Fascinating idea. (via <a href=\"https://www.nytimes.com/2024/06/19/world/europe/marlene-engelhorn-heiress-fortune.html?smid=threads-nytimes\">ny times</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Marlene%20Engelhorn\">Marlene Engelhorn</a> · <a href=\"https://kottke.org/tag/money\">money</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/06/how-to-give-away-a-fortune\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"66787b7b95720e28c9090ab1f4006f537ea03a6e911e95acf20988b927b31a87","category":"default"}