{"title":"I’m AirChatting","link":"https://om.co/2024/04/15/im-airchatting/","date":1713207910000,"content":"<p>There have been multiple attempts to create a new social network that tries to mimic Twitter as a short-text-oriented real-time platform ever since Twitter (nee X) started to fray. Mastodon is the choice of the proponents of the Indie web; BlueSky, a network promoted by Twitter co-founder Jack Dorsey, and Warpcast, which has its roots in the decentralized web ethos. Facebook’s Instagram introduced Threads and so far has emerged as a real option for those who are tired of Twitter’s increasing presence of bots, spam, and degradation of quality. </p>\n\n\n\n<p>However, a new option emerged this past week, which not only improves the current options but also charts a brand new course for itself. In doing so, it is showing how software and services will evolve in the age of “AI.” I have not been this excited about a social app in so long as I am about the newly re-launched AirChat. It is the brainchild of old Silicon Valley hands, Naval Ravikant and Brian Norgard. Naval, most recently the co-founder of AngelList, andNorgard, the former chief product officer at Tinder</p>\n\n\n\n<p>This is the relaunch of the app, which initially wanted to become an option to Clubhouse, a voice-only platform in the past. That didn’t stick — but the new version takes the lessons from the early experiments and has come up with what seems like a winning formula. The new version of AirChat works on the core premise — it is easier to speak than to write. However, it is easier to consume lots of information by reading (and listening).</p>\n\n\n\n<p>At first glance, AirChat has an interface that is inspired by Twitter. Some of its behavioral dynamics are also familiar — like, retweet, follow, and respond. There is hardly any handholding required. It also has “direct messaging” built into its experience. Where it is different is that — you don’t really type into the app — you hold a button and talk to the app. You can talk as long as you want — the app is using “AI” to transcribe the voice notes into “text” and display them on the screen. When you scroll past a user’s post, it speed reads you back the original voice note. </p>\n\n\n\n<p>I have been using the app for a few days. I am not posting as much as I am learning about it. My first impression of AirChat is that it is first and foremost, a social app, which is actually social. It has nailed the user interface and it is all about “chat” as a primary mode of interaction. The speed with which they use machine intelligence to convert voice to text, and the ease with which you can post and reply to the “chats” is perfectly executed. </p>\n\n\n\n<p>In the early days of Instagram, the founders knew that they had to give people the impression that their photos were uploaded and available in the app instantly, no matter the network’s conditions. That was such a crucial differentiator — a moment of instant delight. You can see the same dynamic at work with AirChat. When you are recording, you can see the transcribed text rolling back, but it is faded out. Your brain equates that to ‘transcription is happening.’ The speed of posting and reading is such a motivator to continue using the chat. </p>\n\n\n\n<p>And the best part is that it is going to get better. AirChat is not only fine-tuning its models by taking our voice notes, but it is also creating a personalized model that will probably allow the app to become adaptable to varied accents and voice inflections. There is just so much about this app that I like. I think this is a great example of an AI-enhanced app that helps us bridge from the mobile interface to a future interface where there is much less reliance on a keyboard, mouse, and screen.</p>\n\n\n<div>\n<figure><a href=\"https://www.air.chat/om\"><img width=\"1024\" height=\"729\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-1024x729.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-1024x729.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-300x213.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-768x547.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-192x137.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-1100x783.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile-560x399.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AirChatProfile.jpg 1290w\" /></a></figure></div>\n\n\n<p>The best part of the app is that it actually pushes you to be intentional and very selective in who you follow and how many you follow. If you follow too many, then it becomes the tower of Babel. It becomes very noisy and you start to lose the impact of people, their voices, and their humanity. </p>\n\n\n\n<p>If you want to AirChat with me, I am @om on the app. </p>\n\n\n\n<p><em>April 15, 2024. San Francisco</em></p>\n\n\n\n<hr />\n\n\n\n<h4>From the archives: </h4>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/gigaom/day-traders-angels-and-venture-capital-the-internet-changes-everything-including-money/\">Day traders, angels and venture capital: The internet changes everything, including money</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"66d914411faed1aa35ba2a84ab9df749d0b21c00237f2241c232c24b60fab559","category":"default"}