{"title":"Four Futures","link":"https://www.usv.com/writing/2024/12/four-futures/","date":1734535342000,"content":"<p>We are in a moment where the future is both wildly exciting and highly uncertain. The acceleration of AI has created a new paradigm of possibilities but also fundamental questions we can’t yet answer. Will we continue speeding towards exponentially growing and continually (potentially self-)improving technology indefinitely or will plateaus, short or long term, slow the train down? Are the upcoming asymptotes near or far away? Will we wind up with a closed ecosystem where single or few rulers reign or an open ecosystem where many models compete and create opportunities on top of them? </p>\n\n\n\n<p>The future state and greatest opportunities are likely determined by the two axes central to these questions: rate of advancement and the openness of the frontier models. Rate of advancement indicates how quickly models advance their capabilities towards a self-improving intelligence explosion. Faster advancement means escape velocity is achieved in the next few years, whereas slower advancement would be if one or more plateaus are encountered that delay explosive self-improvement for a decade or more.</p>\n\n\n\n<p>Openness is about how much power is held by models and how much profit they can extract as a result. On the open end of the axis, open models are (nearly) as good as closed ones, or alternatively there are many heavily competing closed models of similar quality. In either case on this side models will not be able to capture much of the economics. Closed by contrast means that a few companies with closed models are far ahead and can capture much of the value creation.</p>\n\n\n\n<p>While new opportunities will exist across scenarios, we believe the quadrant we land in is likely to dictate what projects, approaches, and types of businesses are most advantaged. </p>\n\n\n\n<figure><img src=\"https://storage.googleapis.com/papyrus_images/2459467a5b89122240463cb5811af3a7.png\" /></figure>\n\n\n\n<p><br /><strong>Fat models: lower left quadrant</strong></p>\n\n\n\n<p>There has always been a tension and relationship of value between the infrastructure and application layers. In 2016, Joel Monegro, then a USV analyst, published a blog post called <a target=\"_blank\" href=\"https://www.usv.com/writing/2016/08/fat-protocols/\"><u>Fat Protocols</u></a>: “the Internet stack, in terms of how value is <em>distributed,</em> is composed of “thin” protocols and “fat” applications. As the market developed, we learned that investing in applications produced high returns whereas investing directly in protocol technologies generally produced low returns.” Instead, in the blockchain stack, this relationship reversed, with more value accruing to the protocols. As AI emerges as a dominant new platform, we again need to figure out this relationship and weighting–does the bulk of value sit with the model or the applications built on top? </p>\n\n\n\n<p>In the bottom left quadrant, a world where we continue accelerating the speed of progress in the models and wind up in a closed ecosystem, the models accrue nearly all the value. The more models can do themselves, the less we’ll need apps built on top of them or other models to fill in niches they haven’t covered. </p>\n\n\n\n<p>In this scenario, the dominant players will be the small number of giant foundational models and the infrastructure they need to continue to effectively scale. We will need huge quantums of energy (ideally including new forms of more efficient energy.) New opportunities to build and manage this infrastructure–in hardware, software, and energy production–will create massive value. USV portfolio companies like <a target=\"_blank\" href=\"https://www.radiantnuclear.com/\"><u>Radiant</u></a>, <a target=\"_blank\" href=\"https://blixt.tech/\"><u>Blixt</u></a>,<a target=\"_blank\" href=\"https://www.lydianlabs.com/\"><u> Lydian</u></a>, or <a target=\"_blank\" href=\"https://glow.org/blog/what-is-glow\"><u>Glow</u></a> fall in this quadrant in evolving energy generation and management. There will also be opportunity for counterpositioned model architectures that are making bets on different approaches being the right paths to ultimately winning markets, like decentralized training. </p>\n\n\n\n<p><strong>Defensible niche models: top left quadrant</strong></p>\n\n\n\n<p>In the top left quadrant, the ecosystem is closed but acceleration slows down, allowing opportunity for niche models to emerge that cover gaps in ability of foundational models. We are seeing quite a bit of this now–biotech, <a target=\"_blank\" href=\"https://www.abridge.com/\"><u>healthcare</u></a>, robotics, <a target=\"_blank\" href=\"https://www.hume.ai/\"><u>sentiment analysis</u></a>, personal data sets, physical world data are all examples of opportunities for niche models, some of which we’ve already invested in at USV. Here, data is more specific and targeted than in the generalist models and, often, utility is, too. By shrinking scope and increasing specificity, accuracy and utility can increase. In the world of this quadrant, we continue to see dominant niche models across many categories grow and become important foundations to build on top of. </p>\n\n\n\n<p><strong>Network effect applications: upper right quadrant</strong></p>\n\n\n\n<p>In the upper right quadrant, the rate of progress in the foundation models slows down and the ecosystem is open. Models have gaps in their abilities and more specific scope, leaving room for startups to productize AI into applications that sit on top. </p>\n\n\n\n<p>This outcome is familiar territory for the venture ecosystem. It becomes as much a challenge of imagination as technology. The opportunity is to dream up how to evolve our interactions with AI to change how we work and live. We envision new applications, enablement layers, and interfaces that transform <a target=\"_blank\" href=\"https://www.duolingo.com/\"><u>how we learn</u></a>, <a target=\"_blank\" href=\"https://consensus.app/\"><u>research</u></a>, deliver and receive care, <a target=\"_blank\" href=\"https://glif.app/glifs\"><u>create</u></a>, <a target=\"_blank\" href=\"https://apps.apple.com/us/app/status-sims-but-social-media/id6596771144\"><u>play</u></a>, interact with one another, perform tasks, and <a target=\"_blank\" href=\"https://soona.co/ai\"><u>manage elements of our businesses</u></a>. More direct agentic paths to the user, learner, patient, or customer will likely dramatically adjust cost curves and create access. As in previous cycles, many builders will go after the same set of opportunities and so network effects, whether through users or data, will be a critical component in accruing and protecting value. </p>\n\n\n\n<p><strong>“Actually open AI”: bottom right quadrant</strong></p>\n\n\n\n<p>If models accelerate quickly but within an open ecosystem we wind up with the wildest scenario of all: lots of super smart and rapidly improving models all interacting with each other at high volume and skill. Here, the many open models themselves accrue value as they become dominant in their corners of the market but they all require tooling to interact with one another. In a highly skilled agentic world, agents will need to transact with each other frequently. Crypto may emerge as the easiest and most flexible digital currency for agents, benefitting tokens themselves, decentralized infrastructure, and protocols where agents can interact like <a target=\"_blank\" href=\"https://www.farcaster.xyz/\"><u>Farcaster</u></a>. Imagine lots of agents with wallets and budgets transacting in a digital economy.  </p>\n\n\n\n<p>This framework is no doubt oversimplified. The advantaged approaches in each quadrant have opportunities to win across scenarios. Primarily, products that enable new behavior, create new forms of access, and inspire users to adopt them will create outsized value. But these quadrants have helped our team think through “what has to happen for this approach to be most advantaged?” in a moment of particularly outsized unknowns. </p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/12/four-futures/\">Four Futures</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Rebecca Kaden","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"6706e9a4a2d8a382396ac0f5c6351d518bb465a1b559ab5d134a1e368daba283","category":"Sites"}