{"title":"Mediaeater Digest Vol 30, No. 144","link":"https://ghuneim.com/2024/05/23/mediaeater-digest-vol-30-no-144/","date":1716466040000,"content":"<p><a href=\"https://www.ft.com/content/23fab126-f1d3-4add-a457-207a25730ad9\"><span>Meta AI chief says large language models will not reach human intelligence</span></a><span>. (FT) At an event in London on Tuesday, DeepMind’s chief Sir Demis Hassabis said what was missing from language models was “they didn’t understand the spatial context you’re in . . . so that limits their usefulness in the end”.</span></p>\n<p><a href=\"https://www.ftc.gov/policy/advocacy-research/tech-at-ftc/2024/05/cars-consumer-data-unlawful-collection-use\"><span>Cars &amp; Consumer Data: On Unlawful Collection &amp; Use</span></a><span>  (FTC)  Car manufacturers—and all businesses—should take note that the FTC will take action to protect consumers against the illegal collection, use, and disclosure of their personal data. Recent enforcement actions illustrate this point:</span></p>\n<p><a href=\"https://arxiv.org/pdf/2401.13138\"><span>Visibility into AI Agents</span></a><span> (arxiv) </span><span>Visibility informs actions to manage risks from the deployment of increasingly agentic systems, but is not by itself sufficient. Even with a comprehensive understanding of agent activities, those harmed by them may not have the power to intervene and reduce risks. To best make use of visibility, future work could investigate increasing public influence over AI development and </span><span>deployment,  developing a wide range of potential policy levers, and implementing infrastructure and practices to prevent or defend against harms</span></p>\n<p><a href=\"https://newscorp.com/2024/05/22/news-corp-and-openai-sign-landmark-multi-year-global-partnership/\"><span>News Corp</span></a><span> and </span><a href=\"https://openai.com/index/news-corp-and-openai-sign-landmark-multi-year-global-partnership/\"><span>OpenAI </span></a><span>today announced a multi-year agreement. So far, Axel Springer has secured a $30 million, three-year deal, while the Financial Times landed a $10 million per year agreement. Rupert Murdoch has netted a substantial rate of $50 million per year, but this covers a bundle of at least seven publications. OpenAI is currently offering between $7 million to $10 million per year per publication as the prevailing rate in the industry. For more context, it would take an 100’s of thousands of deals to satisfy what was stolen. Lastly, getting in early is crucial; the last one in line will face the least favorable deal terms. Lastly if you were an IP rights holder suing them…. Also no word on how Rupert might integrate this with his spy craft. </span></p>\n<p><span>DOJ Ticketmaster <a href=\"https://www.justice.gov/news\"> (DOJ)</a>. <a href=\"https://www.justice.gov/live\">Live and direct at 11 AM  EDT </a>   Also DOJ more music news,  Purported Rap Promoter Pleads Guilty to Role i<a href=\"https://www.justice.gov/opa/pr/purported-rap-promoter-pleads-guilty-role-23m-nationwide-fraud-conspiracy\">n $2.3M Nationwide Fraud Conspiracy</a>.  (ouch “purported”). </span></p>\n<p>DOJ and Ticketmaster: A Timeline<br />\n– 1976: Ticketmaster is founded.<br />\n– 1991: Ticketmaster merges with Front Line Management; DOJ investigates and allows the merger with conditions.<br />\n– 2010: Ticketmaster merges with Live Nation to form Live Nation Entertainment; DOJ approves with conditions to foster competition.<br />\n– 2019: DOJ launches an investigation into Live Nation Entertainment for potential violations of the 2010 merger conditions.<br />\n– 2023: January: Senate Judiciary Committee holds a hearing on competition in the ticketing industry, fueled by controversy surrounding Ticketmaster’s handling of Taylor Swift’s tour tickets.<br />\n–  May 23 -2024 <a href=\"https://www.justice.gov/opa/pr/justice-department-sues-live-nation-ticketmaster-monopolizing-markets-across-live-concert\"> DOJ files a new lawsuit against Live Nation Entertainment, alleging antitrust violations and anti-competitive practices “It is time to break it up”.</a></p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"671f70f646819891e03e680bb8078904ff6ee625da62a83ff99801cfce69f68b","category":"default"}