{"title":"Taboola + Apple News? No thanks","link":"https://om.co/2024/07/16/taboola-apple-news-no-thanks/","date":1721160519000,"content":"<p>I’ve been a happy Apple One customer. It made perfect sense to sign up for the package considering I was paying for Apple TV+, Apple Music, and iCloud storage. For an extra couple of dollars, I could get Apple News+, so I thought why not. That ended today when I learned that Apple had <a href=\"https://www.axios.com/2024/07/16/taboola-apple-news-deal\" target=\"_blank\">struck a deal with Taboola</a>, a company known for serving low-quality ads next to web content. I decided to cut bait.</p>\n\n\n\n<p>I have gone back to iCloud storage and Apple Music. I like Apple Music because it has high-resolution music, isn’t as heavy-handed as Spotify, and most importantly, doesn’t time out like Qobuz. What was a $37-a-month subscription is now down to about $22 a month.</p>\n\n\n\n<p>For over a decade, I have <a href=\"https://om.co/2022/11/29/musk-overload/\" target=\"_blank\">been critical of Taboola</a> (and its one-time rival, Outbrain), equating them to the internet’s venereal disease that never goes away. In 2017, when the two companies merged, it became clear that what was the herpes of the internet was mutating into a superbug. <a href=\"https://x.com/om/status/858028321304719361\">I said as much on Twitter</a>. Well, that day has come, and even Apple is now infected.</p>\n\n\n\n<p>No way I want to pay to let Taboola and its terrible advertising re-enter my information streams. Apple’s decision to strike a deal with Taboola is shocking and off-brand — so much so that I have started to question the company’s long-term commitment to good customer experience, including its commitment to privacy. As it chases more and more revenue to appease Wall Street, it’s clear Apple will become one of those companies that prioritize shareholders over paying customers and their experience.</p>\n\n\n\n<p><strong>Added/Updated</strong> <strong>on July 18, 2024</strong>: If you look at Facebook’s ARPU in the U.S. and Canada, it is hovering around $54 or about $4.50 a month. There’s no way Apple News and Stocks are as good at monetizing from advertising or have the market power to extract better advertising pricing. If they did, then they wouldn’t be partnering with Taboola. It makes more sense for Apple to charge a few dollars more from its Apple News customers and eschew all advertising. That’s almost a better business decision and actually maintains brand integrity.</p>\n\n\n\n<p><strong><em>July 16, 2024. </em></strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"674c607cd52c3fe0d6cc59c2fdaad055e18bdd1b8924a1d0ebfbcde248823368","category":"default"}