{"title":"Of pencils and pens","link":"https://bradbarrish.com/2024/04/10/of-pencils-and-pens/","date":1712789013000,"content":"<p>I watched <a href=\"https://www.youtube.com/watch?v=bLwo1kOcwxs\">Adam Savage talk about a pencil</a> for nearly twenty minutes. He’s the kind of person who can make an interesting and engaging video about a pencil for nearly twenty minutes, and I am the kind of person who watches, despite knowing what the punchline will be, until the very end.</p>\n\n\n\n<p>This is made all the more strange by the fact that I don’t like pencils. I never have. If it had not been for all of the Scantron bubbles I had to fill in with a No. 2 pencil, I might not have ever used them in school. The one and only exception is woodworking or other maker stuff. For that, I use a carpenter pencil. I’ve been saying for decades that pencils are for people who are afraid to commit. It’s <em>kind of</em> a joke.</p>\n\n\n\n<p>While I don’t like pencils and am therefore not fussy about them, I am fussy about pens. I buy one kind of pen and buy them in bulk because I want them everywhere I might need them. Unlike Adam, I don’t generally lose or misplace them, but when that happens, I don’t sweat it because I know I have boxes of others.</p>\n\n\n\n<p>I don’t know exactly why the Zebra Sarasa Retractable Clip Gel Pen 0.4 mm with black ink is the best pen. The smooth, quick-drying black ink is a delight. The satisfying springy click of the ink cartridge is a good substitute fidget toy for when I don’t have a small alligator clip around. The weight of the 0.4 mm line is certainly a good balance for all kinds of paper. The rubber grip is nice. The clip means it can attach securely to the outside of a notebook or pad of paper. Nearly every other pen I’ve tried (and I’ve tried many) just isn’t as good. I feel like I can count on <a href=\"https://en.wikipedia.org/wiki/Zebra_%28pen_manufacturer%29\">Zebra</a>, a privately-held Japanese company that only makes writing instruments, to maintain quality more than PaperMate, a subsidiary of <a href=\"https://en.wikipedia.org/wiki/Newell_Brands\">Newell Brands</a>, a U.S.-based public company that owns a laundry list of brands.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"676c1b36a86401947d71067d4a79cb0adf1c5a22d78f7d09c190a8b083e8c478","category":"Sites"}