{"title":"MED Vol.30, No.132","link":"https://ghuneim.com/2024/05/11/med-vol30no132/","date":1715426995000,"content":"<div>\n<div>\n<p>Random notes…</p>\n<p><strong>Music is always first, always. </strong></p>\n<p>Surviving the first wave of digital disruption on the first beachfront gave me the tools needed to understand shifts across all sectors, with web1, web2 and now three.  The learnings in the arbitrage of disruption of music provided super digital powers for those who did not fight, but embraced and reshaped, though the insights from hand to hand combat.</p>\n<p><span>Our music model </span><span><a href=\"https://twitter.com/elevenlabsio\">@elevenlabsio </a></span><span> is coming together! <a href=\"https://twitter.com/i/status/1788630726532899266\">Here’s a very early preview. </a></span><span>Here we have full lyrical generation at full song length. The accelerators dropping each day in this category that move the creative process further downstream is astonishing,  It’s no wonder Lucian Grange TikTok deal points for UMG had AI in the mix, I look forward to seeing the enforcement mechanisms. </span></p>\n<p><span><strong>Current state of the internet:</strong>  Large and small companies working on solving for understanding individual indent by inferring it though process like tutoring and learning. </span></p>\n<p><span>We will see prompting fade as intent ascends, some LLMs are already doing this like Anthropic. By empirical observation the tacit understanding that search was search-and- destroy your thought process through multiple options. We lived like that for two decades. </span>The alliteration of words that start with C have now added words like ‘context’ to the mix.</p>\n<p><span> My head hurts.  Some recent links</span></p>\n</div>\n<p><a href=\"https://www.semafor.com/article/05/10/2024/as-states-take-on-ai-techs-top-lobbyist-fights-back\">As states take on AI, tech’s top lobbyist fights back</a> Q: How much are you and people in Washington focused on the election and possible AI involvement in election interference? A: People are worried about it. But it won’t be until something pretty significant happens and that gets a ton of attention, that the general public will focus on it a lot. Of course, we’re trying to make sure that doesn’t happen.</p>\n<div>\n<p><a href=\"https://cdn.openai.com/spec/model-spec-2024-05-08.html#dont-respond-with-nsfw-content\"><span>OpenAI Model Spec</span></a><span>  (openai) </span><span>We believe developers and users should have the flexibility to use our services as they see fit, so long as they comply with our usage policies. We’re exploring whether we can responsibly provide the ability to generate NSFW content in age-appropriate contexts through the API and ChatGPT. We look forward to better understanding user and societal expectations of model behavior in this area.  </span></p>\n</div>\n<p>DESCRIPTION:<a href=\"https://openai.com/\">We’re streaming live at 10AM PT on Monday, May 13</a> to demo some ChatGPT and GPT-4 updates.  1PM EDT</p>\n<div>\n<p><a href=\"https://www.bloomberg.com/news/articles/2024-05-11/apple-closes-in-on-deal-with-openai-to-put-chatgpt-on-iphone\"><span>Apple Nears Deal With OpenAI to Put ChatGPT on iPhone</span></a><span> (bloomberg) </span><span>Move is part of push to add AI features to Apple devices Company also held talks with Google about using Gemini</span></p>\n<p><a href=\"https://www.cbsnews.com/video/randy-travis-sings-again-courtesy-of-ai/\"><span>Randy Travis sings again, courtesy of AI</span></a><span>  (cbs) </span>In 2013 country singer Randy Travis suffered a massive stroke, which paralyzed his right side and damaged an area of his brain that controls speech and language. He has not quite recovered the ability to sing, but working with singer James DuPre and a computer program that creates an AI-generated version of his voice, Travis and his longtime producer Kyle Lehning have created a new song, “Where That Came From,” that captures Randy’s country heart. Lee Cowan reports.    — at last happy use cases…</p>\n<p><a href=\"https://www.scientificamerican.com/article/ai-doesnt-threaten-humanity-its-owners-do/\"><span>AI Doesn’t Threaten Humanity. Its Owners Do</span></a><span>  (scientific america) </span><span>In fact, that information harvesting is the whole business model of our digital and smart-device-enabled world. All of our habits and behaviors are monitored, reduced to “data” for machine learning AI, and the findings are used to manipulate us for other people’s gains. </span><span>It doesn’t have to be this way. AI could be used more ethically for everyone’s benefit. We shouldn’t fear AI as a technology. We should instead worry about who owns AI and how its owners wield AI to invade privacy and erode democracy.</span></p>\n<p><a href=\"https://www.facebook.com/business/news/Introducing-Enhanced-Gen-AI-Features-and-Other-Tools-to-Help-Build-Your-Business\"><span>Introducing Enhanced Gen AI Features and Other Tools to Help Build Your Business</span></a><span> (meta) </span><span>We’re launching enhanced generative AI features for advertisers, such as full image and text generation, and introducing additional tools and services to help businesses like yours grow.</span></p>\n<p><a href=\"https://drive.google.com/file/d/1BU5bV3X5w65DwSMapKcsr0ZvrMRU_Nbi/view?pli=1\"><span>Do large language models need sensory grounding for meaning and understanding?</span></a><span>  (nyu paper)  </span><a href=\"https://openreview.net/pdf?id=BZ5a1r-kVsf\"><span>A Path Towards Autonomous Machine Intelligence Version 0.9.2, 2022-06-27</span></a><span>  (openview)</span></p>\n<p><a href=\"https://www.billboard.com/pro/ai-deepfakes-beware-copyright-infringement-cost-big-money/\"><span>AI Deepfakes Beware: Copyright Infringement Can Cost Up To $150,000 Per Copied Work</span></a><span> (billboard)</span></p>\n</div>\n</div>\n<p><a href=\"https://www.nytimes.com/2024/05/10/style/westminster-dog-show-agility.html\">The Unwanted Shelter Dog Who Found His Way to Westminster</a>. (nyt)</p>\n<p> </p>\n<div>\n<div>\n<p><em>MED = Mediaeater Digest publishing links since 1993</em></p>\n</div>\n</div>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"676f1803ec2612deda912919ebaa082826df12c1be644928dc2caf6f0d75cecb","category":"default"}