{"title":"The Galapagos and the Meaning of Life: A Young Woman’s Bittersweet Experiment in Inner Freedom","link":"https://www.themarginalian.org/2024/10/22/dore-strauch-floreana/","date":1729638053000,"content":"<p><a href=\"https://www.amazon.com/Satan-Came-Eden-Survivors-Galapagos/dp/1497424321/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_Satan.jpg?fit=320%2C480&amp;ssl=1\" alt=\"The Galapagos and the Meaning of Life: A Young Woman’s Bittersweet Experiment in Inner Freedom\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_Satan.jpg?w=667&amp;ssl=1 667w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_Satan.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_Satan.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_Satan.jpg?resize=240%2C360&amp;ssl=1 240w\" /></a></p><p>“We may think we are domesticated but we are not,” Jay Griffiths wrote in her <a href=\"https://www.themarginalian.org/2024/10/13/dont-waste-your-wildness/\">homily on not wasting our wildness</a>, insisting on the “primal allegiance” the human spirit has to the wild.</p>\n<p>A decade after artist Rockwell Kent headed to a remote Alaskan island <a href=\"https://www.themarginalian.org/2022/02/15/rockwell-kent-wilderness/\">“to stand face to face with that infinite and unfathomable thing which is the wilderness,”</a> a young German woman headed to an even smaller island on the opposite side of the globe to face a wilderness even more fierce and fathomless, living out her primal allegiance to the undomesticated soul, searching for the fruition of her spiritual ideals.</p>\n<p>Having grown up with the haunting sense that she was “somehow not like other children,” feeling a “special intimacy” with wild nature not usually seen in those born and raised in cities, <strong>Dore Strauch</strong> (1900–1943) was eighteen and training to be a teacher when she fell under the spell of Nietzsche’s <em>Zarathustra</em> and felt the calling to some higher purpose, though she could not discern what it might be. </p>\n<p>Watching the world come aflame with its first global war, moved by “the frightful distress” of the working classes, she grew convinced that the higher development of humanity “can never come from the outside” — that no prophet can promise it and no demagogue can deliver it; that it is the inner work of each individual. She was determined to do her part, “whatever the cost.” </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?resize=680%2C593&amp;ssl=1\" width=\"680\" height=\"593\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?w=1012&amp;ssl=1 1012w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?resize=320%2C279&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?resize=600%2C523&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?resize=240%2C209&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian1.jpg?resize=768%2C669&amp;ssl=1 768w\" /><figcaption>Dore Strauch</figcaption></figure>\n<p>Dore decided to become a doctor and enrolled in night school to prepare for the university entrance exam. She might have withstood the seventeen-hour workdays had she not decided to live on fruit alone after reading Schopenhauer and finding herself moved by his “discountenancing the destruction of life for human nourishment,” eventually reducing her diet to figs only. After a year and a half of this morally cloaked eating disorder, her body started giving way. </p>\n<p>Just as Dore was trying to decide what to do next, she met a “cheerless bachelor” twice her age and married him, determined “to thaw him out with sunshine,” only to learn one of the hardest lessons in life — that unless we love who a person is and not whom we wish them to be or hope to make them, it is not love but projection destined for heartbreak. At twenty-three, she found herself “the wife of an elderly schoolmaster” who repulsed her with his conjugal demands and his desire to make of her an accessory to appear on his arm at social functions high-heeled and gowned — the perfect housewife, “her horizon bounded by the four walls of a few stuffy rooms, her mind stunted to the scope of her husband’s paltry opinions.” She would later reflect:</p>\n<blockquote><p>With all the strength and obstinacy in me, I defended myself against being turned into something I had always passionately despised… The emptiness and frustration of such an existence poisons the spirit, however one may strive to counterbalance it.</p></blockquote>\n<p>The poison hit deep. Dore fell gravely and mysteriously ill. After a seventeen-month hospitalization, she was diagnosed with multiple sclerosis and told her illness was incurable. “This was a blow,” she later wrote, “but it shocked me less than the realization that my marriage was a failure, and beyond repair.”</p>\n<p>People come into our lives when we need a way out of them, out of self-erected prisons and back to ourselves. Dore found herself falling in love with her attending physician, Dr. Frederick Ritter — with his love of Nietzsche, with “his astonishing blond mane, his youthful bearing, and his steel- blue eyes that looked out from under his furrowed forehead so compellingly,” with the little black notebook he showed her, in which he had logged some of the world’s remotest islands as possible destinations for realizing “his great ideal of solitude.”</p>\n<p>They were in love — a Rilkean love in which the highest task of each is to <a href=\"https://www.themarginalian.org/2018/09/03/rilke-love-marriage/\">“stand guard over the solitude of the other”</a> — and they set out to find those ideal solitudes together as far from the bourgeois traps of their culture as they could get on this planet. </p>\n<p>It was pioneering oceanographer <a href=\"https://www.themarginalian.org/2023/08/19/william-beebe-half-mile-down/\">William Beebe’s</a> landmark volume on the Galapagos that persuaded them to seek their idyll on the islands where Darwin had first conceived the evolutionary cohesion of nature, originally known as the Enchanted Islands — a land so alien that it had never been inhabited by native tribes. “I believe that these islands are in truth one of those places of the earth where humans are not tolerated,” Dore would later write, having lived the proof.</p>\n<figure><a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=680%2C945&amp;ssl=1\" width=\"680\" height=\"945\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=320%2C445&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=600%2C834&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=240%2C334&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=768%2C1068&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_finches_TheMarginalian.jpg?resize=1105%2C1536&amp;ssl=1 1105w\" /></a><figcaption>Five species of Galapagos ground finches from William Beebe’s <em>Galapagos: World’s End</em>, 1924. (Available as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>The lovers buried themselves in the stacks of the Berlin Public Library, reading everything they could get their hands on about the Galapagos in order to choose a particular island. </p>\n<p>They settled on Floreana — a volcanic burp smaller than Brooklyn, favored by the whalers of the previous century for its flat terrain and ample supply of freshwater. </p>\n<p>In a living antidote to the dangerous myth that contemplation is a luxury of the privileged — here was a woman of humble means, ailing with multiple sclerosis, having survived a World War and a suffocating marriage — Dore reflects in her striking memoir <a href=\"https://www.amazon.com/Satan-Came-Eden-Survivors-Galapagos/dp/1497424321/?tag=braipick-20\" target=\"_blank\"><strong><em>Satan Came to Eden: A Survivor’s Account of the “Galapagos Affair”</em></strong></a> (<a href=\"https://search.worldcat.org/title/890327485 \" target=\"_blank\"><em>public library</em></a>):</p>\n<blockquote><p>How few, if any, of the millions struggling along the world’s ways, have ever had or sought the opportunity to find themselves. The leisure after the day’s work is not devoted to this higher learning. Time that the wise would spend in meditating on these things is spent at movies, cafes and theaters, created as if by malicious design to hinder contemplation.</p>\n<p>Frederick and I rejected all these things and were determined to fight our way to inner freedom in spite of all the hindrances of civilized life.</p></blockquote>\n<p>They were not trying to be modern Crusoes. This was not be a mere experiment in “Puritan self-denial, of repudiation of the flesh in a search for higher spiritual values.” They were going to Floreana not to escape life but to contact the substratum of its deepest meaning, “to try and found an Eden not of ignorance but of knowledge.”</p>\n<p>And so, in the first week of summer in 1929, with Dore disguised as a man to avoid identification, they headed for Ecuador. Packed in alongside mosquito netting and matches were Dore’s Greek and Latin textbooks, a small volume of animal fables, and what she considered her “greatest treasure”: her heavily underlined, marginalia-laden copy of <em>Zarathustra</em>. She didn’t tell her mother that she intended never to come back. She didn’t formally divorce her husband. She made no will.</p>\n<p>Dore reflects in her memoir:</p>\n<blockquote><p>I felt, in spite of all my deep affection for those dear to me, that in leaving them forever I was not uprooting my real self but only an outward part of me that did not count.</p></blockquote>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=680%2C993&amp;ssl=1\" width=\"680\" height=\"993\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=320%2C467&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=600%2C876&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=240%2C350&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=768%2C1121&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/DoreStrauch_TheMarginalian.jpg?resize=1052%2C1536&amp;ssl=1 1052w\" /><figcaption>Dore and Frederick on the way to the Galapagos</figcaption></figure>\n<p>In consonance with Wendell Berry’s insistence that <a href=\"https://www.themarginalian.org/2014/12/17/wendell-berry-pride-despair-solitude/\">“in the wild places… one’s inner voices become audible,”</a> Dore could feel even before she set foot on Floreana how the part of her that counts the most, the wild and true voice of the soul, was about to come alive in a way it never could have in so-called civilization: </p>\n<blockquote><p>I shall never forget the first view of Ecuador as we sailed slowly into the deep bay of Guayaquil. The coast is fringed with dense thickets of mangrove interrupted by settlements where groves of cocoanut palms waved over the heads of the other trees, amidst which cows, donkeys and goats seemed to find plentiful pasture.</p>\n<p>[…]</p>\n<p>A brilliant early morning sun shone down on our departure from the haunts of men, as we set out upon the final stage of our long journey to the solitudes of our desire. We thought and hoped that we should never recross the broad six-hundred miles of ocean that lay between our island and the mainland. As we moved out of the little harbor and watched it receding slowly from our sight, we felt a oneness with each other which we had never felt before, and if we thought about the past at all, then it was with an utter absence of regret, and with a feeling of deep happiness and gratitude to the fate which had permitted us to approach our goal at last.</p></blockquote>\n<p>Upon arrival, they discovered that an oil leak in the ship’s hull had ruined all their books and writing paper, all the bedding, and a box of clothes. But the captain — a questionable character who had been a German spy in WWI and who frequently docked on Floreana — dropped them off with the remains of their belongings and went on his way. </p>\n<p>Alone on the desolate beach, with the dark silhouette of an extinct volcano rising above them, they took comfort in the half-demolished stone wall, rusty water tanks, and remnants of a chicken coop left behind by the Norwegian settlers who had tried living there long ago, then given up. Dore writes:</p>\n<blockquote><p>An atmosphere of extreme desolation enfolded this scene, and was increased by the almost completely dried-up, lifeless vegetation round about it. It was impossible not to think, with a qualm of fear, of all the disappointed hopes of our predecessors on this island, who probably had come there with confidence no less than ours that they would be able to make their lives according to their hearts’ desire.</p></blockquote>\n<figure><a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=680%2C980&amp;ssl=1\" width=\"680\" height=\"980\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=320%2C461&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=600%2C865&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=240%2C346&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=768%2C1107&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_fish_TheMarginalian.jpg?resize=1065%2C1536&amp;ssl=1 1065w\" /></a><figcaption>Common Galapagos fish from William Beebe’s <em>Galapagos: World’s End</em>, 1924. (Available as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>She paints the alien world that was suddenly their home, beautiful and menacing:</p>\n<blockquote><p>The landscape spread out at its feet had the gray-blue shimmer of all the Galapagos vegetation. What looked like dense thickets at the crater’s edge was much greener and fresher than the growth below. Thin streamers of clouds floated low down among the smaller craters towards the interior of the island, and at the water’s edge more volcanoes stood up straight out of the sea, steeply, though to no great height. Their rocky flanks were full of deep clefts which caught the incoming surf, so that the island was encircled by a tossing white girdle of the breaking sea. As the waves receded they revealed huge boulders of pitch-black lava.</p>\n<p>[…]</p>\n<p>The red rays of the setting sun gilded the ocean at our feet. The sharp black fins of sharks cut through the water; a thousand wild voices of unseen creatures mingled with the soft roar of the surf. With the terrifying suddenness to which I, the Northerner, never grew accustomed, the equatorial night rushed down upon us and the moon came up.</p></blockquote>\n<p>Filled as she was with “golden anticipation” at the prospect of building Eden on Earth, almost immediately Dore collapsed with an attack of her multiple sclerosis. Dr. Ritter, despite his medical training, held some dangerously antiscientific views: He believed that willpower alone could prevail over any physical condition, including her illness, and with “sheer intensity of consciousness” one could erect a wall of defense against any danger or pathogen. He had therefore refused to bring even basic medication — a decision for which Dore would later pay bitterly: teeth extracted without anesthesia, severe lacerations from the sharp lava rocks, a fire burn almost to the bone, a crippling blood infection by Floreana’s vampiric sand fleas carried by the wild swine.</p>\n<figure><a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=680%2C1001&amp;ssl=1\" width=\"680\" height=\"1001\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=320%2C471&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=600%2C884&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=240%2C353&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=768%2C1131&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Beebe_Galapagos_eels_TheMarginalian.jpg?resize=1043%2C1536&amp;ssl=1 1043w\" /></a><figcaption>Galapagos eels from William Beebe’s <em>Galapagos: World’s End</em>, 1924. (Available as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Over and over, Floreana surprised them and challenged them beyond anything they had imagined: </p>\n<blockquote><p>Our aim was to lead a life of contemplation, but we soon learned that this was something we should have to earn at the expense of arduous and protracted manual toil.</p></blockquote>\n<p>They surprised themselves and each other, this nation of two, thousands of miles from the nearest human being, having crossed the globe to discover that all true companionship is made of two parallel solitudes. Dore writes:</p>\n<blockquote><p>There could be no such thing as loneliness, for each must be complete within himself, and companionship is only perfect when it is not dependent.</p></blockquote>\n<figure><a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=680%2C903&amp;ssl=1\" width=\"680\" height=\"903\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=320%2C425&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=600%2C797&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=240%2C319&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=768%2C1020&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/Finches_exception.jpg?resize=1156%2C1536&amp;ssl=1 1156w\" /></a><figcaption>Collage from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>, using text from Darwin’s <em>Voyage of the Beagle</em> and Elizabeth Gould’s illustration of his Galapagos specimens. (Available as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/artists/brainpicker/designs?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>The story goes on to take a strange and ominous turn when a newspaper gets a hold of their letters home and makes of them the era’s equivalent of clickbait, sending the world’s wealthy voyeurs on their trail. An American yachting party arrives, then a polyamorous Austrian Baroness (the Satan in the title of Dore’s memoir) declares herself Empress of the Galapagos. Dore’s life is suddenly enfolded in a human drama that far exceeds the ills and artifices of civilization she had fled, culminating with a murder mystery and Frederick’s death. </p>\n<p>Having gone to Floreana to find the purest light of being amid the wildest nature, Dore left having seen the darkest recesses of human nature. And yet there is no wasted experience — looking back on her idealistic experiment, she reflects on its deepest lesson: </p>\n<blockquote><p>Life in the wilderness is rich in lessons most of us never have a chance to learn. It was a source of continual amazement to me to realize how civilization falsifies the lives of men and women, making it forever impossible, even for those who know each other best, to see each other as they really are.</p></blockquote>\n<p>Couple with <a href=\"https://www.themarginalian.org/2017/10/11/a-life-of-ones-own-joanna-field-marion-milner/\"><em>A Life of One’s Own</em></a> — a very different and very poignant answer to the enduring question of how we attain inner freedom by Dore’s contemporary Joanna Field — then revisit <a href=\"https://www.themarginalian.org/2024/07/16/solitude/\">200 years of great writers, artists, and scientists on the spiritual rewards of solitude</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"678e7eebc9ee506309e8ee9c89be57340ec7a92382649481f321e91e34346a4a","category":"Sites"}