{"title":"On Domain Naming","link":"https://chias.blog/2024/on-domain-naming/","date":1711353953000,"content":"<span><span>Reading Time: </span> <span>12</span> <span>minutes</span></span>\n<p>This is a republication of <a href=\"https://ambient.institute/domain-naming/\">my essay</a> written for the <a href=\"https://naive-yearly.are.na/\">Naive Yearly x Are.na</a> publication; the original essay-site is live at <a href=\"https://ambient.institute/domain-naming/\">https://ambient.institute/domain-naming/</a> and contains interactive elements that are essential to the piece’s themes on (re)defining, language, and borders. I encourage you to explore the <a href=\"https://naive-yearly.are.na/\">publication site</a> with a foreword by Kristoffer Tjalve and the <a href=\"https://www.are.na/editorial/introducing-a-new-publication-from-naive-yearly-and-are-na\">Are.na editorial post</a> with thoughts from Meg Miller.<br /><br />The essay itself is an expansion of my talk given at Naive Yearly in Copenhagen last August 2023, which was then a fragmented performance-lecture responding to Kristoffer’s prompt of ‘naming’; the essay weaves these into one (of many) reading-writings on naming. Thank you dearly to <a href=\"https://megmiller.world/\">Meg Miller</a> for editing this piece closely and <a href=\"https://kaloyankolev.com/\">Kaloyan</a> for our conversations on domain names, names, and life.</p>\n\n\n\n<hr />\n\n\n\n<p></p>\n\n\n\n<p><em>The internet is where I have always made myself.</em></p>\n\n\n\n<p>As a precocious child, I made websites.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-1-25581\"><sup>1</sup></a></span> Without much of an environment around me, I wanted to shape places for myself, and found that the internet gave me this potential.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-2-25581\"><sup>2</sup></a></span> Here, I taught myself the language &amp; code, pointing at screens and not understanding why my parents were confused when a collection of boxes was, to me, indistinguishable from <em>me</em>. Slowly nestled under any free website hosting service I could find was an accumulating corner of stories, posts, resources, and games — all things I loved and couldn’t lose, now safeguarded in a home.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-3-25581\"><sup>3</sup></a></span></p>\n\n\n\n<p>One of the first steps you take when creating a website is choosing a domain name. The domain name becomes your presence, a point of access; you are a site that people may recognize, are welcome to visit, one that is real. I took as many names as I did selves: <em>destinyzbond.webs.com</em>, <em>cirrumilus.sky-song.org, belovedhearts.webs.com, </em>each a name to my stories, a place to fill, a becoming.</p>\n\n\n\n<figure><img src=\"https://ambient.institute/domain-naming/img/Domains.gif\" /><figcaption>chia.neocities.org, a collection of my domains</figcaption></figure>\n\n\n\n<p>As I grew older, my domains began to take on a realness (<em>chiaski.com</em><span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-4-25581\"><sup>4</sup></a></span>, <em>chia.design, chias.website, chia.audio)</em>.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-5-25581\"><sup>5</sup></a></span> I was interested in how my name alone could be as vast a container as my earlier website names that leaned towards my interests and ambiguous provocations. <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-6-25581\"><sup>6</sup></a></span> The self is fragmented, and the internet affords it this complexity. We split and weave these names across spaces,marking the boundaries and lines that make the self.</p>\n\n\n\n<p></p>\n\n\n\n<p>“People determine who they are by drawing a line.”<br /><span>Luc Devoldere, translated by Astrid Vandendaele</span></p>\n\n\n\n<p></p>\n\n\n\n<p>I buy domain names when the right word or phrase resonates, incubating the space far before a tangible idea has come to mind. Technologists commonly joke about how many domain names they have in their pocket, a collection of unrealized dreams just waiting for activation. When I start thinking about these names as invitations rather than tombstones, I find that what I work on naturally settles itself into one of them, inhabiting language and perhaps even redefining it.</p>\n\n\n\n<p>A website is a site of potential.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-7-25581\"><sup>7</sup></a></span> A domain isn’t only a name, it is an invitation to start something new.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-8-25581\"><sup>8</sup></a></span> Websites have always functioned to me as translations and fragmentations of myself, ways to give form to myself through constantly re-situating and re-contextualizing across the internet. The act of construction is a practice of making the self (rather than just a re-presentation): filling a domain is assembling a new body for the self, with the site as an extension of the body, or a distillation and compression of it… Conscious of how <em>being</em> online is intertwined with distribution, presentation, marketing, but never going without making. If names are nothing and <em>naming</em> is everything, the website is the perfect medium in which I carve space, take space, and make space… A website in its infinitely republishable, malleable, transient, and perpetually unfinished nature; its accumulation of histories, a body that attempts to obscure so much of history. I think of myself like I think of a website.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-9-25581\"><sup>9</sup></a></span> At any moment, I am remaking my name and what it means. Names are functionally territories. I become a landscape.</p>\n\n\n\n<p>Decades later, these digital records are one of my only remains. I trace these sites, dissolving to time, assembling a fragmented collection of selves that tell a story of a becoming. I watch the way I carry an ever-changing girl through new containers, always outgrowing myself. At each step, I’d bare an old self, searching for a new name I could inhabit.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-10-25581\"><sup>10</sup></a></span></p>\n\n\n\n<p>Language shapes worlds and selves, drawing the territories that we then inhabit. Naming then, is placemaking: as naming identifies a domain of control, it becomes the act of domaining itself. </p>\n\n\n\n<blockquote>\n<p>All digital space is anchored in physical infrastructure. The internet cannot point to itself.</p>\n</blockquote>\n\n\n\n<p>As names point to both the online and offline, the URL/IRL divide is less blurry than one might think. Internet geographies are reroutings atop of the human world, more than they are distinct, fantastical spaces<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-11-25581\"><sup>11</sup></a></span> unconstrained by the world. Domain names collapse and reorder territories to form ones of their own through assemblages of cables, data centers, and clouds; the physical conditions that let us make ourselves malleable.</p>\n\n\n\n<p>Domain names<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-12-25581\"><sup>12</sup></a></span> function as unique identifiers that point to locations. Functionally, domain names map onto less human-readable numerical IP addresses (like 192.168.1.1), corresponding to a host server that stores a website’s content and assets. When typing in a domain name, the machine translates it into the respective numbers and addresses, then takes you to the correct server’s location. Call the website by its name, and the machine helps you get there. Here, hardware and software tuck their mechanisms underneath human language.</p>\n\n\n\n<hr />\n\n\n\n<p>Domain naming is the social, situated, and environmental practice of “naming as placemaking” on the internet, recognizing the power in words to shape worlds materially, ideologically, and socially. ‘Domaining’ draws out places and borders by naming. ‘Naming’ makes place legitimate, legible, and accessible. Enter a name to access a site. Name it and it becomes a site.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-13-25581\"><sup>13</sup></a></span></p>\n\n\n\n<p>The process of domain naming acknowledges our self-made authority to define the environments we inhabit, and thus ourselves. As we settle with language, words determine the visibility of a place’s logic. Logic in turn, is just an evaluation of language. Within these dichotomies, naming treads the line between liberation and oppression, illegibility and clarity, obfuscation and identification. </p>\n\n\n\n<p>The secret to construction (of identity<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-14-25581\"><sup>14</sup></a></span>, object, or place) has always been in naming. Language and space are interlinked, each mutating our understanding of a world and the possibilities within. Truth is revealed when it is recognized. Names are tools for recognition / memory-making / cognition / meaning-making. Like a collective contract to recognize one color as red, or to dispute for centuries over the name of a land and its authority, names as relations are always embroiled with questions of power.</p>\n\n\n\n<p>When I wanted to find myself, I made websites.</p>\n\n\n\n<p>I registered <a href=\"https://ifyouknewmewouldyoulove.me/\"><em>ifyouknewmewouldyoulove.me</em></a> in a time of reinvention, it carryied me through an era of erasure, seeing. I lean towards websites (more than newsletters or physical artifacts) precisely because they are immaterial and impermanent, but instantaneous and immanent. For many bodies, to be unseen means repression, erasure, and exploitation. Love was and is to me, about fully embracing a whole self: I thought it impossible to know all of someone without loving them. Otherwise, how would you get to that point? I wanted to be an environment, not a monument. A place where people could go, fill, address, see, and then eventually know.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-15-25581\"><sup>15</sup></a></span></p>\n\n\n\n<p>One of our primal desires is to be seen. Or more precisely, to say how we want to be seen. Naming is knowing.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-16-25581\"><sup>16</sup></a></span></p>\n\n\n\n<p><em><a href=\"https://chias.website/\">Chias.website</a></em> would hold a field of lifelong flowers, <a href=\"https://lifel.ong/\"><em>lifel</em>.<em>ong</em></a> would be the place where I could find all my friends, <a href=\"https://chia.design/\"><em>chia.design</em> would be an illegible index of all I have done and could become</a>, <a href=\"https://ambient.institute/domain-naming/ifyouknewmewouldyoulove.me\" target=\"_blank\"><em>ifyouknewmewouldyoulove.me</em></a> would be an invitation to this labyrinthine self, <a href=\"https://chia.audio/\"><em>chia.audio</em> would be a fishbowl collecting fragments of fields and sounds</a>, <a href=\"https://engine.lol/\"><em>engine.lol</em></a> a tool that would make itself, <a href=\"https://chia.pics/\" target=\"_blank\"><em>chia.pics</em></a> a series of clippings, <a href=\"https://chias.computer/\" target=\"_blank\"><em>chias.computer</em></a> a repository of all that make me. </p>\n\n\n\n<figure><img src=\"https://d2w9rnfcy7mm78.cloudfront.net/23344512/original_3747878166a7ee424a325e4c242859f3.png?1693163634?bc=0\" /><figcaption>A Google Search</figcaption></figure>\n\n\n\n<p>Each name serves as a boundary. Names serve as recognition of a place, body, or identity: drawn out from relationships and context: what we call each other, where we go towards, who we respond to. For the person I become—only once you recognize me. The name situates, letting us access sites on the internet when names point to space (as DNS protocols<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-17-25581\"><sup>17</sup></a></span> name to point &amp; recognize; turning numeric IP addresses into human-readable names), and when names prevent collisions in space (as programming languages &amp; filesystems utilize ‘namespaces’ that assign, group, and prevent collisions; preventing naming conflicts by providing unique identifiers within their scopes of control)—using names to determine relations (in what sphere is a name recognized?), control (what does the name enable?), and power (who assigns the name?). Domains are controlled territories and names draw out nations.</p>\n\n\n\n<blockquote>\n<p>Domains are controlled territories and names draw out nations.</p>\n</blockquote>\n\n\n\n<p>When I choose to make space on the internet, I place my faith in vast systems of infrastructure, care, and ecologies. I put my faith in people. All within a network of relations, an ecology of machines and places all tended by human hands, interdependent to all. Identity is infrastructure because naming unites the self and its signifiers with a site; these relations are the foundations of the worlds we can visit.</p>\n\n\n\n<p>For the computer to know where I am, and for you to reach me. From any point in the world, point at the name you remember and find me, if I’m still there, I am found again. Domain naming is self-preservation against a world that demands singular cohesion.</p>\n\n\n\n<blockquote>\n<p>“Domain naming is self-preservation against a world that demands singular cohesion.”</p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<p>Perhaps who decides what is named and what the process of naming entails <em>is</em> authority. These concerns are all the more pertinent online, where although material conditions are necessary for us to move around the internet, the concept of ‘place’ is effectively nonexistent without names reinforced by relations &amp; protocols. To cross from one site to another, one accepts its borders and conditions. Recognizing the name realizes both the thing referenced, and the authority that grants who may be identified at all.</p>\n\n\n\n<p>Take the most central institutional authority to the domain name system, ICANN (The Internet Corporation for Assigned Names and Numbers) taking over the general administration of IP addresses and top-level domains from a lone researcher named Jon Postel. Today, many top-level domains are administered by countries (such as <em>.us </em>or Tuvalu’s primary export, <em>.tv</em>), sponsors (.gov or .<em>xxx</em>), or other genericized domains (.design or .wiki). </p>\n\n\n\n<figure><img src=\"https://ambient.institute/domain-naming/img/TLD-geography.gif\" /><figcaption>Will Oremus, <a href=\"https://slate.com/technology/2013/11/internet-domain-name-map-of-the-world-us-uk-de-rule-tuvalu-missing.html\" target=\"_blank\"><em>Why You Won’t Find Tuvalu on a Map of the World’s Internet Domains</em></a></figcaption></figure>\n\n\n\n<p>The delegation of these names sweeps physical infrastructure under a rug, acting as if internet cartographies are exempt from politics, borders, and protocol biases. While the DNS system was designed to resist territorialization, it’s even more strongly coupled to physical geography today. Entire digital cultures and histories have dissolved from domain deletions, from the self to nations. <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-18-25581\"><sup>18</sup></a></span> Scaling the self contends with the hypercapitalist system of delegation, exploitative and predatory, manufacturing ‘scarcity’ for mere identifiers. <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-19-25581\"><sup>19</sup></a></span> Imperialism manifests through power struggles over in-demand TLDs. If domain names are considered as ‘natural resources,’ do we know where we inhabit? <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-20-25581\"><sup>20</sup></a></span> In the very fabric of the internet is the violence in naming, the delusion of self-extension at odds with expansionism. <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-21-25581\"><sup>21</sup></a></span></p>\n\n\n\n<p></p>\n\n\n\n<p>In knowing, we must also know the underlying expansionist goals of the internet project that underscore the promise of connection.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-22-25581\"><sup>22</sup></a></span> As I use websites and names to expand myself, I borrow addresses atop an internet that posits itself as ever-expanding, near-infinite. With no real-real space to own and conquer, we look towards the internet. With nothing in real life, I made life for myself online: was it as limitless as me?</p>\n\n\n\n<p>The internet can be traced to its imperialist U.S. roots, a military venture connecting scientists, the academe, and defense contractors.These origins underpin its infrastructures and continue to weaponize its shape: from DNS governance (the authorities that administer the provision and control of domains), ongoing platform<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-23-25581\"><sup>23</sup></a></span> centralization (where more and more internet users rely on social networking and profit-oriented platforms to maintain presences online, nestled as slashes on Facebook instead of naming their own space), to surveillance and repression (domain names provide information on the physical location of host servers to point, so can be used to loosely detect an area). All sites on the internet are tinged with a sharpness and an ever-pervasive question of who serves who. When I speak of the liberatory potential of the internet, I speak with cautious optimism: these very structures have been used to destabilize democracies, radicalize nations, and erase people. The dream of the internet did not begin with intimacy and interdependency, it began with power and subjugation. </p>\n\n\n\n<p><a href=\"https://www.theguardian.com/technology/2016/jul/15/how-the-internet-was-invented-1976-arpa-kahn-cerf\" target=\"_blank\"><em>How the internet was invented</em></a></p>\n\n\n\n<p>Borders are drawn by names, tangible or intangible, routes for wayfinding and routes for coloniality. <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-24-25581\"><sup>24</sup></a></span>Names, with all their power, are weapons themselves.</p>\n\n\n\n<hr />\n\n\n\n<p>A true reinvention of the name might involve a remaking of our protocols for knowing. A redistribution of addressing, of power, and of place. Today, names exacerbate inequities, further territorializing the internet by perpetuating the limitations of place in the real world. The internet is not the utopia it appears to be: it masks our bordered, imperfect world, not as a mirror, but a recreation absolved from the physical world’s limits – a far more dangerous presentation. </p>\n\n\n\n<p>When language is re-translation and re-situation, and when language is equated to space and place, we need to question both ends of this re-assembly… the institutions that determine the name, the objects that the names point to, and the sovereignty that all in-between may truly hold. Domain naming might be liberatory on the level of the individual who holds autonomy over a world, but on the level of larger societies, it falls to the roots and authorities that only push imperialist agendas.</p>\n\n\n\n<p>Even the language we use to describe ourselves online needs prodding: those who tend websites as worlds, gardens, and rivers, might be invited to evaluate what they are looking to carry from these real-world spaces. If language is world-shaping, why limit ourselves to the borders and failures of the offline, where existing words and languages might exacerbate inequities? Why limit the mythology<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-25-25581\"><sup>25</sup></a></span> of the internet rather than write new ones?</p>\n\n\n\n<blockquote>\n<p> “Why limit the mythology of the internet rather than write new ones?”</p>\n</blockquote>\n\n\n\n<p>Critical and poetic reimaginings of the internet require the authoring of entirely new logics. We find language to carve out landscapes, defining their curves with words, terraforming the world and its histories in tenses. Much of this practice of writing comes from inhabitation: After all, while the border is drawn with articulation, we live in looseness. We live within the self before knowing our name. We live to draw the border between ourselves and all around us. We live in states whose borders are drawn and redrawn. We live in sites that we have yet to find the language and write the poetry for. </p>\n\n\n\n<p>Domain naming invites us to inhabit worlds so emergent and unnamed, that to refer to things, we might only be able to point.<span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-26-25581\"><sup>26</sup></a></span> Language is laggy, boundless, bounded, overlapping, constrained, situated, uttered anywhere, everywhere, embedded, becoming. Extending ourselves onto a website might not only be an interior, individual practice of preservation, but part of a broader non-linear history <span></span><span><a href=\"https://chias.blog/2024/on-domain-naming/#easy-footnote-bottom-27-25581\"><sup>27</sup></a></span> that welcomes many visibilities, each with countless lines and opacities.</p>\n\n\n\n<p>I know that whatever place I end up in, I will find a way to make it a home. I know that for a name to be truly known, it must be inhabited. A name is not just sounded, it must be lived. </p>\n\n\n\n<hr />\n\n\n\n<p>What’s in your name?</p>\n\n\n\n<p>When you ask the name of someone next to you, attempt to truly know it.<br />(Don’t just remember it politely, know them.)</p>\n\n\n\n<p>How are you using your name to border yourself?</p>\n\n\n\n<p>What names have you taken that you’ve truly felt you’ve filled?</p>\n\n\n\n<p>Does the potential of anonymity on the internet inspire you?</p>\n\n\n\n<p>How do we recognize the place and geography of the internet, whilst simultaneously recognizing that what we build does not have to map cleanly towards real-world geographies?</p>\n\n\n\n<p>Call the world you live in something new.</p>\n\n\n\n<p>What words do we use? What words do we ignore? </p>\n\n\n\n<p>What words do we need to use in new ways?</p>\n\n\n\n<p>What name do you want to become? </p>\n\n\n\n<p>What name do you want to kill?</p>\n\n\n\n<p>Do you have the language to reinvent a world?</p>\n\n\n\n<p>How do we engage in a way of seeing and naming that stands as cognizant, optimistic, and agentic?</p>\n\n\n\n<p>How might we become cognizant of the imperialist, expansionist desires underneath names?</p>\n\n\n\n<hr />","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"67fcc551a1ed010ec169adce1aa5b24c0834c659e392356a03101ffa0df88fd4","category":"Sites"}