{"title":"Migration to Ghost has commenced","link":"https://bradbarrish.com/migration-to-ghost/","date":1710056761000,"content":"<p>If you're reading this, it means I <em>at least</em> got the DNS correct and bradbarrish.com is now pointing to an Ubuntu server with <a href=\"https://www.vultr.com/?ref=9576890\">Vultr</a> where I installed <a href=\"https://ghost.org/?ref=bradbarrish.com\">Ghost</a>.  This is the second time I've done this, which is more a testament to Ghost's good documentation on self-hosting than it is my technical skill. I still had to get some help from ChatGPT when I was having an issue with MySQL.</p><p>I spent last night and today importing my WordPress posts on a dev server, but I realized a couple of things that caused me to hesitate to import everything at once. The first thing is that I have many posts that I just don't care to import—a lot of titleless link posts, many of which have dead links and broken images. It'll take quite a while to sort through everything, so I basically just imported blog posts from this year to start. The second thing is that having one big file to import when you have thousands of posts is not wise. So I'm going to export by month and year from WordPress before I shut things down over there, allowing me to smaller, cleaner imports. This is going to take some time.</p><p>While the simple theme I'm using at the moment (<a href=\"https://github.com/bradbarrish/Zap-B?ref=bradbarrish.com\">my own fork of Zap</a>) is fine, I'd like a theme that supports titleless posts and a scrolling experience on the homepage rather than a list of posts <a href=\"https://aspirethemes.com/themes/hakone?ref=bradbarrish.com\">Hakone</a> seems to be the only one I can find. The biggest reason is that I want to have <a href=\"https://micro.bradbarrish.com/?ref=bradbarrish.com\">my microblog</a> consolidated here. At least that's the current thinking. There may be some value in keeping them separate.</p><p>If you're reading this in an RSS reader, which I just tested, you shouldn't miss a beat.</p>","author":"Brad Barrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"6a021f8d9a6c4918603696dd306e9e8998d2b199ec5b1c102cf013c5f40db512","category":"default"}