{"title":"Field Notes. 08.04.2024","link":"https://om.co/2024/08/04/field-notes-08-04-2024/","date":1722806286000,"content":"<figure><img src=\"https://photos.smugmug.com/photos/i-Whz45cT/0/KVMPd8z23v7Nf45SMPWRppHhn4HtJFNjL2dDCn77t/X4/i-Whz45cT-X4.jpg\" /></figure>\n\n\n\n<h4>On My Mind</h4>\n\n\n\n<p>A week away from the usual vagaries of modern life and a <a target=\"_blank\" href=\"https://om.co/2024/07/30/intermittent-social-media-fasting/\">social media (and news) fast</a> has been a welcome break. <a target=\"_blank\" href=\"https://www.bloomberg.com/opinion/articles/2023-10-05/the-moral-case-for-no-longer-engaging-with-elon-musk-s-x\">It looks like I didn</a>’<a target=\"_blank\" href=\"https://www.bloomberg.com/opinion/articles/2023-10-05/the-moral-case-for-no-longer-engaging-with-elon-musk-s-x\">t miss much on social media</a>. I am glad I took some time to reacquaint myself with my camera and exercise my compositional skills. I went to the Palouse, which is mostly in eastern Washington but also spills over into Idaho. I stayed in the quaint little university town of Moscow, Idaho. A full photo essay will follow — but for now, I’m enjoying this one single photo (see above).</p>\n\n\n\n<p>As I return to work, I have to catch up on a lot of emails, follow up on messages and take a moment to shed a quiet tear over my lost season. I’m in last place in my fantasy baseball league, ravaged by injuries and poor form. Nevertheless, I do have a decent week here and there, thanks to many rookies on my team.</p>\n\n\n\n<p>Happy Sunday, everyone.</p>\n\n\n\n<hr />\n\n\n\n<h4>Quote: </h4>\n\n\n\n<blockquote>\n<p>The transition from tenseness, self-responsibility, and worry to equanimity, receptivity, and peace is the most wonderful of all those shiftings of inner equilibrium, those changes of personal center of energy.</p>\n\n\n\n<p>-William James, 1902</p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<h4>What’s New:</h4>\n\n\n\n<p>I am enjoying the new Brian Eno EP, “Soft Edges.” It features five tracks. This should tide fans over as they wait for the soundtrack of Gary Hustwit’s 2024 documentary “Eno.” That album will likely be on repeat for many listeners. Streaming services have some preview tracks <a target=\"_blank\" href=\"https://brianeno.lnk.to/EnoOST\">available.</a></p>\n\n\n\n<hr />\n\n\n\n<h4><br />Great Reads:  </h4>\n\n\n\n<ul>\n<li><a href=\"https://www.laphamsquarterly.org/states-war/gulf-time/?campaign=FE8LQA1\" target=\"_blank\">The Gulf of Time</a>: Lewis Lapham, one of my editorial heroes, recently passed away. I never got to meet him, even though I wrote to him on multiple occasions requesting an audience. His approach to writing, editing and, most importantly, thinking has influenced me immensely in my adult years. I have <a href=\"https://www.laphamsquarterly.org/death/memento-mori/?campaign=FE7LQA4\" target=\"_blank\">hung on to his every word because,</a> in our crazy times, his nuanced, cultured and measured approach to everything was what made me look away when anger, anxiety and shortsightedness started to take over. RIP.</li>\n\n\n\n<li><a href=\"https://kansasreflector.com/2024/07/28/spyware-turned-this-kansas-high-school-into-a-red-zone-of-dystopian-surveillance/\" target=\"_blank\">Spy in the House of Ed</a>: A Dallas-based student safety technology company, Gaggle, has transformed a Kansas high school into a dystopian surveillance “red zone.” Welcome to the future. This is just the start. Across the pond, in the United Kingdom, AI is being used to monitor drivers, looking for those who are breaking cell phone driving laws.</li>\n\n\n\n<li><a href=\"https://www.lawfaremedia.org/article/the-crowdstrike-outage-and-market-driven-brittleness\" target=\"_blank\">The CrowdStrike Outage and Market-Driven Brittleness</a>: Capitalism needs growth. To grow, companies need to cut corners, and all of them do. It’s not just CrowdStrike. Consider <a href=\"https://www.bloomberg.com/features/2024-roblox-pedophile-problem/?leadSource=uverify%20wall\" target=\"_blank\">Roblox’s pedophile problem</a> — a story that deserves more attention than it received.</li>\n\n\n\n<li><a href=\"https://www.nytimes.com/2024/07/24/business/blake-benthall-silk-road-crypto.html\" target=\"_blank\">Does an Online Drug Lord Deserve a Second Chance? </a>One of the best pieces I read in a while in the New York Times.</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4>I Read About It:</h4>\n\n\n\n<ul>\n<li>Apple’s App Store has a big and growing fake review problem (<a href=\"https://lapcatsoftware.com/articles/2024/7/1.html\" target=\"_blank\">LapCatSoftware.</a>)</li>\n\n\n\n<li>St. Louis Fed confirms that print media is dying. In 1993, there were 469 newspaper publishers. In 2023, there were 97. Magazine publishers for that time frame are down from 165 to 70. And book publishing companies have declined from 89 to 56. It seems people still like books, despite the internet and reduced attention spans. (<a href=\"https://fredblog.stlouisfed.org/2024/07/employment-in-print-media/\" target=\"_blank\">FRED Blog</a>)</li>\n\n\n\n<li>Tim Sweeney is just <a href=\"https://www.macrumors.com/2024/07/30/tim-sweeney-find-my-creepy-surveillance-tech/\" target=\"_blank\">a barrel of laughs</a>.</li>\n\n\n\n<li>“In 2023, intense competition among over 100 LLMs has emerged in China, resulting in a significant waste of resources, particularly computing power,” <a href=\"https://www.tomshardware.com/tech-industry/artificial-intelligence/chinas-ai-model-glut-is-a-significant-waste-of-resources-due-to-scarce-real-world-applications-says-baidu-ceo\" target=\"_blank\">notes </a>Robin Li Yanhong, the founder and CEO of Baidu.</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<p>August 4, 2024. San Francisco</p>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6a1c9547bb82729bf45a90356faa0338f8866d22fc2528d1e9e0171670daf39e","category":"default"}