{"title":"(Weekend Edition) Field Notes: June 23, 2024","link":"https://om.co/2024/06/23/weekend-edition-field-notes-june-23-2024/","date":1719165801000,"content":"<figure><a href=\"https://om.co/2024/06/19/los-angeles-vibes/\"><img src=\"https://photos.smugmug.com/photos/i-3C4tKnp/0/FTNsZrTpN5DHD7JwdqPph7rcDD8d3gWZr43Hfk8qn/X4/i-3C4tKnp-X4.jpg\" /></a></figure>\n\n\n\n<h4>On My Mind</h4>\n\n\n\n<p>This past week, I devoted time to “personal maintenance,” undergoing the usual array of medical tests necessary to preempt potential health issues. Additionally, I faced a dreaded dental surgery — which, despite the use of lasers and sedatives, did not necessarily mean less pain or discomfort. As a result, my writing, reading, and creating suffered. I should be thankful to have emerged unscathed and still smiling.</p>\n\n\n\n<p>I call these field notes because these are some of the notable pieces of information I gathered in my Internet travels. Field notes are a way to <strong>record observations and activities that one encounters or participates in during fieldwork</strong>. Internet is my fieldwork. <br /><br />Since not every noteworthy article requires a separate post, and not all topics merit 750 words of musings, I am going to try this newish format — midweek and on the weekend. The wonderfully talented John Naughton <a href=\"https://memex.naughtons.org\">inspired the idea</a> for this format. Happy Sunday, everyone! </p>\n\n\n\n<hr />\n\n\n\n<blockquote>\n<p>The losers of this game of environmental chance would start appearing as climate refugees at the winners’ doorstep, ready to worship new gods.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.laphamsquarterly.org/climate/if-god-shall-not-send-rain/\">If God Shall Not Send Rain, Thomas Meany</a></p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<h4><strong>New &amp; Interesting:</strong></h4>\n\n\n\n<p>This week, I began testing two services that initially seem quite promising.</p>\n\n\n\n<ul>\n<li><a href=\"https://new.computer\" target=\"_blank\">Dot from New.computer</a> is a very personal AI companion. What I find intriguing is that there are times when I have found myself engaged in lengthy discussions with “Chat GPT” about various topics. It reminds me of casual conversations with a stranger at a local chai stall. Dot, on the other hand, feels unsettlingly personal. <a href=\"https://techcrunch.com/2024/06/21/dots-ai-really-really-wants-to-get-to-know-you/\" target=\"_blank\">More details on TechCrunch.</a></li>\n\n\n\n<li>In the realm of personalized artificial intelligence, I’ve begun experimenting with <a href=\"https://spiral.computer\" target=\"_blank\">Spiral</a>, and so far, it’s impressive. The concept behind Spiral is to accelerate your writing process by training on your own text. They utilize Anthropic’s Claude for this purpose. My initial impressions are positive, and I plan to continue using it for some time.</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>Great Reads</strong></h4>\n\n\n\n<ul>\n<li><a href=\"https://www.propublica.org/article/delusion-advanced-chemical-plastic-recycling-pyrolysis\" target=\"_blank\">The Delusion of Advanced Plastic Recycling Using Pyrolysis</a>: In this well-reported, deeply sourced article, ProPublica’s Lisa Song exposes the fallacy around the magical “endless recycling” solution promoted by an oil giant and plastic companies. Pyrolysis is the process of using heat to break plastic down to its molecular building blocks. If a pyrolysis operator starts with 100 pounds of plastic waste, they can expect to end up with 15-20 pounds of reusable plastic. Even traditional mechanical recycling performs better.</li>\n\n\n\n<li><a href=\"https://thewalrus.ca/the-scourge-of-self-checkout/\" target=\"_blank\">The Scourge of Self-Checkout: </a>In theory, self-checkout makes perfect sense. As a traveler to Japan, I experienced its gloriousness. So, when Amazon and other companies touted self-checkout as the future of retail, I was convinced. However, once again, the promise of technology and its reality are not aligned. Shoppers are growing increasingly frustrated with the technology due to frequent errors and heightened surveillance. As theft rates climb, major retail chains are investing more in this technology instead of abandoning it, leaving consumers stuck in a subpar shopping experience with no alternatives. This article provides a good overview of the current situation, though I wish publications such as this would refrain from moralizing. The facts speak for themselves.</li>\n\n\n\n<li><a href=\"https://www.sandofsky.com/lambda-school/\" target=\"_blank\">Fast Crimes at Lambda School:</a> I remember the hype around this concept. Well, almost half a decade later, Lambda School, the hyped coding boot camp backed by top VCs, has crashed spectacularly amid false job claims and predatory tactics. Founder Austen Allred’s hubris and lies unraveled the $120 million startup. Regulators banned him from student lending and fined him personally $100,000. This is a great read about what went wrong.</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>I Read About It:</strong></h4>\n\n\n\n<ul>\n<li>YouTube Music is set to introduce “Ask for Music,” an AI chatbot that allows users to search tracks using voice prompts or by humming melodies. This experimental feature is designed to simplify music discovery for paid subscribers. It will initially be available to select Android users, with a wider rollout anticipated soon. (<a href=\"https://www.news18.com/tech/youtube-music-to-launch-ask-for-music-ai-chatbot-feature-know-more-8939615.html\" target=\"_blank\">News18</a>)</li>\n\n\n\n<li>An academic study analyzed citation patterns from 8,360 journals across 20 major academic publishers, revealing that MDPI and Frontiers, two prominent publishers of open-access research—free to read outside a paywall—are excessively citing papers previously published in their own journals. (<a href=\"https://osf.io/preprints/socarxiv/5t8v7\" target=\"_blank\">Study</a>)</li>\n\n\n\n<li>Microsoft’s Project Natick, which tested underwater data centers, has concluded, according to executive Noelle Walsh. The lessons learned from subsea operations will aid in other infrastructure projects. Only six of the 855 submerged servers failed over more than two years, compared with eight of 135 on land. Key factors included stable temperatures and nitrogen gas. Interestingly, the Chinese have only recently fully committed to underwater data centers. (<a href=\"https://www.datacenterdynamics.com/en/news/microsoft-confirms-project-natick-underwater-data-center-is-no-more/\" target=\"_blank\">Data Center Dynamics</a>)</li>\n\n\n\n<li><a href=\"https://fortune.com/europe/2024/06/21/why-going-cashless-has-turned-sweden-from-one-of-the-safest-countries-into-a-high-crime-nation/\" target=\"_blank\">Why Sweden’s Shift to a Cashless Society Has Led to a Surge in Crime</a></li>\n</ul>\n\n\n\n<hr />\n\n\n\n<p>June 23, 2024, San Francisco</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6a27e8a726f21a31871b0ec0cc0689939a3259418b90fe45a9a68f68cf2c3ffa","category":"default"}