{"title":"the internet as a creative practice (podcast)","link":"https://keningzhu.com/journal/the-internet-as-a-creative-practice-podcast","date":1722596423000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/09-the-internet-as-a-creative-practice/id1731169431?i=1000664047323\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/4YzQtSv6UKtpgsWxebgApy?si=6fbd43a291694309\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>this week’s episode is about inhabiting yourself on the internet — by relating to it as a public vessel for your ongoing self, in all your creative practices. I’ll explore: </p><ul><li><p>letting go of the <em>opposite</em> of internet as creative practice: the internet as performance, as a strategy game, and as obligation </p></li><li><p>reframing the internet as a genre-defying infinity canvas for your creative expressions </p></li><li><p>how being in public is about allowing yourself to be seen</p></li><li><p>internet as a portal for manifesting new visions and worlds  <br /></p></li></ul><p>this is inspired by <a href=\"https://keningzhu.com/journal/the-internet-as-creative-practice\" target=\"_blank\">a post I wrote a few months ago</a> with the same title.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/c06b0d07-1b69-4a75-b4ca-c55d29e254c7/ep_9.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction</h1><p></p><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening, and I'll be your guide.</p><p>In this week's episode, I want to explore the concept of being on the internet as your full creative self.</p><p>And this requires reframing the internet as a creative practice, because to be in practice and to be in process is the closest we can be to being ourselves.</p><p>Practices are always ongoing and changing and fluid, just like the internet itself.</p><p>We have our own creative practices and our chosen mediums, and we can think of the internet itself and how we show up on it as a creative medium, as a practice that we cultivate and nourish and explore.</p><p>Often times for me, being on the internet feels pretty much like just talking to myself, not that different from writing in a notebook or a sketchbook, except the possibility of it being seen.</p><p>And I'll spend the remainder of the episode exploring the possibilities of the internet as an infinite creative vessel, as a public practice of creativity, and as a portal for your personal power, therefore empowering yourself to create a new reality via the digital reality.</p><p>I think this is very different than how the internet is typically presented to us.</p><p>The opposite of internet as creative practice is internet as performance, as a strategy game and as an obligation.</p><p></p><h1>the internet as performance</h1><p>So first, let's explore internet as performance.</p><p>I think this is something that we see everywhere, and I think there's so much play and experimentation and possibility in performing ourselves online.</p><p>But the downside of this is that there's a pressure to polish ourselves.</p><p>And whether that's through showing our digital resume or our connections or showing our portfolio of work, when we think of the internet as a performance, we want to perform the best version of ourselves because the stakes feel high.</p><p>The stakes feel like getting a new job opportunity or having a successful business.</p><p>Whether or not we feel this pressure to signal our success, signal the image that we have at all together, or a sense of accomplishment or enoughness, to see the internet as performance is to constantly feel that there's the stakes of what we desire hanging in the air, and that there's a panel of judges before us.</p><p>This focus is not about being ourselves, it's about showing a version of ourselves and not the whole.</p><p>Even vulnerability and intimacy could feel like a performance, like something that we do to show something to someone else, like something that we do to elicit an emotional reaction or a connection.</p><p></p><h1>the internet as strategy game</h1><p>The second way that is opposite of internet as practice is to see the internet as a strategy game.</p><p>It's believing that if we give a good performance, if we do the right things, if we make the right moves, if we figure out the rules of this game, then we will find success.</p><p>Whether that's figuring out how to build an online business or how to succeed on a specific platform, to see the internet as a strategy game is trying to figure out how to hack success.</p><p>The analogy I would describe it as is like a gold rush.</p><p>Like we watch everyone else chasing the gold rush of a new platform or of a certain marketing technique and then we follow their paths because we believe that it will guarantee success.</p><p>The danger of playing this gold rush game is that we tire ourselves out following someone else's template that may or may not be aligned with our energy.</p><p>Sometimes the algorithm of a specific platform feels so mysterious, so it's like playing the lottery or a slot machine in a casino and you keep wanting to output more to invest more.</p><p>For me, this feels a bit disempowering and I'm not focused on my own practice, I'm focused on how to win the game.</p><p>There's the idea of winning versus failing.</p><p>There's clear metrics to measure ourselves against.</p><p>And I think that just creates a feeling of not enoughness.</p><p></p><h1>the internet as obligation</h1><p>And so the internet as obligation is basically saying, \"I don't really want to be here, I don't really want to be in this space, but I must.</p><p>Because if I don't then I won't get the sort of recognition and validation that I desire.\"</p><p>And I've done all of these things, I've tried to play the marketing game, I've followed all the marketing gurus, I've forced myself through a checklist of things I must do as if to say, \"If I just input this work then I will get the output.</p><p>If I just play this game then I have a chance at winning.\"</p><p>But ultimately these ways of being on the internet, it felt deeply draining for my energy, it felt like partitioning parts of myself and only showing a tiny, tiny sliver of who I was.</p><p>I deeply desired a way to be on the internet where I didn't have to filter myself, I didn't have to play by the rules that someone else created on someone else's platform.</p><p>In all these years of building a public creative practice and a business online, I've learned to always question when if something is a means to an end but doing it fills me with a sense of dread or reluctance or resistance, that it means I need to look really hard at this means.</p><p>And maybe let go of the pressure to do it.</p><p>There are infinite paths to where we want to go, and the first step is always finding clarity as to what is it that we want to bring in our lives.</p><p>For me, being on the internet as a public creative practice is deeply integrated with building a world on my website.</p><p>Intreading that world as a garden or an open sketchbook of ongoingness focused not on performance or on winning or on converting but instead as expression and offering.</p><p>So in reframing the internet as a public creative practice, I want to explore with you three different perspectives.</p><p>One is the internet as a creative vessel, two is as a public practice, and three as a portal for personal power.</p><p></p><h1>the internet as a creative vessel</h1><p>So internet as creative vessel.</p><p>I really think of this space as an infinity canvas, like a sketchbook in digital form, but it's fluid and non-linear.</p><p>The internet is like a master form to hold all forms.</p><p>If you look at different types of artists, writers have a certain kind of website and visual artists have a different kind of website, but actually the internet doesn't limit us on how we want to present ourselves, how we want to be in our creative practice.</p><p>We can have our writing next to animations or music or interactions.</p><p>We can pair it with curations or we can weave threads of thought in between two separate works across time and space in a single click.</p><p>I think of the internet as a body container, as the container to hold all of our creative expressions in whatever form and shape they want to take and whatever medium they want to take.</p><p>And of course, it's not the same as a tactile experience, which is why having an analog practice is also so important, but the digital form in its nebulousness, in its intangibility can hold everything.</p><p>It is expansive.</p><p>It is connected.</p><p>I talk about the internet as a collective consciousness, as a soup.</p><p>And the difference, of course, is that we decide what goes into this consciousness.</p><p>We decide what we want to share and what we want to keep private.</p><p>But as a creative vessel, whatever we do share is an offering.</p><p>And I think it is a form of psychic embodiment, as in allowing ourselves to take up space in the container that is the internet, whether that's a corner that we claim for ourselves in the form of a website or whatever platform we want to channel our energy into.</p><p></p><h1>the internet as a public practice </h1><p>Now let's talk about the internet as a public practice.</p><p>Being public is actually really not about the other.</p><p>Being public and being visible is about the practice of seeing yourself and valuing your own gifts.</p><p>And so to think of the internet as a creative practice is to think of the act of sharing as an integral part of the process, as the end of a creative exhale.</p><p>The act of allowing yourself to be public, to be seen, is the practice of valuing your own work, your own process, and your authenticity.</p><p>And saying, \"I believe in this idea or creation or this sketch enough to let it stand on its own even before it feels 100% perfect or done.</p><p>I release this idea into the world because it has value to me.\"</p><p>I think the act of accepting yourself in progress, yourself in process, in the public eye is to dissolve the barrier between who I am versus who I allow them to see, to not feel the need to wait until you're a finished product.</p><p>And I think that's the beauty of a form as nebulous as the internet because you can put up a drawing and then you can edit it the next day or an hour later and change it.</p><p>It's ongoing just as we are ongoing and that's why I feel most inspired by the internet as a mirror of consciousness.</p><p>We can edit the pixels, we can edit a thought on the internet, we can allow ourselves to not perform a version of ourselves we think we need to be to achieve success, but instead to allow ourselves to contain multitudes, to contradict ourselves, to change our minds anytime we desire.</p><p>And for me, I find a lot of comfort in building on a website because there's the feeling that it's a private space even if it is public, that there's a shade of darkness that covers it that people have to go out and look for it.</p><p>It gives a sense of intimacy, feeling obscure can be such a gift.</p><p></p><h1>the internet as a portal  </h1><p>Last, I want to talk about the internet as a portal for personal power.</p><p>This is something that's in the intro of every Botanical Studies episode.</p><p>And what I mean by that is I think we're living in such a magical time, we can have an idea one day and manifest it on the digital sphere within the same day.</p><p>The act of manifestation of materialization is the act of creating a new world, a new reality, a new possibility.</p><p>And using the internet, there's a sense of limitlessness as in we can share our energy without asking anyone for permission or approval.</p><p>We can propose an idea into the void of the cosmic internet space.</p><p>And yes, that could very well be met with silence and crickets, but that's not really the point.</p><p>The point is we can create something out of nothing.</p><p>We get to create our own rules.</p><p>And I think the best kinds of worlds are those that are ecosystems that we tend to over time through a practice of slow gardening.</p><p>Those are the ecosystems that can nourish us over the long run.</p><p>If it comes from our authentic selves, then they can be a form of our highest offerings, of our gifts and potentials and insights.</p><p>And in this sense, to create a new world into being is to propose a new vision for the collective world that we're living in through color and sound and shape and form and experience.</p><p>And that's truly where I see the power of artists as creators in this world.</p><p>To use the internet as a portal to the artists we want to become or the entrepreneur we want to become or the world we want to build is about using it as an ongoing fluid experiment.</p><p></p><h1>internet as inhabiting myself</h1><p>And so the question of how do I share my work on the internet is really a question of how can I practice being my full creative self in public and simply seeing what happens.</p><p>For me, the shift from feeling the pressure to perform myself or to play the marketing or the business game on the internet into choosing to use it as an infinity vessel, as a portal of possibility, as a public creative practice, it really transformed everything.</p><p>Choosing how to show up in a way that feels expansive and nourishing and an act of cherishing my creative gifts instead of diluting or downsizing them to fit someone else's template.</p><p>It is the thing that has brought me closer and closer to myself.</p><p>It's made me more myself and to be more myself is the key to whatever flavor of success I want to create.</p><p>Because it's only from that place of closeness to yourself where you can decide to create something that is truly unique that can only come from you.</p><p>The internet as a creative practice is all about inhabiting yourself.</p><p>To practice inhabiting yourself in a place where you can be seen and through that you give power to your process, your imagination, your creativity, your truth and your visions for a new world.</p><p></p><p></p><p>—</p><p>Thank you creative friends for being here and for listening.</p><p>You can find more of my work and writings on my website worldkinningzoo.com.</p><p>I also send a weekly newsletter on Creative Alchemy called Guide Notes.</p><p>I'll look forward to speaking to you again soon.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"6a466b1f57c348dde65c7761e552fed34622a11b5a464a9555ab9c53cb75b1c1","category":"Sites"}