{"title":"Why are Easter eggs so expensive?","link":"https://om.co/2024/03/29/why-easter-eggs-are-so-expensive/","date":1711745428000,"content":"<p><em>I found these nuggets on my Internet travels over the past couple of days. I saved them, hoping that you might find them either interesting or useful or both — Om</em>.</p>\n\n\n\n<hr />\n\n\n\n<p>If you are wondering if Easter eggs are more expensive this year, then you are right. Some popular brands across the world have seen their prices increase by almost 50 percent. Why? Because cocoa, aka the thing you need for your chocolate, has become more costly — almost $8,500 a ton. Why are prices up? Climate Change is impacting the region where cocoa grows — West Africa. There has been a severe drought. Cocoa trees get impacted quite sharply because of temperature variance. (<a target=\"_blank\" href=\"https://www.bbc.com/news/science-environment-68619912\">Read</a>)</p>\n\n\n\n<hr />\n\n\n\n<p>Taylor Swift is the queen. Of the top 20 best-selling vinyl LPs of 2023, seven are by her. She sold 3.8 million records. The 19 of the 29 best-selling (not streaming) albums in the world last year were from K-pop artists. (<a target=\"_blank\" href=\"https://www.ifpi.org/taylor-swift-seventeen-and-morgan-wallen-top-ifpi-global-album-charts/\">Read</a>)</p>\n\n\n\n<hr />\n\n\n\n<p>With 5G available everywhere, you would think the demand for fixed broadband would start to taper off. Not quite so. Point Topic, a broadband research firm, <a href=\"https://www.point-topic.com/post/global-fixed-broadband-subscribers-forecasts-2030\" target=\"_blank\">forecasts that</a> “at the end of 2030 there will be more than 1.618 billion subscribers across the globe.” The slowest growing region is Western Europe. The highest predicted growth will be in Kenya and Botswana. China’s growth will decline by 3.92 percent. <a href=\"https://www.point-topic.com/post/global-fixed-broadband-subscribers-forecasts-2030\" target=\"_blank\">More data and details are here.</a></p>\n\n\n\n<hr />\n\n\n\n<p>Podcasts are big and getting bigger. A recent survey points out that an impressive 47% of the U.S. population over the age of 12 has listened to one in the last month, up 12% year over year. An impressive 34% of the same people have listened in the last week, up 10% year over year. The growth is coming because of increasing number of <strong>female listeners: 45%</strong> of women above the age have tuned in during the last month, up from 39% in 2023. <strong>Thirty-two percent </strong>of females in the U.S. over the age of 12 have listened in the last week, up from 27% in 2023. <a target=\"_blank\" href=\"https://podnews.net/press-release/infinite-dial-2024\">More data and details here.</a></p>\n\n\n\n<hr />\n\n\n\n<p><em><strong>March 29, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6a758ea8cdfa400c99976e9e68e906edd1052f7ec3fdf73f2bd3b5f7669e6fc5","category":"default"}