{"title":"Einstein&#8217;s Nuclear Warning Letter to FDR Up For Auction","link":"https://kottke.org/24/09/einsteins-nuclear-warning-letter-to-fdr-up-for-auction","date":1725568470000,"content":"\n        <p></p>\n\n<p>A copy of the letter written and signed by Albert Einstein in 1939 warning President Franklin Roosevelt of the possibility of Nazi Germany building nuclear weapons <a href=\"https://www.christies.com/en/lot/lot-6495018\">is up for auction next week at Christie’s</a>. The estimate is $4-6 million.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/einstein-fdr-letter.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/einstein-fdr-letter.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/einstein-fdr-letter.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"1667\" alt=\"Einstein Fdr Letter\" /></p>\n\n<blockquote><p>The present letter is based directly on the content that Einstein dictated in German. Leo Szilard then translated the text into English and dictated it in turn to a Columbia University typist. Unsure of the level of detail to present to the chief executive, Szilard also made a longer version that recommended specific administrative steps the President could take to support uranium research. The longer version was the one delivered to the White House. It has rested, since 1945, in the permanent collection of the Franklin D. Roosevelt Library at Hyde Park, New York and has been referenced in myriad histories and biographies. It is arguably the single-most influential letter of the twentieth century. Leo Szilard retained the original version of that historic communication and it is offered here, together with Einstein’s handwritten letter to Szilard transmitting both signed letters addressed to the President of the United States.</p></blockquote>\n\n<p>The letter reads in part:</p>\n\n<blockquote><p>Recent work in nuclear physics made it probable that uranium may be turned into a new and important source of energy. New Experiments performed by E. Fermi and L. Szilard, which have been communicated to me in manuscript, make it now appear likely that it will be possible to set up a chain reaction in a large mass of uranium and thereby to liberate considerable quantities of energy. Less certain, but to be kept in mind, is the possibility of making use of such chain reactions for the construction of extremely powerful bombs.</p></blockquote>\n\n<p>Nuclear weapons historian Stephen Schwartz <a href=\"https://bsky.app/profile/atomicanalyst.bsky.social/post/3l3dtl2bizb2o\">writes more about the letter on Bluesky</a>:</p>\n\n<blockquote><p>On August 15, Szilard mailed the letter to prominent economist Alexander Sachs, who had formerly worked for Roosevelt, after trying and failing (at Sach’s suggestion) to get Charles Lindbergh to personally deliver the letter to the president.</p>\n\n<p>Sachs did not immediately reach out to Roosevelt. Then, on September 1, Hitler invaded Poland and Roosevelt became preoccupied with the war. Sachs finally met with Roosevelt on October 11, bringing not only the letter but scientific reports and papers provided by Szilard.</p></blockquote>\n\n<p>The letter is being sold by the estate of late Microsoft co-founder Paul Allen. The <a href=\"https://www.christies.com/en/stories/gen-one-innovations-from-the-paul-g-allen-collection-1f0df60a726e4dcbabef3a91a57ef7ee\">series of Allen auctions</a> also include notable items like <a href=\"https://www.christies.com/en/lot/lot-6495022\">an Apple I computer</a>, <a href=\"https://www.christies.com/en/lot/lot-6495026\">an Enigma machine</a>, <a href=\"https://www.christies.com/en/lot/lot-6495044\">a Cray-1 supercomputer</a>, <a href=\"https://www.christies.com/en/lot/lot-6495035\">a NASA flight suit worn by Buzz Aldrin</a>, and <a href=\"https://www.christies.com/en/lot/lot-6495014\">a cool-ass meteorite</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Albert%20Einstein\">Albert Einstein</a> · <a href=\"https://kottke.org/tag/atomic%20bomb\">atomic bomb</a> · <a href=\"https://kottke.org/tag/Franklin%20Roosevelt\">Franklin Roosevelt</a> · <a href=\"https://kottke.org/tag/Leo%20Szilard\">Leo Szilard</a> · <a href=\"https://kottke.org/tag/Nazis\">Nazis</a> · <a href=\"https://kottke.org/tag/Paul%20Allen\">Paul Allen</a> · <a href=\"https://kottke.org/tag/video\">video</a> · <a href=\"https://kottke.org/tag/war\">war</a> · <a href=\"https://kottke.org/tag/World%20War%20II\">World War II</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/09/einsteins-nuclear-warning-letter-to-fdr-up-for-auction\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"6ac4daf62ce2722029be8993497931e27727c9b26313ec2b59f706f969820908","category":"Sites"}