{"title":"My Conversation with Velina Tchakarova","link":"https://feeds.feedblitz.com/~/899395460/0/marginalrevolution~My-Conversation-with-Velina-Tchakarova.html","date":1718255441000,"content":"<p>Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conversationswithtyler.com/episodes/velina-tchakarova/\" target=\"_blank\">the audio, video, and transcript</a>.  Here is the episode summary:</p>\r\n<blockquote><p>Founder of the consultancy FACE, Velina is a geopolitical strategist guiding businesses and organizations to anticipate the outcomes of global conflicts, shifting alliances, and bleeding edge technologies on the world stage.</p>\r\n<p>In a globe-trotting conversation, Tyler and Velina start in the Balkans and then head to Russia, China, North Korea, and finally circle back to Putin’s interest in the Baltics. She gives her take on whether the Balkan Wars still matter today, the future of Bulgarian nationalism, what predicts which Eastern European countries will remain closer to Russia, why China will not attack Taiwan, Putin’s next move after Ukraine, where a nuclear weapon is most likely to be used next, how she sources intel, her unique approach to scenario-planning, and more.</p></blockquote>\r\n<p>Here is one excerpt on a matter of great importance:</p>\r\n<blockquote>\r\n<p><strong>COWEN: </strong>Maybe we’ll come back to Bulgaria, but let me try some questions about the broader world. Why is it you think <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://news.usni.org/2023/03/02/high-cost-of-taiwan-invasion-will-dissuade-china-pentagon-official-says\" target=\"_blank\">China will not attack Taiwan</a>? They claim it as theirs, and arguably, in five to ten years, they’ll be able to <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.wsj.com/world/china/us-submarine-dominance-shift-china-8db10a0d\" target=\"_blank\">neutralize our submarine advantage</a> from the US with underwater drones and surveillance of <em>our</em> submarine presence. At that point, why don’t they just move on Taiwan and try to take it?</p>\r\n<p><strong>TCHAKAROVA: </strong>Well, I do understand that there is a lot of analysis coming out right now, especially on behalf of the military experts, not only in the United States but also in other parts of the world, pointing to this realistic scenario that we may see a military attack by China on Taiwan not later than 2027. And why 2027? Because it is being anticipated as the year when China will be able to catch up militarily with the United States.</p>\r\n<p>I do not share this assessment. I just don’t see why China will have to take such a big risk in achieving something that it can achieve in a much smarter and more efficient way. What do I mean by that? I call this approach “death by a thousand cuts.” That would mean that China could spend a little bit longer in a slow but steady political, social, economic, and societal penetration of Taiwan. We could argue it’s the old Soviet playbook. It could be done in a more subtle way, using plausible deniability.</p>\r\n<p>Taiwan is still the most successful democracy in the Indo-Pacific. That means, also, it is vulnerable to this kind of penetration, where you can practically use agents provocateurs on the ground. You can buy up a lot of institutional or individual players. You can start doing all this subversion process in a longer timeframe, but it could bring about bigger success than actually risking military intervention, which is not giving you, I would say, even a 50–50 chance of success.</p>\r\n<p>The terrain of Taiwan, if we compare it with the most sophisticated war that’s going on right now, is much more difficult. You have a very, very limited window to attack. In the case of Taiwan, this window of opportunity is probably limited only to two periods in the whole year, which, of course, is also known by everyone in the region. That particularly means the defense of Taiwan. You have a window of opportunity in April and then in October, so you cannot attack at any time in the year.</p>\r\n<p>It is a sophisticated military attack that cannot be conducted on the whole of the island. Even though China is catching up militarily right now, I think that the mindset of this Chinese leadership — the way the Chinese leadership is actually conducting strategy — does contradict such risky endeavor, again because time is on China’s side. China only needs to really prepare this sum of minor actions in a longer period of time. At least, this is what I would actually do as a strategist, which would promise a much better percentage of success than, like I said, an adventurous military attack.</p>\r\n<p>Now, we may argue that under unanticipated circumstances for the political leadership — think of a situation where the political stability in China is shaken, where the Chinese leader, Xi Jinping, is somehow put into a corner to take a very, let’s say, ad hoc decision on the matter because of certain circles of the hawks, of the military hawks. Of course, we have this possibility as well. It could be a black swan event, something that has happened in China, and this makes him take this decision in order to draw the attention away from internal problems.</p>\r\n<p>Foreign policy adventures are always gathering public support. It’s not 100 percent to be excluded, but in my scenario, I would actually point to, as I explained, this death-by-a-thousand-cuts approach rather than a military attack on Taiwan.</p>\r\n<p><strong>COWEN: </strong>Are we now in a world where the laws of war are basically obsolete?</p>\r\n</blockquote>\r\n<p>It is worth repeating that issues of foreign policy are very much the most important issues.  And here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://x.com/vtchakarova\" target=\"_blank\">Velina on Twitter</a>.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html\">My Conversation with Velina Tchakarova</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/899395460/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/899395460/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/899395460/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/899395460/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/899395460/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/899395460/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comment-160768318\">I do not share this assessment. I just don’t see why China ...</a> <i>by aaron</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comment-160768317\">In reply to Tom T..   Uhh people in the administration were ...</a> <i>by aaron</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comment-160768262\">What if it's much more simple? Like …Xi wants to go down in ...</a> <i>by Paul</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comment-160768246\">That would mean that China could spend a little bit longer in a ...</a> <i>by Niko Davor</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comment-160768233\">In reply to Armchair Bill.   Such a weapon is not in the right ...</a> <i>by Anti-Gnostic</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/my-conversation-with-velina-tchakarova.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/backlash-effects-are-real.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=backlash-effects-are-real\">Backlash effects are real, for drug policy too</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/the-sea-change-on-crypto-regulation.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-sea-change-on-crypto-regulation\">The Sea Change on Crypto-Regulation</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/does-visiting-south-africa-make-you-more-right-wing-or-more-left-wing.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=does-visiting-south-africa-make-you-more-right-wing-or-more-left-wing\">Does visiting South Africa make you more right-wing or more left-wing?</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"6ad577ce86b304d24d71f2b5dfaafd40eb90dc65b1771a854d61242e1ff2941d","category":"default"}