{"title":"The Origin & Evolution of Italian Stuffed Pasta Shapes","link":"https://kottke.org/24/07/the-origin-evolution-of-italian-stuffed-pasta-shapes","date":1721942439000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/pasta-shapes-evolution.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/pasta-shapes-evolution.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/pasta-shapes-evolution.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"1290\" alt=\"a circular graph showing how all of the stuffed pasta shapes in Italy relate to each other\" /></p>\n\n<p>Using methods generally employed to track the evolution and spread of plants and animals over time and across geography, <a href=\"https://link.springer.com/article/10.1007/s44187-024-00136-1\">this paper</a> aims to provide a scientific classification of Italian stuffed pasta shapes (<em>pasta ripiena</em>) and how they spread and evolved across what is now Italy. From the abstract of ‘Evolution of the Italian <em>pasta ripiena</em>: the first steps toward a scientific classification’:</p>\n\n<blockquote><p>Our results showed that, with the exception of the Sardinian Culurgiones, all the other pasta ripiena from Italy likely had a single origin in the northern parts of the country. Based on the proposed evolutionary hypothesis, the Italian pasta are divided into two main clades: a ravioli clade mainly characterized by a more or less flat shape, and a tortellini clade mainly characterized by a three-dimensional shape.</p></blockquote>\n\n<p>The introduction provides a short history lesson in stuffed foods:</p>\n\n<blockquote><p>The Italian pasta ripiena are part of a large family of Eurasian stuffed dumplings that similarly come in a wide array of shapes and forms and are known by many different names, for example, the Turkish manti, German maultaschen, Polish pierogi, Jewish kreplach, Russian pelmeni, Georgian khinkali, Tibetan momo, Chinese wonton, Japanese gyoza, and many others. It is unclear whether all dumplings had a singular origin or evolved independently, or how the remarkable diversity observed in Italy is related to the greater variation present in Eurasia. Based on linguistic similarities, it has been speculated that stuffed dumplings were probably first invented in the Middle East and subsequently spread across Eurasia by Turkic and Iranian peoples. Dumplings were known in China during the Han Empire (206 BC-220 AD), where archaeological remnants of noodles from this period were also discovered; however, in the same era, pasta had not yet made its appearance in Europe. The Italian ravioli have also been suggested to be a descendent of the Greek manti.</p></blockquote>\n\n<p>And then moves on to stuffed pastas native to Italy:</p>\n\n<blockquote><p>In Italy, ravioli are probably the oldest historically documented filled pasta, even though the early iterations of this dish evidently did not include the enclosing pasta casing. Between the 12 and 13 centuries, a settler from Savona agreed to provide his master with a lunch for three people made of bread, wine, meat and ravioli, during the grape harvest. Tortelli and agnolotti first appeared in literature much later. However, the origins of the iconic tortellini are controversial. The long-standing historical feud between the cities of Bologna and Modena over who invented the tortellini was symbolically settled at the end of the 19 century by Bolognese poet and satirist Giuseppe Ceri, who, in his poem “L’ombelico di Venere” (the navel of Venus), declared Castelfranco Emilia, a town halfway between the two cities, to be the birthplace of tortellini. According to this legend, one day, while Venus, Mars and Bacchus were visiting a tavern in Castelfranco Emilia, the innkeeper inadvertently caught Venus in a state of undress and was so astonished at the sight of the goddess’ navel that he ran into the kitchen and created tortellini in her honor. Clearly, a product as perfect as tortellini could be inspired only by Venus, the goddess of beauty.</p></blockquote>\n\n<p>See also <a href=\"https://kottke.org/18/03/how-to-make-29-different-shapes-of-pasta-by-hand\">How to Make 29 Different Shapes of Pasta by Hand</a>, <a href=\"https://kottke.org/09/10/150-different-pasta-shapes\">150 Different Pasta Shapes</a>, <a href=\"https://kottke.org/21/06/flat-packed-pastas-that-pop-open-when-cooked\">Flat-Packed Pastas That Pop Open When Cooked</a>, and <a href=\"https://kottke.org/21/03/the-invention-of-a-new-pasta-shape\">The Invention of a New Pasta Shape</a>. (via <a href=\"https://bsky.app/profile/jenlucpiquant.bsky.social\">@jenlucpiquant.bsky.social</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/geometry\">geometry</a> · <a href=\"https://kottke.org/tag/Italy\">Italy</a> · <a href=\"https://kottke.org/tag/science\">science</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/07/the-origin-evolution-of-italian-stuffed-pasta-shapes\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"6b2b0a2f444f9aa1462876ca9018e4010077e4625243dbe92714bb3d41953d8f","category":"default"}