{"title":"Why (& How) IPL Could Save Test Cricket","link":"https://om.co/2024/07/09/why-how-ipl-could-save-test-cricket/","date":1720547760000,"content":"<figure><img width=\"1024\" height=\"797\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-1024x797.jpeg\" alt=\"red and black ball illustration\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-1024x797.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-300x233.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-768x598.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-1536x1195.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-2048x1593.jpeg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-192x149.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-1100x856.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-560x436.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/chirayu-trivedi-idtdvsdevjw-unsplash-edited-1800x1400.jpeg 1800w\" /></figure>\n\n\n\n<p>Marylebone Cricket Club, one of cricket’s august organizations, recently organized World Cricket Connects, a symposium about the future of a sport that — like so many things — finds itself caught between tradition and tomorrow. Test cricket, the traditional form of the game, is giving way to an onslaught of franchises offering up T20 cricket, a much faster and higher-scoring version. This change is best exemplified by the growth of the Indian Premier League (IPL). </p>\n\n\n\n<p>At this point, everyone who is anyone in cricket has <a href=\"https://www.espncricinfo.com/story/johnny-grave-west-indies-covid-tour-showed-that-big-three-need-strong-opponents-1442484\">weighed in</a> on the challenges the game is facing. Some <a href=\"https://www.thecricketer.com/Topics/premiumfeatures/fans_market_and_money_cannot_be_ignored_says_nicholas_after_mcc_world_cricket_connects_event_at_lords.html?t=638559962473982848\">have</a> come up with <a href=\"https://sportstar.thehindu.com/cricket/ravi-shastri-wants-fewer-test-team-marylebone-cricket-club-mcc-t20-format-justin-langer-cricket-news/article68381226.ece\">out of the box suggestions</a> to save it. In such a rapidly changing environment, any new proposal is and should be considered a credible suggestion — with the exception, I would argue, of denying the inevitable and blindly clinging to the past. </p>\n\n\n\n<p>While I was not asked to weigh in at World Cricket Connects, I’ll tell you what I think the future holds: To save Test cricket, the IPL must get bigger and richer. In cricket, as in all things, the most effective way to preserve the best elements of the past is to fully embrace progress.</p>\n\n\n\n<h2><strong>Sports Reflect the Times</strong></h2>\n\n\n\n<blockquote>\n<p><em>“If we can have specific windows for IPL, but then also Test windows, that makes the decision-making for the players a lot easier.” -Pat Cummins, Australian Cricket Team Captain </em></p>\n</blockquote>\n\n\n\n<p>To understand my — admittedly somewhat counterintuitive — argument, it is important to appreciate that sports, like society itself, change with the times, mostly driven by technological advances. This is nothing new, nor is it unique to this topic. Long before the internet and smartphones, the emergence of technologies, like the steam engine and the internal combustion engine, <a href=\"https://om.co/2015/04/22/our-mobile-networked-world-a-new-victorian-age/\">transformed how we lived</a>. </p>\n\n\n\n<p>The good news is that, as has been shown time and again, the introduction of new sports need not mean the destruction of old ones. There is room for both. Five years ago, I wrote an essay about the changes in cricket, which were already underway and accelerating rapidly, and took some cues from other sports that had faced similar dilemmas. <a href=\"https://om.co/2019/05/29/world-cup-of-cricket-2019/\">Here’s what I wrote</a>: </p>\n\n\n\n<blockquote>\n<p><em>Baseball, like test cricket, became popular because it was a pastime for a different era — newly Industrial Age when television hadn’t started to consume our waking hours. Test Cricket and it’s American Cousin were stars of the golden age of radio — when words kept the fans fixated. American Football was a creation of the television, and mostly the weekend. It was a reflection of society changing, becoming faster. It was ideal fare for the TV networks.</em></p>\n\n\n\n<p><em>Fast forward to today, and we have a whole new rhythm to our world. We move at the speed of the network, and as such, we don’t have the patience for slower games. There is a reason why people are losing interest in baseball and football (American) — because who has the time, right. Instead, the whole planet loves the whizzing, spinning and heart pumping, vein throbbing action of basketball. At the end of a game, you have an answer. During the game, you don’t have time to think about life and its vagaries. It is just the game, the action and the joy of winning, or tears of sadness. And then we move on to the next thing, like dealing with emails, fighting on Twitter, and trolling our friends with our best life on Instagram. It is why the NBA is so popular around the world. It is a sport of our times.</em></p>\n</blockquote>\n\n\n\n<p>T20 cricket is a reflection of contemporary, technology-driven societal expectations— and this is why “franchise cricket” is becoming so popular that it’s starting to threaten Test cricket. Traditionalists blame the IPL for eroding cricket’s traditions to satisfy their endless appetite for money. While these detractors have some perfectly valid arguments, they often overlook the fact that consumers of the sport — a.k.a. the fans — want to watch these T20 games. That’s why the broadcasters are happy to pay for it. </p>\n\n\n\n<p>Because of their popularity, the leagues have more money to pay the players, who have their own financial futures to worry about and reasonably opt to prioritize T20 over Test cricket. The growing schism has led to a point where smaller cricket nations can’t really afford to have Test teams. Obviously, no such problems exist for India, Australia, and England. These three countries have the audience and television dollars to support all forms of cricket infrastructure in their own countries. </p>\n\n\n\n<figure><img width=\"1024\" height=\"439\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-1024x439.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-1024x439.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-300x129.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-768x329.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-1536x658.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-192x82.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-1100x471.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-560x240.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r-1800x771.jpeg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/tpglffhkwkhjxzqgps4r.jpeg 1932w\" /></figure>\n\n\n\n<h2><strong>Why Cricket Doesn’t Need Three Formats</strong></h2>\n\n\n\n<p>The big question is how to find common ground for both styles of the game. Cricket’s challenge is unique in that there are so many formats: T20, One-Day International (ODI), and Test. American football doesn’t have that problem (unless you count Australian rules football). You can easily balance national tournaments and club leagues. </p>\n\n\n\n<p>As a fan of both Test cricket and T20 cricket, I often think about the problems facing the sport. I have come to the conclusion — really, an extension of my argument from five years ago — that <a href=\"https://om.co/2019/05/29/world-cup-of-cricket-2019/\">the time and era of the ODI format is over</a>. The ODI format was created to make cricket more television-friendly. Colorful outfits and day-night games helped propel the sport in a new direction. That world has become faster, and now ODI occupies an awkward middle ground that satisfies neither the traditionalists nor the modern speed-enthusiasts. The game can really only afford two clearly distinct styles: the shorter, faster format (T20) and the longer, old school Test format. </p>\n\n\n\n<h2><strong>Why IPL Needs To Be Bigger</strong></h2>\n\n\n\n<p>In order to evolve effectively, the IPL needs to adopt a more <a href=\"https://distinction.studio/journal/the-four-pillars-of-product-thinking\">product-centric approach</a>. </p>\n\n\n\n<p>It could work something like this: First, I propose expanding the IPL to 16 teams (from the current 10) and splitting the league into two divisions. Each division would run for 2.5 months. Division Two could be played in India or rotated to other nations, such as South Africa, Sri Lanka, or the United Arab Emirates. The top division would play February to April, while the second division would be played during the September to November window. The six new teams would start in Division Two. The bottom four teams from Division One would be relegated to Division Two. </p>\n\n\n\n<p>IPL could go further to bolster its preeminence by increasing cash outlays. Expanding team purses to 200 crore rupees ($24 million) and squads to 32 players would allow players to sign exclusive contracts, freeing them from the treadmill of lesser leagues. It’s a win-win: Players focus on quality cricket and recovery, while teams retain their stars. More importantly, players don’t have to decide between playing for their country and their club. </p>\n\n\n\n<p>And why stop there? Let’s borrow a page from American sports leagues. Allow teams to draft up to four players for three-year contracts before they enter the auction pool. This would allow the local minor league system for talent spotting to flourish even further — where teams would go overseas to spot talent. It’s a system that could foster team loyalty and long-term strategic planning, mimicking the best of the NBA, MLB and NFL models.</p>\n\n\n\n<p>This model also solves the perpetual tension between domestic and international cricket. Players are released for national duty as needed, with expanded squads covering any gaps.</p>\n\n\n\n<p>For broadcasters, this split season is a gold mine. Two distinct windows mean sustained engagement and potentially higher revenues. For fans, it’s a year-round cricket feast without the fatigue of an overextended single season.</p>\n\n\n\n<p>The relegation system adds a layer of competitiveness to both divisions. Teams fight tooth and nail to ascend to or remain in the top tier, ensuring high-quality cricket across the board.</p>\n\n\n\n<p>Yes, there will be logistical hurdles, particularly around national team schedules. But the potential benefits — for players, teams, broadcasters, and fans — far outweigh these challenges.</p>\n\n\n\n<p>Broadcasters should be at the forefront of technological innovation. Imagine lidar and NFC technologies enhancing decision-making and accelerating gameplay. This isn’t just about better cricket; it’s about creating a more engaging, high-tech spectacle. The more IPL pushes new technologies, the more interesting it can become. </p>\n\n\n\n<p>In other words, IPL could start to distinguish itself as a product. </p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"439\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-1024x439.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-1024x439.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-300x129.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-768x329.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-1536x658.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-192x82.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-1100x471.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-560x240.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk-1800x771.jpeg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/lvffbsanav795brifdkk.jpeg 1932w\" /></figure>\n\n\n\n<h2><strong>How T20 Can Save Test Cricket</strong></h2>\n\n\n\n<blockquote>\n<p><em>“I think the easiest thing to do is say, well, this format doesn’t make money or isn’t sustainable in this market or that country, but if the game works together and has a collective mindset, there is plenty of money to go around to ensure the game can thrive.” Johnny Grave, CEO, </em><a href=\"https://www.espncricinfo.com/story/johnny-grave-west-indies-covid-tour-showed-that-big-three-need-strong-opponents-1442484\"><em>West Indies Cricket</em></a><em>.</em></p>\n</blockquote>\n\n\n\n<p>The more distinct it is from T20, the more attractive the traditional game of Test cricket will become. It’s similar to streaming versus analog music: both have their advantages and joys.</p>\n\n\n\n<p>ICC should work with various T20 leagues for a global fund that underwrites the “longer format” World Test Championship (WTC) tours. Every league that wants to be recognized by the International Cricket Council should be asked to pay $50,000 per game to a WTC Fund. The recognized status means that it is easier for top players to get waivers from their boards. By not paying, the league loses its List A status, and thus becomes less valuable as a property. This contribution doesn’t come from the national cricket boards, so they shouldn’t have a problem with such a move. The money, via the franchise teams, is really coming from broadcasters, advertisers and ticket holders. </p>\n\n\n\n<p>The funds could then be used to underwrite tour expenses for visiting test-playing nations. IPL, could take a lead. The IPL, being the biggest league, could easily contribute nearly $5 million a year. Add another $5 million from other leagues, and you can start to make an impact. It’s not quite revenue sharing, but it’s a start nonetheless. </p>\n\n\n\n<p>For IPL, though, the league needs to start adopting a product-centric mindset — one that involves selling more things to more people by constantly improving what it has to offer. Better stadiums, better broadcasts, and helping turn viewers into fans of the teams are key. While Premier League clubs are based in the U.K., their fandom is global — and that is what IPL needs to be aiming for. IPL needs to learn from golf, where a Saudi-backed professional golf league upset the applecart for the traditional league. </p>\n\n\n\n<p>I hear Saudis are keen on cricket too.</p>\n\n\n\n<p><em><strong>July 9, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6b3669649ab1208322c1343a1fbac2a2bb5a1e329668b4be8ce4cb928d9a360c","category":"default"}