{"title":"APFS preboot install issues no more!","link":"https://blog.webb.page/2017-11-03-apfs-preboot-volume-woes.txt","date":1509667200000,"content":"<p>I was minding my business one day (October 27th) and I thought, oh! What's\nthis? A \"recommended update\"? \"Oh sure, I'll update to macOS High Sierra Beta\n5, while I wait to pre-order my iPhone X at 3am.\" Updating my OS is something\nI've done <em>countless</em> times before. Apple waits until 1~3am to let me know\nthere's a software update or just performs one while I'm asleep. I awake the\nfollowing morning to find my computer more secure than it was the previous day.\nGuess what happened this time? On the day of my friggin' <em>marriage</em> (at 2am)?</p>\n<p>I glance at my computer and see a software update…stuck. No worries, I'll\nreboot! Okay, Recovery Mode! Also, Restore from Time Machine…wtf? Why the hell\ndid it stop at 39%? <em>opens logs</em> Can't find linker for CoreSomethingOrOther?\nGood grief, reboot! Ghostbusters logo in white, sans ghost. WHAT. THE. FUCK. I\nopen the Apple Support app, choose my laptop from my devices list, and chat\nwith a rep. After confirming I didn't want to book a Genius Bar appointment on\nmy wedding day, I shut down my computer and went to bed in a huff (I prefaced\nmy availability and was still asked…bruh).</p>\n<p>Fast-forward a few days and I'm talking to a nice Genius about my computer\nissue (and Nintendo Switch, he's trying to justify buying one). He performs\nmany of the same things I did to try and get my computer to work. Lo and\nbehold, my computer lives! It breathes! It scrolls the wrong direction by\ndefault (Natural Scrolling is WRONG, you <em>heathens</em>)! I eagerly head home to\nperform a three-hour restore from my Time Machine.</p>\n<h2>I done goofed</h2>\n<p>I went through the same recovery process I've done days prior. What did I see?\nGHOST. BUSTERS! Managed to get into Recovery Mode to try for the last time,\nrestoring via Time Machine, even though I knew it would end in error. First\nthough, I should reformat the drive with Apple's File System (APFS)…<em>Could not\ncreate a preboot volume for APFS install</em>. Welp. Time to fire up the iPad to\nsearch for solutions.</p>\n<h2>Salvation</h2>\n<p>After scouring the Internet for some <em>semblance</em> of a solution, I stumbled upon\na post<a href=\"https://discussions.apple.com/thread/8106654\">1</a> on Apple's own support forums by a user named Ethoic. Here is that\npost in full:</p>\n<blockquote>\n<p>Right Mac users. If your facing the same problem like me then I suggest you\nlisten up. First don't try to install Mac OS high Sierra again or try\nanything else. You want to first of delete your drive until you have no\ndrive. Yes I mean no drive. To do this, power off your Mac and then hold\ncommand + R and boot up your Mac. This should do the trick. Then delete your\ndrive in disk utility by clicking the minus button on the top right and then\nenter internet recovery mode by repeating the process though this time adding\noption and then command + R. Then you will enter the same menu which is mac\nos utilities and then this time instead of Mac OS High Sierra you will just\nsee Sierra. Go disk utilty  and create a disk this time clicking + and make\na drive calling it Macintosh HD with the format Mac OS Extended. The fix is\nyour removing the APFS system which is what is confusing the drive which for\nsome reason apple can't figure out them self. Then just click install Mac OS\nand you should be good to go. Hope your all good and ask anything you need.</p>\n</blockquote>\n<p>Let's break that down into steps for ease of reading:</p>\n<ol>\n<li>Don't try to install macOS High Sierra again.</li>\n<li>Delete your drive until you have no drive. Seriously.<ul>\n<li>Power off your Mac and then hold the <code>Command + R</code> keys while booting.</li>\n<li>Delete your drive in Disk Utility. You should only see the macOS\nRecovery Drive. <em>Leave this alone.</em></li>\n</ul>\n</li>\n<li>Reboot Mac and hold down the <code>Option + Command + R</code> keys to activate\nInternet Recovery mode. Oh yeah, you'll need wifi. Make sure you're\nconnected.</li>\n<li>You should see a drive in Disk Utility. If you don't see a drive and are\nunable to click the little plus button to create one, reboot until you do…\nthis was a little weird for me, might not happen to you.<ul>\n<li>If you do see a drive, reformat it as \"Mac OS Extended\" and call it\n\"Macintosh HD\".</li>\n<li>There are a couple options for \"Mac OS Extended\". If you have a Time\nMachine backup you want to keep, know that you should choose \"Case\nsensitive\" if you setup your OS to be case sensitive (as an example).</li>\n</ul>\n</li>\n<li>Initiate Internet Recovery.</li>\n<li>Once the recovery is successful, use Migration Assistant to restore from a\nTime Machine backup.</li>\n</ol>\n<p>Restoring from Time Machine from scratch has NEVER worked for me and\nseemingly, 99% of the Internet. Absolute trash IMO. I'm glad I got my data\nback but jeez. So many hours of my life wasted because of this issue. And the\nproductivity loss (but Super Mario Odyssey <em>gains</em>)! Oh, and I'm not on the\nmacOS beta anymore, haha. Other folks who have the same issue didn't seem to\nbe on a beta OS but you can never be too sure.</p>\n<p>If you are currently on a macOS beta and would like to hop off that train<a href=\"https://superuser.com/a/845520\">2</a>:</p>\n<blockquote>\n<p>On <code>System Preferences → App Store</code> you have an option called \"Your computer\nis set to receive pre-releases Software Update seeds\", use the button\n<code>Change</code> and select <code>Do Not Show Pre-release Updates</code>.</p>\n</blockquote>\n<p>Hope this helps! 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"6c94b79228974029de49815d5d4247e9d42fec9dcc4b5a90cd38fe18acee4dd3","category":"Sites"}