{"title":"Curiosity as an Instrument of Love: Thoreau and the Little Owl","link":"https://www.themarginalian.org/2024/09/22/thoreau-screech-owl/","date":1727056833000,"content":"<h3>“If you would learn the secrets of Nature, you must practice more humanity than others.” </h3>\n<hr />\n<p><a href=\"http://www.amazon.com/Journal-Thoreau-1837-1861-Review-Classics/dp/159017321X/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2013/06/thoreaujournal.jpg?w=680&amp;ssl=1\" /></a>Among the things I most cherish about science is the way it anneals curiosity. True curiosity is an open wonderment at what something is and how it works without emotional attachment to the outcome of observation and experiment. It is only when we cede emotional attachment that we can be truly free from judgment, for all judgment is feeling — usually some species of fear — masquerading as thought. And when we judge, we cannot understand. True curiosity is therefore a form of love, because, as the great Zen teacher Thich Nhat Hanh so plainly and poignantly put it, <a href=\"https://www.themarginalian.org/2015/03/31/how-to-love-thich-nhat-hanh/\">“understanding is love’s other name.”</a></p>\n<p>There have been few more curious and loving observes of this world than <strong>Henry David Thoreau</strong> (July 12, 1817–May 6, 1862). “Life! who knows what it is, what it does?” he exclaimed on the pages of <a href=\"https://www.themarginalian.org/2023/03/23/thoreau-friendship/\">his journal</a> — perhaps the book in my library most populous with highlights and marginalia — a tender record of Thoreau’s yearning to understand the nature and workings of life in all its physical and psychic manifestations, not as a scientist but as a poet. “Every poet has trembled on the verge of science,” he conceded as he read books of ornithology to deepen his reverence for the birds he observed, and yet it was with a poet’s eyes that he observed them, animated by the belief that “the poet’s relation to his theme is the relation of lovers.”</p>\n<p>Because curiosity is a supreme act of unselfing, it is at its most difficult and most rewarding when aimed at what is most unlike ourselves — as Thoreau’s is in his journal account of a singular encounter from the autumn of 1855.</p>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?resize=680%2C357&amp;ssl=1\" width=\"680\" height=\"357\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?resize=320%2C168&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?resize=600%2C315&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?resize=240%2C126&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/Thoreau_owl_Marginalian2.jpg?resize=768%2C403&amp;ssl=1 768w\" /></p>\n<p>One “raw and windy” October afternoon, paddling down a stream under the overcast skies, Thoreau sees a small screech-owl perched on the lee side of a three-foot hemlock stump, looking at him with its “great solemn eyes” and raised horns. An epoch before science began illuminating the mysteries of <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">what it’s like to be an owl</a>, he marvels at this creature so profoundly other:</p>\n<blockquote><p>It sits with its head drawn in, eying me, with its eyes partly open, about twenty feet off. When it hears me move, it turns its head toward me, perhaps one eye only open, with its great glaring golden iris. You see two whitish triangular lines above the eyes meeting at the bill, with a sharp reddish-brown triangle between and a narrow curved line of black under each eye…. You would say that this was a bird without a neck. Its short bill, which rests upon its breast, scarcely projects at all, but in a state of rest the whole upper part of the bird from the wings is rounded off smoothly, excepting the horns, which stand up conspicuously or are slanted back.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2015/04/22/beastly-verse-joohee-yoon/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/05/beastlyverse1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Art by JooHee Yoon from <a href=\"https://www.themarginalian.org/2015/04/22/beastly-verse-joohee-yoon/\"><em>Beastly Verse</em></a></figcaption></figure>\n<p>After observing the bird for ten minutes, transfixed by its strangeness, Thoreau decides he must study the creature closely to better understand its umwelt. He lands the boat and carefully makes his way to the hemlock from the windward side, surprised to find the owl unperturbed by his approach. Unlike the ornithologists of his day, who killed in order to know and reduced living species to “specimens” — even Audubon, for all his tenderheartedness, shot every bird he drew and described — Thoreau sets out to capture the living bird. (“If you would learn the secrets of Nature, you must practice more humanity than others,” he writes in another journal entry.) Sneaking up behind the hemlock, he springs out his arm to gently grasp the little owl, which is so surprised that it offers no resistance but only glares at him “in mute astonishment with eyes as big as saucers.” He swaddles it in his handkerchief, rests it at the bottom of the boat, and paddles home, where he builds a small cage for observation. He marvels at the seemingly neckless owl puffing out its feathers and stretching out its neck, slowly rotating its head in that singular owl way. He tries to imitate its hiss “by a guttural whinnering.” He offers his hand, to which the bird clings so tightly that it draws blood from his fingers. He regards its “squat figure” and “catlike” face, the fine white down covering its legs all the way down to the sharp talons. </p>\n<p>When dusk falls, he sits down to record his observations and becomes the object of observation himself, the owl looking out at him with its immense eyes, intent and perfectly still. Thoreau writes:</p>\n<blockquote><p>It would lower its head, stretch out its neck, and, bending it from side to side, peer at you with laughable circumspection; from side to side, as if to catch or absorb into its eyes every ray of light, strain at you with complacent yet earnest scrutiny. Raising and lowering its head and moving it from side to side in a slow and regular manner, at the same time snapping its bill smartly perhaps, and faintly hissing, and puffing itself up more and more, — cat-like, turtle-like, both in hissing and swelling. The slowness and gravity, not to say solemnity, of this motion are striking.</p>\n<p>[…]</p>\n<p>He sat, not really moping but trying to sleep, in a corner of his box all day, yet with one or both eyes slightly open all the while. I never once caught him with his eyes shut.</p></blockquote>\n<p>When morning comes, Thoreau sets out to return the bird to its home, rowing back to the hill with the hemlock. But to his surprise, the owl refuses to leave the box and has to be gently shaken out of it. With raw reverence for this creature, this mind so incomprehensibly other yet so strangely kindred, he records their farewell:</p>\n<blockquote><p>There he stood on the grass, at first bewildered, with his horns pricked up and looking toward me. In this strong light the pupils of his eyes suddenly contracted and the iris expanded till they were two great brazen orbs with a centre spot merely. His attitude expressed astonishment more than anything. I was obliged to toss him up a little that he might feel his wings, and then he flapped away low and heavily to a hickory on the hillside twenty rods off.</p></blockquote>\n<p>There is something poignant in this account — a disquieting reminder of how accustomed we too grow to the false comforts of our traps, how unwilling to leave them for the terror of freedom, how we too may need a gentle push to feel our own wings. Our habitual way of seeing is also a comfort and a trap. In another entry, Thoreau wonders what it might be like to “witness with owls’ eyes” the life of the forest, then concludes that what we perceive of the world is what we receive in the world and each person “receives only what he is ready to receive, whether physically or intellectually or morally.”</p>\n<figure><a href=\"https://www.themarginalian.org/2020/11/21/the-lost-spells-macfarlane-morris/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/11/owl-closeup.jpg?w=1200&amp;ssl=1\" /></a><figcaption>Art by Jackie Morris from <a href=\"https://www.themarginalian.org/2020/11/21/the-lost-spells-macfarlane-morris/\"><em>The Lost Spells</em></a></figcaption></figure>\n<p>Complement with the strange and wondrous science of <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">how owls hear with sound</a>, then revisit Thoreau on <a href=\"https://www.themarginalian.org/2023/03/01/thoreau-grief/\">living through loss</a>, <a href=\"https://www.themarginalian.org/2022/08/09/walden-solitude/\">the Milky Way and the meaning of life</a>, and his <a href=\"https://www.themarginalian.org/2023/03/23/thoreau-friendship/\">introvert’s field guide to friendship</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"6c9fab3903dd16cbc2c4f9fdf816e25faa578b3e917b83e6b28061282fb48347","category":"Sites"}