{"title":"Here’s how to live: Make a million mistakes.","link":"https://sive.rs/htl25","date":1640390400000,"content":"<p>\nYou learn best from your mistakes.\n<br />\nThis is true.\n<br />\nSo you should deliberately make as many mistakes as possible.\n</p><p>\nTry absolutely everything, all the time, expecting everything to fail.\n<br />\nJust make sure that you capture the lessons from each experience.\n<br />\nAnd never make the same mistake twice.\n</p><p>\nYou’ll be extremely experienced.\n<br />\nYou’ll get incredibly smart.\n<br />\nYou’ll learn more lessons in a day than others learn in a year.\n</p><p>\nDeliberate mistakes are inspiring.\n<br />\nTrying to write a great song is hard.\n<br />\nTrying to write a bad song is easy and fun.\n<br />\nYou could do it in one minute, right now.\n</p><p>\nWriters say you should quickly finish a bad first draft, because it gets the idea out of your head and into reality, where it can then be improved.\n<br />\nLive your whole life this way.\n<br />\nJump into action without hesitation or worry.\n<br />\nYou’ll be faster and do more than everyone else.\n<br />\nWhat takes them a month will take you an hour, so you can do it ten times a day.\n</p><p>\nDo what everyone says not to.\n<br />\nIgnore every warning so you can find out for yourself.\n<br />\nLearn by hands-on experience.\n<br />\nThe more mistakes you make, the faster you learn.\n<br />\nOnce you’ve made all the mistakes in a field, you’re considered an expert.\n</p><p>\nSee, you only really learn when you’re surprised — when your previous idea of something was wrong.\n<br />\nIf you’re not surprised, it means the new information fits in with what you already know.\n<br />\nSo try to be wrong.\n<br />\nTry to disprove your beliefs.\n<br />\nNever believe something on faith.\n<br />\nProve it or disprove it.\n<br />\nWhile other people have one idea that they think might work, you will have thousands you can prove didn’t work, and one you couldn’t make fail.\n</p><p>\nJust keep a log.\n<br />\nA mistake only counts as experience if you learn from it.\n<br />\nRecord what you learned, and review it.\n<br />\nOtherwise, it was a waste.\n</p><p>\nTake on big challenges.\n<br />\nStart a company in Silicon Valley.\n<br />\nAsk investors for millions.\n<br />\nAudition for Hollywood movies.\n<br />\nInvite your dream date to dinner.\n<br />\nWhile everyone else is nervously preparing, you jump right in, unafraid to fail.\n</p><p>\nCreate predicaments.\n<br />\nGet into trouble.\n<br />\nBeing desperate leads to creative solutions.\n</p><p>\nThis gives you emotional stability.\n<br />\nNo mistake will upset you.\n<br />\nYou’ll never think that a failed attempt means you’re a failure.\n</p><p>\nThe people devastated by failure are the ones who didn’t expect it.\n<br />\nThey mistakenly think failure is who they are instead of the result of one attempt.\n<br />\nIf you’re prepared for endless failures, you’ll never think of yourself as a failure.\n</p><p>\nThere’s only one difference between a successful person and a failure.\n<br />\nA failure quits, which concludes the story, and earns the title.\n</p><p>\nYour growth zone is your failure zone.\n<br />\nBoth are at the edge of your limits.\n<br />\nThat’s where you find a suitable challenge.\n<br />\nAim for what will probably fail.\n<br />\nIf you aim for what you know you can do, you’re aiming too low.\n</p><p>\nIt’s easy to make a robot that walks.\n<br />\nIt’s hard to make a robot that can’t be knocked down.\n<br />\nSame with people.\n<br />\nPeople who avoid mistakes are fragile, like the robot that only walks.\n<br />\nYour million mistakes will make you someone that can’t be knocked down.\n</p><p>\nMistakes are the fountain of youth.\n<br />\nThe old and successful get fragile.\n<br />\nThey think they know everything.\n<br />\nThey over-invest in one solution.\n<br />\nThey have only answers, not questions.\n<br />\nIf you’re never wrong, you never change.\n<br />\nKeep making mistakes, so you can keep changing, learning, and growing.\n</p><p>\nShare your stories from all your mistakes for the benefit of the world.\n<br />\nEvery plane crash makes the next one less likely.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"6d918c3b175871a524f27f0613e67399f2db14b94f91375392f39991c34e4dae","category":"Sites"}