{"title":"We Are Free to Change the World: Hannah Arendt, the Power of Defiant Goodwill, and the Art of Beginning Afresh","link":"https://www.themarginalian.org/2024/03/15/we-are-free-to-change-the-world-hannah-arendt/","date":1710516297000,"content":"<h3>“It is when the experience of powerlessness is at its most acute, when history seems at its most bleak, that the determination to think like a human being, creatively, courageously, and complicatedly, matters the most.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Are-Free-Change-World-Disobedience/dp/0593229738/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?fit=320%2C480&amp;ssl=1\" alt=\"We Are Free to Change the World: Hannah Arendt, the Power of Defiant Goodwill, and the Art of Beginning Afresh\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?w=1000&amp;ssl=1 1000w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?resize=240%2C360&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/arendt_change.jpg?resize=768%2C1152&amp;ssl=1 768w\" /></a></p><p>“We speak of four fundamental forces,” a physicist recently said to me, “but I believe there are only two: good and evil” — a startling assertion coming from a scientist. Beneath it pulsates the sensitive recognition that it is precisely because free will is <a href=\"https://www.themarginalian.org/2023/05/13/free-will-bbc/\">so uncomfortably at odds</a> with everything we know about the nature of the universe that the experience of freedom — which is different from the fact of freedom — is fundamental to our humanity; it is precisely because we were forged by these impartial forces, these handmaidens of chance, that our choices — which always have a moral valence — give meaning to reality. </p>\n<p>Whether our cosmic helplessness paralyzes or mobilizes us depends largely on how we orient to freedom and what we make of agency. “The smallest act in the most limited circumstances,” <a href=\"https://www.themarginalian.org/tag/hannah-arendt/\">Hannah Arendt</a> wrote in <a href=\"https://www.themarginalian.org/2017/05/17/hannah-arendt-human-condition-speech-action/\"><em>The Human Condition</em></a>, “bears the seed of… boundlessness, because one deed, and sometimes one word, suffices to change every constellation.”</p>\n<figure><a href=\"http://www.amazon.com/Life-Mind-Combined-Volumes-Vols/dp/0156519925/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/09/hannaharendt2.jpg?w=680&amp;ssl=1\" /></a><figcaption>Hannah Arendt by Fred Stein, 1944. (Photograph courtesy of the Fred Stein Archive.)</figcaption></figure>\n<p>Arendt’s rigorously reasoned, boundlessly mobilizing defiance of helplessness and “the stubborn humanity of her fierce and complex creativity” come abloom in <a href=\"https://www.amazon.com/Are-Free-Change-World-Disobedience/dp/0593229738/?tag=braipick-20\" target=\"_blank\"><strong><em>We Are Free to Change the World: Hannah Arendt’s Lessons in Love and Disobedience</em></strong></a> (<a href=\"https://search.worldcat.org/title/1378097397\" target=\"_blank\"><em>public library</em></a>) — Lyndsey Stonebridge’s erudite and passionate celebration of what Arendt modeled for generations and goes on modeling for us: “determined and splendid goodwill, refusing to accept the compromised terms upon which modern freedom is offered and holding out for something new.”</p>\n<p>Stonebridge, who has been studying Arendt for three decades, writes:</p>\n<blockquote><p>Hannah Arendt is a creative and complex thinker; she writes about power and terror, war and revolution, exile and love, and, above all, about freedom. Reading her is never just an intellectual exercise, it is an experience.</p>\n<p>[…]</p>\n<p>She loved the human condition for what it was: terrible, beautiful, perplexing, amazing, and above all, exquisitely precious. And she never stopped believing in a politics that might be true to that condition. Her writing has much to tell us about how we got to this point in our history, about the madness of modern politics and about the awful, empty thoughtlessness of contemporary political violence. But she also teaches that it is when the experience of powerlessness is at its most acute, when history seems at its most bleak, that the determination to think like a human being, creatively, courageously, and complicatedly, matters the most.</p></blockquote>\n<p>She too lived in a “post-truth era,” she too watched the fragmentation of reality in a shared world, and she saw with uncommon lucidity that the only path to freedom is the free mind. Whether she was writing about <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">love and how to live with the fundamental fear of loss</a> or about <a href=\"https://www.themarginalian.org/2016/06/15/lying-in-politics-hannah-arendt/\">lying in politics</a>, she was always teaching her reader, as Stonebridge observes, not what to think but how to think — a credo culminating in her parting gift to the world: <a href=\"https://www.themarginalian.org/2014/09/16/hannah-arendt-the-life-of-the-mind/\"><em>The Life of the Mind</em></a>.</p>\n<figure><a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=680%2C939&amp;ssl=1\" width=\"680\" height=\"939\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=240%2C331&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=320%2C442&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=768%2C1060&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=600%2C829&amp;ssl=1 600w\" /></a><figcaption>Art by Ofra Amit from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>. Available <a href=\"https://society6.com/product/a-velocity-of-being-ofra-amit_print?sku=s6-10131622p4a1v1?curator=brainpicker\" target=\"_blank\">as a print</a>.</figcaption></figure>\n<p>In consonance with George Saunders’s <a href=\"https://www.themarginalian.org/2023/04/09/george-saunders-uncertainty/\">lovely case for the courage of uncertainty</a> and his insistence that possibility is a matter of trying to <a href=\"https://www.themarginalian.org/2024/03/11/regret/\">“remain permanently confused,”</a> Stonebridge writes:</p>\n<blockquote><p>Having a free mind in Arendt’s sense means turning away from dogma, political certainties, theoretical comfort zones, and satisfying ideologies. It means learning instead to cultivate the art of staying true to the hazards, vulnerabilities, mysteries, and perplexities of reality, because ultimately that is our best chance of remaining human.</p></blockquote>\n<p>Having “escaped from the black heart of fascist Europe and its crumbling nation states,” having witnessed the horrors of the Holocaust and the rise of totalitarian regimes around the world, Arendt never stopped thinking and writing about what it means to be human — an example of what she considered the <a href=\"https://www.themarginalian.org/2014/09/16/hannah-arendt-the-life-of-the-mind/\">“unanswerable questions” feeding our “capacity to ask all the answerable questions upon which every civilization is founded.”</a> </p>\n<p>Celebrating Arendt as a “conservationist” who “traveled back into the traditions of political and philosophical thought in search of new creative pathways to the present,” Stonebridge reflects:</p>\n<blockquote><p>Fundamental questions about the human condition are not beside the point in dire political times; they are the point. How can we think straight amidst cynicism and mendacity? What is there left to love, to cherish, to fight for? How can we act to best secure it? What fences and bridges do we need to build to protect freedom and which walls do we need to destroy?</p></blockquote>\n<p>In my own longtime immersion in Arendt’s world, I have often shuddered at how perfectly her indictment of political oppression applies to the tyranny of consumerist society, although Arendt did not overtly address that. In this passage from Stonebridge, one could easily replace “Nazism,” “totalitarianism,” and “the Holocaust” with “late-stage capitalism” and feel the same sting of truth:</p>\n<blockquote><p>Nazism was undoubtedly tyrannical, and self-evidently fascist in its gray-black glamour, racist mythology, and disregard for the rule of law. However, Arendt argued that modern dictatorship had an important new feature. Its power reached everywhere: not a person, an institution, a mind, or a private dream was left untouched. It squeezed people together, crushing out spaces for thought, spontaneity, creativity — defiance. Totalitarianism was not just a new system of oppression, it seemed to have altered the texture of human experience itself.</p>\n<p>[…]</p>\n<p>The moral obscenity of the Holocaust had to be recognized, put on trial, grieved, and addressed. But it could not be made right with existing methods and ideologies… You cannot simply will this evil off the face of the earth with a few good ideas, let alone with the old ones that allowed it to flourish in the first place. You have to start anew.</p></blockquote>\n<figure><a href=\"https://society6.com/product/we-found-our-own-o-my-soul-in-the-calm-and-cool-of-the-daybreak_framed-print?sku=s6-8967204p21a12v52a13v54?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=680%2C883&amp;ssl=1\" width=\"680\" height=\"883\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=240%2C312&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=320%2C415&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=768%2C997&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass1.jpg?resize=600%2C779&amp;ssl=1 600w\" /></a><figcaption>One of English artist Margaret C. Cook’s illustrations for <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a rare 1913 edition</a> of Walt Whitman’s  of <em>Leaves of Grass</em>. (Available <a href=\"https://society6.com/product/we-found-our-own-o-my-soul-in-the-calm-and-cool-of-the-daybreak_framed-print?sku=s6-8967204p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>This belief that “we are free to change the world and to start something new in it” animated Arendt’s life — a freedom she located not in what she termed <em>reckless optimism</em> (the divested shadow side of Rebecca Solnit’s notion of <a href=\"https://www.themarginalian.org/2016/03/16/rebecca-solnit-hope-in-the-dark-2/\">hope as an act of defiance</a>), but in <a href=\"https://www.themarginalian.org/2018/03/12/hannah-arendt-thinking-without-a-banister-action-happiness/\">action as the crux of the pursuit of happiness</a> — what Stonebridge so astutely perceives as “the determination to exist as a fully living and thinking person in a world among others.” She writes:</p>\n<blockquote><p>Freedom cannot be forced; it can only be experienced in the world and alongside others. It is on this condition that we are free to change the world and start something new in it.</p></blockquote>\n<p>Echoing Albert Camus’s insistence that <a href=\"https://www.themarginalian.org/2016/06/17/albert-camus-the-rebel/\">“real generosity toward the future lies in giving all to the present,”</a> she adds:</p>\n<blockquote><p>Learning to love the world means that you cannot be pleasantly indifferent about its future. But there is a wisdom in knowing that change has come before and, what is more, that it will keep on coming, often when you least expect it; unplanned, spontaneous, and sometimes, even just in time. That, for Hannah Arendt, is the human condition.</p></blockquote>\n<p>Couple <a href=\"https://www.amazon.com/Are-Free-Change-World-Disobedience/dp/0593229738/?tag=braipick-20\" target=\"_blank\"><strong><em>We Are Free to Change the World</em></strong></a> — a superb read in its entirety — with James Baldwin on <a href=\"https://www.themarginalian.org/2021/06/06/james-baldwin-giovannis-room-love-choice/\">the paradox of freedom</a>, John O’Donohue on <a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\">the transcendent terror of new beginnings</a>, and Bertrand Russell on <a href=\"https://www.themarginalian.org/2016/05/18/bertrand-russell-free-thought-propaganda-doubt/\">the key to a free mind</a>, then revisit Arendt on <a href=\"https://www.themarginalian.org/2017/05/17/hannah-arendt-human-condition-speech-action/\">how we invent ourselves and reinvent the world</a>, <a href=\"https://www.themarginalian.org/2016/04/12/hannah-arendt-men-in-dark-times/\">the power of being an outsider</a>, and <a href=\"https://www.themarginalian.org/2021/07/14/hannah-arendt-forgiveness/\">what forgiveness really means</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"6df4a0f902da4a3404bdb47979b57360532ab93ed2825bc1c1e36f77ca19e689","category":"default"}