{"title":"Wah Ustad! Zakir Hussain’s Lasting Lessons","link":"https://om.co/2024/12/16/wah-ustad-zakir-hussains-lasting-lessons/","date":1734369107000,"content":"<p>It’s a hell of a noise to be woken up by your continuous glucose monitoring app sending an alert for a hyp<em>o</em>glycemic event. As a diabetic, you’ve got to pay attention to this — get up, take a quick sip of apple juice, and wait for things to get better. While you’re doing that, you end up reading news on your app.</p>\n\n\n\n<p>And then you go, “Damn.” Because you have <a href=\"https://www.bbc.com/news/articles/cwype77kwyjo\" target=\"_blank\">just learned that</a> Ustad <a href=\"https://en.wikipedia.org/wiki/Zakir_Hussain_(musician)\" target=\"_blank\">Zakir Hussain</a>, the tabla maestro, passed away yesterday at UCSF in San Francisco due to complications from idiopathic pulmonary fibrosis. He was 73. His passing made me think about him, his music, and how it dovetailed with my own life. It also made me realize how much of our modern digital life — <a href=\"https://om.co/2020/02/20/facetime-with-techs-dual-reality/\">convenient as it might be</a> — disconnects us from our memories.</p>\n\n\n\n<p>When I look at my “Replay” lists from my online music services, I see a remarkable similarity in what I listened to most often. No matter how much I tried, I found myself listening to my favorite few artists, though honestly, I couldn’t tell you what the albums look like or which tracks are from which album. Eric Hilton, one-half of Thievery Corporation, was my No. 1 artist in 2023 and 2024. Nils Frahm is second, and the next eight are some variation of the same. Again — I have no recollection as to when I listened to these songs, or why, or with whom. It is music without joy of memories. (<a href=\"https://om.co/2020/06/10/other-music-the-other-end-of-algorithmic-discovery/\">Read my essay about algorithmic discovery</a> and it lack of emotional appeal.) </p>\n\n\n\n<p>Not so with the late Ustad’s music.</p>\n\n\n\n<hr />\n\n\n\n<figure><div>\n<div></div>\n</div></figure>\n\n\n\n<p>Funnily enough, my first vivid memory of the Ustad was an advertisement for Taj Mahal Tea — where he is teaching a young student. (See ad.) That ad made him a household name and an icon, even though he had notched up many firsts all around the globe.</p>\n\n\n\n<p>Music is such a wonderful mile marker. I remember being in college — St. Stephen’s Science Block Common Room — when I discovered the band Shakti, Ustad Hussain’s collaboration with John McLaughlin, thanks to my then-new and now life long friend Rajiv Malikarjun. A few years later, while living in New York with Tito Ghosh, another childhood friend from my early life, we together discovered the album “Planet Drum” and the fusion electronica group Tabla Beat Science.</p>\n\n\n\n<p>I remember the record sleeve from my college commons just as I remember the covers of Tabla Beat Science CDs I bought from Other Music, the cool indie record store on 4th Street, between Lafayette Street and Broadway in lower Manhattan. (You should <a target=\"_blank\" href=\"https://www.othermusicdocumentary.com/about-1\">check out the documentary</a> on Other Music.) These days, though, it is hard to form such a memorable bond with music.</p>\n\n\n\n<p>My childhood friend Tito grew up in what Indians called a cultured family — they went to art galleries and dance recitals, watched <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Satyajit_Ray_filmography\">Satyajit Ray films,</a> and listened to classical music. My childhood was different, and so were my influences. Like my college friends, Tito often exposed me to these new cultural ideas, including Zakir Hussain’s music. We saw him perform live in Central Park before I moved out West.</p>\n\n\n\n<p>I’m not much of a concert-goer — large crowds in confined spaces are not my jam. People often talk about the energy of a performance and the crowd creates a sublime experience. Not for me. I much prefer a future when I can watch live concerts in my Vision Pro. I know, I’m weird like that.</p>\n\n\n\n<p>As I waited for my blood sugar levels to normalize, I ended up reading some old articles about Zakir Hussain, and they made me realize how much we could have learned from his life. Despite being a maestro of tabla in the purest classical art form, he wasn’t afraid to push the envelope.</p>\n\n\n\n<p>Whether it was Shakti, Planet Drum, or Tabla Beat Science, he was ready to try the new, experiment, and imagine reinterpreting his art and skills in a new fashion. Yet he remained true to his core and his essence. We could all strive to live in such a way.</p>\n\n\n\n<blockquote>\n<p>“You know, you come from India and you say, ‘OK, I’m representing a 3,000-year-old history,’ so you think you’re gonna teach the world about rhythms and drums and so on. And then you arrive here. You suddenly realize that you know nothing. You’re just one little dot in the painting that is the music of the universe.”</p>\n</blockquote>\n\n\n\n<p>He is really talking about what we now call “day zero.” No matter how much you know, you can never stop learning and evolving. What a great lesson for everyone, including those who deem themselves experts. You are almost always the student, always part of the process, and part of the collective that leads to a better place, as he so wonderfully said in an interview.</p>\n\n\n\n<blockquote>\n<p>“The moment you think you’re a maestro, you are distancing yourself from the others. You have to be part of a group, and not dominate it.”</p>\n</blockquote>\n\n\n\n<p>When reflecting on his journey, it became clear that he never considered the work truly finished. A few years ago, when asked about his two Grammy Awards (now five), <a target=\"_blank\" href=\"https://www.miaminewtimes.com/music/zakir-hussain-tabla-master-who-worked-with-george-harrison-and-mickey-hart-changed-my-life-9266443\">he said</a>:</p>\n\n\n\n<blockquote>\n<p>“That happened already. I can’t be standing on what’s already happened. I have to be better every day that goes by.”</p>\n</blockquote>\n\n\n\n<p>True to that belief, earlier this year he made history as the first Indian musician to win three Grammy Awards in a single year. His collaborative spirit shone through each victory: the soundtrack for <em>“Pashto,”</em> created with American virtuosos Béla Fleck (banjo) and Edgar Meyer (bass), alongside Indian flutist Rakesh Chaurasia; the best contemporary instrumental album for <em>“As We Speak,”</em> another boundary-pushing venture with the same ensemble; and perhaps most fittingly, the best global music album for <em>“This Moment,”</em> a triumphant return with his pioneering world-fusion band, Shakti.</p>\n\n\n\n<blockquote>\n<p>“We were all on the same wavelength, the same quest, looking for perfection, which we will never find. But that didn’t matter because it’s all about the journey — not the goal.”</p>\n</blockquote>\n\n\n\n<p>Wah, Ustad!</p>\n\n\n\n<p><em>December 16, 2024. San Francisco</em></p>\n\n\n\n<hr />\n\n\n\n<h4>Additional Reading</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2020/06/10/other-music-the-other-end-of-algorithmic-discovery/\">Algorithmic discovery of music lacks emotional appeal</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2017/12/23/has-music-lost-that-loving-feeling/\">Has music lost that loving feeling?</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2019/10/13/big-tech-people-a-complicated-relationship-of-convenience/\">Big Tech &amp; people: a complicated relationship of convenience</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2020/02/20/facetime-with-techs-dual-reality/\">FaceTime with Tech’s Dual Reality</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"6ebab369d23460abff604bf43acda930c4073f92e7aa503f0c78ddef75839d47","category":"Sites"}