{"title":"Sentimentality and Being Mortal: Poet Mark Doty on the Passionate Fragility of Our Attachments","link":"https://www.themarginalian.org/2024/01/13/mark-doty-sentimentality/","date":1705181066000,"content":"<p><a href=\"https://www.amazon.com/Dog-Years-Memoir-Mark-Doty/dp/0061171018/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"487\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?fit=320%2C487&amp;ssl=1\" alt=\"Sentimentality and Being Mortal: Poet Mark Doty on the Passionate Fragility of Our Attachments\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?w=893&amp;ssl=1 893w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?resize=320%2C487&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?resize=600%2C914&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?resize=240%2C366&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/dogyears_doty.jpg?resize=768%2C1170&amp;ssl=1 768w\" /></a></p><p>How beautiful and unbearable that only one of each exists — each lover, each child, each dog; that this particular chance-constellation of atoms has never before existed and will never again recur in the history of the universe. The fact of each such singularity is a wonder beyond why, as mysterious and irrefutable as the reason you love one and not another. The feeling trembling beneath the fact — the brutal knowledge that everything we love is irreplaceable yet will be lost: to dissolution and death, to rejection and indifference, to our own return to stardust — is the hardest thing to bear, the thing for which we have devised <a href=\"https://www.themarginalian.org/2023/04/25/ernest-becker-heroism/\">our most elaborate theaters of denial</a>. </p>\n<p>Among those coping mechanisms is the invention of sentimentality. “Sentimentality is a superstructure covering brutality,” Carl Jung wrote. Its strange psychological machinery is what the poet Mark Doty explores with uncommon insight and sensitivity in a passage from his wonderful memoir <a href=\"https://www.amazon.com/Dog-Years-Memoir-Mark-Doty/dp/0061171018/?tag=braipick-20\" target=\"_blank\"><strong><em>Dog Years</em></strong></a> (<a href=\"https://search.worldcat.org/title/69792686\" target=\"_blank\"><em>public library</em></a>). </p>\n<p>He writes:</p>\n<blockquote><p>The oversweetened surface of the sentimental exists in order to protect its maker, as well as the audience, from anger. At the beautiful image refusing to hold, at the tenderness we bring to the objects of the world — our eagerness to love, make home, build connection, trust the other — how all of that’s so readily swept away. Sentimental images of children and of animals, sappy representations of love — they are fueled, in truth, by their opposites, by a terrible human rage that nothing stays. The greeting card verse, the airbrushed rainbow, the sweet puppy face on the fleecy pink sweatshirt — these images do not honor the world as it is, in its complexity and individuality, but distort things in apparent service of a warm embrace. They feel empty because they will not acknowledge the inherent anger that things are not as shown; the world, in their terms, is not a universe of individuals but a series of interchangeable instances of charm. It is necessary to assert the insignificance of individuality to make mortality bearable. In this way, the sentimental represents a rage against individuality, the singular, the irreplaceable. (<em>Why don’t you just get another dog?</em>) The anger that lies beneath the sentimental accounts for its weird hollowness. But it is, I supposed, easier to feel than what lies beneath rage: the terror of emptiness, of waste, of the absence of meaning or value; the empty space of our own death, neither comprehensible nor representable.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?resize=680%2C851&amp;ssl=1\" width=\"680\" height=\"851\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?resize=240%2C300&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?resize=320%2C401&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?resize=768%2C961&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass25.jpg?resize=600%2C751&amp;ssl=1 600w\" /></a><figcaption>Art by Margaret C. Cook for <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a 1913 edition</a> of Walt Whitman’s <em>Leaves of Grass</em>. (Available <a href=\"https://society6.com/product/i-musing-late-in-the-autumn-day_framed-print?sku=s6-8967581p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>Of course, our fury at entropy is the great motive force of our creativity — we make art to make meaning out of our mortality, to counteract its brutality with beauty. Every creative act is an act of consolation for our transience, for our despair about our transience. A century after Albert Camus insisted that <a href=\"https://www.themarginalian.org/2015/11/30/albert-camus-travel-lyrical-critical-essays/\">“there is no love of life without despair of life,”</a> Doty contemplates this fundamental equivalence of existence:</p>\n<blockquote><p>Despair, I think, is the fruit of a refusal to accept our mortal situation. Perhaps it’s less passive than it may seem; is despair a deep assertion of will? The stubborn self saying, <em>I will not have it, I do not accept it</em>. <em>Fine</em>, says the world, <em>don’t accept it</em>. The collective continues; the whole goes on, while each part slips away. To attach, to attach passionately to the individual, which is always doomed to vanish — does that make one wise, or make one a fool?</p></blockquote>\n<p>Complement with Annie Dillard on <a href=\"https://www.themarginalian.org/2023/04/30/annie-dillard-for-the-time-being/\">how to bear your mortality</a> and D.H. Lawrence on <a href=\"https://www.themarginalian.org/2023/05/09/d-h-lawrence-death/\">the best lifelong preparation for death</a>, then revisit Doty’s magnificent Whitman-lensed reflection on <a href=\"https://www.themarginalian.org/2021/09/26/whitman-love-death-doty/\">the courage to love despite the certitude of loss</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"6ec8629ff605bfd919275e47b4c93acf3f198080db47a56d8e32a7a1452d728b","category":"default"}