{"title":"The Sunflower and the Soul: Wendell Berry on the Collaborative Nature of the Universe and the Cure for Conflict","link":"https://www.themarginalian.org/2024/07/01/wendell-berry-sunflower/","date":1719831227000,"content":"<h3>“We are not the authors of ourselves. That we are not is a religious perception, but it is also a biological and a social one. Each of us has had many authors, and each of us is engaged, for better or worse, in that same authorship. We could say that the human race is a great coauthorship in which we are collaborating with God and nature in the making of ourselves and one another.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Art-Commonplace-Agrarian-Essays-Wendell/dp/1593760078/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"486\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?fit=320%2C486&amp;ssl=1\" alt=\"The Sunflower and the Soul: Wendell Berry on the Collaborative Nature of the Universe and the Cure for Conflict\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?w=988&amp;ssl=1 988w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?resize=320%2C486&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?resize=600%2C911&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?resize=240%2C364&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/commonplace_berry.jpg?resize=768%2C1166&amp;ssl=1 768w\" /></a></p><p>“Every atom belonging to me as good belongs to you,” Walt Whitman <a href=\"https://www.themarginalian.org/2019/10/19/lia-halloran-walt-whitman-universe-in-verse/\">wrote</a> an epoch before the Nobel-winning physicist Erwin Schrödinger <a href=\"https://www.themarginalian.org/2021/11/03/erwin-shcrodinger-my-view-of-the-world/\">examined the quantum conditions of existence</a> to ask that urgent, discomposing question: “What justifies you in obstinately discovering… the difference between you and someone else… when objectively what is there is <em>the same</em>?”</p>\n<p>It is not simply that we are here, made of the same matter, sharing the same improbable planet; it is that the sharing makes us what we are, each of us a fractal of this immense and indivisible ecosystem of relationship, a golden strand in a tapestry whose only meaning is in the interweaving of its threads. </p>\n<p>That despite this elemental interdependence we remain riven by conflict and division is the great paradox and the great tragedy and great opportunity for redemption. </p>\n<p>In his agrarian essay collection <a href=\"https://www.amazon.com/Art-Commonplace-Agrarian-Essays-Wendell/dp/1593760078/?tag=braipick-20\" target=\"_blank\"><strong><em>The Art of the Commonplace</em></strong></a> (<a href=\"https://search.worldcat.org/title/870403241\" target=\"_blank\"><em>public library</em></a>), poet, farmer, and philosopher <a href=\"https://www.themarginalian.org/tag/wendell-berry/\">Wendell Berry</a> dismantles the paradox to the building blocks of the tragedy and reconfigures them into a cathedral of redemption.</p>\n<figure><a href=\"https://society6.com/product/salut-au-monde_print?sku=s6-8967918p4a1v45?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass12.jpg\" /></a><figcaption>One of Margaret C. Cook’s illustrations for <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a stunning rare edition of <em>Leaves of Grass</em></a>. (Available <a href=\"https://society6.com/product/salut-au-monde_print?sku=s6-8967918p4a1v45?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>In what is nothing less than an act of countercultural courage and resistance, Berry indicts the Western capitalist mythos of “self-fulfillment” as the root of this artificial and often violent erasure of our interconnectedness and considers its fundamental logical flaw:</p>\n<blockquote><p>The problem, of course, is that we are not the authors of ourselves. That we are not is a religious perception, but it is also a biological and a social one. Each of us has had many authors, and each of us is engaged, for better or worse, in that same authorship. We could say that the human race is a great coauthorship in which we are collaborating with God and nature in the making of ourselves and one another. From this there is no escape. We may collaborate either well or poorly, or we may refuse to collaborate, but even to refuse to collaborate is to exert an influence and to affect the quality of the product. This is only a way of saying that by ourselves we have no meaning and no dignity; by ourselves we are outside the human definition, outside our identity.</p></blockquote>\n<p>To illustrate how erroneous this notion of an individual separate from relationships is, Berry recounts visiting the experimental plots at the Land Institute in Salina, Kansas, and being pointed to a huge Maximilian sunflower growing alone and apart from other plants. The man who had planted it proudly held it up as an example of a plant that has “realized its full potential as an individual.” Berry counters:</p>\n<blockquote><p>Clearly it had: It had grown very tall; it had put out many long branches heavily laden with blossoms — and the branches had broken off, for they had grown too long and too heavy. The plant had indeed realized its full potential as an individual, but it had failed as a Maximilian sunflower. We could say that its full potential as an individual was this failure. It had failed because it had lived outside an important part of its definition, which consists of both its individuality and its community. A part of its properly realizable potential lay in its community, not in itself.</p></blockquote>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?resize=680%2C680&amp;ssl=1\" width=\"680\" height=\"680\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?w=1280&amp;ssl=1 1280w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?resize=320%2C320&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?resize=600%2C600&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?resize=240%2C240&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/sunflowers.jpg?resize=768%2C768&amp;ssl=1 768w\" /></p>\n<p>In a sentiment springing from the same defiant recognition that led Albert Camus to <a href=\"https://www.themarginalian.org/2024/06/22/albert-camus-world/\">refuse the choice of right side and wrong side in conflict</a>, Berry adds:</p>\n<blockquote><p>To make conflict — the so-called “jungle law” — the basis of social or economic doctrine is extremely dangerous. A part of our definition is our common ground, and a part of it is sharing and mutually enjoying our common ground. Undoubtedly, also, since we are humans, a part of our definition is a recurring contest over the common ground: Who shall describe its boundaries, occupy it, use it, or own it? But such contests obviously can be carried too far, so that they become destructive both of the commonality of the common ground and of the ground itself.</p></blockquote>\n<p>Echoing Schrödinger’s quantum-lensed koan-like insight that <a href=\"https://www.themarginalian.org/2021/11/03/erwin-shcrodinger-my-view-of-the-world/\">“this life of yours which you are living is not merely a piece of the entire existence, but is in a certain sense the whole,”</a> Berry writes:</p>\n<blockquote><p>The business of humanity is undoubtedly survival in this complex sense — a necessary, difficult, and entirely fascinating job of work. We have in us deeply planted instructions — personal, cultural, and natural — to survive, and we do not need much experience to inform us that we cannot survive alone. The smallest possible “survival unit,” indeed, appears to be the universe… Inside it, everything happens in concert; not a breath is drawn but by the grace of an inconceivable series of vital connections joining an inconceivable multiplicity of created things in an inconceivable unity. But of course it is preposterous for a mere individual human to espouse the universe — a possibility that is purely mental, and productive of nothing but talk. On the other hand, it may be that our marriages, kinships, friendships, neighborhoods, and all our forms and acts of homemaking are the rites by which we solemnize and enact our union with the universe… They give the word “love” its only chance to mean, for only they can give it a history, a community, and a place. Only in such ways can love become flesh and do its worldly work.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2022/01/16/what-is-love-carson-ellis-mac-barnett/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/whatislove_ellis_barnett12.jpg\" /></a><figcaption>Art by Carson Ellis from <a href=\"https://www.themarginalian.org/2022/01/16/what-is-love-carson-ellis-mac-barnett/\"><em>What Is Love?</em></a></figcaption></figure>\n<p>In consonance with the Nobel-winning poet and philosopher Rabindranath Tagore’s insistence that <a href=\"https://www.themarginalian.org/2017/03/07/tagore-mans-universe/\">“relationship is the fundamental truth of this world,”</a> Berry adds:</p>\n<blockquote><p>It is only in these bonds that our individuality has a use and a worth; it is only to the people who know us, love us, and depend on us that we are indispensable as the persons we uniquely are… Separate from the relationships, there is nobody to be known.</p></blockquote>\n<p>Couple with Rachel Carson on wonder — that ultimate gasp at the interrelations of things — as <a href=\"https://www.themarginalian.org/2022/11/30/rachel-carson-national-book-award-speech/\">the antidote to our human folly</a>, then revisit Berry on <a href=\"https://www.themarginalian.org/2019/11/17/wendell-berry-hidden-wound/\">the key to mirth under hardship</a>, <a href=\"https://www.themarginalian.org/2021/03/12/wendell-berry-the-peace-of-wild-things-animated/\">the peace of wild things</a>, and <a href=\"https://www.themarginalian.org/2015/05/12/how-to-be-a-poet-wendell-berry/\">how to be a poet and a complete human being</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"6f0977b1488e07354eef4ada535e626f8674a8799cf032dbfe57484402f8a259","category":"default"}