{"title":"An Animated Timelapse of 200 Million Years of Continental Drift, From Pangea to Today","link":"https://kottke.org/24/01/an-animated-timelapse-of-200-million-years-of-continental-drift-from-pangea-to-today","date":1706565967000,"content":"\n        <p></p>\n\n<p>Millions of years ago, the supercontinent of Pangea slowly started to break apart into the continents we all live on today. In this video from the makers of ArcGIS mapping software, you can watch as the reconfiguration of the Earth’s land happens over 200 million years.</p>\n\n<p>Damn, India slammed into Asia like the Kool-aid Man — no wonder <a href=\"https://www.bbc.com/future/article/20220407-how-tall-will-mount-everest-get-before-it-stops-growing\">the Himalayas are so tall</a>!</p>\n\n<blockquote><p>Once, the craggy limestone peaks that skim the sky of Everest were on the ocean floor. Scientists believe it all began to change about 200 million years ago — at around the time the Jurassic dinosaurs were beginning to emerge — when the supercontinent of Pangea cracked into pieces. The Indian continent eventually broke free, journeying north across the vast swathe of Tethys Ocean for 150 million years until it smacked into a fellow continent — the one we now know as Asia — around 45 million years ago.</p>\n\n<p>The crushing force of one continent hitting another caused the plate beneath the Tethys Ocean, made of oceanic crust, to slide under the Eurasian plate. This created what is known as a subduction zone. Then the oceanic plate slipped deeper and deeper into the Earth’s mantle, scraping off folds limestone as it did so, until the Indian and Eurasian plates started compressing together. India began sliding under Asia, but because it’s made of tougher stuff than the oceanic plate it didn’t just descend. The surface started to buckle, pushing the crust and crumples of limestone upwards.</p>\n\n<p>And so the Himalayan mountain range began to rise skyward. By around 15-17 million years ago, the summit of Everest had reached about 5,000m (16,404ft) and it continued to grow. The collision between the two continental plates is still happening today. India continues to creep north by 5cm (2in) a year, causing Everest to grow by about 4mm (0.16in) per year (although other parts of the Himalayas are rising at around 10mm per year [0.4in]).</p></blockquote>\n\n<p>See also <a href=\"https://kottke.org/20/05/map-of-pangaea-with-modern-day-borders\">Map of Pangaea with Modern-Day Borders</a>, <a href=\"https://kottke.org/18/06/how-the-earths-continents-will-look-250-million-years-from-now\">How the Earth’s Continents Will Look 250 Million Years From Now</a>, and <a href=\"https://kottke.org/18/06/locate-modern-addresses-on-earth-240-million-years-ago\">Locate Modern Addresses on Earth 240 Million Years Ago</a>. (via <a href=\"https://www.openculture.com/2024/01/pangea-to-the-present-to-the-future-watch-animations-showing-500-million-years-of-continental-drift.html\">open culture</a>)</p>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Earth\">Earth</a> · <a href=\"https://kottke.org/tag/geology\">geology</a> · <a href=\"https://kottke.org/tag/maps\">maps</a> · <a href=\"https://kottke.org/tag/Pangaea\">Pangaea</a> · <a href=\"https://kottke.org/tag/time%20lapse\">time lapse</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/01/an-animated-timelapse-of-200-million-years-of-continental-drift-from-pangea-to-today\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"6f92e8fbb7f7188925d461aa976afaddc8272695f1bec34f1788ce73247e2874","category":"default"}