{"title":"50 conversations in Bangalore and Chennai","link":"https://sive.rs/meet-chbg","date":1677715200000,"content":"<p>\n<strong>UPDATE: I moved the conversations to <a href=\"https://sive.rs/met\">sive.rs/met</a></strong>.\n</p><p>\n<strong>February 13 through 21, 2023</strong>, I went to Chennai and Bengaluru, India.\nMy sole purpose was to meet new friends.\nI’m an “<a href=\"https://en.wikipedia.org/wiki/Overseas_Citizenship_of_India\">Overseas Citizen of India</a>” and my son is half-Indian (Tamil).\nI will always have ties to India.\nI wanted to deepen those ties and make new connections.\n</p><p>\nSo I scheduled <strong>fifty one-hour conversations with fifty interesting people over seven days</strong>.\nBack-to-back meetings from 9am to 10pm every day.\nIt was one of <strong>the most intense and fascinating</strong> (and heart-warming and educational) things I’ve ever done in my life.\nI recorded almost every conversation into a little voice recorder, then had it transcribed.\nWhen I got home to New Zealand I spent 30 hours reading through the transcriptions to help me remember what we talked about, then made a tiny summary, below.\n</p><p>\nMy conversations there were some of the best I’ve ever had, immediately open-hearted, honest, and intellectual.\nI also hosted two parties but owe an apology to my guests, because I thought I could have quality conversations in that environment but I just couldn’t.\nI’m really a one-to-one conversationalist.\n</p><p>\nMaybe-embarrassing thing I’ll admit:\nBefore my arrival, I hired a man in Chennai to make an audio recording of him slowly and clearly reading the names of the fifty people I was to meet with.\nThen I put those recordings into <a href=\"https://apps.ankiweb.net/\">Anki</a> flash cards, with the written name on the front, and the audio recording on back, so I could <strong>practice pronouncing everyone’s name correctly</strong> when we met.\nNames like Arunsathyaseelan Palanichami and Thiyagarajan Maruthavanan became little melodies that stuck in my head.\n</p><p>\nIndia has <strong>changed so much</strong> in the last 10 years since my last visit.\n</p><ul><li>\nThe new <a href=\"https://duckduckgo.com/?q=vande+bharat&amp;ia=images&amp;iax=images\">Vande Bharat</a> train from Chennai to Bangalore is as nice as any train in Europe, and the four-hour journey costs 1100 Rupees - about $13 - including a nice meal service.\n</li><li>\nThe new <a href=\"https://en.wikipedia.org/wiki/Unified_Payments_Interface\">UPI</a> cashless payment system is amazing.\nInstant free bank transfers for every bank account in India, no fee, just by scanning a QR code.\nEverybody and every roadside vendor now has it, so it’s thoroughly practical even for little payments of 40 rupees (50¢).\n</li><li>\nThe new <a href=\"https://en.wikipedia.org/wiki/Aadhaar\">Aadhaar</a> government ID is impressive, and has enabled anyone to open a bank account, which created the ubiquity of UPI.\n</li><li>\nOne downside is the current political climate which had my friends literally looking over their shoulders and speaking in hushed tones when the subject came up.\n</li><li>\nAnd WhatsApp is practically the sole mode of communication.\n</li></ul><p>\n<strong>Bangalore</strong> in particular has become a wonderful creative hub.\n<strong>It feels like the new San Francisco</strong>, with creative ambitious people moving there from all over India.\nA super-casual California-style culture, free from the formality and materialism of Delhi and Mumbai.\n</p><p>\nBangalore is such a great place to live - (good weather, culture, people) - that the money made in Bangalore is staying in Bangalore instead of fleeing overseas like it used to, so this feeds the local arts and culture scene, making it an even better place to live.\nI loved it so much that I wanted to cancel my return flight and just live there now.\nInstead, it’s now my second home, in my heart, and I’ll be returning often.\n</p><p>\nI agree with <a href=\"https://shrutiraj.com/\">Shruti</a> that <a href=\"https://srajagopalan.substack.com/p/why-everyone-should-pay-more-attention\">everyone should pay more attention to India</a>.\n</p><p>\n<strong>UPDATE: I moved the conversations to <a href=\"https://sive.rs/met\">sive.rs/met</a></strong>.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"706349bd312f3f0d7095928b1a301ca74f4284650175141fad5e95dd0d4783c1","category":"default"}