{"title":"50 conversations in Bangalore and Chennai","link":"https://sive.rs/meet-chbg","date":1677715200000,"content":"<p>\n<strong>February 13 through 21, 2023</strong>, I went to Chennai and Bengaluru, India.\nMy sole purpose was to meet new friends.\nI’m an “<a href=\"https://en.wikipedia.org/wiki/Overseas_Citizenship_of_India\">Overseas Citizen of India</a>” and my son is half-Indian (Tamil).\nI will always have ties to India.\nI wanted to deepen those ties and make new connections.\n</p><p>\nSo I scheduled <strong>fifty one-hour conversations with fifty interesting people over seven days</strong>.\nBack-to-back meetings from 9am to 10pm every day.\nIt was one of <strong>the most intense and fascinating</strong> (and heart-warming and educational) things I’ve ever done in my life.\nI recorded almost every conversation into a little voice recorder, then had it transcribed.\nWhen I got home to New Zealand I spent 30 hours reading through the transcriptions to help me remember what we talked about, then made a tiny summary, below.\n</p><p>\nMy conversations there were some of the best I’ve ever had, immediately open-hearted, honest, and intellectual.\nI also hosted two parties but owe an apology to my guests, because I thought I could have quality conversations in that environment but I just couldn’t.\nI’m really a one-to-one conversationalist.\n</p><p>\nMaybe-embarrassing thing I’ll admit:\nBefore my arrival, I hired a man in Chennai to make an audio recording of him slowly and clearly reading the names of the fifty people I was to meet with.\nThen I put those recordings into <a href=\"https://apps.ankiweb.net/\">Anki</a> flash cards, with the written name on the front, and the audio recording on back, so I could <strong>practice pronouncing everyone’s name correctly</strong> when we met.\nNames like Arunsathyaseelan Palanichami and Thiyagarajan Maruthavanan became little melodies that stuck in my head.\n</p><p>\nIndia has <strong>changed so much</strong> in the last 10 years since my last visit.\n</p><ul><li>\nThe new <a href=\"https://duckduckgo.com/?q=vande+bharat&amp;ia=images&amp;iax=images\">Vande Bharat</a> train from Chennai to Bangalore is as nice as any train in Europe, and the four-hour journey costs 1100 Rupees - about $13 - including a nice meal service.\n</li><li>\nThe new <a href=\"https://en.wikipedia.org/wiki/Unified_Payments_Interface\">UPI</a> cashless payment system is amazing.\nInstant free bank transfers for every bank account in India, no fee, just by scanning a QR code.\nEverybody and every roadside vendor now has it, so it’s thoroughly practical even for little payments of 40 rupees (50¢).\n</li><li>\nThe new <a href=\"https://en.wikipedia.org/wiki/Aadhaar\">Aadhaar</a> government ID is impressive, and has enabled anyone to open a bank account, which created the ubiquity of UPI.\n</li><li>\nOne downside is the current political climate which had my friends literally looking over their shoulders and speaking in hushed tones when the subject came up.\n</li><li>\nAnd WhatsApp is practically the sole mode of communication.\n</li></ul><p>\n<strong>Bangalore</strong> in particular has become a wonderful creative hub.\n<strong>It feels like the new San Francisco</strong>, with creative ambitious people moving there from all over India.\nA super-casual California-style culture, free from the formality and materialism of Delhi and Mumbai.\n</p><p>\nBangalore is such a great place to live - (good weather, culture, people) - that the money made in Bangalore is staying in Bangalore instead of fleeing overseas like it used to, so this feeds the local arts and culture scene, making it an even better place to live.\nI loved it so much that I wanted to cancel my return flight and just live there now.\nInstead, it’s now my second home, in my heart, and I’ll be returning often.\n</p><p>\nI agree with <a href=\"https://shrutiraj.com/\">Shruti</a> that <a href=\"https://srajagopalan.substack.com/p/why-everyone-should-pay-more-attention\">everyone should pay more attention to India</a>.\n</p>\n\n\n\n<h1>CHENNAI</h1>\n<h2>MONDAY</h2>\n<hr />\n<div><img src=\"/images/306253.jpg\" alt=\"photo of Kiruba Shankar\" />\n<h2><a href=\"https://www.kiruba.com/\">Kiruba Shankar</a></h2>\nWe met 12 years ago at INK.\nHe founded the Professional Speakers Association of India focuses on the business side of public speaking, whereas Toastmasters focuses on the craft of speech.\nSpeakers and rappers who can dissect what they’re doing as they’re doing it.\nWhen doing a paid talk, (versus a free talk), the speaker has to do their homework, know the audience and their objective, write the script, and practice hard.\nHe has taught digital marketing for 21 years, and runs a marketing company called Breathe Digital.\nEveryone who takes his course must have their own website by the time the course finishes.  Many students have been accepted to colleges and jobs because having their own website set them apart.\nInstead of waiting to be invited to a super-achievers event, just create and organize a super-achievers event.  Better to be the host than a guest.\nHis meet-up is called Cerebrate.\nInstead of hiring strangers through a help-wanted ad, speak/write/teach in public, then hire the people that approach you afterwards.  Natural filter.  You don’t try to attract people.  These people are already attracted.\nHis first speaking gig was to a girl’s college.  His boss was supposed to speak but couldn’t make it, so sent Kiruba instead.\nHis 90-year-old grandmother runs a farm stay, and could use a database for their guests, to know them better. 13 acres of organic farm. So many people come stay collectively, bonding, isolated away from distractions, so they really interact with each other, staying in one building. All booked word-of-mouth. No AirBNB or other portals.\nThe 3rd-most-popular bucket list wish is to own a farm. People long for the rural life.\n</div>\n\n<hr />\n<div><img src=\"/images/324799.jpg\" alt=\"photo of Dr. Mani Sivasubramanian\" />\n<h2><a href=\"http://MoneyPowerWisdom.com\">Dr. Mani Sivasubramanian</a></h2>\nHe and I have been emailing regularly for 13 years!\nHis daughter finished medical school and she’s going to become a Rhodes Scholar this year - doing her PhD at Oxford.\nDr. Mani is his identity as a writer online.\nDr. Subramanian is his identity as a heart surgeon.\nHe specialized in pediatric cancer because it was challenging and nobody else was doing it.\nThe biggest problem in India isn’t the facilities or patient load, but that 99% of the patients can’t afford the cost of treatment.\nSo even though he’s a surgeon, he found the best solution is to support Devi Shetty in Bangalore, who is doing the most affordable treatments because he’s taken a radical new approach, lowering costs by 80%.  Trains women to do the mechanical steps needed instead of only hiring nurses with ten years’ training.\nPatients who can afford full price go into the corporate suite and he uses those profits to subsidize the patients who can’t afford it. Keeps the profit margin at 5% instead of maximum.\nWhen Dr. Mani said that his ebooks are sold to fund operations, response rate sales went from 2% to 18%.  People aren’t reading the book as much as supporting the cause.\nHe spent so much time with his daughter that she said when she grows up she wants to be a pediatric heart surgeon since they clearly have so much free time. That’s his biggest compliment in life.\n</div>\n\n<hr />\n<div><img src=\"/images/396473.jpg\" alt=\"photo of Ramkumar Venkataraman\" />\n<h2><a href=\"https://github.com/ramkumarvenkat\">Ramkumar Venkataraman</a></h2>\nWhile being paid to do a simpler tech job (CSS) he studied the deeper tech of fraud prevention at that same company.\nHe and his wife moved back to India from Singapore for better health care for their babies.\nA minute after he and his wife walked from living room to kitchen, the living room ceiling completely collapsed. It would have killed them.  This inspired him to quit his job and do something he’s proud of.\nGot into smart contracts and following supply chain of coffee beans in Indonesia. Making sure funds are safe. Risk management.\nIncorporated in Delaware &amp; funded by Y Combinator. Silicon Valley Bank. India banks require round tripping.\n</div>\n\n<hr />\n<div><img src=\"/images/437520.jpg\" alt=\"photo of Soundarya Balasubramani\" />\n<h2><a href=\"https://curiousmaverick.com/\">Soundarya Balasubramani</a></h2>\nHer brother called her Pooja as a girl, and it stuck, so everyone calls her Pooja.\nEmailed 2500 immigrants to say she’s writing a book on immigration, so what are your top three questions? Open rate was 80% and she got hundreds of responses in the first two days. People are frustrated with the system. Book is called Unshackled.\nBrad Feld at Techstars suggested she do a crowdfunding campaign. She raised $50K.  Emergent Ventures granted another $50K.\nGot her masters at Columbia in NYC. Living in California but came back to Chennai to finish the book.  Not sure where she’ll live next.\nPeople don’t realize how much discrimination a place has until they leave it and discover new freedoms.  Even little things like wearing a dress.\nExamples of men being sexist, some deeply seated mindsets, not realizing they’re being insensitive.\nTo truly help someone, you need to be invested. It takes a lot of time. Can’t happen in a rushed manner.\n</div>\n\n<hr />\n<div><img src=\"/images/437902.jpg\" alt=\"photo of Senthil Kumar Muthamizhan\" />\n<h2><a href=\"https://www.linkedin.com/in/senthilkumarmuthamizhan/\">Senthil Kumar Muthamizhan</a></h2>\nMeeting people is richness, real rich - not just money in the bank.\nRameswaram in Tamil Nadu is a significant auspicious place.\nIn India, kids are gods.\nThis box of cookies might have great meaning to someone who has eaten from that shop with their family for the last 25 years, but means nothing to someone else. London’s WC1 means a lot to you, but nothing to someone else.\nKural - Tirukkuṟaḷ - திருக்குறள் - very important book - wise through means - it’s how to live\nNorth Indian culture slowly gets diluted, while South Indian culture resisted influence.\nAs a South Indian, Delhi is a nightmare, because of the food and the whole thing.\nLived in Netherlands and Manchester and Singapore. Europeans were annoying for wanting to be on time. Creativity is not on time. Coding is creativity.\nHe uses Ruby and Rails. \nHis company CultureMonkey delivers bad news to companies to let them know when their internal culture is bad.\nThe human body is a shirt the soul is wearing. It drops every time you die and are born again.\nEvery soul goes through four phases: pleasure, engagement, meaning, serving god.\n</div>\n\n<hr />\n<div><img src=\"/images/384063.jpg\" alt=\"photo of Sainath Rajagopal\" />\n<h2><a href=\"https://isstiaung.me/\">Sainath Rajagopal</a></h2>\nSainath taught me how to eat the thali.\nHe did “Entrepreneur First” in Singapore - 100 people from around the world put together in a place to start companies.\nWhen he pitched his education finance idea in Singapore, he got a meeting with the Minister of Education immediately. The accessibility in a small country is surprising coming from India.\nBangalore - vs Chennai - is more experimental, trying silly things. Bangalore has a migrant population. People move there for the startups, and that has a rolling effect on the culture of the place.\nHe’ll stay in Chennai to help be a good influence for his younger brother. His fiancée will work for the Indian Foreign Service.\nWhether to have kids, and if that makes a more or less fulfilling life.\n</div>\n\n<hr />\n<div><img src=\"/images/387923.jpg\" alt=\"photo of Shaizil Sheriff\" />\n<h2>Shaizil Sheriff</h2>\nGrew up in Kerala, and only after leaving realized how great it is.  Lives in NC, USA now.\nNorth Kerala people go to Gulf countries.  South Kerala people go to US, US, Canada.\nKerala’s high literacy rate is because it was the first elected communist government, and they promoted a lot of social welfare, building schools, paying teachers.\nWith communism, the achievers can’t climb as high, but the people at the bottom are protected.\nThe religious texts don’t know the smallest things like atoms, or the biggest things like the earth is round, but they claim they know everything.\nHe’s atheist, from a Muslim family, and married a Hindu woman. Hasn’t brought her home to Kerala because of the current political tensions.\nBeing Indian is secondary to being Malayali, Tamil, Kanada or a Telugu, because those roots run deep.\n</div>\n\n<hr />\n<div><img src=\"/images/410426.jpg\" alt=\"photo of Martin Jeffery\" />\n<h2><a href=\"https://www.instagram.com/martin_writes16/\">Martin Jeffery</a></h2>\nHe grew up in Madurai. Lost his dad at age 12. Dad’s family blamed his mother. Probably moving to Victoria, Australia, soon.\nTamil Nadu was ruled by three kings. That’s why when the British came, they were able to divide and conquer. There was no unity.\nMost people in India don’t choose their careers. Careers are decided by the parents at age 15-16.\nUses Selenium for app testing.\nInto dancing and choreography.\n</div>\n\n<h2>TUESDAY</h2>\n<hr />\n<div><img src=\"/images/395564.jpg\" alt=\"photo of Srikumar K. S.\" />\n<h2><a href=\"http://sriku.org\">Srikumar K. S.</a></h2>\nKumar and I met 12 years ago in Singapore through our dear friend Pete Kellock.\nThe new translation of the Kural: translating poetry is hard.\nKumar created a popular system of Carnatic music notation.\nHe explained the difference between Hindustani and Carnatic music.\nHis PhD was a study in human musicology.\nNeither of us can let music be in the background.\nIt’s almost a crime to not be vocal about politics these days. South India resisted colonization.\nA date is not actually a time but a place, since dates are what we call our position in orbit around the sun. But Earth never comes back to the same spot, so it’s not exact.\nHe explained quantum computing - something he’s working with now.\nScheme/Lisp, Functional programming, Quantum mechanics: these things change the way you think forever.\nLook into Julia because of multiple dispatch. Julia’s libraries work together amazingly well.\n</div>\n\n<hr />\n<div><img src=\"/images/437568.jpg\" alt=\"photo of Chandhana Sathish Kumar\" />\n<h2><a href=\"https://twitter.com/chandhana01\">Chandhana Sathish Kumar</a></h2>\nChandhana is one of the most impressive people I’ve ever met. Age 17 now.\nShe was in a program called The Knowledge Society, exposed to gene editing, nanotechnology, quantum computing, then got into neuroscience, fetal brain research, memory development research.\nNow into bioplastics - biodegradable plastic - edible plastic made from seaweed for less than a dollar - working on this at home for the past week, just by reading papers and experimenting.\nEmergent Venture winner.\nBorn in America. She switches between an Indian accent and American accent, depending on who she’s talking with.\nFamily speaks Telugu, so she had to learn Hindi and Tamil on her own.\nLearned at a Montessori school and always followed whatever seems fun. Parents never forced learning. But also encouraged her to not quit.\nShe did stand-up comedy and won a competition.\nI have the opposite of imposter syndrome: I think it’s cooler to be resourceful and uncredentialed.\nShe does everything in her head working solo, so she can work 8x faster than a team would, since they have to communicate and document everything.\n</div>\n\n<hr />\n<div><img src=\"/images/364195.jpg\" alt=\"photo of Santhosh Sundararaman\" />\n<h2><a href=\"https://www.flickr.com/photos/santhoshsram\">Santhosh Sundararaman</a></h2>\nMoved to the US in 2004: Kansas then California.  Moved to Pune India in 2017.\nPune has good monsoons: less waterlogging.\nDifficult moving back because everything had changed, so they didn’t know how to do anything like set up utilities.\nSpending time out from career being a full-time dad to toddler and baby.\nReading Sapiens changed his mind about religion.\nMaharashtra have strong pride in their culture: statues of Shivaji like a demigod.\nTamil Nadu in the 90s: signs were in Tamil, Hindi, English. People were blacking-out the Hindi, protesting Hindi in Tamil Nadu.\nHe told me about the Vande Bharat Express train from Chennai to Bangalore, then booked it for me. It was great.\n</div>\n\n<hr />\n<div><img src=\"/images/437633.jpg\" alt=\"photo of Mayur Vamanan\" />\n<h2><a href=\"https://www.brindavanschools.org/\">Mayur Vamanan</a></h2>\nDidn’t take golf scholarship to U Michigan, and always wonders about that path not taken.\nMoved back to India for his kids to grow up around their grandparents.\nHis grandfather set up Brindavan Schools around Tamil Nadu, now Mayur as returned to run them. \nPolytechnic schools help kids get practical skills - working right away.\nGrandfather and dad used to do road shows to find new students, now it’s all on social media.\nChallenge is to make it a top-notch school for parents who care about more than test scores.\nSchools should teach consideration for others and the environment.\n</div>\n\n<hr />\n<div><img src=\"/images/437558.jpg\" alt=\"photo of Akash Chinnaiah\" />\n<h2><a href=\"https://akashchinnaiah.com/\">Akash Chinnaiah</a></h2>\nFull-time professional writer for magazines, and memoir books.\nMoving to Goa.\nWe talked a lot about writing.\n</div>\n\n<hr />\n<div><img src=\"/images/437609.jpg\" alt=\"photo of Manivannan Sadasivam\" />\n<h2><a href=\"https://twitter.com/MirrorOfMySelf\">Manivannan Sadasivam</a></h2>\nTea leaves grow in chilly places: that’s why they’re on hill stations here.\nHe grew up on a hill station because his dad ran the tea factory after Sri Lanka.\nHe is his brother’s keeper. Brother is a film maker who wrote a poetic book.\nMani is a copy writer.\n</div>\n\n<hr />\n<div><img src=\"/images/392860.jpg\" alt=\"photo of Saravanan Sampath Kumar\" />\n<h2>Brothers <a href=\"https://sridhar.co\">Sridhar Raj</a> and <a href=\"https://sarav.co/\">Saravanan Sampath Kumar</a></h2>\nReally cool hearing their stories of growing up and how they influenced each other, and getting into tech.\nThey taught me about Hindu mythology.\nUnfortunately I met them at the end of my second night when I was really jet-lagged, so I don’t remember most of our conversation.\nI wish I had a recording of it.\n</div>\n\n<h2>WEDNESDAY</h2>\n<hr />\n<div><img src=\"/images/419606.jpg\" alt=\"photo of Prahalad Rajkumar\" />\n<h2>Prahalad Rajkumar</h2>\nBridge (the card game) expert. Loves the problem solving, the beautiful positions, unspeakable joy.\nTold me about Om Swami, millionaire turned monk, he’s been following since 2014.\nArranged marriages work because even if it’s the devil, it’s your devil.\nHe taught me so many examples and perspectives of making any marriage work.\nSending kids to “The School” - surrounded by nature - started by J. Krishnamurti.\nHe and his dad run the back-office for a doctor in Florida.\n</div>\n\n<hr />\n<div><img src=\"/images/438794.jpg\" alt=\"photo of Mukesh Amaran\" />\n<h2>Mukesh Amaran</h2>\nMukesh created a musicians’ collective in Chennai, to help promote Tamil music.\nMumbai’s Bollywood exports India culture worldwide, but doesn’t promote the local Maharashtra culture.  Whereas Kollywood - the local Tamil film industry - promotes Tamil culture.\nHis model is to get musicians together to collaborate on a project, then he owns the rights to that project only, to recoop costs, helping to raise the profile of all musicians involved.\n</div>\n\n<hr />\n<div><img src=\"/images/254116.jpg\" alt=\"photo of Lakshmi Pratury\" />\n<h2><a href=\"http://www.ixoraamedia.com/\">Lakshmi Pratury</a></h2>\nRode together on the 6-10am train from Chennai to Bangalore.\nShe taught me about parenting, bringing your child around to meetings, differences between San Francisco and Bangalore, fundraising.\nEffective altruism is fine but other charities also need people who can realize their benefits, like music education for example.\nShe lives in Whitefield, and we passed her home on the train from Chennai.\n</div>\n\n<hr />\n<h1>BANGALORE</h1>\n<hr />\n<div><img src=\"/images/437905.jpg\" alt=\"photo of Ricky Kej\" />\n<h2><a href=\"https://www.rickykej.com/\">Ricky Kej</a></h2>\nQR-code-only menu: asked waiter to scan and show him the menu.\nAmazing memory: able to list out all of his upcoming projects and details off the top of his head.\nWent to a Christian/Protestant school and said he recommends it since the Christians perfected education.\nAtheism is tabboo in America, but common in India.\nLikes “Hindu Atheist” because it reveres all life equally vs Old Testament style “dominion of man” over all living things.\nWe bonded over a love of Peter Gabriel’s music, especially Passion soundtrack.\nNegotiating for the UN.  Kiribati.  Greta Thunberg hasn’t seen India.\nNo major riots in Gujarat since the 2002 riots.\nWhat to do with all the gifts, especially portraits.\nAmazing story of Kalyan Akkipeddi and his Proto Village where cows eat millet, chickens eat the cow poop, chickens poop into a pond feeding the fish, and people eat the fish.\nChanakya University is aiming to be world-class best.\n</div>\n\n<h2>FRIDAY</h2>\n<hr />\n<div><img src=\"/images/431393.jpg\" alt=\"photo of Sindhu Shivaprasad\" />\n<h2><a href=\"https://sindhushivaprasad.com/\">Sindhu Shivaprasad</a></h2>\nRaised in Abuja Nigeria and loved it. People express themselves loudly, free, spontaneous. Teachers there cared for her well-being outside of school.\nReturning to India was culture shock. Needing permission to go to and return from the restroom in school.\nThis self-consciousness made her retreat into her mind, still to this day.\nLived in Dubai for 5 years. Family loved being away from relatives in India, beyond judgement and involvement.\nLived in Sheffield, relished her independence.\nTalked about norms: Nigeria norms, Dubai norms, England norms, India norms. Third culture kid.\nShe taught me how to put sugar in my tea.\nBought her own home now since this will always be home base.\nGo to Himalayas to write a book? Or make her new home have the same placebo triggers to be a place of creative writing?\nShe’s Kannadiga - a Kannada speaker - rare in central Bangalore now. Taxi drivers speak in Hindi to her and are thrilled when she replies in Kannada.\nTamils protect their culture stronger than Kannada/Karnatakans have.  We’re more accepting of others’ culture than others are of ours.  To our detriment.  Karnataka has great prolific writers and artists, but the culture is not as strong since we haven’t protected it as fiercely as the Tamils.\nSouth Bangalore is more conservative, people who are from here.\nLoves the balance of tradition and modernity in Japan.\nTo be an outsider in a culture is the best because you can reap its benefits, but not be bound by its restrictions.\n</div>\n\n<hr />\n<div><img src=\"/images/399145.jpg\" alt=\"photo of Ayush Jain\" />\n<h2><a href=\"https://www.ayushjain.net/\">Ayush Jain</a></h2>\nGrew up in a small town in Rajasthan where students come from all over to prepare for exams, super-high-pressure, but his parents never pushed that, and he got way into basketball!\nParents encouraged him to leave India to get more experience. Spent a year in Singapore, year in Dubai, and two years in Sydney.\nDid Techstars.\nFamily has cloud kitchen business in Bangalore making Rajasthan cuisine, though Covid paused that for two years. Brings down staff and houses them.\nWeather in Bangalore is so much better.\nNow doing learning design, finding subject matter experts, creating courses on various subjects. Nigeria is their biggest market.\nJust spent 4 months in Nairobi and loves it, wonderful, everyone so talkative. Some daytime petty crime.\nFlying India to Nairobi is cheaper than Nairobi to Rwanda just 40 minutes away.\n</div>\n\n<hr />\n<div><img src=\"/images/389970.jpg\" alt=\"photo of Ranjana TN\" />\n<h2><a href=\"https://ranjanatn.com/\">Ranjana TN</a></h2>\nRanjana is one of the most open people I’ve ever met, telling me very personal matters within minutes of meeting.\nVery broad-minded Hindu Brahmin family opted out of the surname signifier.\nStudied dance. MBA in Chennai.\nWe talked about polyamorous relationships and our past relationships.\nLeft the startup she co-founded when she disagreed with its direction.\nPublished an ebook on PCOS.\nSpent months in Peru, US, Canada, where she has family.\nSteve Pavlina mentioned me in his group. I loved his book. She didn’t.\n</div>\n\n<hr />\n<div><img src=\"/images/410499.jpg\" alt=\"photo of Pavitra Gurumurthi\" />\n<h2><a href=\"https://www.pavitraguru.com/\">Pavitra Gurumurthi</a></h2>\nShe lived in Wellington for 11 years, so we bonded on that.\nReturned to India last year after 20 years of being away.\nShe has a deep connection to the ocean, love and fear combined, but can’t swim yet.\n</div>\n\n<h2>SATURDAY</h2>\n<hr />\n<div><img src=\"/images/437587.jpg\" alt=\"photo of Udhay Shankar N\" />\n<h2><a href=\"http://digeratus.com/\">Udhay Shankar N</a></h2>\nBeen in the tech startup scene since 1992, before they were called startups.\n3D graphics cards in 1993, brought back from Singapore in luggage. Got a modem &amp; didn’t know what to do with it.\nEarly internet, easy to make friends with people like John Perry Barlow. You could email anyone.\nEarly mailing list called Silk, and unconference in Goa.\nCertain parts of Bangalore, things move faster than Silicon Valley.\nHe advises startups to help point out where they might fail, having been there himself. Just does it for the intellectual interest.\n</div>\n\n<hr />\n<div><img src=\"/images/418710.jpg\" alt=\"photo of Shreyas Prakash\" />\n<h2><a href=\"https://www.shreyasprakash.com/\">Shreyas Prakash</a></h2>\nThe language of Kerala is Malayalam. Similar to Tamil. Kannada is quite different.\nWorking with Noora Health helping them scale the program across Indonesia and Bangladesh.\nDoing voice prompts to help bridge digital divide: usable on feature phones. IVR = Interactive Voice Response. \nBefore this he helped set up maker spaces in rural areas in Maharashtra and Auroville.\nCastes have community halls, so they use those. Tools for wood and metal, and a computer. But without upkeep they get repurposed.\nWorked with UV sterilization inside hospitals, at IIT Madras. Moved to Bangalore a year and a half ago.\nMaking a community of builders. Side projects. $100 startups. Online &amp; worldwide.\nMumbai has the big business, but Bangalore if for startups, the Silicon Valley of India.\nAll startup conversations happen at Third Wave coffee chain in Bangalore.\n</div>\n\n<hr />\n<div><img src=\"/images/421294.jpg\" alt=\"photo of Trisha Reddy\" />\n<h2><a href=\"https://trishareddy.in/\">Trisha Reddy</a></h2>\nGot an iPad and started drawing during lockdown, now writing on Substack thanks to Write of Passage.\nTaking a 6 month break now before starting her MBA in Chicago in August.\nSomeone told her she’ll always be a second-class citizen in America. I suggested that’s an advantage not disadvantage, to be an outsider. She said, “It’s all Plato’s cave.”\nDoing yoga teacher training just to improve her yoga, not to actually teach it.\nBangalore is more into fitness and way more active than other Indian cities.\nDid a swimathon then a relay swim from Bandra Worli Sea Link to Gateway of India.\nReading Existential Kink, book about dissolving existing beliefs, making subconscious conscious.\nStories turn off our defenses.\n</div>\n\n<hr />\n<div><img src=\"/images/437936.jpg\" alt=\"photo of Pradarshan\" />\n<h2><a href=\"https://pradologue.com/\">Pradarshan</a></h2>\nBackpacked around India for a year and a half, and has written 300-500 pages about it, but never published.\nHelps startups with growth and marketing, getting developers.\nEveryone wants to come to Bangalore. The quality, the freedom to build, the quality of the conversation, is different than anywhere else.\nFavorite book is Lessons of History by Will and Ariel Duran.\n</div>\n\n<hr />\n<div><img src=\"/images/409470.jpg\" alt=\"photo of Kaushal Shah\" />\n<h2><a href=\"https://twitter.com/kaushalvshah\">Kaushal Shah</a></h2>\nAhmedabad has worse weather than Bangalore but better infrastructure: more reliable electricity, drainage, wiring.\nPeople from Gujarat are known for their entrepreneurial business spirit.\nOne reason Bangalore became the startup city is that Gujarat is a dry state.\nHe splits his time between New York, Ahmedabad, and Bangalore.\nPeople don’t say anything political even in private encrypted WhatsApp chats.\nMeditation and comedians made him question his religious upbringing. Bill Burr’s great bit laughing at Scientology but is it really more ridiculous than what we’re taught growing up? We just don’t laugh at the things taught to us as kids.\nIn India we substitute academic excellence for character. He was a great student, so his teacher treated him like he could do no wrong. One day during cricket he hit another kid and didn’t get in trouble. Years later in vipassana meditation this all came back to haunt him.\nWe agree about Yuval Noah Harari, meditation credibility, and his three books.\nOut of 500 non-fiction books he’s probably finished 3 of them. He gets the gist and moves to the next.\n</div>\n\n<hr />\n<div><img src=\"/images/339997.jpg\" alt=\"photo of Kartik Isvarmurti\" />\n<h2><a href=\"https://www.vmgbpo.com/\">Kartik Isvarmurti</a></h2>\nKartik was the first person I ever met in India, back in 2008. We are the same age.\nAgriculture background. Started a magazine about ag business and distributed it in fancy hotels in Bangalore. Built a website for it in 1998. \nSaw the book World is Flat and jumped right into the VA/BPO business that week. Created a profile on Elance and got immediate clients.\nLots of live chat monitoring. Now 300 people part-time.\nHe splits his time between Coimbatore and Bangalore, but officially lives and votes in Coimbatore.\nSays if I want to live in Bangalore, I should live in Mysore instead. Better quality of life, and close enough.\nHe builds relationships on LinkedIn, even if they’re not hiring now.\nModern companies are avoiding customer service by just doing instant refunds if you declare there’s any problem at all.\n</div>\n\n<hr />\n<div><img src=\"/images/406623.jpg\" alt=\"photo of Nikhil Jois\" />\n<h2><a href=\"https://twitter.com/nikhiljoisr\">Nikhil Jois</a></h2>\nA just-in-time book is a book you get for an immediate need, like how to sell, or Deep Work to focus.  A just-in-case book is wisdom.\nSome get books to display as a status symbol. The book itself is a reminder of the message.\nYou can train GPT/LLModels on just one book or selection of text, including the Gita.\nTried to get schools to buy his product, but decisions were made too slowly and conservatively.\nSo he went there and started teaching in colleges: how to have a clean resume, how to do interviews, how to do group discussions. That worked.\nIn his family, Chandigarh &amp; Hyderabad, if you’re 22 and haven’t migrated to the U.S., you’re a failure. But he stayed and when friends and relatives came back to India to get married, they would call on him to help make things happen. Then he learned to automate those things. Then created a company around it, and tried to partner with a matrimony site, assuming they know when people get married, but they don’t.\nGot into IoT for oil rigs - to determine when an oil rig’s parts might break down so that they can do maintenance in time. Funded by Techstars, who moved them to Texas, but it was too early for that market.\nWent to California, met 143 people in 45 days. Mentor madness. Always did his homework before meeting with each person, to know as much as he could about them. That alone set him apart.\nWorked to prevent fraud in Indian market, like SIM card bonuses. He got 6 months free Uber rides by gaming the system, then preventing others from doing it.\nIndia affords me lifestyle upgrades like a chauffeur-driven car for under $600/month, and a cleaner and a cook who come every day.\nFriend lived in a hotel in Bangalore for under $2000/month, including food and everything.\nLong sweet conversation about how he met his wife, and how they made a framework for conflict resolution, both little and big things. The importance of being coachable. Avoid relationships between a reacher and a settler.\n</div>\n\n<hr />\n<div><img src=\"/images/408912.jpg\" alt=\"photo of Arunsathyaseelan Palanichami\" />\n<h2>Arunsathyaseelan Palanichami</h2>\nHis passport just says “P” not Palanichami, but foreign visa people kept challenging it, so put in his father’s full name.\nHis parents named him Arun so he’d be called first in class, alphabetically.\nHis daughter’s name is Haiku.\nHe and his wife have been through a lot, he gave her a lot of trauma, she was so patient with him, and he’s so thankful.\nMy son is Gen Alpha.\nGave me some wonderful books about Tamil culture.\nWent to a school for military training, but didn’t go into the military. Smith School of Business in Kingston Ontario Canada.\nWorked for ITC for 2 years in supply chain department. Current company is software that compiles info. He’s bridge between India product team and US sales.\nHe loves Bangalore, opportunities, going to shows, Museum of Art and Photography, meeting international people.\nPeople in South India are a bit more humble. People in the North are very aggressive. Even just in the middle of the corporate ladder they would drive a Benz because for them the show is more important. Whereas here the CEO will drive a Honda.\nIn Tamil Nadu the arts have played a significant role all along. Musicians play a huge role in dealing with sadness, grief, happiness, marriages, festivals, everywhere. Music is a part of our life. And similarly, cinema is a huge part of life.\n</div>\n\n<hr />\n<div><img src=\"/images/362744.jpg\" alt=\"photo of Thiyagarajan Maruthavanan\" />\n<h2><a href=\"https://mtrajan.com/\">Thiyagarajan Maruthavanan</a></h2>\nTamil, grew up in Delhi, school in Hyderabad, now living in Bangalore. Feels both North and South Indian.\nDelhi: “Do you know who my father is?!” (because of the politicians)\nMumbai: “Do you know where I live?!” (because South Bombay is so rich)\nBangalore: “Do you know a front-end developer?”\nCompared to Bangalore, Mumbai has more extremes of wealth and poverty next to each other.\nIn Mumbai, everyone is always pressed for time. Bangalore is more laid-back.\nBangalore is “live and let live” culture. Party people next to prayer people. Chennai meddles and judges.\nBangalore is so humble, it’s sometimes overplayed. Who can be more humble.\nGood thing Bangalore has bad traffic otherwise everyone would move here.\nKoramangala (“mangla”) is where all the startups are. He lives south of Electronic City.\nWe talked almost entirely about locations. Great stuff.\n</div>\n\n<h2>SUNDAY</h2>\n<hr />\n<div><img src=\"/images/437169.jpg\" alt=\"photo of Ayushi Mukhi\" />\n<h2><a href=\"https://twitter.com/ayushimukhi\">Ayushi Mukhi</a></h2>\nFrom Delhi but moved around a lot, Kolkata, Bhopal.\nShe was top of her class, #1 out of 60, so everyone was happy, dad treated her best.\nBoth her names are given names, not family names.\nRich people in Delhi have more cars than people in the house. \nSays she’s from NCR: National Capital Region, even though it’s got a bad reputation, because she aims to bust the stereotype.\nMoved to Bangalore last year. \nBangalore is run by folks from Delhi and Mumbai.\nService workers in Bangalore are so casual it’s almost rude. Not putting on manners.\nWent to one of the best colleges in the country, now feels she can be herself. Plans to get an MBA to run a business.\nGoing to one of these colleges is solid proof that you went through so much and you came out alive. And you are definitely capable of handling the pressure that comes with handling a business. You are capable of making good decisions and you have the frameworks and the background knowledge of how a business operates, because that’s that’s what they taught for two years. So it’s just a very quick way of building credibility.\nShe’s trying to balance writing with work. Just started Substack issue #0. We talked about the muse: pursuing or waiting.\nHer achiever friends, all around age 24, are generally not happy.\n</div>\n\n<hr />\n<div><img src=\"/images/344392.jpg\" alt=\"photo of Ritesh Nagpal\" />\n<h2><a href=\"https://twitter.com/ritesh_nagpal\">Ritesh Nagpal</a></h2>\nCreated a bedtime story book for kids. First the Hindi version then translated to English.\nGrew up in Kota, Rajasthan, 250km from Jaipur.  Got his masters at Purdue, Indiana.\nProduct manager at Amazon.\nKids are now six and one. The six-year-old is suddenly organized, keeping a clean room, now that the one-year-old tries to get into his stuff.\nHis mother died suddenly with him at home. Feels guilty for what he could have done, even though he knows it’s nothing.\nTold me the story of the Gita, the cousins fighting - 5 vs 100 - and one decides not to fight, so Vishnu tells him the contents of the Gita.\nVision for a company is Useful Not True.\nTaught me about UPI - unified payment interface - how it works - and that everyone has it now - all in the last 5-6 years.\nPayTM Sound Box can tell vendors when someone has paid - speaks it in any language, how much was received.\nBangalore has nothing outdoorsy to do. Hyderabad has many things to do.\nJoke about divorce: There was a city with no rain for many years. The priest said tomorrow we’ll pray for rain. When everybody gathered for the prayers, he said, first thing first, how many brought an umbrella?\n</div>\n\n<hr />\n<div><img src=\"/images/437569.jpg\" alt=\"photo of Siddharth V. Rao\" />\n<h2><a href=\"https://www.sequoiacap.com/india/people/siddharth-rao/\">Siddharth V. Rao</a></h2>\nParents instantly moved to Seychelles for a job, so he grew up there from 1986 to 1995.\nShipped off at age 8 to Rishi Valley residential school in India, run by Krishnamurti Foundation, because of complications with his mom and younger brother.\nWent to law school in Hyderabad, as a tool to implement systemic change.\nEarly 2000s, working hard as a lawyer, but this was before Blackberry, so you’d leave work at 6 and be done for the day.\nStarted working with Sequoia Capital, eventually became the general counsel.\nWhiskey is the most popular drink in India.\n</div>\n\n<hr />\n<div><img src=\"/images/353570.jpg\" alt=\"photo of Anish Raju\" />\n<h2><a href=\"https://twitter.com/anishraju\">Anish Raju</a></h2>\nParents from Kerala. Dad was in the army so they moved around a lot. Learned most Indian languages.\nDid an MBA in human resources.\nBecame a certified fitness trainer. Coach.\nNomad at heart but not in fact.\nSince his kids were little, he’s been telling them that at age 18 it’s time for them to go out into the world.\nThey use the Montessori system.\n</div>\n\n<hr />\n<div><img src=\"/images/393785.jpg\" alt=\"photo of Nirant Kasliwal\" />\n<h2><a href=\"https://nirantk.com/\">Nirant Kasliwal</a></h2>\nOne of the most fascinating educational conversations I’ve ever had. I asked him why the south has such a different culture than the north and he said, “Actually I know the answer. I studied sociology of North and West India”, then told me all about it.\nHis parents are from Rajasthan. He grew up in a coastal town called Sura, in Gujarat.\nBangalore is the only city in India with any meaningful quantities of new money.\nNorth and West India has a lot of old money. So there’s a lot of emphasis on dressing.\nIn Jaipur, the famous Golden Triangle, there’s a lot more emphasis on conspicuous display of wealth because most wealth is inherited and it feeds into everything. The opportunities you get to grow professionally and socially are dependent on that display of wealth. Wealth and status are very closely tied.\nOn the other hand, in western India, where I grew up, the display, the clothing will still be very casual. So you could see somebody dressed in boxers, for instance, getting out of a Mercedes, and that guy would eat from a roadside place, because there the display of wealth is less tied to inherited wealth.  It’s tied more to what you have accomplished. So it’s more about what you can do with that wealth. Sponsoring schools.\nNorth India signals strength and wealth - the ability to protect what you love - because until the 1950s India was always under attack from our neighbors. The threat was real. India didn’t have enough money to buy weapons or ammo so they’d send volunteers to collect jewelry and gold to buy ammo to defend our borders. People donated out of free will. Some degree of social pressure. \nPeople often start a school or they donate to a temple, depending on how religious they are and how much money they have, because it’s often cheaper to donate to a temple because legally speaking, schools in India cannot discriminate between students if they are run by a religious institution. So donating to a temple can make a school through the temple which can discriminatingly educate your children.\nJainism’s main prayer starts with, “I bow down to those who have conquered all their senses”.\nWe both noticed the similarity of the words “war ship” and “worship”.\nThe hotel I chose (ITC Gardenia) is intimidating.\nIndia in terms of just cultural diversity is probably richer than Europe.\nBangalore had a Ghazal night - my favorite form of music - inspired by Sufi - romantic poetry. Tabla, harmonium, now guitar since the 90s, and they have their own spin on it in Bangalore. Taking tradition forward, and keeping culture alive.  A performance of Urdu poetry tonight in Bangalore.  None of these existed 5-6 years ago.\nAs money came into Bangalore, it stayed here, which was not the case through the 90s. So now it’s supported its own litrary arts culture scene.\nUrdu poetry gives you some other degree of flexibility. For instance, there’s a word called Ghulam, which has the same origin word as Ghazal. The first sound is very similar to honeysuckle. So in the same root, same Ghulam means slave. And there are very interesting use of this in poetry because most of very famous ghazal traditions, traditions came when India was slave country. So people would write entire poems on how they’re enslaved. And the entire poem would be of great joy that I’m taking joy in slavery. And then the last two lines of that same poem would indicate that actually, they’re enslaved to their lover. \nSufism was Islam’s answer to changing our relationship with God or fear to something a God which is approachable, a God which you can listen to instead of being forced to listen to.\n</div>\n\n<hr />\n<div><img src=\"/images/424416.jpg\" alt=\"photo of Kartikeya Bhardwaj\" />\n<h2><a href=\"https://twitter.com/kartike_ya\">Kartikeya Bhardwaj</a></h2>\nAge 24. From north India - Shimla, Dehradun, Jaipur, and Hyderabad for college - but moved to Bangalore because he got into AI a couple years ago.\nTrained as mechanical engineer but hated it. Skipped exams.\nFather works for Indian Railways and fingerprint attendance systems were banned because of Covid touching shared surfaces.  So Kartikeya came up with Raspberry Pi facial recognition thing, very simple, to replace it.  Worked well for this and other offices, until someone found they could spoof it with a photo instead of live face.  So he figured out an AI to tell the difference between a real face and photo face.  So now he focuses on just that: anti-spoof technology that attendance software systems can use.  SpoofSense.ai\nMoved to Bangalore because not a lot of places that have this kind of culture &amp; connectivity. Crazy stuff happens here. Folks here are at the cutting edge of everything, culturally, technologically, very liberal, very early adopters.\nHe’s the first person to ever ask about the guitar chords at the start of my podcast and audiobook chapters.\nUses FL Studio + Akai MPK Mini to make music, producing for a bunch of rappers in India. The hip-hop scene in Mumbai and Delhi is amazing and magical. Everyone wants to be the next Divine.  He’s very connected with the music community here.\nHe’s in three bubbles: tech, music, and filmmaking.\n</div>\n\n<hr />\n<div><img src=\"/images/437900.jpg\" alt=\"photo of Srikanthan Kumarasamy\" />\n<h2><a href=\"https://coachsrikanth.com/\">Srikanthan Kumarasamy</a></h2>\nHe coaches people to help get past trauma and to their goals.\nOften people in companies hire him to help deal with inter-personal situations at work.\nMinimalist. No car. His son is now in the coaching business with him.\n</div>\n\n<hr />\n<div><img src=\"/images/401650.jpg\" alt=\"photo of Apoorve Singhal\" />\n<h2><a href=\"https://www.tersho.com/\">Apoorve Singhal</a></h2>\nGrew up in Rajasthan. College in Kolkata.\nStudied AI, self-driving cars, machine learning. Decided against master/PhD because he doesn’t like the incentive structure of research: to keep publishing papers.\nWhen Covid hit, booking appointments was nearly impossible as the time slots would be booked up within minutes of release, so he made an app that did it automatically and gave that app away for free. Just UPI donation QR code. Thousands using it per day. But then government called asking too many questions, so he shut it down.\nLast year made a free course to teach Python and spread the message among friends in tier-2/3 colleges. Free to test its effectiveness. Google Sheets back-end.\nY Combinator met with them &amp; suggested that this path won’t work.\nSo instead of teaching Google Sheets, used GPT to turn plain-language requests into Google Sheets results. Business intelligence without all the menus and formulas.\nNow using GPT to give insights before needed.\nHe makes a mental model of the authors he likes.\n</div>\n\n<h2>MONDAY</h2>\n<hr />\n<div><img src=\"/images/437952.jpg\" alt=\"photo of Saurav Arya\" />\n<h2><a href=\"https://justshipit.club/\">Saurav Arya</a></h2>\nGrew up in North India, then West Bengal Kharagpur to study engineering.\nWorked in Italy steel industry for three years when wine was cheaper than water. Read 4HWW there.\n2012 lived every day like it was Sunday. Lived ten years that year. Travelled the world.\nLamu Kenya is like time travel. Donkeys are main transportation.\nRwanda doesn’t get the tourism it deserves. Lake Kivu bordering Congo is amazing.\nHis dad is a retired professor of philosophy and often joined him on his travels.\nRuns an experiential place in Bangalore called Small World.\nNagaland is like going to Papua New Guinea.\nHe helps people transition from 9-5 to nomadic life.\n</div>\n\n<hr />\n<div><img src=\"/images/434288.jpg\" alt=\"photo of Jesvin Mathew\" />\n<h2><a href=\"http://jesvinmathew.gumroad.com\">Jesvin Mathew</a></h2>\nPentecostal family from Kerala but grew up in Bahrain from age 0-6, then boarding school alone in Kerala age 6-11, then back to Bahrain age 11-17.\nWe talked the whole time about family stuff, parenting, honesty, emotions, and other personal things.\nDrummer Benny Greb opened his mind about drumming, and now he’s doing a series of 100 books about drummers.\n</div>\n\n<hr />\n<div><img src=\"/images/437539.jpg\" alt=\"photo of Moina Abdul\" />\n<h2><a href=\"https://www.moinaabdul.com/\">Moina Abdul</a></h2>\nGreat illustrator — “visualizer” — turning ideas into simple visual representations. I’m a fan of her work.\nFrom Vijayawada, Andhra Pradesh. Graduated in Chennai, did MBA in communication management in Pune.\nDad got her my book and Austin Kleon. Got really into Bookstagram. \nTook Janis Ozolins’ course and thrived.\nShe’s been collaborating a lot online, and doing international projects, but looking to get more involved in the Bangalore scene.\n</div>\n\n<hr />\n<div><img src=\"/images/429458.jpg\" alt=\"photo of Srijan Mahajan\" />\n<h2><a href=\"https://srijanmahajan.com/\">Srijan Mahajan</a></h2>\nSuch a cool dude. We bonded on music and motorcycles. Doing pause.family\nCreative technologist. Talked Delhi, vitamins, Seth Godin, and more.\n</div>\n\n<hr />\n<div><img src=\"/images/437521.jpg\" alt=\"photo of Kaustubh Maske Patil\" />\n<h2><a href=\"https://twitter.com/n1kochiko\">Kaustubh Maske Patil</a></h2>\nFellow programmer. We talked tech the whole time, and it was wonderful.\nHe’s nudging me to try Haskell, teaching me about its combinators.\n</div>\n\n<hr />\n<div><img src=\"/images/401388.jpg\" alt=\"photo of Saurabh Mithal\" />\n<h2><a href=\"https://www.passionatelycurious.in/\">Saurabh Mithal</a></h2>\nGrew up in Delhi. Did “all the typical Indian stuff”: a degree in engineering, and an MBA. Then JP Morgan investment banking.\nWent to a forest in Madhya Pradesh to meditate 8 hours a day for three months. We talked a lot about meditation.\nHe’s written a daily blog for 800+ days now.\nWorked with Seth Godin on Carbon Almanac, and really internalized all of Seth’s work.\nWe talked about a lot of personal stuff, divorce, etc. And American lemonade stands.\n</div>\n\n<h2>TUESDAY</h2>\n<hr />\n<div><img src=\"/images/376117.jpg\" alt=\"photo of Alicia Souza\" />\n<h2><a href=\"https://www.aliciasouza.com/\">Alicia Souza</a></h2>\nFamous illustrator, but keeps the focus on her work not her persona.\nShe laughs easier than anyone I’ve ever met. She’s always smiling.\nShe said it’s because she works alone so much that when she does emerge she has so much pent-up energy.\nBorn and raised in Abu Dhabi, then Melbourne, then Bangalore in 2009. She didn’t know crime was real.\nShe’s fascinated by how I manage all my emails.\nHer husband George Seemon is young but looks old with a long all-white beard, which works great for him as an architect.\nFamily from Goa, so she wants to learn Portuguese. Embarrassed that she only knows English.\nGoa was the party place, cheap alcohol, but since Covid has become much more expensive. It’s European in how everything closes for a few hours in the afternoon.\nHad a fun conversation about religion, Catholic upbringing, Da Vinci Code, and why she baptized her son.\n</div>\n\n<hr />\n<div><img src=\"/images/402511.jpg\" alt=\"photo of Yogesh Nachnani\" />\n<h2><a href=\"https://yogeshnachnani.github.io/\">Yogesh Nachnani</a></h2>\nI loved that he uses a Debian Linux laptop. Nerd bonding. He uses grep.\nTalked tech, and PostgreSQL functions. Told me WhatsApp has a back-end API.\nWorked at Flipkart, now at Google.\nWe talked a lot about journaling.\nHis GP is Ricky Kej’s dad.\nHe’s thinking of buying some land past the BLR airport, but land is much cheaper in Andhra Pradesh.\nTaught me about the Aadhaar card.\nIn India you can dictate your expenses. You can live dirt-cheap or expensive. Your choice. Whereas in San Francisco for example it’s forced upon you.\nCompanies in India have economies of scale.\n</div>\n\n<hr />\n<div><img src=\"/images/302363.jpg\" alt=\"photo of Arif Vakil\" />\n<h2>Brothers <a href=\"https://www.facebook.com/mavakil\">Arif Vakil</a> and Ali Vakil</h2>\nThey make the wonderful Sufi Comics.\nGrew up in Dubai, family from Gujarat so always Indian citizens.\nWe talked about the amplifying effect of the internet, limiting our kids’ access to YouTube, and lots about parenting after age 11, manners, discipline, boundaries, Jordan Peterson, Neil Postman, being a monster versus a rabbit.\nThe Quran says that in this book there are verses that are clear and decisive and there are verses that are allegorical.\n</div>\n\n<hr />\n<div><img src=\"/images/437531.jpg\" alt=\"photo of Ganesh K\" />\n<h2><a href=\"https://www.growthstory.in/\">Ganesh K</a></h2>\nGanesh is a “parallel entrepreneur” now after years of being serial. Venture builder platform.\nTaught me about the value of attention, body language, and eye contact.\nTaught me about community health care, agriculture, turmeric superfoods\nTaught me how the Aadhaar card saved banks from doing KYC so that’s why any Indian with the Aadhaar can open a bank account now, free, online.\nAadhaar is like a digital locker so he doesn’t need to carry a wallet or driver’s license anymore.\nTaught me how UPI works, and just today Singapore announced they’re adopting India’s UPI.\nUPI has no fees, so people can pay each other even like 50¢ and it’s worth it. Every roadside vendor takes UPI.\nSix years ago, only 10% of Indians had a bank account, now it’s 80%.\n</div>\n\n<hr />\n<div><img src=\"/images/438224.jpg\" alt=\"photo of Jyothirmayee JT\" />\n<h2><a href=\"https://in.linkedin.com/in/jyothirmayee\">Jyothirmayee JT</a></h2>\nJyothirmayee taught me about the cultural differences between the different parts in India.\nThe bursting creativity of Bengal, aggression of Delhi, money-focus of Mumbai, casual Bangalore, independence of Tamil Nadu and Kerala.\nThe mindset of delegation.\nThere was much more but unfortunately I had packed my bags for the airport, so I didn’t record the conversation.\n</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"706349bd312f3f0d7095928b1a301ca74f4284650175141fad5e95dd0d4783c1","category":"default"}