{"title":"The Enablers","link":"https://kottke.org/24/03/the-enablers","date":1710964139000,"content":"\n        <p>This is quite a paragraph from Adam Gopnik’s New Yorker review (titled <a href=\"https://www.newyorker.com/magazine/2024/03/25/takeover-hitlers-final-rise-to-power-timothy-w-ryback-book-review\">The Forgotten History of Hitler’s Establishment Enablers</a> (subhead: “The Nazi leader didn’t seize power; he was given it.”)) of Timothy Ryback’s new book, <a href=\"https://www.amazon.com/exec/obidos/ASIN/0593537424/ref=nosim/0sil8\">Takeover: Hitler’s Final Rise to Power</a>:</p>\n\n<blockquote><p>Ryback details, week by week, day by day, and sometimes hour by hour, how a country with a functional, if flawed, democratic machinery handed absolute power over to someone who could never claim a majority in an actual election and whom the entire conservative political class regarded as a chaotic clown with a violent following. Ryback shows how major players thought they could find some ulterior advantage in managing him. Each was sure that, after the passing of a brief storm cloud, so obviously overloaded that it had to expend itself, they would emerge in possession of power. The corporate bosses thought that, if you looked past the strutting and the performative antisemitism, you had someone who would protect your money. Communist ideologues thought that, if you peered deeply enough into the strutting and the performative antisemitism, you could spy the pattern of a popular revolution. The decent right thought that he was too obviously deranged to remain in power long, and the decent left, tempered by earlier fights against different enemies, thought that, if they forcibly stuck to the rule of law, then the law would somehow by itself entrap a lawless leader. In a now familiar paradox, the rational forces stuck to magical thinking, while the irrational ones were more logical, parsing the brute equations of power. And so the storm never passed. In a way, it still has not.</p></blockquote>\n\n<p>I got this <a href=\"https://www.threads.net/@claytoncubitt/post/C4tY4jOpwME\">via Clayton Cubitt</a>, who says “History doesn’t repeat itself but it often rhymes.”</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Adam%20Gopnik\">Adam Gopnik</a> · <a href=\"https://kottke.org/tag/Adolf%20Hitler\">Adolf Hitler</a> · <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Germany\">Germany</a> · <a href=\"https://kottke.org/tag/Nazis\">Nazis</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Takeover%3A%20Hitler%27s%20Final%20Rise%20to%20Power\">Takeover: Hitler’s Final Rise to Power</a> · <a href=\"https://kottke.org/tag/Timothy%20Ryback\">Timothy Ryback</a></p>\n\n\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"707a0f72108fe31bbc55dd3475687a859caab18ace098d5bdaed4866c4d9bf4b","category":"default"}