{"title":"Repeatedly follow-up to show you care.","link":"https://sive.rs/3in","date":1515888000000,"content":"<p>\nI knew a music publicist in New York City when she was at the peak of her success.\nA few of her clients had hits, so everyone wanted to work with her.\nShe was flooded with new music.\n</p><p>\nHere’s how she dealt with the flood:\n</p><p>\nWhenever someone sent their music, it would go into an inbox.\nThat inbox was completely ignored.\n</p><p>\nWhenever someone contacted her to follow-up the first time, to ask if she’d received it, she would take their music out of that first inbox, and put it in a second inbox.\nThat second inbox was also ignored.\n</p><p>\nThen if they followed-up with her a second time, asking again if she’d had the chance to listen, she would take their music out of the second inbox, and put it in a third inbox.\nThat third inbox would get a listen if she had some spare time.\n</p><p>\nFinally, if they followed-up a third time, she would take their music out of the third inbox, and make it a priority to give it a real listen.\n</p><p>\nShe saw the shocked look on my face, as she described her system.\nSo she explained:\n</p><p>\n<strong>\n“I can’t listen to everyone, so I can’t know who’s got the best music.\nBut the ones who follow-up show they’ve got the tenacity and drive to succeed.\nAs long as their music is also good, then those are the ones I want to work with.”\n</strong>\n</p><p>\nIt wasn’t ego.\nIt was just a practical way to deal with a flood, and a pretty good filter for choosing new clients.\n</p><p>\nMaybe nobody else has an official system like this.\nBut un-officially, they do.\n<strong>\nOverwhelmed people don’t have time for all the random first-contacts.\n</strong>\nPatience and persistence separate you from the rest, and show how much you care.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"717af52435f15afc59cedd2143a0c173cf39c8501b9248d094835c2aeeb4e933","category":"Sites"}