{"title":"Art doesn’t end at the edge of the canvas.","link":"https://sive.rs/ext","date":1516579200000,"content":"<p>\nImagine you see a caged feather on a museum wall.\nThe sign underneath says the artist is a political activist in jail.\n</p><p>\nImagine that same caged feather again.\nBut instead the sign says the artist is a high school kid in Florida.\n</p><p>\nOr imagine that the only way to see it is to crawl deep into a shrinking tunnel that opens into a room of mirrors, where the caged feather is suspended by a thread.\n</p><p>\nSame feather.\nVery different perceptions.\n</p><p><strong>\nThe way you present your art, and what people know about it, completely changes how they perceive it.\n</strong></p><p>\nTherefore, your art doesn’t end at the edge of the canvas.\nYour creative decisions continue all the way to the end.\n</p><p>\nNow think of the way you create and release music:\n</p><ul><li>\nYou have a tiny idea for a song.\n</li><li>\nYou flesh it out into a full song.\n</li><li>\nYou give it layers of instruments.\n</li><li>\nYou choose its texture when recording.\n</li><li>\nYou come up with an album title, and the visual look of your photos and videos.\n</li></ul><p>\nEvery step so far has been a creative expansion of your original idea.\n</p><p>\nSo now it’s time to put it out into the world.\n<strong>\nDo you turn off all that creativity?\n</strong>\nJust upload the song to the usual places, and announce it like everyone else?\n</p><p>\nNo!\nYour creative process hasn’t stopped!\nFlaunt your artistic freedoms, and have some fun with it!\n</p><ul><li>\nthe way you communicate with the world\n</li><li>\nhow you make your music available\n</li><li>\nthe stories you tell about your music and yourself\n</li></ul><p>\nThese are all the continuation of your creation.\n</p><p><strong>\nMarketing is the final extension of your art.\n</strong></p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"71f222b17d09e6051af14be5d255d60f4d06a1b14f6423706ab25c6af5968490","category":"default"}