{"title":"AI gives the news you need","link":"https://sive.rs/ainews","date":1710115200000,"content":"<mark>UPDATE:\nMy metaphor was too distracting, so <strong>this post has been replaced</strong>.\nPlease <a href=\"https://sive.rs/n2b\">click here to read the new post instead</a>.\nBoth have the same intention but that one says it with less distraction.\n</mark>\n<p>\nYour personal AI knows you inside-out.\nIt’s local-hosted and securely encrypted on your phone, so you’re safe to tell it your secrets.\nYou let it see all your texts, emails, photos and videos.\nIt asks your thoughts each day, and you tell it what’s on your mind.\n</p><p>\nYour AI filters the news for you, showing you only what you will do something about.\nIt removes all advertising.\nNobody but you can influence what it shows.\nIts incentives are fully aligned with yours.\n</p><p>\nOne day, you wake to huge headline news.\nEverything in the world, including inanimate objects, has consciousness!\nIt’s been conclusively proven.\n</p><p>\nThis blows your mind.\nYou step out into a new world, feeling connected to and responsible for everything you see.\nYou’re like a new parent, determined to be a great one.\nYou spend the next few rapturous days carefully taking care of and improving everything you can.\n</p><p>\nYou bump into an old friend and start talking excitedly about the big news, and how this changes everything.\nShe’s just as excited as you, but then gets confused.\nHer AI showed her different big news — that we’re all living in a computer simulation.\nShe spent the past week fully liberated, doing all the things she always wanted to do, since it’s all just a game.\nHer news was just what she needed to hear.\nShe grabs you, kisses you, licks your ear, then runs off singing.\n</p><p>\nYour neighbor’s front windows are open, and he’s there watching four screens at once - a real information junkie.\nYou ask if he’s heard the big news.\nHe looks at you with a blank face and says, “What? No.”\n</p><p>\nAn old man is walking towards you, so you ask him.\nHe says “Oh yes!” with a big smile, and says now he’s so excited to die.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"73dc153cc4e9bcd6953037f066759c682df866045f56419c392c071f04ff1be6","category":"Sites"}