{"title":"AI gives the news you need","link":"https://sive.rs/ainews","date":1710115200000,"content":"<p>\nYour personal AI knows you inside-out.\nIt’s local-hosted and securely encrypted on your phone, so you’re safe to tell it your secrets.\nYou let it see all your texts, emails, journals, photos and videos — past and present.\nIt asks your thoughts each day, and you tell it what’s on your mind.\nYou enjoy how its questions make you reflect.\n</p><p>\nYour AI filters the news for you, showing you only what you care about and will do something about.\nSince it knows what you're working on now, it automatically shows you information that helps your current work, or if you've plateaued, opportunities to expand your work.\nIt recommends alternations to your current diet, and summarizes the actionable take-aways from books and articles that might help with your current personal situation.\n</p><p>\nIt filters out any advertising.\nNobody but you can influence what it shows you.\nIts incentives are fully aligned with yours.\n</p><p>\nOne day, you wake to huge headline worldwide news.\nPanpsychism is true.\nEverything in the world, including inanimate objects, has consciousness!\nIt’s been conclusively proven.\n</p><p>\nThis blows your mind.\nYou step out into a new world, feeling connected to and responsible for everything you see.\nYou’re like a new parent, determined to be a great one.\nYou spend the next few rapturous days carefully taking care of and improving everything you can, talking with things as you go.\n</p><p>\nThen you see an old friend and start talking excitedly about the big news, and how this changes everything.\nShe’s just as excited as you, but then gets confused.\nHer AI showed her different big news — that we’re all living in a computer simulation.\nShe’s spent the past week fully liberated, doing all the things she always wanted to do, since it’s all just a game.\nIt was just what she needed to hear.\nShe grabs you, kisses you, licks your ear, then runs off singing.\n</p><p>\nYou ask the next person you see if he’s heard the big news.\nThe old man says “Oh yes!” with a big smile, and says he’s so excited to die.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"73dc153cc4e9bcd6953037f066759c682df866045f56419c392c071f04ff1be6","category":"default"}