{"title":"Louise Erdrich on the Deepest Meaning of Resistance","link":"https://www.themarginalian.org/2024/11/13/louise-erdrich-resistance/","date":1731521184000,"content":"<h3>“Resist loss of the miraculous by lowering your standards for what constitutes a miracle. It is all a fucking miracle.”</h3>\n<hr />\n<p>The best advice we have for anyone else is <a href=\"https://www.themarginalian.org/2024/10/22/marginalian-18/\">always advice to ourselves</a>, honed on the sincerity of living, learned through life’s best teaching tool: suffering. Otherwise it becomes that most untrustworthy of transmissions: preaching. It is in speaking to ourselves that we practice speaking the truth — the unflattering truth, the incongruous truth, the truth trembling with all the terror and tenderness of knowing ourselves in order to know the world, of loving ourselves in order to love the world. </p>\n<p>That is what Native American novelist, poet, and children’s book author Louise Erdrich — she who urged us so passionately to <a href=\"https://www.themarginalian.org/2024/03/22/love-anyway/\">love anyway</a> — offers in “Advice to Myself #2: Resistance,” originally published in a special edition of <a href=\"https://orionmagazine.org/article/women-standing-rock/\" target=\"_blank\"><em>Orion Magazine</em></a> — a poem evocative of Derek Walcott’s classic <a href=\"https://www.themarginalian.org/2015/04/21/love-after-love-derek-walcott/\">“Love After Love,”</a> of Leonard Cohen’s <a href=\"https://www.themarginalian.org/2024/07/18/leonard-cohen-anger-resistance/\">lyric reckoning with resistance</a>, and yet entirely original for the simple reason of drawing from the freshest spring of the universal: the most deeply personal. </p>\n<p> </p>\n<blockquote><p><strong>ADVICE TO MYSELF #2: RESISTANCE</strong><br />\n<em>by Louise Erdrich</em></p>\n<p>Resist the thought that you may need a savior,<br />\nor another special being to walk beside you.<br />\nResist the thought that you are alone.<br />\nResist turning your back on the knife<br />\nof the world’s sorrow,<br />\nresist turning that knife upon yourself.<br />\nResist your disappearance<br />\ninto sentimental monikers,<br />\ninto the violent pattern of corporate logos,<br />\ninto the mouth of the unholy flower of consumerism.<br />\nResist being consumed.<br />\nResist your disappearance<br />\ninto anything except<br />\nthe face you had before you walked up to the podium.<br />\nResist all funding sources but accept all money.<br />\nCut the strings and dismantle the web<br />\nthat needing money throws over you.<br />\nResist the distractions of excess.<br />\nWear old clothes and avoid chain restaurants.<br />\nResist your genius and your own significance<br />\nas declared by others.<br />\nResist all hint of glory but accept the accolade<br />\nas tributes to your double.<br />\nWalk away in your unpurchased skin.<br />\nResist the millionth purchase and go backward.<br />\nGet rid of everything.<br />\nIf you exist, then you are loved<br />\nby existence. What do you need?<br />\nA spoon, a blanket, a bowl, a book —<br />\nmaybe the book you give away.<br />\nResist the need to worry, robbing everything<br />\nof immediacy and peace.<br />\nResist traveling except where you want to go.<br />\nResist seeing yourself in others or them in you.<br />\nNothing, everything, is personal.<br />\nResist all pressure to have children<br />\nunless you crave the torment of joy.<br />\nIf you give in to irrationality, then<br />\nresist cleaning up the messes your children make.<br />\nYou are robbing them of small despairs they can fix.<br />\nResist cleaning up after your husband.<br />\nIt will soon replace having sex with him.<br />\nResist outrageous charts spelling doom.<br />\nHowever you can, rely on sun and wind.<br />\nResist loss of the miraculous<br />\nby lowering your standards<br />\nfor what constitutes a miracle.<br />\nIt is all a fucking miracle.<br />\nResist your own gift’s power<br />\nto tear you away from the simplicity of tears.<br />\nYour gift will begin to watch you having your emotions,<br />\nso that it can use them in an interesting paragraph,<br />\nor to get a laugh.<br />\nResist the blue chair of dreams, the red chair of science, the black chair of the humanities, and just be human.<br />\nResist all chairs.<br />\nBe the one sitting on the ground<br />\nor perching on the beam overhead<br />\nor sleeping beneath the podium.<br />\nResist disappearing from the stage,<br />\nunless you can walk straight into the bathroom and resume the face,<br />\nthe desolate face, the radiant face, the weary face, the face<br />\nthat has become your own, though all your life<br />\nyou have resisted it.</p></blockquote>\n<p>Couple with e.e. cummings on <a href=\"https://www.themarginalian.org/2017/09/25/e-e-cummings-advice/\">the courage to be yourself</a> — the ultimate act of resistance “in a world which is doing its best, night and day, to make you everybody else” — then revisit Grace Paley on <a href=\"https://www.themarginalian.org/2015/09/03/grace-paley-aging/\">the art of growing older</a>, predicated on how you hold your face.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"749fdd9f96d1ef34836a5cf143d6801846194f9be704e3673a8dc8e40673a1fc","category":"Sites"}