{"title":"Baseball’s Gambling Hypocrisy","link":"https://om.co/2024/06/06/baseballs-gambling-hypocrisy/","date":1717682039000,"content":"<figure><img width=\"1024\" height=\"731\" src=\"https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1024&amp;h=731\" alt=\"person standing on sands\" srcset=\"https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=300&amp;h=214 300w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1024&amp;h=731 1024w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=150&amp;h=107 150w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=768&amp;h=548 768w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1536&amp;h=1096 1536w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=2048&amp;h=1462 2048w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=256&amp;h=182 256w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=2000&amp;h=1428 2000w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=192&amp;h=137 192w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1100&amp;h=785 1100w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=232&amp;h=157 232w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=627&amp;h=416 627w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=560&amp;h=399 560w, https://images.unsplash.com/photo-1528291954423-c0c71c12baeb?ixid=M3wxMzczOTd8MHwxfGFsbHx8fHx8fHx8fDE3MTc2ODE4OTN8&amp;ixlib=rb-4.0.3&amp;fm=jpg&amp;q=85&amp;fit=crop&amp;w=1800&amp;h=1285 1800w\" /><figcaption>Photo by <a href=\"https://unsplash.com/@bmowinkel\">Brandon Mowinkel</a> on <a href=\"https://unsplash.com/?utm_source=on-my-om&amp;utm_medium=referral\">Unsplash</a> </figcaption></figure>\n\n\n\n<p>If you’re wondering why this is a topic of interest, let me elaborate — whether it involves selling in-game upgrades, pursuing growth at all costs on Facebook, or engaging in sports betting, I believe these practices are fundamentally wrong and not right way to use technology for the greater good. The weaponization of betting in the name of sports and entertainment has been facilitated by the proliferation of smartphones, affordable always-on connectivity, big data, and algorithms.</p>\n\n\n\n<hr />\n\n\n\n<blockquote>\n<p>MLB has banned Tucupita Marcano of the Padres permanently for betting on baseball games while injured last season. Four other minor leaguers received one-year suspensions for betting on MLB games not involving their teams. [<a href=\"https://www.nytimes.com/athletic/5539792/2024/06/04/tucupita-marcano-permanent-ban-mlb-sports-betting/\" target=\"_blank\">The Athletic</a>]<br /><br />NBA bans Raptors’ Jontay Porter for life over betting scandal. <a href=\"https://www.nytimes.com/2024/04/21/business/raptors-jontay-porter-gambling.html?searchResultPosition=6\" target=\"_blank\">The New York Times</a></p>\n</blockquote>\n\n\n\n<p>This is just the beginning. We are going to see many more Jontay Porters and Tucupita Marcanos!</p>\n\n\n\n<p>How can we not — when every game, every ad break, and every instance of non-gaming action encourages us to engage in disguised gambling? The message is clear: Gambling is not just acceptable; it’s an integral part of the fan experience.</p>\n\n\n\n<p>Whether Major League Baseball wants to admit it or not, like every other sports league, it has struck a Faustian bargain when it comes to gambling. All its moral grandstanding is nothing but blatant hypocrisy.</p>\n\n\n\n<p>The sports betting complex has engulfed the entire sporting ecosystem, including the leagues, influencers, podcasters, and even established media organizations — notably ESPN. The Athletic, which reported the story and is owned by The New York Times, serves as the “sports betting partner” of BetMGM in Canada and the United States. The New York Times also accepts gambling-related advertising. The revenue is simply too substantial to resist what some might call a devil’s bargain.</p>\n\n\n\n<p>There is no hiding from the facts. In 2018, after the<a href=\"https://www.nytimes.com/2018/05/14/us/politics/supreme-court-sports-betting-new-jersey.html\" target=\"_blank\"><u> Supreme Court struck down a 1992 federal law that</u></a> limited sports betting primarily to Nevada, MLB quickly signed a deal with MGM Resorts. This agreement was <a href=\"https://www.espn.com/chalk/story/_/id/25292551/mgm-resorts-mlb-strike-gaming-sponsorship-deal\">the first of its kind</a> between a major U.S. sports league and a gaming company. Since then, more such deals between leagues, teams, and betting operators like DraftKings and FanDuel <a href=\"https://www.actionnetwork.com/mlb/mlb-sports-betting-partnerships-deals-draftkings-fanduel-mgm-scoreboards\">have followed</a>. </p>\n\n\n\n<p>The key to all these deals is data — the lifeblood of betting ecosystems. Sports leagues, including MLB, are providing <a href=\"https://om.co/?page_id=924449\">real-time data feeds to bookmakers</a>, enabling a dizzying array of in-game betting options. </p>\n\n\n\n<p>This gamification of sports betting, essentially Gambling 2.0, eliminates the need for a casino or traditional bookies.</p>\n\n\n\n<blockquote>\n<p>“There are people who say that you enjoy sports more if you bet. I say you ruin sport if you promote betting because, first of all, it disembodies sport ” <br /><br /><em>Bruce Kidd, Ban Ads for Gambling in Canada &amp; a professor emeritus of sport and public policy at the University of Toronto, <a href=\"https://www.nytimes.com/2024/03/09/world/canada/canada-sports-gambling-advertising.html?searchResultPosition=3\" target=\"_blank\">quoted in The New York Times.</a></em></p>\n</blockquote>\n\n\n\n<p>And if you think this issue is confined to Major League Baseball, think again. Every sports league is complicit. Take cricket, especially in the intensely popular T20 format, which boasts more leagues than Waymo cars on the streets of San Francisco. Many of these leagues are so loosely policed, they might as well be a Nevada backwater casino.</p>\n\n\n\n<p>In India, the world’s largest cricket market, fantasy apps such as Dream11 and MPL <a href=\"https://www.exchange4media.com/marketing-news/how-fantasy-gaming-platforms-are-fuelling-the-growth-of-sports-marketing-in-india-108505.html\">have become ubiquitous sponsors</a>. In other leagues, betting companies feature their <a href=\"https://www.insidesport.in/ipl-2020-franchises-50-sponsorship-revenue-from-betting-gambling-companies/\">logos prominently on team kits and stadium hoardings</a>. Even the ICC, the sport’s global governing body, <a href=\"https://www.icc-cricket.com/media-releases/1227396\">has a data deal with Sportradar</a> to fuel <a href=\"https://www.thehindu.com/sport/cricket/ipl-betting-racket-busted-in-delhi-11-arrested/article34381921.ece\">betting markets</a>.</p>\n\n\n\n<p>When I watch games on Willow in the US, every ad break pushes a company’s own “fantasy” app. These come-ons are a nanometer away from being advertising for gambling. Willow is owned by the same Indian media company that owns one of two major cricket websites, Cricbuzz, and The Times of India newspapers. The other major cricket website, ESPN Cricinfo, actually has “bet” as an option in its app, right next to the in-game scores. </p>\n\n\n\n<blockquote>\n<p>“We’re now in a phase where the nation has an appetite for sports betting. It’s created this new form of entertainment that society has approved, but that form of entertainment does have a potential for addiction.”</p>\n\n\n\n<p><em>Dr. Timothy Fong, a professor of psychiatry with specialty in addiction at the University of California, Los Angeles, <a href=\"https://www.nytimes.com/2021/04/01/sports/sports-betting-addiction.html?unlocked_article_code=1.xU0.XlmE.ZDcTA22cv1yX&amp;smid=nytcore-ios-share&amp;referringSource=articleShare&amp;u2g=i\" target=\"_blank\">The New York Times</a>.</em></p>\n</blockquote>\n\n\n\n<p>The proliferation of smartphones, inexpensive data plans, and gamification tactics perfected over more than two decades have made sports gambling ubiquitous.The integrations are seamless; placing a bet is as easy as ordering an Uber. Every click, swipe, and dollar or rupee staked generates valuable data to further optimize the system. Using phrases that normalize betting as a sporting activity, the industry is creating a disaster that we don’t yet fully comprehend.</p>\n\n\n\n<p>Remember the Farmville addiction?. That was just baby stuff. This is surveillance capitalism with the thrill of a wager. In this unholy alliance of sports, betting, and big data, we may be sowing the seeds of another crisis. The societal impact of this gambling boom could be as significant, if not more, than the impact of opioids, which also was sold in an innocuous fashion. Experts are sounding <a href=\"https://www.nytimes.com/2022/11/20/business/gambling-addiction-pandemic.html\">alarms about problem gambling</a>, <a href=\"https://theconversation.com/as-sports-betting-grows-experts-warn-of-a-surge-in-gambling-addiction-177415\">mental health issues, financial hardship</a>.</p>\n\n\n\n<p>Don’t listen to me — just listen to Craig Carton, who chronicles the sports gambling crisis on his weekly radio show. In a recent article, <a href=\"https://www.nytimes.com/2024/04/21/business/craig-carton-sports-gambling.html?searchResultPosition=4\" target=\"_blank\">Carton told</a> The New York Times:</p>\n\n\n\n<blockquote>\n<p>“There’s a preconceived notion of the kind of guy or gal that is a gambling addict. And now you’re listening to schoolteachers and doctors and lawyers and first responders and librarians — normal people who went down a road never having any expectation of having a problem.”</p>\n</blockquote>\n\n\n\n<p>The problem is particularly acute among young people — I hear about youngsters, especially in colleges, becoming addicted to sports gambling. There are offline multi-level marketing efforts aimed at drawing kids into gaming. In a 2021 article, The New York Times quoted a former gambling addict<a href=\"https://www.nytimes.com/2021/04/01/sports/sports-betting-addiction.html?unlocked_article_code=1.xU0.XlmE.ZDcTA22cv1yX&amp;smid=nytcore-ios-share&amp;referringSource=articleShare&amp;u2g=i\" target=\"_blank\"> saying</a>:</p>\n\n\n\n<blockquote>\n<p>“I think that the industry of sports betting is definitely evolving, which is scary for the public. You’re always clicks away from it anytime you want it. It’s out there 24/7. I don’t think that people are aware of how devastating the consequences of this will be.”</p>\n</blockquote>\n\n\n\n<p>The leagues, of course, will say they’re on top of it. A banned player here, a slap on the wrist there. But it’s all just theater. MLB and every sports league are full of it. They’ve made their deal with the devil. They love the money. They love the profits. It doesn’t matter who ultimately pays the price.</p>\n\n\n\n<p>If those in power were truly committed to integrity, they would take a serious look at themselves. The New York Times would refuse to accept any gambling advertisements. However, if it declines, others will certainly accept them. Media outlets are desperate for revenue — a fact well known to the gambling giants. Major League Baseball understands the importance of keeping fans engaged with their sport.</p>\n\n\n\n<p>I’m not holding my breath that anyone will take action. Perhaps my frustration stems from the visible societal crisis looming on the horizon — as if we don’t have enough other issues to contend with. Until then, spare me the moralizing.</p>\n\n\n\n<p><em>June 6, 2024. San Francisco</em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"75646d1db99551ccdb9bd9b420b0bf876136a974112b3bf283108238b362500b","category":"default"}