{"title":"Nintendo Switch review","link":"https://blog.webb.page/2017-03-18-nintendo-switch-review.txt","date":1489795200000,"content":"<p>In the two weeks since I left GameStop eagerly waiting to get home and unbox\nmy console, the Nintendo Switch has been <em>such</em> a joy to use. I waited two\nweeks to write this review so I could accurately depict how it fits into my\neveryday. Before I start the review though, I figured I'd run through my\nlaunch night.</p>\n<h2>Midnight Launch</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-a.jpg\">I was the first customer in Boston to get a Switch</a></p>\n<p>In an effort to make the midnight launch go as smoothly as possible, GameStop\nrequired people to get a receipt with their pre-order earlier in the day and\nthey were numbered so people would know where to stand in line. As people on\nthe Internet say, \"FIRST!!1!\". The guy behind me got to the midnight launch\nbefore I did and was wondering who had the number one receipt. I thought it\nwas pretty funny.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-b.jpg\">Line to the door and then some</a></p>\n<p>I went to the midnight launches of the DSi and 3DS. Those launches had\n<em>nothing</em> on this one. When I left, the line was to the door and then some. It\nwas a <em>hella</em> windy night and I'm glad we didn't have to wait outside.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-c.jpg\">Lucky mofos to snag a Switch</a></p>\n<p>The people on the other side of the store didn't have a pre-order, but they\nsnagged the 13 or so extra Switch consoles this GameStop had for launch. As I\nwaited to get the aforementioned receipt, a couple realized that someone in\nGameStop allowed those 13 people to reserve the right to buy the limited\nSwitch consoles and the couple were highly upset, to say the least.\nApparently, that wasn't supposed to happen until 6pm. GameStop's gonna\nGameStop. 🤷🏾‍♂️</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-d.jpg\">Double-sided Zelda poster</a></p>\n<p>As a launch bonus, everyone got a free Zelda poster. I should put this up at\nsome point but I'm still unsure about which side I like most. As soon as I got\nmy bag of goodies, I left the store ASAP. I was stopped by someone in line for\nan impromptu Facebook Live interview. That was weird but two random people\nknow who I am now! Since you got this far, here's a video:</p>\n<h2>Initial Setup</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-e.jpg\">Such gaming, much fun</a></p>\n<h2>The Review</h2>\n<p>I didn't truly appreciate the Wii U's GamePad until my girlfriend asked me if\nI was done playing Deus Ex: Human Revolution. I was hours deep into playing\nand she had shows to watch. With the press of a button, I <em>switched</em> my\nattention from the TV to the controller I already had in my hand and walked to\nmy desk a few feet away. Confused, she asked if I was mad at her. Of course I\nwasn't, I was still playing Deus Ex! I guess you could say my gameplay was\naugmented.</p>\n<p>For the uninitiated, the Wii U allowed you to swap between the GamePad and the\nTV for playing most (if not all) games. In a household where there was only\none TV at the time, it was amazing.</p>\n<p>With the Switch, that appreciation came a helluva lot quicker. I have a roving\n10-month-old who likes to wreak havoc and while my girlfriend was gracious\nenough to let me spend the entire first weekend with the Switch relatively\nundisturbed, the boy needed to be watched when mom was busy. While playing\nZelda, I was asked to watch the boy for a couple minutes so I took the Joy-Con\nout of the charging grip<a href=\"http://amzn.to/2n522S7\">1</a> (<em>highly</em> recommended) and onto the sides of the\nSwitch, which I then took out of the dock and walked downstairs. After making\nmyself a human fence to block the boy from roaming elsewhere I continued\nplaying.</p>\n<p>Seamless!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-f.jpg\">The super portable</a></p>\n<p>I bought a Nintendo GameBoy fanny pack from eBay after seeing someone post an\nold ad for it in /r/NintendoSwitch<a href=\"https://www.reddit.com/r/NintendoSwitch\">2</a>. I wasn't sure if the Switch would even\nfit but it does! You'll have to detach the Joy-Con, of course. Since the\nweather is frigid at the moment, I've been using my hoodie<a href=\"https://www.instagram.com/p/BOLHZpjhE1F\">3</a>'s pouch to\ntransport my Switch. When the weather gets warmer, the fanny pack will make an\nappearance. I also have an Animal Crossing bell pouch that I purchased from\nEtsy but I like the fanny pack more.</p>\n<p>I think the <em>super</em> portable nature of the Switch is going to make gaming\nhappen in unexpected places, and more often. I'm looking forward to having\nimpromptu Splatoon 2 battles in an airport or Street Fighter II matches in a\nline for food trucks.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-g.jpg\">Charging on the go</a></p>\n<p>Being a home console that's also portable, AAA-type games like the new Zelda\nconsume a LOT of power. As a result, the battery life isn't great (I've gotten\nroughly three hours of Zelda gameplay on a single charge). It doesn't seem\nthat much different from the battery life of a 3DS when playing Super Smash\nBros. You'll get a notification that the battery level is low but I usually\nignore that until I see it a second time. If I'm in transit, I use my Anker\ncharger<a href=\"http://amzn.to/2mFFy6R\">4</a> to keep gaming.</p>\n<p>For me, the battery life hasn't been an issue and that's because I have a\nlaptop with USB-C charging<a href=\"/2017-01-07-macbook-pro-review.txt\">5</a>. Whether I'm at home or at work, I <em>always</em> have\na charger (I bought two because I kept leaving my then sole charger at home).\nThe addition of yet another popular device with USB-C charging in the global\nmarketplace makes me confident that the future of a single port for a̶l̶l̶\nmost electronics will come to fruition relatively soon. Early adopters like\nmyself have to deal with buying temporary plugadoos and such but hey, that's\nso <em>you</em> don't have to!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-h.jpg\">An excellent purchase decision</a></p>\n<p>I wasn't sure if I would come to regret buying grips<a href=\"http://amzn.to/2n4lUVx\">6</a> for the Joy-Con but\nafter a <em>single</em> Snipperclips play session, I can honestly say it was a\n<em>fantastic</em> purchase decision. The Joy-Con feel decent without it but with my\nJack Skellington-esque fingers, I definitely appreciated the classic\ncontroller feel of the grips. My girlfriend has much smaller hands and will\nnot play Snipperclips without them.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-i.jpg\">Love the build quality</a></p>\n<p>The build quality of the Switch is awesome. It's also incredibly light,\nsuspiciously so. You'd think it'd weigh more for what it does. The kickstand\non the back is plastic and detachable. It's designed to be easily replaceable\nand that's awesome because it would suck if you had to replace the console\nbecause of it.</p>\n<p>There are fan vents on the top of the device and it occurred to me after week\none of owning it that I've never heard fan noise. When I've thought to touch\nthe top of it during a lengthly play session I did feel heat and had to put\nthe Switch up to my ear to hear fan noise. I've had a screen protector since\nday one and somehow let an errant wisp of fabric get in but I don't care\nenough to fix that niggling issue.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-j.png\">dbrand skin for Nintendo Switch</a></p>\n<p>I'm sad that dbrand won't be making Switch skins<a href=\"https://www.reddit.com/r/NintendoSwitch/comments/5xc5si/warning_do_not_skin_your_nintendo_switch\">7</a>. This is the design I came\nup with, to match the awesome marble skin on my MacBook Pro<a href=\"/2017-01-07-macbook-pro-review.txt\">5</a>. Welp. At least\ndbrand is an awesome company.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-k.jpg\">Great interface</a></p>\n<p>I've taken so many screenshots of the interface (except in eShop, that's not\npossible there) and I've got one request for Nintendo. <em>Please</em> make it\npossible to hide the UI in games when taking screenshots! I complained about\nthis to @jessety<a href=\"https://twitter.com/jessety\">8</a> and he informed me that you can hide most of the UI in\nZelda (you'll just see your heart containers). I just hope more games adopt\nthe \"Pro HUD\" option that Zelda provides.</p>\n<p>I'll end this review with the real reason I bought a Switch: Splatoon 2! If\nyou hadn't guessed by the decal on the back of my Switch, I'm a <em>huge</em> fan of\nthe original for Wii U. 🕸</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/nintendo-switch-review-l.jpg\">The reason I bought a Switch</a></p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"7661a29f668c1862269bbba0c4fd2906b6c0c57c724887e8ba8bf806aa2f025a","category":"Sites"}