{"title":"Would you make your art if you were the last person on earth?","link":"https://sive.rs/tp3","date":1569369600000,"content":"<p>\nMusicians, photographers, writers, and artists of all sorts:\n</p><p>\n<strong>\nWould you make your art if you were the last person on earth?\n</strong>\n</p><p>\nFor me, it’s an immediate YES — of course!\nIn fact, it might make the experience even better.\n</p><p>\nA musician friend asked me this question, and was freaked out by my answer.\nShe said she can’t even imagine a world-view like mine.\nHow could I possibly want to make music if there was no one to hear it?\n</p><p>\nShe said, “Ultimately, everything I do is for other people.”\n</p><p>\nI said, “Ultimately, everything I do is for myself.”\n</p><p>\nWhen I’m creating anything, I do it mostly for my own curiosity — to see how I can develop this fun idea in my head.\nEven when I’m providing a service that seems generous, I’m really doing it because it seemed like a fun system to build.\nIf people like what I’ve made, that’s just a bonus.\n</p><p>\nThis is related to yesterday’s post, “<a href=\"https://sive.rs/tp2\">Travel without social praise</a>”.\nEven despite what I’ve said here, I still have to ask myself if I’m doing something just for the praise.\n</p><p>\n<strong>\nIs this something I really want to do, or do I just like the image it represents?\n</strong>\n</p><p>\nIf it feels like I’m doing it for the image, is that for my self-identity — how I see myself — the person I’d like to be for my own sake — or is it just being done for others?\n</p><p>\nOne way I try to solve that question is by asking myself if I would do this thing if I was the last person on earth — or at very least, if I never told anyone about it.\n</p><p>\n(\nSee also: “<a href=\"https://sive.rs/zipit\">Announcing your plans makes you less motivated to accomplish them</a>”.\n)\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"76b22d71780dfad7c707b0705b371aa72876750b00289b571e389937bad532db","category":"default"}