{"title":"VIP on Baton+Caviar: Final Farm Report","link":"https://mirror.xyz/riotgoools.eth/8WjWsJmRoQLnRPCM0IZzlCE-3zIwD5y7vsS3dLmfm5k","date":1694398388000,"content":"<p><a href=\"https://mirror.xyz/riotgoools.eth/8WjWsJmRoQLnRPCM0IZzlCE-3zIwD5y7vsS3dLmfm5k\"><img src=\"https://images.mirror-media.xyz/publication-images/CaeQFrrmwmiLmwlh7v8AL.png?height=420&amp;width=840\" /></a></p>\n<p><strong><a href=\"https://mirror.xyz/riotgoools.eth/8WjWsJmRoQLnRPCM0IZzlCE-3zIwD5y7vsS3dLmfm5k\">VIP on Baton+Caviar: Final Farm Report – elle</a></strong></p>\n<blockquote>\n<p>The Very Internet Person farm season on Baton has concluded! Four Miladys have been successfully emitted and distributed to farmers. Thank you to everyone that participated in this three month long farming experiment to take my Miladys away (๑˃ᴗ˂๑) and thanks to Caviar and Baton for inviting me to try out the platform. Now, I want to write a little review on how things went; the goals, the results, the surprises.</p>\n</blockquote>\n<p>As a more art focused \"project\", I had never done much with NFTfi. Even though I started out on Fantom, a defi heavy chain, I didn't really delve too deeply into the financialization of NFTs. The focus of my art practice has mainly been on making things that resonate with people on some level – aesthetically, intellectually, memetically, etc. (ie. vibes.) It's why I never really pay much attention to where the floor is or encourage many of the manufactured hype behaviors that have (unfortunately) become the standard fare. I would rather people collect the things I make because they like the art and not because of coercion through outsized promises of utility and returns. And if the art isn't for them, then they don't have to mint/buy it. But I am aware that NFTs are a developing form and a technology that can allow for things to be much more interesting than just being a simple digital art shop that makes you pay with internet money. And, in terms of my broader creative practice, I believe a big part of making art is also experimenting with the medium and form and this is intertwined with my practice as an internet person learning about/experimenting with internet technology.</p>\n<p>One of the reasons I deployed Very Internet Person on Ethereum was to play with the wider array of NFTfi tools that were becoming available. I already had a habit of doing things like randomly distributing funds generated from sales and royalties to people who collected my Goool collections. But it was done in a manual, mostly offchain way, just using Disperse to send tokens to addresses I compiled in a spreadsheet. Not very efficient, especially when I have art projects to do.</p>\n<p>The Caviar VIP pool had been going for a while when Tamagoyaki from Caviar asked me if I wanted to try out a new NFT yield farming platform called Baton that was being built on top of Caviar and introduced me to the founder, Sapijiju. It sounded very interesting to me and I started thinking about what I could do with it.</p>\n<p>As I thought about how the space has evolved and where it was at, I had been wanting to move some more VIP trade activity away from the standard order book marketplaces to the Caviar pool. This would enable people to do things like directly swap for their desired VIPs without having to go through sell/buy and also earn rewards from the trading activity (stakers receive the trading fees whereas the fees on things like OpenSea go to the marketplace platform.) I like how this system benefits the people who enjoy being a part of the project whereas the traditional marketplaces can sometimes feel like a PVP funnel to get out of projects at the expense of someone else. The typical order book marketplaces make more sense for specific pieces that one might want to sell far above floor price. Given the current state of the space, it feels like a good time to try different models. But with Caviar being relatively newer on the scene itself, many people had not used it before and so I thought doing a Baton farm would be a good way to incentivize checking it out. Like I said, I also wanted to experiment.</p>\n<p><a href=\"https://mirror.xyz/riotgoools.eth/8WjWsJmRoQLnRPCM0IZzlCE-3zIwD5y7vsS3dLmfm5k\">Read the full entry</a></p>\n","author":"elle","siteTitle":"elle","siteHash":"7e5129fe3f5513780be522d901263accb61be79b3a0e9bbe44e73d0e66dada6d","entryHash":"778e48d24a293738728a85a2494d63ad73e339abe35050234158e6f96c4d0a7f","category":"default"}