{"title":"Mediaeater Digest Vol.30, No. 159","link":"https://ghuneim.com/2024/06/07/mediaeater-digest-vol-30-no-159/","date":1717791009000,"content":"<p><a href=\"https://transparencyreport.google.com/youtube-copyright/intro\"><span>YouTube Copyright Transparency Report</span></a><span> (youtube) paid out over $70 billion to creators, artists, and media companies in recent years, and it boasts over 100 million Premium and Music subscribers. Its Content ID system, which allows rightsholders to monetize user-generated content, has paid out over $9 billion in ad revenue</span></p>\n<p><a href=\"https://www.youtube.com/watch?v=EXxMCm941WA\">Adobe roofies all of their customers</a> (youtube) After they went to the cloud I stopped using their products. -ed</p>\n<p><a href=\"https://www.wired.com/story/how-to-lead-army-of-digital-sleuths-age-of-ai/\"><span>How to Lead an Army of Digital Sleuths in the Age of AI</span></a><span> (nyt) Eliot Higgins and his 28,000 forensic foot soldiers at Bellingcat have kept a miraculous nose for truth—and a sharp sense of its limits—in Gaza, Ukraine, and everywhere else atrocities hide online.</span></p>\n<p><a href=\"https://www.bloomberg.com/news/articles/2024-06-06/apple-to-debut-passwords-app-in-challenge-to-1password-lastpass?\"><span>Apple to Debut Passwords App in Challenge to 1Password, LastPass</span></a><span>  (bloomberg)  Apple Inc. will introduce a new homegrown app next week called Passwords, aiming to make it easier for customers to log in to websites and software, according to people with knowledge of the matter.</span></p>\n<p><span>Andrew Ng (Twitter) The effort to protect innovation and open source continues. I believe we’re all better off if anyone can carry out basic AI research and share their innovations. </span><a href=\"https://x.com/AndrewYNg/status/1798753608974139779\"><span>Right now, I’m deeply concerned about California’s proposed law SB-1047.</span></a><span> It’s a long, complex bill with many parts that require safety assessments, shutdown capability for models, and so on.</span></p>\n<p><a href=\"https://www.wsj.com/tech/ai/ftc-opens-antitrust-probe-of-microsoft-ai-deal-29b5169a\"><span>FTC Opens Antitrust Probe of Microsoft AI Deal </span></a><span>(WSJ) Commission has sent subpoenas to tech giant and startup, asking whether their partnership evaded required government review</span></p>\n<p><a href=\"https://heymusic.ai/blog/papers/coola\">Heymusic.ai</a> – Coherence-Oriented Contrastive Learning of Musical Audio Representations</p>\n<p><a href=\"https://www.ncbi.nlm.nih.gov/pmc/articles/PMC7233791/pdf/ACTA-90-526.pdf\">Secret hand gestures in paintings</a>  (pdf) – hand signs in visual art may provide clues about the underlying iconographical symbols. This paper will examine the eventual hidden meanings behind a peculiar hand gesture that has been widely used by several painters</p>\n<p><a href=\"https://kling.kuaishou.com/\">KLING</a> – Chinese new DiT Video AI Generation model 【KLING】 Open access  Generate 120s Video with FPS30 1080P, Understand Physics Better, Model Complex Motion Accurately prompt: Traveling by train, viewing all sorts of landscapes through the window.</p>\n<p> </p>\n<p>(ed note: in production)</p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"77cab7ce1d6643a1090a8eaaf253900cb60e6ad2efabb1365e39c9de88bfd784","category":"default"}