{"title":"Anne Morrow Lindbergh on Embracing Change in Relationships and the Key Pattern for Nourishing Love","link":"https://www.themarginalian.org/2024/02/11/anne-morrow-lindbergh-change/","date":1707674708000,"content":"<h3>“All living relationships are in process of change, of expansion, and must perpetually be building themselves new forms.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Gift-50th-Anniversary-Anne-Morrow-Lindbergh/dp/0679732411/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"501\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?fit=320%2C501&amp;ssl=1\" alt=\"Anne Morrow Lindbergh on Embracing Change in Relationships and the Key Pattern for Nourishing Love\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?w=959&amp;ssl=1 959w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?resize=320%2C501&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?resize=600%2C938&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?resize=240%2C375&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/giftfromthesea_lindbergh.jpg?resize=768%2C1201&amp;ssl=1 768w\" /></a></p><p>“God is Change,” Octavia Butler <a href=\"https://www.themarginalian.org/2022/06/22/octavia-butler-god/\">wrote</a>, channeling in poetic truth <a href=\"https://www.themarginalian.org/2014/05/22/alan-lightman-accidental-universe-impermanence/\">the fundamental scientific fact of the universe</a>. </p>\n<p>We know this. And yet to be human is to long for constancy, to crave the touchingly impossible assurance that what we have and cherish will be ours to hold forever, just as it is now. We build homes — fragile haikus of concrete and glass to be unwritten by the first earthquake or flood. We make vows — fragile promises to be upheld by selves we haven’t met in a future we can’t predict. </p>\n<p>The dearer we hold something, the more tightly we cling to the dream of constancy, the more zealously we torture ourselves with the belief that any change is loss. Naturally, it is in our intimate relationships that we most come to fear change and most suffer when it comes — a fear not at all groundless, given <a href=\"https://www.themarginalian.org/2022/09/06/general-theory-of-love-separation/\">what relationship rupture does to our limbic system</a>. </p>\n<p>The salve for this singularly discomposing suffering comes not from ossifying change but from changing our beliefs about it. Such salutary recalibration is what the aviator and writer <strong>Anne Morrow Lindbergh</strong> (June 22, 1906–February 7, 2001) offers in <a href=\"https://www.amazon.com/Gift-50th-Anniversary-Anne-Morrow-Lindbergh/dp/0679732411/?tag=braipick-20\" target=\"_blank\"><strong><em>Gift from the Sea</em></strong></a> (<a href=\"https://search.worldcat.org/title/1031967395\" target=\"_blank\"><em>public library</em></a>) — a book I found in a Little Free Library and felt immediately speaking to my soul, drawn from the diaries Lindbergh kept during two weeks of solitude on the ocean shore “searching for a new pattern of living” as she was entering the second half of her life, that vital “period of second flowering” when one is “free for growth of mind, heart and talent.”</p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?resize=680%2C383&amp;ssl=1\" width=\"680\" height=\"383\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?resize=320%2C180&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?resize=600%2C338&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?resize=240%2C135&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/annemorrowlindbergh_TheMarginialian.jpg?resize=768%2C433&amp;ssl=1 768w\" /><figcaption>Anne Morrow Lindbergh</figcaption></figure>\n<p>Reflecting on the natural trajectory of intimate relationships, she writes:</p>\n<blockquote><p>The pure relationship, how beautiful it is! How easily it is damaged, or weighed down with irrelevancies — not even irrelevancies, just life itself, the accumulations of life and of time. For the first part of every relationship is pure, whether it be with friend or lover, husband or child. It is pure, simple and unencumbered. It is like the artist’s vision before he has to discipline it into form, or like the flower of love before it has ripened to the firm but heavy fruit of responsibility. Every relationship seems simple at its start. The simplicity of first love, or friendliness, the mutuality of first sympathy seems, at its initial appearance — even if merely in exciting conversation across a dinner table — to be a self-enclosed world. Two people listening to each other, two shells meeting each other, making one world between them… It is free of ties or claims, unburdened by responsibilities, by worry about the future or debts to the past. And then how swiftly, how inevitably the perfect unity is invaded; the relationship changes; it becomes complicated, encumbered by its contact with the world.</p></blockquote>\n<p>While this is true in most relationships, Lindbergh observes, the pattern is most pronounced — and most painful — in our most intimate bonds. And yet the pain we experience as a relationship exits this early stage of unselfconscious mutual elation is not evidence of loss — it is evidence of our misshapen ideals of closeness as a static pattern of attachment. She offers an alternative orientation to the inevitability of change:</p>\n<blockquote><p>We mistakenly feel that failure to maintain its exact original pattern is tragedy. It is true, of course, the original relationship is very beautiful. Its self-enclosed perfection wears the freshness of a spring morning. Forgetting about the summer to come, one often feels one would like to prolong the spring of early love, when two people stand as individuals, without past or future, facing each other. One resents any change, even though one knows that transformation is natural and part of the process of life and its evolution. Like its parallel in physical passion, the early ecstatic stage of a relationship cannot continue always at the same pitch of intensity. It moves to another phase of growth which one should not dread, but welcome as one welcomes summer after spring.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2023/07/11/bunny-tree-blaint-zsako/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/07/bunnyandtree2.jpg\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2023/07/11/bunny-tree-blaint-zsako/\"><em>Bunny &amp; Tree</em></a> by Balint Zsako</figcaption></figure>\n<p>At the heart of this dread is our unwillingness to relinquish the polished self-image we see in the light-filled eyes of the other in those early stages of mutual infatuation, before we have touched each other’s darkness, before we have met the hungry ghosts of each other’s unmet needs. We long for that image, perfect and haloed with adoration, to become our identity, seeking to make of love a flattering mirror in which to find our best selves, tasking the other with the emotional brunt of bearing the parts we don’t want to look at. Lindbergh pulls back the curtain on the most damaging myth handed down to us by the Romantics:</p>\n<blockquote><p>Certainly, one has the illusion that one will find oneself in being loved for what one really is, not for a collection of functions. But can one actually find oneself in someone else? In someone else’s love? Or even in the mirror someone else holds up for one? I believe that true identity is found… in creative activity springing from within. It is found, paradoxically, when one loses oneself. One must lose one’s life to find it… Only a refound person can refind a personal relationship.</p></blockquote>\n<p>The twin root of our suffering in a changing relationship is the expectation — the demand, even — that the other’s love be total and permanent, reserved for us alone, unshared with other priorities and passions, those natural constituents of a fully developed personality and a fully inhabited life. Lindbergh writes:</p>\n<blockquote><p>We all wish to be loved alone… Perhaps, as Auden says in his poem, this is a fundamental error in mankind. </p>\n<p><em>For the error bred in the bone<br />\nOf each woman and each man<br />\nCraves what it cannot have,<br />\nNot universal love<br />\nBut to be loved alone.</em></p></blockquote>\n<p>Lindbergh recounts discussing this verse with an Indian philosopher, who made a striking observation — while mutuality is the essence of love and therefore it is natural for us to wish for it, it is in the time-sense that we err. “It is when we desire continuity of being loved alone that we go wrong,” he told her. </p>\n<p>The fear of change dissolves when we come to see love not as a vector of constancy but as a rosary of nows, its core promise not that of permanence but of presence. Hannah Arendt would affirm this a generation after Lindbergh in her <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">superb meditation on love and the fear of loss</a>, insisting that “fearlessness is what love seeks [which] exists only in the complete calm that can no longer be shaken by events expected of the future… Hence the only valid tense is the present, the Now.”</p>\n<figure><a href=\"https://society6.com/product/falling-star-by-witold-pruszkowski-1884_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=680%2C874&amp;ssl=1\" width=\"680\" height=\"874\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=320%2C411&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=600%2C772&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=240%2C309&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=768%2C988&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/fallingstar_WitoldPruszkowski.jpg?resize=1195%2C1536&amp;ssl=1 1195w\" /></a><figcaption><em>Falling Star</em> by Witold Pruszkowski, 1884. (Available as <a href=\"https://society6.com/product/falling-star-by-witold-pruszkowski-1884_print?curator=brainpicker\" target=\"_blank\">a print</a>.)</figcaption></figure>\n<p>Only by meeting each now on its own terms, Lindberg argues, can we allay the reflexive ache of perceiving change as loss, reframing it instead as fertile evolution:</p>\n<blockquote><p>One learns to accept the fact that no permanent return is possible to an old form of relationship; and, more deeply still, that there is no holding of a relationship to a single form. This is not tragedy but part of the ever-recurrent miracle of life and growth. All living relationships are in process of change, of expansion, and must perpetually be building themselves new forms. But there is no single fixed form to express such a changing relationship.</p></blockquote>\n<p>Those able to configure their relationships with such fluidity of form, Lindbergh notes, are “pioneers trying to find a new path through the maze of tradition, convention and dogma.” Auden was one himself — his relationship with the young poet Chester Kallman, <a href=\"https://www.themarginalian.org/2016/07/28/virginia-woolf-vita-sackville-west/\">like that of Virginia Woolf and Vita Sackville-West</a>, shape-shifted <a href=\"https://www.themarginalian.org/2022/04/07/the-more-loving-one-auden-universe-in-verse/\">from friend to lover and back again</a> over the last quarter century of Auden’s life.</p>\n<p>Ultimately, our fear of change is a trap of self-limitation, keeping relationships from deepening and broadening to encompass the full range of who we are as complete human beings, as dynamic processes in continual state of becoming, which in turn makes possible the thrill of continual mutual discovery. Lindbergh writes:</p>\n<blockquote><p>One comes in the end to realize that there is no permanent pure-relationship and there should not be. It is not even something to be desired. The pure relationship is limited, in space and in time. In its essence it implies exclusion. It excludes the rest of life, other relationships, other sides of personality, other responsibilities, other possibilities in the future. It excludes growth.</p></blockquote>\n<p>With an eye to the best kind of pure-relationship — “the meeting of two whole fully developed people as persons” — and with the recognition that “the light shed by any good relationship illuminates all relationships,” she considers the core dynamic of such a relationship:</p>\n<blockquote><p>A good relationship has a pattern like a dance and is built on some of the same rules. The partners do not need to hold on tightly, because they move confidently in the same pattern… To touch heavily would be to arrest the pattern and freeze the movement, to check the endlessly changing beauty of its unfolding. There is no place here for the possessive clutch, the clinging arm, the heavy hand; only the barest touch in passing. Now arm in arm, now face to face, now back to back… Because they know they are partners moving to the same rhythm, creating a pattern together, and being invisibly nourished by it. </p>\n<p>The joy of such a pattern is not only the joy of creation or the joy of participation, it is also the joy of living in the moment. Lightness of touch and living in the moment are intertwined. One cannot dance well unless one is completely in time with the music, not leaning back to the last step or pressing forward to the next one, but poised directly on the present step as it comes.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2013/07/25/ruth-krauss-maurice-sendak-open-house-for-butterflies/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2013/07/openhouseforbutterflies25.jpg?w=680&amp;ssl=1\" /></a><figcaption>Illustration by Maurice Sendak from <a href=\"https://www.themarginalian.org/2013/07/25/ruth-krauss-maurice-sendak-open-house-for-butterflies/\"><em>Open House for Butterflies</em></a> by Ruth Krauss</figcaption></figure>\n<p>With this, she returns to the correct time-scale of love — not constancy but intermittency, measured out by the metronome of presence:</p>\n<blockquote><p>When you love someone you do not love them all the time, in exactly the same way, from moment to moment. It is an impossibility. It is even a lie to pretend to. And yet this is exactly what most of us demand. We have so little faith in the ebb and flow of life, of love, of relationships. We leap at the flow of the tide and resist in terror its ebb. We are afraid it will never return. We insist on permanency, on duration, on continuity; when the only continuity possible, in life as in love, is in growth, in fluidity — in freedom, in the sense that the dancers are free, barely touching as they pass, but partners in the same pattern. The only real security is not in owning or possessing, not in demanding or expecting, not in hoping, even. Security in a relationship lies neither in looking back to what it was in nostalgia, nor forward to what it might be in dread or anticipation, but living in the present relationship and accepting it as it is now.</p></blockquote>\n<p>Complement these fragments of <a href=\"https://www.amazon.com/Gift-50th-Anniversary-Anne-Morrow-Lindbergh/dp/0679732411/?tag=braipick-20\" target=\"_blank\"><strong><em>Gift from the Sea</em></strong></a> — a revelatory read in its entirety — with philosopher Martin Buber on <a href=\"https://www.themarginalian.org/2018/07/24/martin-buber-i-thou-love/\">love and what it means to live fully in the present</a>, then revisit Thich Nhat Hanh on <a href=\"https://www.themarginalian.org/2020/12/01/thich-nhat-hanh-fear-love/\">the four Buddhist mantras for turning fear into love</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"78453605236eefa77a2160821d75f6bd268d0f871909f32d7679d727185ae55b","category":"default"}