{"title":"Here’s how to live: Think super-long-term.","link":"https://sive.rs/htl05","date":1638662400000,"content":"<p>\nIn 1790, Benjamin Franklin gifted £2000 to the cities of Philadelphia and Boston by putting it into a 200-year trust, and by 1990 it was worth over $7 million.\n<br />\nIf you put $2000 into the stock market for 200 years at the average 8% return, it will be worth over $9 billion.\n<br />\nIf you can do $100,000, it will be worth over $483 billion.\n</p><p>\nLive like this.\n<br />\nServe the future.\n<br />\nDo small things now with huge benefits for your older self, your descendants, and future generations.\n</p><p>\nActions amplify through time to have a massive impact on the future.\n<br />\nLet this fact guide your life.\n<br />\nUse a time machine in your mind, constantly picturing your future self and your great-grandchildren’s world.\n<br />\nAct now to influence that time.\n</p><p>\nThe actions are obvious.\n<br />\nPut money in an investment account and never withdraw.\n<br />\nEat mostly vegetables.\n<br />\nExercise always.\n<br />\nGet preventative health checkups.\n<br />\nMake time for your relationships.\n<br />\nDo these, yes, but let’s look at less-obvious ones.\n</p><p>\nThe biggest challenge is to think long-term when life is pulling you around.\n<br />\nYou need a constant vivid reminder.\n<br />\nSo use an age progression filter — the software that takes a photo of a face and realistically makes it look thirty years older.\n<br />\nRun it on some photos of yourself.\n<br />\nSee your elderly face, and take care of that person.\n<br />\nRun it on photos of the people you care for.\n<br />\nSave the results and put them where you’ll see them every day.\n<br />\nThese future people are your responsibility now.\n</p><p>\nImagine your future self judging your current life choices.\n<br />\nWhen making a decision, ask yourself how you’ll feel about it when you’re old.\n<br />\nWhat would your future self and family thank you for?\n<br />\nSimple actions now will compound to give them a better life.\n</p><p>\nDelay gratification.\n<br />\nToday’s discomfort brings future rewards.\n<br />\nWhen you have a clear view of the future, you won’t mind the small sacrifice.\n<br />\nYou never regret not indulging.\n</p><p>\nOnly spend money on things that do long-term good, like education.\n<br />\nIn other words, never spend, only invest.\n<br />\nThe earlier you start, the better, since time is the multiplier.\n</p><p>\nMany huge achievements are just the result of little actions done persistently over time.\n<br />\nCities began with just one building.\n<br />\nWalmart was one little store.\n<br />\nPeople with incredible skill just practiced every day.\n<br />\nPut $25 a day in your investment account, and in thirty years, you’ll have over a million dollars.\n</p><p>\nWe overestimate what we can do in one year.\n<br />\nWe underestimate what we can do in ten years.\n<br />\nIf you take up a new hobby at the age of forty, or whatever age you think is too late, you’ll be an expert by the age of sixty.\n</p><p>\nBe extra-careful of habits that seem harmless.\n<br />\nImagine each choice continuing forever.\n<br />\nEat a cookie, and eventually you’re obese.\n<br />\nShop for fun, and eventually you’re deep in debt.\n<br />\nWhen you choose a behavior, you choose its future consequences.\n</p><p>\nThinking of the future doesn’t come naturally.\n<br />\nOur hunter-gatherer ancestors had to live moment-to-moment, so our tendency to focus on today is built into our biology.\n<br />\nBut times have changed.\n<br />\nNow the surviving fittest are the ones who plan ahead.\n</p><p>\nYou owe your quality of life to people in past generations.\n<br />\nWe say someone is lucky if they are born into a rich family, in a stable country, full of opportunity.\n<br />\nBut that luck was created by the grandparents that moved to that promising place, then worked hard and saved money for the next generation instead of spending it themselves.\n<br />\nMake your grandchildren lucky like this.\n<br />\nMove to a place with good values that’s headed in the right direction.\n</p><p>\nClimate change might make everything between 40° and -40° latitude quite unlivable, so start getting legal resident status in a country outside of that, like Canada, New Zealand, or the Nordics.\n<br />\nThese might be the last livable places on Earth.\n<br />\nMake sure your grandchildren will have citizenship.\n<br />\nBe a great ancestor.\n</p><p>\nPlan your death.\n<br />\nWrite your will now.\n<br />\nMake sure your heirs know where everything is, and who to contact.\n</p><p>\nShort-term thinking is the root of most of our problems, from pollution to debt, both personal and global.\n<br />\nEaster Island used to be filled with trees, but early settlers cut them down, and they never grew back.\n<br />\nGreenland used to have grass, but early settlers let their sheep graze, and it never grew back.\n<br />\nA few short-term decisions can lead to centuries of destruction.\n</p><p>\nWe treat the future like a garbage dump.\n<br />\nWe dump our debts, pollution, junk, and responsibilities on the future, as if it’s a problem solved.\n<br />\nIt’s the most psychopathically inconsiderate thing we do to our children, since it’s their world, not ours.\n</p><p>\nYour future self is depending on you.\n<br />\nYour descendants are depending on you.\n<br />\nOur future generations are depending on us.\n<br />\nUse the compounding amplifier of time.\n<br />\nThinking super-long-term is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"78bf7828acad229821d24d2c30cf9ec5f30b8f395e61f4767df6b005871c4146","category":"Sites"}