{"title":"How to Miss Loved Ones Better: The Psychology of Waiting and Withstanding Absence","link":"https://www.themarginalian.org/2024/08/27/adam-phillips-better-waiting/","date":1724775379000,"content":"<h3>On “the capacity to bear frustration without turning against one’s needy self, or against the person one needs.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Getting-Better-Adam-Phillips/dp/1250838878/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"489\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?fit=320%2C489&amp;ssl=1\" alt=\"How to Miss Loved Ones Better: The Psychology of Waiting and Withstanding Absence\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?w=982&amp;ssl=1 982w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?resize=320%2C489&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?resize=600%2C916&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?resize=240%2C367&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/better_phillips.jpg?resize=768%2C1173&amp;ssl=1 768w\" /></a></p><p>With its fusion of frustration and hope, waiting is one of the most singularly maddening human experiences, and one of the great arts of living. To wait for something is to value it, to want it, to yearn for it, but to face its absence, its attainment forestalled by time and circumstance. All true waiting — which is different from abstinence, delayed gratification, and other forms of self-discipline — has an element of helplessness to it and is therefore training ground for mastering the vital, incredibly difficult balance of control and surrender that gives shape to our entire lives. </p>\n<p>Because, as Tom Waits so unforgettably observed, the way we do anything is the way we do everything, our style of waiting is a miniature of our style of living: There is impatient and petulant waiting; there is waiting with the humility that while we may be worthy of the object of our hope, we are not entitled to it or to the mercies of time; there is waiting with an open heart and a willingness to be surprised, for the wait itself may reveal something we did not yet know about ourselves that might change our desire for the awaited outcome. (“I said to my soul, be still and wait without hope,”  T.S. Eliot wrote knowing this, “for hope would be hope for the wrong thing.”)</p>\n<p>At its core, waiting is a frustrated relationship between desire and time — a surplus of desire with no temporal agency over its fulfillment. In that sense, it is the opposite of boredom — another <a href=\"https://www.themarginalian.org/2024/06/28/brodsky-boredom/\">singularly maddening experience</a>, marked by total temporal agency hollowed of desire. This is how I think of it:</p>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?resize=680%2C603&amp;ssl=1\" width=\"680\" height=\"603\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?resize=320%2C284&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?resize=600%2C532&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?resize=240%2C213&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/TimeDesire_by_MariaPopova.jpg?resize=768%2C681&amp;ssl=1 768w\" /></p>\n<p>But like boredom, waiting is also one of our earliest and most primal experiences — infancy and childhood are punctuated by the parent’s absences and it is in missing the parent, in awaiting their return, that we get our first taste of longing, of frustration, of rage. In missing the mother, the infant is training for all the people they will ever love and miss in the course of life. Every absence is therefore a fractal of that great primal absence, and while hardly anyone can wait <a href=\"https://www.themarginalian.org/2024/08/17/penguin/\">with a penguin’s patience and faith</a>, those with insecure attachment — most often the product of a childhood marked by a parent’s irremediable absences, physical or emotional — find waiting especially tortuous.</p>\n<p>In <a href=\"https://www.amazon.com/Getting-Better-Adam-Phillips/dp/1250838878/?tag=braipick-20\" target=\"_blank\"><strong><em>On Getting Better</em></strong></a> (<a href=\"https://search.worldcat.org/title/1246144697\" target=\"_blank\"><em>public library</em></a>) — one of his many small, tremendous <a href=\"https://www.themarginalian.org/tag/adam-phillips/\">books</a> about the paradoxes composing our lives — the psychoanalyst Adam Phillips argues that we can get better at waiting, better at putting absences in the service of our emotional and spiritual development.</p>\n<figure><a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=680%2C1052&amp;ssl=1\" height=\"1052\" width=\"680\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?w=1655&amp;ssl=1 1655w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=600%2C928&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=993%2C1536&amp;ssl=1 993w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=1324%2C2048&amp;ssl=1 1324w\" /></a><figcaption>Art from <em><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\">An Almanac of Birds: Divinations for Uncertain Days</a></em>. (Available as <a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>To get better at waiting and at withstanding absences, Phillips argues, is “to get better at, to begin with, missing the mother, and then missing all the people one loves and needs.” Drawing on the influential work of <a href=\"https://www.themarginalian.org/2024/08/19/winnicott-care-cure/\">Donald Winnicott</a>, he writes: </p>\n<blockquote><p>The child experiences the mother’s absence as a withholding of something that could be given. The mother forbears to come into presence, and the child can’t help but react, respond, mobilize something in or of himself to manage the withdrawal in the first instance, often rage. Everything depends in this developmental story on how mother and child deal with the absences. It is in one sense a matter of time, of how long the wait is before the mother reappears. “It is a matter,” Winnicott writes in <em>Playing and Reality</em>, “of days, or hours, or minutes. Before the limit is reached the mother is still alive; after this limit has been overstepped the mother is dead.” That is to say it feels to the child that the mother he has in his mind has died; and/or he has killed her in his mind out of rage at her absence. In this story it is all about what happens in the absence — what Winnicott calls the “gap” — and, more pragmatically, what can be done in, or with, the gap.</p></blockquote>\n<p>It is in that gap that we cultivate the most essential skill for enduring absence and the tyranny of waiting — “the capacity to bear frustration without turning against one’s needy self, or against the person one needs.” Phillips writes:</p>\n<blockquote><p>When you are waiting for someone you are looking forward to seeing, can you do anything other than wait? And can you enjoy them when they finally arrive? How you wait is who you are, and everything depends on your sense of an ending.</p></blockquote>\n<p>At its healthiest, Phillips intimates, that sense ought to be one of open-endedness — Winnicott himself considered the mark of a healthy person the ability to have, as Phillips puts it, “a certain kind of mutual relationship with another person, but to no obviously discernible, or predictable, end.” And indeed the sense that we are are unfinished — as individuals and as a species, in our personal development and our interpersonal relations and our evolutionary trajectory — may be the single most hopeful thing about being alive, the truest grounds for faith. </p>\n<p>Complement this fragment of <a href=\"https://www.amazon.com/Getting-Better-Adam-Phillips/dp/1250838878/?tag=braipick-20\" target=\"_blank\"><strong><em>On Getting Better</em></strong></a> — a superb read in its entirety, and a mighty antidote to the fashionable cult of self-improvement — with Phillips on <a href=\"https://www.themarginalian.org/2024/05/17/adam-phillips-giving-up/\">knowing what you want and the courage to change your mind</a>, then revisit Winnicott on <a href=\"https://www.themarginalian.org/2024/08/19/winnicott-care-cure/\">the qualities of a healthy mind and a healthy relationship</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"797c93abeb7f403e59ee8af05c32043e0fa9390842d96e00361108fdc5b713b9","category":"default"}