{"title":"What I've achieved in 2016","link":"https://blog.webb.page/2016-12-27-what-ive-achieved-this-year.txt","date":1482796800000,"content":"<p>Last year, I decided to look back<a href=\"https://2016.dsgn.io/thoughts/post/what-ive-achieved-in-2015\">1</a> on everything I've learned/achieved and\nit was a great reflective experience. So, here it is again for 2016!</p>\n<h2>Became a father to a newborn</h2>\n<p>I was already a dad but I've never experienced taking care of a <em>brand new</em>\nlife. I was worried that my son wouldn't like me and other silly non-sensical\nthings like that. In reality, it is <em>super</em> challenging at times but he's a\nhappy boy who has no problem falling asleep in my arms. And biting me. And\nfarting on me. Needless to say, he's super comfortable with his papa. 😁</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2016/what-ive-achieved-this-year-a.jpg\">Ian Asher and I</a></p>\n<h2>Moved all my projects to GitLab</h2>\n<p>After running my own email server for half a year, I wondered why I was\n<em>still</em> paying GitHub for private repos. What they c̶h̶a̶r̶g̶e̶d̶ used to charge\ndidn't make sense so I set up a personal GitLab instance<a href=\"https://paulwebb.software\">2</a> and I couldn't be\nhappier. I have unlimited private repos for <em>$40/month</em> (my server has\n<em>4GB of RAM</em> and <em>60GB of storage</em>). Because you can never be too sure, I have\nbackups enabled for <em>$8/month</em>.</p>\n<h2>Moved all my email to Mail-in-a-Box</h2>\n<p>Just like with GitHub, I didn't understand why I was paying Hover $200/year\nfor hosting my email when I <em>already</em> had a Mail-in-a-Box<a href=\"https://mailinabox.email\">3</a> instance hosting\none<a href=\"https://thenetwork.email\">4</a> of my them. Thankfully, it's relatively easy<a href=\"https://mailinabox.email/maintenance.html#multiple-domains\">5</a> to add multiple domains\nto the same box. It currently costs me <em>$10/month</em> for <em>unlimited</em> email\naccounts versus $200/year for merely 10 (my server has <em>1GB of RAM</em> and\n<em>30GB of storage</em>).</p>\n<h2>Released a SaaS product</h2>\n<p>I buy a lot of books on Amazon and never get around to reading them. That\nwasn't the case with The 7 Day Startup<a href=\"https://www.amazon.com/Day-Startup-Learn-Until-Launch/dp/1502472392\">6</a>. After reading the book (it was a\nquick read), I was super motivated to bring an idea (I sat on for about a\nyear) to life. That idea was BeachfrontDigital<a href=\"https://beachfront.digital\">7</a>, a domain portfolio\nmanagement tool. My market focus is quite niche, it's for people who buy\nmultiple domains from multiple registrars. The problem I am solving involves\nkeeping track of all your domains and renewal dates. Some TLDs also renew 30\ndays before expiration and I intend to include this kind of information in V2.\nI've gotten some great feedback and I look forward to enhancing the service\nin 2017.</p>\n<p>Related to releasing BeachfrontDigital, I learned how to use Feathers.js<a href=\"http://feathersjs.com\">8</a>\nmore, used MongoDB<a href=\"https://www.mongodb.com\">9</a> and mongoose<a href=\"http://mongoosejs.com\">10</a> for the first time, and in production\n(I love them both now), and other back-end web development things. I'm a firm\nbeliever that side projects are key to learning new things. Your day job most\nlikely won't challenge you to try drastically different things from what\nyou're used to, which can stifle your personal growth.</p>\n<h2>Hosted my first pop-up shop</h2>\n<p>My clothing brand WEÖM<a href=\"https://weom.space\">11</a> had a pop-up shop in one of WeWork\nSouth Station's conference rooms. Along with my friend Angel<a href=\"https://www.instagram.com/angel_garc\">12</a>, we had fun\ncollaborating on 2017 collections when we weren't chatting with people who\nstopped by. It was a <em>great</em> learning experience! In the time since, I've\ndecided to transition/rebrand WEÖM to become a space-centric lifestyle brand\ninstead of being <em>just</em> a clothing brand. There's still a lot of work to be\ndone, but look forward to visiting the new world I'm building around it!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2016/what-ive-achieved-this-year-b.jpg\">Bridget rocking the signature snapback</a></p>\n<h2>Had my first interview</h2>\n<p>Revision Path<a href=\"http://revisionpath.com\">13</a> is a weekly interview podcast, Patreon<a href=\"https://patreon.com/revisionpath\">14</a>, and Slack\ngroup<a href=\"https://revisionpath.herokuapp.com\">15</a> that I've been a fan of for quite some time. The host, Maurice\nCherry<a href=\"https://twitter.com/mauricecherry\">16</a>, likes to interview people on the come up doing interesting things.\nSo, imagine my surprise when he asked to interview <em>me</em>! We tried recording\nwhile I was in my apartment but houses in Massachusetts are old so my\nmicrophone was picking AM radio signals. 😒 I wasn't hearing that weirdness\nbut Maurice is in Atlanta and was hearing ads for Harvard, lol! Long story\nshort, we had to reschedule and the interview will be out in January. <em>Great</em>\nway to start off the new year!</p>\n<h2>Published my first module to npm</h2>\n<p>My module is called <code>hexo-render-sass</code> and I made it before realizing that\nsimilar modules exist…oh well (it doesn't help that the official Hexo\nsite<a href=\"https://hexo.io/plugins\">17</a> fails to list Sass plugins on the site). It was another great\nlearning experience and it took away the mystic mumbo jumbo I associated npm\nmodules with. You can find it here<a href=\"https://www.npmjs.com/package/hexo-render-sass\">18</a>.</p>\n<h2>And that's it!</h2>\n<p>I'll end this post with my best nine Instagram photos of 2016, according to\nLip Inc<a href=\"https://2016bestnine.com\">19</a>. 🕸</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2016/what-ive-achieved-this-year-c.jpg\">My best 9 Instagram photos of 2016</a></p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"7abbb1312f8cc6e97586b7bbf66504ea45750e7ad1edb69ba5a01481f9fa3bec","category":"Sites"}