{"title":"Dave, Happy 30th Blog Birthday","link":"https://om.co/2024/10/08/dave-happy-30th-blog-birthday/","date":1728399898000,"content":"<p>It would be an understatement to say that Dave Winer has been influential in my life. His pioneering work set me on the path of blogging. I wouldn’t be where I am without blogging, as my ideal medium of expression. Sure, I was a professional journalist, but my blog was me, my voice, and my way of thinking- in public, for all to see, warts and all.</p>\n\n\n\n<p>Social behaviors of today were cooked up in the lab called blogs. And many of those ideas came from the desk (and brain) of Dave Winer. I was, am, and will always be a fan of the ‘blogfather.’</p>\n\n\n\n<p>The best version of Dave is the <em>Hopeful Dave</em>. Today, <a href=\"http://scripting.com/2024/10/07.html\">writing on his blog</a>, he is still pushing for the blogs into the future, one line at a time.</p>\n\n\n\n<blockquote>\n<p>There may be hope to find a blogosphere buried somewhere in there. And it may be possible to give them some sweet new writing tools so they can get excited about writing on the web the way we did all those years ago. I actually am kind of optimistic about that. Maybe we can stand up something in the midst of the noise.</p>\n\n\n\n<p>Blogging started out as a programming adventure and eventually became a form of literature. How about that. I’m up for doing more of that if you all are.</p>\n\n\n\n<p>Blogging is kind of lost, and I would like to see that change. Every time you post something you’re proud of on a social media site, how about taking a moment and posting it to your blog too. And while there, if appropriate, link to something from some part of your post, even though the social media sites don’t support linking, the web is still there and it still does. </p>\n</blockquote>\n\n\n\n<p>Never change Dave. Message received! And thank you!</p>\n\n\n\n<p><strong><em>October 8, 2024. San Francisco. </em></strong></p>\n\n\n\n<hr />\n\n\n\n<h4>Related Reads From My Archives</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/gigaom/the-evolution-of-blogging/\">The Evolution of Blogging</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2013/12/16/in-12-years-of-blogging-the-more-things-change-the-more-they-stay-the-same/\">In 12 years of blogging, the more things change, the more they stay the same</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/gigaom/how-ev-dave-the-trotts-matt-changed-my-life/\">How Ev, Dave, The Trotts &amp; Matt Changed My Life</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"7bc84551921ffd5e4ac9d7459c6fe06760c9d1808ad0977f9ecc5628b8f8c9e2","category":"Sites"}