{"title":"Tilting my mirror (motivation is delicate)","link":"https://sive.rs/tilt","date":1480896000000,"content":"<p>\nMotivation is delicate.\n</p><p>\nWhen you notice your motivation fading, you have to seek out the subtle cause.\n<strong>\nA simple tweak can make all the difference between achieving something or not.\n</strong>\n</p><p>\nAn hour outside my city, there’s a little mountain range.\nThe other side is gorgeous.\nBut the road that crosses the mountains is very twisted, with sharp turns every few seconds.\nThe first two times I drove across, my kid threw up in the back seat.\nIt’s also stressful because I’m surrounded by mountain scenery but I can’t take my eyes off the winding road.\nThough I drive at a normal speed, the other cars follow impatiently on my tail, because many of them drive this road every day.\n</p><p>\nCrossing the mountains takes only half an hour, but I always arrive exhausted.\nThe stress was affecting my motivation enough that I wanted to stop visiting.\n</p><p>\nSo one day I tried a new approach: I drove really slowly.\nNow the turns didn’t make my kid sick.\nNow I could afford to take a few seconds to glance sideways and appreciate the scenery.\nNow it wasn’t stressful, except for one thing: the impatient queue of cars behind me.\nI care (perhaps too much) about other people, so just seeing them in my mirror made me go back to driving faster than I wanted, which brought back all the original problems.\n</p><p>\nSo I made one simple tweak:\nI tilted my rear-view mirror up towards the ceiling so I couldn’t see anything behind me.\n</p><p>\nThat little tweak changed everything!\n</p><p>\nNow it feels like I’m almost alone on this gorgeous mountain drive.\nGoing at my own pace, not influenced or stressed by anyone else.\n</p><p>\nThere’s a passing lane every few minutes, so when it comes, the other cars whiz by me.\nBut for thirty minutes, they’re not my problem.\nWhen I get to the other side of the mountain, I put my mirror back.\n</p><p>\nNow I visit all the time — no stress at all.\n</p><p>\nYou know I’m going for the metaphor here:\n</p><ul><li>\nSocial media comments\n</li><li>\nDistracting environments\n</li><li>\nDiscouraging family members\n</li><li>\nYour email inbox\n</li></ul><p>\nEven the toughest of us have delicate motivation.\n</p><p>\nWhen you notice that something is affecting your drive, find a way to adjust your environment, even if that’s a little inconvenient for others.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"7bd2bcc1c4e14a1ebf3ed278aa9f113a3beebbe9fab5b109a9bed8e55cb4c781","category":"default"}