{"title":"Chessvision.ai","link":"https://www.usv.com/writing/2024/08/chessvision-ai/","date":1724413424000,"content":"<p>I’m a chess player and one of the things I still enjoy about twitter is stumbling on diagrams of chess tactics and trying to solve them. A couple weeks ago I thought I had the answer to a tactic so I started to scroll through the responses to see if it was right. That’s when I saw someone respond by tagging @ChessvisionAI and I discovered an awesome product.</p>\n<p>ChessvisionAI is a twitter bot. Someone responds to a tweet with a chess diagram in it by tagging the bot and then Chessvision.ai analyzes the position and responds with links to both chess.com and lichess.org with an analysis of the next best move. Here’s an example of it in action.</p>\n<p>I really like that ChessvisionAI responds with options to analyze positions in both chess.com and lichess.org and gives the user a choice as to which service they want to use (preferences can be pretty polarizing in the chess world). The experience is smooth and fast, and I now see ChessvisionAI popping up in the responses to virtually every chess tactic diagram. It’s taken ahold of the chess world.</p>\n<p>I find the idea behind this bot to be very powerful. It’s a headless application, summoned in certain contexts and responds within the UI of that context. There’s no home or central application for ChessvisionAI. It can live across Twitter, Discord, Reddit, etc. It’s fluid and interoperable.</p>\n<p>ChessvisionAI was created and is managed by one person, Pawel Kacprzak . He wrote a great post explaining the initial inspiration behind the idea and how he built it which went viral on Hacker News years ago. It’s cool to see one individual have such an impact on the way we interact with chess diagrams and how their flexible approach meets users wherever they are.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/chessvision-ai/\">Chessvision.ai</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"7bd73716f59f00dffecee59a6259381793d6847df194062e1dcea01c8148e3d1","category":"Sites"}