{"title":"Here’s how to live: Be a famous pioneer.","link":"https://sive.rs/htl12","date":1639267200000,"content":"<p>\nNobody had ever run a mile in under four minutes.\n<br />\nIt seemed impossible.\n<br />\nBut one day, Roger Bannister did it, and the news spread worldwide.\n<br />\nOver the next two years, thirty-seven people also did it.\n</p><p>\nThis is the power of the pioneer:\n<br />\nTo enable the impossible.\n<br />\nTo open a new world of possibility.\n<br />\nTo show others that they can do it too, and take it even further.\n<br />\nExplorers used to find unknown lands and bring back stories of unfamiliar cultures, which encouraged others to go exploring.\n<br />\nThe old finish line becomes the new starting line.\n</p><p>\nDebussy, Charlie Parker, Jimi Hendrix, and Rakim pioneered new approaches to music.\n<br />\nRosa Parks, Harvey Milk, Sally Ride, and Malala Yousafzai broke the glass ceiling, encouraging others to rise.\n<br />\nModern explorers like Tim Ferriss, Neil Strauss, and A.J. Jacobs, instead of finding unknown lands, are finding unknown lifestyles.\n<br />\nEach of them shows new possibilities for the rest of us.\n</p><p>\nThese pioneers were valuable because they got famous.\n<br />\nIf someone else innovated in obscurity, they didn’t make an impact.\n<br />\nMarco Polo wasn’t the first European to reach China, but he was the first to write a book about it.\nThen his book inspired Christopher Columbus, and so on.\n</p><p>\nMillions of young adults today are living a life their grandparents didn’t know was possible.\n<br />\nThey have more options, thanks to the brave adventures of a few people who broke through boundaries.\n<br />\nPioneers have a massive impact on the world because their stories help people do things they wouldn’t have dreamed of otherwise.\n</p><p>\nA famous pioneer does more for human progress than a billion others who live a normal life.\n</p><p>\nSo if you want to help humanity while having the most exciting life, then the way to live is to be a famous pioneer.\n<br />\nGo to new extremes.\n<br />\nTry new ideas.\n<br />\nVisit undiscovered cultures.\n<br />\nShow what can be done.\n</p><p>\nYour job is not just to act, but to tell a fascinating story of how you did so, and inspire others to do it.\n<br />\nMake great adventures, but tell greater stories.\n<br />\nPursue massive media attention, not for vanity or ego, but so your stories can open minds, spark imaginations, and lead to further explorations.\n</p><p>\nHere’s the best way to do it:\n</p><p>\nFirst, make a stage name.\n<br />\nCreate a company with the same name, and have it own all the rights to everything you do.\n<br />\nNever reveal your real name.\n<br />\nThis is to manage the trappings of your upcoming fame.\n</p><p>\nFind a writer and a publicist to create your first pioneering adventure.\n<br />\nCollaborate with the writer to make a great story arc before you begin.\n<br />\nSo, for example, it’s not just a story of how you escaped a cult, but how you joined the cult, uncovered a surprising history, fell in love, were almost discovered and captured, then escaped by changing the mind of your captor, and finally learned some interesting counter-intuitive lessons along the way.\n<br />\nConsult with the publicist to make sure it’s interesting to the media.\n<br />\nThen begin.\n</p><p>\nRecord everything on video.\n<br />\nFind ways to make the story arc happen in real life.\n<br />\nWhen you’re done, have your writer make it a fascinating story of various lengths for various outlets — making it a great article, book, video, screenplay, stage talk, and more.\n<br />\nHave the publicist get it everywhere — on every popular platform of the day.\n<br />\nHire a business manager to turn the attention into profit.\n<br />\nKeep half of your profits in the business, and put half into your private savings.\n<br />\nWhile your team is promoting your last adventure, you and your writer prepare the next one.\n<br />\nOnce fame hits, your biggest challenge is to keep creating — to keep momentum.\n</p><p>\nRepeat this process as long as you’d like.\n<br />\nYour fame will open new doors, making it possible to do even more incredible things.\n</p><p>\nSo how does it end?\n<br />\nOne of two ways:\n</p><p>\nIf this life is really your destiny, do it until it kills you.\n<br />\nAlways pushing to see how far you can go, if you die during an adventure, you’ll die happy, knowing you pushed it as far as you could.\n</p><p>\nBut if you start feeling you’ve had enough, then write the ending.\n<br />\nBuild the death of your public persona into your last story.\n<br />\nSince you’re famous, this will take some planning.\n<br />\nThis is why you used a stage name and company from the start.\n</p><p>\nSecretly buy a house under your real name in a mundane place nobody would expect you to be.\n<br />\nBuy some second-hand clothes and practice changing your appearance and voice.\n<br />\nMake sure your company is in good hands, run by a team you trust.\n</p><p>\nThen, when the filming of your final story is done, rent a boat and disappear near the ocean, letting everyone think you died.\n<br />\nEscape anonymously into your new life.\n<br />\nSince your private company owns the rights, it can license your stories, shows, books, and more for years to come, funding your anonymous life.\n<br />\nA benefit of fame is that it carries on without you.\n</p><p>\nAs you watch the world in the following decades, be glad if many people surpass you and belittle your pioneering adventures.\n<br />\nYour final act of generosity is your absence.\n<br />\nIt leaves a void for others to step into.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"7be4359acea2a86d38be9a1ec35d261746ea840f9e4592e437d226f70943c61d","category":"Sites"}