{"title":"Who the hell creates a social network?","link":"https://blog.webb.page/2017-12-30-who-creates-social-networks.txt","date":1514592000000,"content":"<p>Or, \"Social networks are terrible, so I'm creating one\". But…why? <em>Excellent</em>\nquestion, buckle up gang!</p>\n<p>Social networks in 2017 are just <em>bad</em>. There's no shortage of articles\nwritten about how depressing, manipulative, greedy, and morally bankrupt they\nare but, to what end? The same people writing about these horrid networks\ncontinue to use them because <em>despite</em> all the horrible things done (or\nignored) by the creators to their users, these networks have <em>utility</em>. At\ntheir very core, social networks bring people together and double as support\ngroups for like-minded thinkers (for better or worse). There's (seemingly) no\nincentive for the networks to make things better on behalf of their users.\nWhere else are they (the masses) gonna go? Mastodon? Micro.blog? Sublevel?\nScuttlebutt? HAH!</p>\n<p>\"Big Social\" knows <em>damn well</em> that the average user (read: at least 70% of\nthem) isn't going to:</p>\n<ol>\n<li>Create a DigitalOcean, or other VPS (virtual private server) provider\naccount</li>\n<li>Pay <em>money</em> for a server (even though the cheapest is $5)</li>\n<li>Read a tutorial on GitHub for instructions on how to set up their own\nMastodon instance</li>\n<li>Invite their friends and family</li>\n<li>Maintain the server and <em>continue</em> paying $5/month for it</li>\n</ol>\n<p>You wanna know what my friends did after I told them I was deleting my\nFacebook account at the top of this year? Some responded with a disaffected,\n\"oh\". Some were appalled at the privacy violations they unknowingly subjected\nthemselves to daily yet continued scrolling their feed. Others just didn't\ncare. Now we get to the reason social networks are just <em>bad</em> and will\ncontinue to be: The masses simply do not give a rat's ass, flying fuck, and/or\nshit. Womp womp.</p>\n<p>To my wife's credit, she mainly uses Facebook for the mom/support groups she's\nfound. All those moms aren't going to a transition to a Discord server or\nsubreddit because the <em>experience</em> will be too jarring and that'll make the\ntransition unlikely to stick.</p>\n<p>To be quite honest, <em>I am not much better</em>. I mean sure, I quit Google because\nof their ever-increasing invasiveness to my privacy and selling my user data\nto advertisers. I now self-host my email (shout out to Mail-in-a-Box<a href=\"https://mailinabox.email\">1</a>).\nBut…I created a new Google account so I could still use YouTube (thinking\nabout deleting it again and manually keeping track of favorite channels but\nMEHHHHH).</p>\n<p>I complain about Twitter <em>on</em> Twitter and guess what? I tweet like a <em>mofo</em>. I\nretweet even more! I favorite! I am <em>disgusted</em> by the fact that they utilize\nDrumpf in their advertisements overseas while pretending that they cannot hold\nthe current U.S. president to the same standards as everyone else. I am\ndisgusted by the way they <em>enable</em> Nazi propaganda while simultaneously\nblocking such content in Germany and France. I am disgusted by the way they\neffectively <em>shit</em> on their users being attacked and for some strange reason,\n<em>side with the oppressors/attackers</em>. And yet…it's the best damn version\nof social media I've been on to date and that does <em>not</em> make me happy. At\nsome point though, you've got to stop complaining and <em>take action</em>.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/who-creates-social-networks-a.jpg\">Socii logo and logotype</a></p>\n<p>Introducing <em>Socii</em> (\"Oh great, another social network,\" you think), my answer\nto the bullshit perpetuated by Big Social and the absence of an easily\naccessible alternative (pronounced \\'sō-'kē\\).</p>\n<p>Like Big Social, you'll be able to:</p>\n<ul>\n<li>add a profile picture</li>\n<li>have an accent color</li>\n<li>post updates</li>\n</ul>\n<p><em>Un</em>like Big Social, you'll be able to:</p>\n<ul>\n<li>play with a crap ton more customization options (top secret for now)</li>\n<li>use tools to customize and protect your online experience</li>\n<li>read your timeline untouched by algorithms</li>\n</ul>\n<p>\"This sounds good,\" you say, \"but how will you make money? I'm not paying for\na social network!\"</p>\n<p>Well damn, you're stingy but okay <em>I get it</em>. There will be a merchandise\nshop, account upgrades like the ability to secure a three/four character\nusername, and something else related to the top secret customization options\nmentioned above. Furthermore, there will be a way for users to make a bit of\ncash themselves. It is my hope that this will be enough to keep Socii going\nonce the free tier limits on some services I'm using to operate it start\ncosting money.</p>\n<p>To temper expectations (if only for myself), I do not expect Socii to become\n\"the one true network\" but I would be <em>delighted</em> if people found it to be a\nwelcome reprieve and community of good vibes. A private alpha will occur in\nearly 2018 with a beta slated for (hopefully) late summer. I'll bring people\nin on a rolling basis at that point. If you'd like to be notified once early\nregistration opens up, feel free to sign up at socii.network<a href=\"https://socii.network/welcome\">2</a>! 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"7c0f874fe21be18403584021b5e2825a88608f155c3b7cea80fcde643584394a","category":"Sites"}