{"title":"&#8220;A 600-Year-Old Blueprint for Weathering Climate Change&#8221;","link":"https://kottke.org/24/04/a-600-year-old-blueprint-for-weathering-climate-change","date":1712168276000,"content":"\n        <p><a href=\"https://www.theatlantic.com/science/archive/2024/04/little-ice-age-native-north-america-climate-change/677944/?gift=Jt-1qNm01l52IpAdJoE_J27LoPMNx_F7dfKff0uGsDI\">This is a fascinating article by Kathleen DuVal</a> about how climate change (including the Little Ice Age) affected social and political structures in North America in the 13th and 14th centuries.</p>\n\n<blockquote><p>But then the climate reversed itself. In response, Native North American societies developed a deep distrust of the centralization, hierarchy, and inequality of the previous era, which they blamed for the famines and disruptions that had hit cities hard. They turned away from omnipotent leaders and the cities they ruled, and built new, smaller-scale ways of living, probably based in part on how their distant ancestors lived.</p></blockquote>\n\n<p>While Europeans reacted to the Little Ice Age by centralizing and militarizing under hereditary absolute monarchs, Native Americans went in a decidedly different direction:</p>\n\n<blockquote><p>The cities that Native Americans left behind during the Little Ice Age-ruins such as those at Chaco Canyon and Cahokia-led European explorers and modern archaeologists alike to imagine societal collapse and the tragic loss of a golden age. But oral histories from the generations that followed the cities’ demise generally described what came later as better. Smaller communities allowed for more sustainable economies. Determined not to depend on one source of sustenance, people supplemented their farming with increased hunting, fishing, and gathering. They expanded existing networks of trade, carrying large amounts of goods all across the continent in dugout canoes and on trading roads; these routes provided a variety of products in good times and a safety net when drought or other disasters stressed supplies. They developed societies that encouraged balance and consensus, in part to mitigate the problems caused by their changing climate.</p></blockquote>\n\n<p>Being an adult in the 21st century is the continual discovery of things you never learned in school — how climate change has altered the course of history and changed our societies was not adequately represented in my history classes. (See, for example, <a href=\"https://kottke.org/16/06/the-industrial-revolution-climate-change-and-brexit\">how climate change played a role in Brexit</a>.)</p>\n\n<p>DuVal’s article is excerpted from her upcoming book, <a href=\"https://www.amazon.com/exec/obidos/ASIN/0525511032/ref=nosim/0sil8\">Native Nations: A Millennium in North America</a> (<a href=\"https://bookshop.org/a/2966/9780525511038\">Bookshop</a>), which sounds really interesting:</p>\n\n<blockquote><p>A millennium ago, North American cities rivaled urban centers around the world in size. Then, following a period of climate change and instability, numerous smaller nations emerged, moving away from rather than toward urbanization. From this urban past, egalitarian government structures, diplomacy, and complex economies spread across North America. So, when Europeans showed up in the sixteenth century, they encountered societies they did not understand-those having developed differently from their own-and whose power they often underestimated.</p></blockquote>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/climate%20crisis\">climate crisis</a> · <a href=\"https://kottke.org/tag/Kathleen%20DuVal\">Kathleen DuVal</a> · <a href=\"https://kottke.org/tag/Native%20Americans\">Native Americans</a> · <a href=\"https://kottke.org/tag/Native%20Nations%3A%20A%20Millennium%20in%20North%20America\">Native Nations: A Millennium in North America</a> · <a href=\"https://kottke.org/tag/politics\">politics</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/a-600-year-old-blueprint-for-weathering-climate-change\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"7c4ede791ca7401fcf642101c23dbd7093d5b1e3d68e73ec2abcad15da402d44","category":"default"}