{"title":"Social internet has ED","link":"https://om.co/2024/07/17/social-internet-has-ed/","date":1721237636000,"content":"<blockquote>\n<p>Interaction bait is killing social media. You know what I’m talking about. Those posts that are designed to get you to comment, like, or share. They’re everywhere, and they’re getting more and more annoying.</p>\n\n\n\n<p>People are posting things that are clearly designed to get a reaction. And it’s not just the posts themselves that are annoying. It’s the fact that they’re so obviously designed to manipulate me into interacting with them. I wouldn’t mind if it was a genuine question or a conversation starter. But it’s not. It’s just a ploy to boost engagement.</p>\n\n\n\n<p>I get it. Social media is all about engagement. But there’s a fine line between encouraging interaction and being downright manipulative</p>\n\n\n\n<p><a href=\"https://christianheilmann.com/2024/07/11/interaction-bait-is-killing-social-media/\" target=\"_blank\">Christian Heilmann</a></p>\n</blockquote>\n\n\n\n<p>There has been nothing<a href=\"https://om.co/2023/10/15/social-internet-is-dead-get-used-to-it/\" target=\"_blank\"> social about social internet for</a> a long time. As I wrote in my essay last year, “The way social media is structured rewards extreme ideas, ideologies and those on the fringe. A radical idea will likely get more engagement — comments, likes, or reshares — than a seemingly rational comment.” We are at a new peak, as Christian so astutely observes. It has become unhinged and unsocial. It is suffering from engagement dysfunction. On the upside, one can easily see the ugly side of many, much more clearly! Social<a href=\"https://om.co/2024/06/26/midweek-edition-field-notes-06-26-2024/\" target=\"_blank\"> media is a funhouse mirror</a>, after all.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"7d558564756483914914cb81e2b160243ae08ffc70dbed731057568a09f90647","category":"default"}