{"title":"Why Did We Stop Building Beautiful? The Economics and Ideology Behind an Aesthetic Revolution","link":"https://feeds.feedblitz.com/~/896849534/0/marginalrevolution~Why-Did-We-Stop-Building-Beautiful-The-Economics-and-Ideology-Behind-an-Aesthetic-Revolution.html","date":1716031121000,"content":"<p>“Why are buildings today drab and simple, while buildings of the past were ornate and elaborately ornamented?,” that’s the question asked by Samuel Hughes in <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://worksinprogress.co/issue/the-beauty-of-concrete/\">the latest Works in Progress</a>. There are two extant theories:</p>\r\n<blockquote><p>The naive explanation for the decline of ornament is that the people commissioning and designing buildings stopped wanting it, influenced by modernist ideas in art and design. In the language of economists, this is a demand-side explanation: it has to do with how buyers and designers want buildings to be. The demand-side explanation comes in many variants and with many different emotional overlays. But some version of it is what most people, both pro-ornament and anti-ornament, naturally assume.</p>\r\n<p>However, there is also a sophisticated explanation. The sophisticated explanation says that ornament declined because of the rising cost of labor. Ornament, it is said, is labor-intensive: it is made up of small, fiddly things that require far more bespoke attention than other architectural elements do. Until the nineteenth century, this was not a problem, because labor was cheap. But in the twentieth century, technology transformed this situation. Technology did not make us worse at, say, hand-carving stone ornament, but it made us much better at other things, including virtually all kinds of manufacturing and many kinds of services. So the opportunity cost of hand-carving ornament rose. This effect was famously described by the economist William J Baumol in the 1960s, and in economics it is known as Baumol’s cost disease.</p></blockquote>\r\n<p>In a twist, Hughes offers sophisticated arguments in favor of the naive theory. Hughes argues that even in the past, when labor was relatively cheap, many labor-saving devices were used to make ornament even more affordable and more such devices could have been used if demand were present. In addition, the greater scope for economies of scale and reductions in transportation costs reduced the cost of ornament.</p>\r\n<p>Hughes, however, doesn’t give us the key piece of evidence, namely prices! Still, although I have written <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.mercatus.org/students/research/books/why-are-prices-so-damn-high\">extensively on the Baumol theory</a>, I am not wedded to it as the explanation for the decline in ornament. Indeed, I would note that Baumol predicts that the <em>price</em> of labor-intensive goods and services increases because productivity increases faster in other industries. It does not necessarily predict, however, that consumption declines, as it has not for medical care and education. Indeed, one virtue of the Baumol theory is precisely because the price increases are produced by productivity improvements in other industries, Baumol price increases are always accompanied by income increases. Thus, Baumol is the only unitary theory that allows for a rising price of education along with greater purchases of education. Thus, preferences must play some role in the decline in ornament at least to the extent that people weren’t willing to use more of their income to purchase ornament as the price rose.</p>\r\n<p>Hughes, however, puts more weight on a large shift in tastes among the elite:</p>\r\n<blockquote><p>to exaggerate a little, it really did happen that every government and every corporation on Earth was persuaded by the wild architectural theory of a Swiss clockmaker and a clique of German socialists, so that they started wanting something different from what they had wanted in all previous ages. It may well be said that this is mysterious. But the mystery is real, and if we want to understand reality, it is what we must face.</p></blockquote>\r\n<p>I think that is correct. For many public buildings in particular, ugly was a choice.</p>\r\n<p>I am also in agreement with Hughes that robots are greatly reducing the cost of stone carving as I wrote in my post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2023/12/overcoming-baumol.html\">Overcoming Baumol</a>. Thus, we have two reasons for optimism. if tastes can change once they can change again and prices are falling. Thus, perhaps today we are due for some magnificent buildings that will last the ages as did many of the great buildings of the past.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/05/88328.html\">Why Did We Stop Building Beautiful? The Economics and Ideology Behind an Aesthetic Revolution</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/896849534/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/896849534/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/896849534/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/896849534/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/896849534/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/896849534/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comment-160759220\">In reply to mgregoire.   Okay, but what about all the ugly ...</a> <i>by Pillow Lasers</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comment-160759219\">In reply to dan1111.   Go to Paris. Find me a newer building ...</a> <i>by Pillow Lasers</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comment-160759215\">In reply to Your Husband's Cane.   I like this logic to some ...</a> <i>by Pillow Lasers</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comment-160759037\">The key is actually monopoly-like powers of church and state. ...</a> <i>by DK</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comment-160759022\">In reply to Indoor Camping.   In custom residential ...</a> <i>by Slocum</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/88328.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/experimental-evidence-on-large-language-models.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=experimental-evidence-on-large-language-models\">Experimental Evidence on Large Language Models</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/will-very-large-baby-bonuses-work.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=will-very-large-baby-bonuses-work\">Will very large baby bonuses work?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/05/substitutes-are-everywhere.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=substitutes-are-everywhere\">Substitutes are everywhere</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"7d7c17b9c341eb8f8da7b8c99ca37e41f1e83183ba0232be5fe4fb9e49fd378e","category":"default"}