{"title":"A Less Rigorous Version of Friendship","link":"https://kottke.org/24/07/a-less-rigorous-version-of-friendship","date":1721743546000,"content":"\n        <p>I read Kathryn Jezer-Morton’s <a href=\"https://www.thecut.com/newsletter/2024/05/brooding-may-10-2024.html\">newsletter about “a more lateral approach to Mother’s Day”</a> back when it came out in May, and while I’m not the target audience, I keep thinking about this bit on friendship:</p>\n\n<blockquote><p>After my mother died in 2021, my family returned home from the memorial service to find a lovely array of treats laid out on our kitchen counter: cake, flowers, rotisserie chicken, a nice bottle of wine, and a copy of the newspaper, which somehow felt like the most tender thing of all. The fridge had been stocked too. It turned out my friends Amy and Ariel had asked my neighbor for the spare key, let themselves in, and taken care of us.</p>\n\n<p>This is elite-tier friendship, and at this level, we can see how much friendship at its best overlaps with mothering. There has been an emphasis over the past few years on friendship as a site of self-improvement: radical honesty, callouts, the naming of slights and hurt feelings in the service of some kind of purified, scrubbed-clean higher self. All of this is fine, but I’m less interested in this rigorous version of friendship than I am in a softer, more accepting friendship that has more in common with caregiving. I am all too aware of my flaws; I don’t really need my friends to remind me of them. Rather than demand I be better, I would rather my friends accept me as I am. Isn’t that the kind of mother we all wish we had, too? And no, you don’t need to be a mother to treat your friends to the mothering they all need. Mothering transcends the biological — every chosen family knows this.</p></blockquote>\n\n<p>This is also advice that can be directed inward towards a “more accepting friendship” with ourselves; e.g. “I am all too aware of my flaws; I don’t really need to remind myself of them. Rather than demand I be better, I would rather accept me as I am.”</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Kathryn%20Jezer-Morton\">Kathryn Jezer-Morton</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/07/a-less-rigorous-version-of-friendship\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"7ebcf89e7725ddbf6fd95ab4f2ee2980946091972fab0783565905ba3a070add","category":"default"}