{"title":"Robot(taxi)s Are Coming! No seriously!","link":"https://om.co/2024/11/29/robottaxis-are-coming-no-seriously/","date":1732916051000,"content":"<p><a href=\"https://archive.is/2024.11.29-132456/https://www.businessinsider.com/waymo-robotaxis-competing-uber-lyft-drivers-phoenix-los-angeles-price-2024-11\" target=\"_blank\">Uber &amp; Lyft Earnings Under Pressure from Waymo, Robotaxis. </a>(Business Insider)</p>\n\n\n\n<p>Waymo’s robotaxis are undercutting Uber and Lyft prices in Phoenix while matching quality. It’s no longer just about autonomous technology — it’s about making the economics work at scale. This is a sign of the times as more AI-powered machines become part of our lives.</p>\n\n\n\n<h4>Key Points:</h4>\n\n\n\n<ul>\n<li>In Phoenix, Waymo’s self-driving rides are consistently priced 20% to 30% below traditional ride-hailing services, while maintaining comparable wait times and service quality.</li>\n\n\n\n<li>The expansion to Los Angeles marks a crucial test for Waymo’s scalability. L.A.’s complex traffic patterns and diverse environments present new challenges. Yet, Waymo’s confident pricing strategy suggests it has cracked fundamental operational efficiency issues.</li>\n\n\n\n<li>Waymo still employs remote operators and maintenance staff, the ratio of support personnel to active vehicles continues to decrease. This improving efficiency ratio, combined with the elimination of driver costs, creates a compelling economic model that traditional ride-hailing services will struggle to match.</li>\n</ul>\n\n\n\n<h4>Some thoughts:</h4>\n\n\n\n<p>The parallels to the early days of smartphone-based services disrupting traditional taxis are evident. But this time, the disruption feels more substantial. It’s hard to revert to regular taxis after using Uber, and the same is true for Waymo. Unlike the questionably sustainable subsidies that fueled early ride-hailing growth, Waymo’s price advantage stems from fundamental technological capabilities and operational efficiencies. This convergence of declining technology costs, improved operational efficiency, and scalable infrastructure, when achieved, is almost always disruptive. In the recent past, Amazon Web Services exacted such outcome from traditional data centers and their suppliers, for example.</p>\n\n\n\n<p>The question isn’t whether autonomous ride-hailing will become mainstream, but how we’ll manage its impact on urban economics and employment landscapes. Will cities adapt their infrastructure to optimize for this new paradigm, or will autonomous services have to conform to existing urban frameworks?</p>\n\n\n\n<p>The real question is: What are the societal implications? The job and income loss at the driver level extract dollars from the local economy and have knock-on downstream effects. What does it do to the local tax base or local spending? When technologies are this intertwined in offline societal reality, we need to be proactive in imagining future scenarios. Quite a few questions need serious consideration and discussion!</p>\n\n\n\n<p><strong>Read on Business Insider</strong>: <a href=\"https://archive.is/2024.11.29-132456/https://www.businessinsider.com/waymo-robotaxis-competing-uber-lyft-drivers-phoenix-los-angeles-price-2024-11\" target=\"_blank\">Uber &amp; Lyft Earnings Under Pressure from Waymo, Robotaxis. </a></p>\n\n\n\n<p><em><strong>November 29, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"7ecabd532916314e4eca8398bcfd47ffc33a6be09fccd9a0b4e3cbee47324729","category":"Sites"}