{"title":"Bluesky's the new Twitter probably","link":"https://www.garbageday.email/p/bluesky-s-the-new-twitter-probably","date":1731527902000,"content":"<div><div><h2>New Panic World, Baby</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/b896af2c-3f7a-4f27-91af-2bf9c304238e/pwbannertaylor.png?t=1731526567\" /></div><p>This week we have the newly independent Taylor Lorenz, author of the excellent <a href=\"https://www.usermag.co/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\"><i>User Mag</i></a><a href=\"https://www.usermag.co/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\"> newsletter</a>. She joined us for an episode all about Silicon Valley’s weirdest guys and their horrible midlife crisis that is eating the world. Boy blood, seasteading, little “jetpacks” that measure your night-time erections, we cover all of it. You can check out the episode anywhere you consume audio content. <b><a href=\"https://podcasts.apple.com/us/podcast/panic-world/id1740187810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">You can also click here if that’s easier</a></b>.</p><hr /><h2>Bluesky Probably Just Won The Twitter Wars</h2><p>Bluesky cracked <a href=\"https://bsky.app/profile/jaz.bsky.social/post/3lasqzayfik2e?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">15 million users</a> and hit number one in the iOS App Store this week. (Garbage Day researcher Adam <a href=\"https://www.garbageday.email/p/the-new-york-times-is-back-baby?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">actually noticed</a> Bluesky enter the top five last month briefly after Elon Musk removed blocks from X.) But Bluesky is currently so popular that Threads’ algorithm has mindlessly <a href=\"https://www.threads.net/@willoremus/post/DCTO3vyxZXm?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">picked it up</a> as a trending topic lol. </p><p>And, while some of Bluesky’s recent pop off is due to MSNBC’s Chris Hayes <a href=\"https://bsky.app/profile/carebrose.bsky.social/post/3lascau44zc2t?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">plugging it</a> on air this week, there are other factors at play, as well. The two biggest, as far as I can tell, being that Musk’s proximity to the incoming Trump administration now makes X an official propaganda organ of the American right and journalists are finally accepting that Threads sucks shit. Garbage Day is not always correct, but <a href=\"https://www.garbageday.email/p/the-algorithmic-anti-culture-of-scale?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">we were correct</a> about Threads on day one.</p><p>Bluesky’s big week has also brought with it some fresh drama and discourse. The platform’s big villain at the moment seems to be Democratic pundit and Twitter addict Will Stancil, who, at one point, was the <a href=\"https://bsky.app/profile/whstancil.bsky.social/post/3lar3bmrqoq2k?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">most blocked user</a> on the site. The spotlight has since moved over to <i>The Intercept</i>’s Sam Biddle, the <a href=\"https://www.nytimes.com/2015/02/15/magazine/how-one-stupid-tweet-ruined-justine-saccos-life.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">architect</a> of the Twitter main character, who became a main character himself this week <a href=\"https://bsky.app/profile/sambiddle.bsky.social/post/3laphhysv7224?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">after complaining</a> that Bluesky had “theater kid energy.” (He’s not exactly wrong lol.)</p><p>But it’s sort of a relief that Bluesky is finally having its moment. It was always the most interesting of the Twitter clones. Its tech stack doesn’t run on ActivityPub, but it is federated and <a href=\"https://techcrunch.com/2024/02/14/bluesky-and-mastodon-users-are-having-a-fight-that-could-shape-the-next-generation-of-social-media/?guccounter=1&amp;guce_referrer=aHR0cHM6Ly93d3cucmVkZGl0LmNvbS8&amp;guce_referrer_sig=AQAAADGcq6lbY_KbIQ0Jp5ApyWXEq3R4sH8qk-yw2BVuLaaoYGN9Ab8ZaxvUWGK_87FzeeZYjhQXRRQSTSRhfQtTQYs0FNtdsKYDSEeZ_zwjHIS2U_mRlsnRu_Jz22_9QPx9kTv22eiq84a1qwwq0LSEUYIed4xjhDcAUmrgguhdftFB&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">can bridge</a> with platforms like Mastodon. Its modular moderation is great, giving users an extraordinary amount of control over what they want to see. And its custom feeds feature is fascinating. Someone <a href=\"https://bsky.app/profile/did:plc:xa6dx6gn6xqydvrsakcupmfp/feed/aaab5ydmkk3uo?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">sent me one</a> the other day that is just for people sharing photos of their lunch. But it is still missing some things. </p><p>Aside from the general “millennial roommate board game night” energy that Biddle pointed out, it still doesn’t feel like a one-stop shop for the kinds of memes or news stories that Twitter was in its heyday or TikTok is now. In other words, it doesn’t feel quite ready to be the main artery of the internet. And some of its most passionate super users, many of which are burned out Twitter refugees who decamped for a quieter network, don’t seem to really want that to happen ever. Though, they may not have much say in the matter. The site is already beginning to create large-scale memes, like last year’s <a href=\"https://faineg.substack.com/p/how-i-accidentally-ruined-bluesky?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">sexy Alf</a>. And if you put enough journalists on a website there’s going to be news (and drama, of course). And stan armies are finally showing up, as well. On Monday, I <a href=\"https://www.garbageday.email/p/where-is-the-lib-joe-rogan?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">wrote about</a> the novel ways Swifities are finding each other on Bluesky, but there’s also now a whole bunch of pro- and anti-shipper fights <a href=\"https://www.reddit.com/r/BlueskySocial/comments/1gpvaej/what_even_are_these_antis_blocklists_popping_up/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">happening on the platform</a>. If you don’t know what that is, don’t worry, that just means you’re normal. But the broad strokes are that people are arguing about how to moderate fan art. Like I said, don’t worry about it. All you really need to know is Bluesky has already hit its 2014 Tumblr moment.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6ff9c76c-f93b-4843-851b-0de913203577/Screenshot_2024-11-13_at_11.28.47_AM.png?t=1731515340\" /><div><span><p>(<a href=\"https://bsky.app/profile/themountaingoats.bsky.social/post/3latraasqh22h?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">bsky.app/profile/themountaingoats.bsky.social</a>)</p></span></div></div><p>I’m comfortable saying that Bluesky won the title of The Next Twitter. Without a drastic de-Meta-fication of Threads, Bluesky will continue to grow just fine and easily outpace Threads in, at least, cultural impact. Though, there is a bigger question that hangs over Bluesky. Which is, exactly how big can a text-based, non-algorithmic feed actually get?</p><p>Many years ago, I interviewed Hossein Derakhshan, Iran’s “blogfather,” a writer and reporter who was imprisoned in Tehran for six years on “<a href=\"https://advox.globalvoices.org/2008/11/18/iranian-blogger-hossein-derakhshan-arrested-in-tehran/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">suspicion of espionage</a>\" after a reporting trip to Israel. In prison, he essentially missed the jump from blogs to social platforms and in 2015, finally free, he wrote a fantastic piece titled “<a href=\"https://medium.com/matter/the-web-we-have-to-save-2eb1fe15a426?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">The Web We Have to Save</a>,” making him the first person to clock that the web was dying.</p><p>When we got on the phone to chat I was surprised to discover he had already made peace with the dying web and had moved on to a much more existential fear: Would reading and writing die as well? I’ll confess, at the time, I thought his fears of a post-literate web and, by extension, post-literate world were a little overblown. But I’ve come back to that interview a lot over the years. And Derakhshan’s fears of a video-first web killing words have been on my mind a lot amid the race to replace Twitter this year. </p><p>I’ve found myself fretting over “the literacy wall,” a moment at some point in the future where enough people who grew up on a text-based web have died off and taken with them any memory of enjoying reading and writing posts online. A little dramatic, sure, but it’s definitely clarified for me how important it is to not just replace what people remember about Twitter, but also find ways to evolve the entire concept into something that can survive against the tide of 90-second video clips. Could Bluesky be that future? Well, now they have 15 million users who might be able to figure it out.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/d0ffc66f-c223-4411-a2d2-7637b3b3e75b/Potential_Spam.png?t=1731510627\" /></div><p><b>Silence Your Spam Calls Today</b></p><p>Hey there, Garbage Day readers. You've probably all definitely noticed an uptick in spam calls and texts this election season, right? Well, have you ever wondered how they get ahold of your info in the first place? It's data brokers. They sell your address, phone number, Social Security Number, family contacts, and more, to anyone willing to pay. And, yes, it's totally legal. On the bright side, you can always opt out of these sites yourself and stop the spam. BUT... doing all that on your own is frustrating and can take hours.</p><p>That's why you should use Incogni instead. They'll remove all your data from over 180 data brokerages and people-search sites automatically, so you can kiss spam goodbye.</p><p>Better yet, they're giving our readers 58% off with code DAYDEAL, <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">which you can use by clicking here</a>. Never worry about being tracked on the web again. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">Here's that link one more time!</a></p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2><span>A Good Video</span></h2><blockquote><p></p><p>Name the artist</p><p></p><a href=\"https://twitter.com/TheRyanCarrick/status/1856405007030960157?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\"><p> — Ryan Carrick (@TheRyanCarrick) <br /> 6:33 PM • Nov 12, 2024 </p></a></blockquote><hr /><h2>What If Trump’s Twitter Ban Helped Him Win The Election?</h2><p>Here’s something that has kept me up at night for the last week or so: Did President-elect Donald Trump’s Twitter ban in 2021 actually help him win the election? Now, I will admit, this is one of those questions that probably can’t ever be satisfactorily answered. But I, unfortunately, cannot resist coming up with an idea and then agonizing over it. Here’s my thought process.</p><p>Trump was banned from his favorite app in 2021 after the January 6th Insurrection. After Elon Musk bought the site in late 2022, he reinstated Trump’s account, but Trump didn’t immediately come back. In fact, he’s still not using X the way he once used Twitter. Trump, instead, spends most of his time shouting into the void on Truth Social, which he owns via his Trump Media &amp; Technology Group. </p><p>Now, no serious person could ever argue that Trump’s Truth Social posts have the same impact as his tweets did. But I do wonder if by kicking him off Twitter and, thus, into the digital wilderness, it forced his campaign team to diversify their digital strategy. The campaign was extremely aggressive on dark social, but it <a href=\"https://www.politico.com/news/2024/08/21/trump-harris-campaign-spending-fec-00175377?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">spent less</a> than Harris’ campaign and had a much smaller staff, instead putting most of their energy into rallies that could be clipped and shared by supporters. Who would share them for free.</p><p>Like I said, this is one of those questions that can’t really be answered. But you could argue that Trump had to embrace a decentralized social internet much earlier than both the Democrats and, also, the mainstream media did, who only seem to be grappling with it now.</p><hr /><h2>AI Continues To Eat Google And Everything Else</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/bdf0b6fa-552a-43ba-ac15-262bcc80a234/Screenshot_2024-11-13_at_2.15.13_PM.png?t=1731525327\" /><div><span><p>(<a href=\"https://x.com/jakeswearingen/status/1856066361513976201?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">x.com/jakeswearingen</a>)</p></span></div></div><p><i>Business Insider</i> Deputy Editor Jake Swearingen share a screenshot of a Google snippet pulling out all the relevant information of an article <i>Business Insider</i> had just published. Now, to be clear, this is not a Google AI summary. But it is part of Google’s wider AI-driven push to cannibalize their own links. And, as Swearingen soberly wrote, “The end of Google as a platform for publishers is gonna be rough.” Especially because, at this point, Google is the only way a news organization can stay afloat now that the Facebook traffic hose has been turned off. Speaking of Facebook, though…</p><p><i>404 Media</i> <a href=\"https://www.404media.co/ai-chatbot-added-to-mushroom-foraging-facebook-group-immediately-gives-tips-for-cooking-dangerous-mushroom/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">recently reported</a> that a mushroom foraging community on Facebook added one of Meta’s AI chatbots to the group and it immediately suggested advice that would absolutely kill someone. Amazon’s AI <a href=\"https://www.theguardian.com/technology/2023/sep/01/mushroom-pickers-urged-to-avoid-foraging-books-on-amazon-that-appear-to-be-written-by-ai?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">had similar difficulty</a> with mushroom identification.</p><p>Oh well, at least old people on YouTube can enjoy these amazing AI videos of Barron Trump singing.</p><blockquote><p></p><p></p><p></p><a href=\"https://twitter.com/FacebookAIslop/status/1856362794460807339?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\"><p> — Insane Facebook AI slop (@FacebookAIslop) <br /> 3:45 PM • Nov 12, 2024 </p></a></blockquote><hr /><h2>Weird Crypto Guys Want To Buy Greenland And “Terraform” It</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/45d4b055-6f3d-468c-abed-0eee18bc0891/Screenshot_2024-11-13_at_1.44.38_PM.png?t=1731523515\" /><div><span><p>(<a href=\"https://x.com/drydenwtbrown/status/1856484811294290097?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">x.com/drydenwtbrown</a>)</p></span></div></div><p>Oh man, it’s been a while since we had a good “crypto guys try to buy something stupid” story. Welcome back to the Trump era, everybody.</p><p>Praxis is a project led by Dryden Brown and Charlie Callinan, who have raised A LOT of money to build what they’re calling “the first network state.” And Brown recently shared a very long and deranged thread on X about how he went to Greenland on a fact-finding trip to buy the country. As Brown wrote, “If humanity is going to build Terminus on Mars, we should practice in Greenland. It can serve as a sandbox for terraformation experiments, funded by realizing its potential as a mining and industrial hub.” </p><p>Anyway, all that actually happened is this guy took an arctic vacation to send some DMs and learn that people are OK with paying taxes. Truly incredible stuff. Has anyone asked Brown what the <a href=\"https://www.garbageday.email/p/libertarian-kryptonite?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">age of consent laws</a> in Praxis are going to be?</p><hr /><h2><span>I Asked Bluesky Users To Send Me The Good Posts</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/f47067ea-3b76-425b-a17b-eb442f771340/Screenshot_2024-11-13_at_10.13.28_AM.png?t=1731510838\" /><div><span><p>(<a href=\"https://bsky.app/profile/joesaunders.bsky.social/post/3larg7yuv7c2r?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">bsky.app/profile/joesaunders.bsky.social</a>)</p></span></div></div><p>This was sent to me by <a href=\"https://burghpunk.bsky.social?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">@burghpunk.bsky.social</a>.</p><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://sherwood.news/tech/nytimes-leading-publisher-on-facebook-meta/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">“How </a><i><a href=\"https://sherwood.news/tech/nytimes-leading-publisher-on-facebook-meta/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">The New York Times</a></i><a href=\"https://sherwood.news/tech/nytimes-leading-publisher-on-facebook-meta/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\"> beat the algorithm and became Facebook’s top publisher”</a> (We wrote this!)</p></li><li><p><a href=\"https://www.reuters.com/business/media-telecom/guardian-quits-x-social-media-platform-citing-racism-conspiracy-theories-2024-11-13/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">“Guardian quits X social media platform, citing racism and conspiracy theories”</a></p></li><li><p><a href=\"https://www.theverge.com/2024/11/13/24295637/meta-must-face-ftc-antitrust-trial-instagram-whatsapp?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">“Meta must face FTC trial that could separate Instagram and WhatsApp”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://www.tumblr.com/ellenwipley/766693309220618240/never-posted-this-crochet-tapestry-that-my-friend?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=bluesky-s-the-new-twitter-probably\" target=\"_blank\">very good crocheted tapestry</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=d135c96c-aa09-41c1-8ba4-df1e3918dc07&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"7ee786202f231e042dbef68d46fbc43a31832a0183be1c70764e0ff3729da58f","category":"Sites"}