{"title":"The changes in vibes — why did they happen?","link":"https://feeds.feedblitz.com/~/901293860/0/marginalrevolution~The-changes-in-vibes-why-did-they-happen.html","date":1721191741000,"content":"<p>Clearly it has happened, and it has been accelerated and publicized by the Biden failings and the attempted Trump assassination.  But it was already underway.  If you need a single, unambiguous sign of it, I would cite MSNBC pulling off Morning Joe for a morning, for fear they would say something nasty about Trump.</p>\r\n<p>Another way to put it is that Trump was a highly vulnerable, defeated President, facing numerous legal charges and indeed an actual felony conviction.  Yet he now stands as a clear favorite in the next election.  In conceptual terms, how exactly did that happen?</p>\r\n<p>I had been thinking  it would be a good cognitive test to ask people why they think the vibes have changed, and then to grade their answers for intelligence, insight, and intellectual honesty.</p>\r\n<p>For instance, I used to read people arguing “Trump is popular because of racism,” but now that view is pretty clearly refuted, even if you think (as I do) that racism has some marginal impact on his support.  Or other people have attributed the development to “polarization.”  Whether or not you agree with the polarization thesis, it begs the question here, as we could be polarized with Trump as a big underdog.</p>\r\n<p>In any case, thought I should start this process by offering my answers.  Here they are, in a series of bullet points:</p>\r\n<p>1. Trump and his team understand that we now live in a world of social media.  Only a modest part of the Democratic establishment has mastered the same.</p>\r\n<p>2. The “Trumpian Right,” whether you agree with it or not, has been more intellectually alive and vital than the Progressive Left, at least during the last five years, maybe more.  Being fully on the outs, those people were more free to be creative, noting that I am not equating creative with being correct.</p>\r\n<p>3. The deindustrialization of America has mattered more than people expected at first, and has had longer legs, in terms of its impact on public opinion.  I would say this one is squarely in the mainstream account of the matter.</p>\r\n<p>4. Many Trumpian and MAGA messages have been more in vibe with <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/07/an-overly-simple-model-of-positive-and-negative-contagion.html\" target=\"_blank\">the negative contagion effects of our recent times</a>.</p>\r\n<p>5. The Democrats made a big bet that trying to raise the status of blacks would be popular, but at best they had mixed results.  Some part of this failing was due to racists, some part due to immigrants with their own concerns, and some part due simply to the unpopularity of the message.</p>\r\n<p>6. The ongoing feminization of society has driven more and more men, including black and Latino men, into the Republican camp.  The Democratic Party became too much the party of unmarried women.</p>\r\n<p>7. The Obama administration brought, to some degree, both the reality and perception of being ruled by the intellectual class.  People didn’t like that.</p>\r\n<p>8. Democrats and leftists are in fact less happy as people than conservatives are, on average.  Americans noticed this, if only subconsciously.</p>\r\n<p>9. The relentlessly egalitarian message of Democrats is not so popular, and furthermore — since every claim must have messengers — it translates in lived practice into an “I am better than you all are” vibe.  Americans noticed this, if only subconsciously.</p>\r\n<p>10. The Woke gambit has proven deeply unpopular.</p>\r\n<p>11. Trans support has not been a winning issue for Democrats, but it is hard for them to let it go.</p>\r\n<p>12. Immigration at the border has in fact spun out of control, and that has been a key Trump issue from the beginning of his campaign.  And I write this as a person who is very pro-immigration.  You can imagine how the immigration skeptics feel.</p>\r\n<p>13. Higher education has been a traditional Democratic stronghold, and it remains one.  Yet its clout and credibility have fallen significantly in the last few years.</p>\r\n<p>14. The Democrats made a big mistake going after “Big Tech.”  It didn’t cost them many votes, rather money and social capital.  Big Tech (most of all Facebook) was the Girardian sacrifice for the Trump victory in 2016, and all the Democrats achieved from that was a hollowing out of their own elite base.</p>\r\n<p>15. Various developments in Afghanistan, Ukraine, and Israel did not help the Democratic cause.  Inflation was very high, and real borrowing rates went up sharply.  This is true, whether or not you think it is the fault of Biden, or Trump would have done better.  Crypto came under attack.  The pandemic story is complicated, and its politics would require a post of its own, but I don’t think it helped the Democrats, most of all because they ended up “owning” many of the longer-lasting school closures.</p>\r\n<p>16. In very simple terms, you might say the Democrats have done a lot to make themselves unpopular, and not had much willingness to confront that.  Their own messages make this hard to face up to, since they are supposed to be better people.</p>\r\n<p>You might add to this:</p>\r\n<p>17. Trump is funny (he is one of the great American comics in fact), and</p>\r\n<p>18. Trump acts like a winner.  Americans like this, and his response to the failed assassination attempt drove this point home.</p>\r\n<p>19. Biden’s recent troubles, and the realization that he and his team had been running a con at least as big as the Trump one.  It has become a trust issue, not only an age or cognition issue.</p>\r\n<p>On the other side of the ledger, you might argue, as do many intelligent people, that the Democrats are better at technocracy, and also that Democrats are more respectful of traditional political processes, especially transitions after elections.  I’m not here to debate those issues!  I know many MAGA supporters are not convinced, most of all on the latter.  I’ll simply note that, in the minds of many Americans, those factors do not necessarily outweigh #1-19.</p>\r\n<p>And there you go.</p>\r\n<p><strong>Addendum</strong>: Of course there was and is plenty wrong with Trump and the Trump administration. But the purpose here is not to compare Biden and Trump, rather it is to see why the Democrats are not doing better.  If your response to that question is to cite reasons why the Democrats are better than Trump…well then you are exactly part of the problem.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html\">The changes in vibes — why did they happen?</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/901293860/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/901293860/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/901293860/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/901293860/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/901293860/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/901293860/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comment-160783031\">In reply to Dale D.   Democracies cycle between support for ...</a> <i>by Elitist</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comment-160783030\">I think wokeness is the prime driver.   It goes like this: woke ...</a> <i>by Sondre R</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comment-160783029\">In reply to North.   It seems like the flip side of this is ...</a> <i>by Eric</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comment-160783028\">In reply to North.   I suspect that this “going out of their ...</a> <i>by Dzoldzaya</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comment-160783027\">In reply to Anonymous.   These are the comments he wants to ...</a> <i>by Never forget</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/the-changes-in-vibes-why-did-they-happen.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/my-excellent-conversation-with-brian-winter.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-brian-winter\">My excellent Conversation with Brian Winter</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/one-view-not-to-be-entirely-dismissed.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=one-view-not-to-be-entirely-dismissed\">One view, not to be entirely dismissed</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/j-d-vance-was-selected.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=j-d-vance-was-selected\">J.D. Vance was selected</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"7f1907dc36770798f282151990cafe06467147cd4a7ffe1a1a2e8504745f7bb6","category":"default"}