{"title":"How Technology Is Making Olympic Mountain Bikers Faster","link":"https://kottke.org/24/08/how-technology-is-making-olympics-mountain-bikers-faster","date":1723058003000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/olympic-mtn-bike.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/olympic-mtn-bike.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/olympic-mtn-bike.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"732\" alt=\"a woman going off a jump on a mountain bike\" /></p>\n\n<p>I watched <a href=\"https://olympics.com/en/paris-2024/sports/cycling-mountain-bike\">the men’s Olympic mountain biking race</a> last week and something one of the announcers said caught my attention. She was describing the electronic shifters the cyclists use and then said that many of the competitors were also using an AI-controlled suspension system that automagically adjusted the level of suspension according to the terrain and rider preference.</p>\n\n<p>I’d never heard of this before, so I poked around a little and found some reviews of the Specialized S-Works Epic 8, a bike that comes <a href=\"https://www.sram.com/en/rockshox/collections/flight-attendant\">with an adaptive suspension system called Flight Attendant</a> (and retails for $14,500). From <a href=\"https://www.mbr.co.uk/reviews/120mm-140mm-full-sus/rockshox-flight-attendant-ai-makes-the-new-specialized-s-works-epic-8-a-computer-on-wheels-but-it-sure-is-fast\">a review in Mountain Bike Rider</a>:</p>\n\n<blockquote><p>The S-Works is the first production bike to debut with the latest version of RockShox’s Flight Attendant Ai suspension. This uses sensors in the SID Ultimate fork, SIDLuxe Ultimate shock, Quarq XX SL power crank, XX SL rear mech and XX shifters to build a comprehensive ride ‘picture’. It then automatically switch the fork and shock between open, pedal and lock modes depending on incoming impacts, bike orientation, pre-emptive shift signals and rider referencing ‘effort states’.</p></blockquote>\n\n<p>And from <a href=\"https://flowmountainbike.com/tests/rockshox-flight-attendant-vs-fox-live-valve-review/\">Flow Mountain Bike</a>:</p>\n\n<blockquote><p>Flight Attendant is comprised of two primary components: a fork module and a rear shock module. The fork module sits atop a special Charger damper that comes inside a Pike, Lyrik or Zeb, while the shock module is built into the piggyback reservoir of a Flight Attendant-specific Super Deluxe Ultimate shock. These two modules communicate wirelessly, and decide whether the suspension should be in one of three predetermined compression settings: Open, Pedal or Lock.</p>\n\n<p>The system makes these decisions based on input provided by an array of sensors. Inside the fork and shock modules you’ll find an accelerometer and an inclinometer, which allows the bike to detect both bump forces and pitch. There’s also a sensor within the crank spindle to detect if you’re pedalling or coasting.</p>\n\n<p>With this combination of sensors, Flight Attendant builds a picture of the terrain and the rider’s pedalling input. Based on that picture, it automatically adjusts the suspension to the ideal setting. Put simply, it’s designed to firm up the suspension to improve pedal efficiency on the climbs and along smoother terrain, while allowing the suspension to open up for the descents and on rougher trails. And all without your hands ever having to leave the grips.</p></blockquote>\n\n<p>And does it work? Again from Mountain Bike Rider:</p>\n\n<blockquote><p>In fact I’d actually say RockShox’s claimed 1.8% faster over a 90 minute event is an underestimation for most riders. Even XC GOAT Nino Schurter found the Flight Attendant changed modes over four times more often (1,325 switches rather than 300) than he normally would with a manual lockout. That experiment also ended in the first of several World Cup wins for SID Flight Attendant prototypes in 2023 including some by Victor Koretsky on a modified version of the previous Epic Evo.</p></blockquote>\n\n<p>A lot of that is MTB jargon but I hope you get the jist. What I couldn’t find is any evidence that Flight Attendant or any of the similar systems are actually using AI or machine learning to assist with these adjustments. I did find this article on Pinkbike about <a href=\"https://www.pinkbike.com/news/shimano-files-patent-detailing-machine-learning-for-automatic-suspension-control.html\">Shimano’s plans for a suspension system that a rider can train</a>.</p>\n\n<blockquote><p>Automatic control of suspension itself is nothing new. Fox Live Valve, RockShox Flight Attendant and more recently, SR Suntour’s TACT suspension products have been automatically adjusting suspension damping, with varying levels of success, for a good number of years now. However, the programming behind the function of these products is relatively fixed. There is no scope for the rider to give the system feedback on its performance. It can’t “learn” what the rider’s preferences are.</p></blockquote>\n\n<p>It could be that the Olympic riders are using pre-market prototypes that use machine learning to adapt to individual rider preferences, but I don’t know. I’d love to hear from folks out there if you know any more details!</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/2024%20Summer%20Games\">2024 Summer Games</a> · <a href=\"https://kottke.org/tag/cycling\">cycling</a> · <a href=\"https://kottke.org/tag/Olympic%20Games\">Olympic Games</a> · <a href=\"https://kottke.org/tag/sports\">sports</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/08/how-technology-is-making-olympics-mountain-bikers-faster\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"7f69ddee51b7f6aa289ff0b53d849bf0b11e4ff70c10476b728575cb44b55fca","category":"default"}