{"title":"1984 review","link":"https://blog.webb.page/2017-09-03-1984-review.txt","date":1504396800000,"content":"<p>The first half of this book was gripping and the second half was unpleasant to\nme, but I had to see how it ended.</p>\n<p>1984 is an oft-referenced book when tech writers and privacy-conscious people\ntalk about governmental encroachment upon citizens' privacy and abuses of power\nto obtain private information. And Facebook (haven't been a fan for some time).\nBy the way, there's going to be slight spoilers moving forward…</p>\n<p>Get ready!</p>\n<p>The story follows a man, Winston Smith, living in what could only be called a\n\"negative utopia\" in the year 1984 (the book was published in 1950). The\ncountry he lives in, Oceania, is controlled by the Party and the Party quite\nliterally rewrites history. As far as anyone knows, the Party invented\nsteamboats and airplanes and everything else. Those born before the formation\nof the Party know the truth but it doesn't matter. Questioning otherwise\nresults in sure death. Winston's only purpose in life is to rewrite facts\nwhenever the Party deems it necessary. If there was a speech in which the Party\nclaimed something and recorded facts said otherwise, those recorded facts (in\nthe form of newspapers, books, video, &amp;c) were subsequently destroyed and teams\nof people would recreate the aforementioned media to \"prove\" the Party was and\nalways is right in all things.</p>\n<p>Prime example: in the beginning of the story, Oceania was at war with Eurasia\nand Eastasia was their ally…only, the opposite was declared later at a war\nrally <em>mid-speech</em> and the populace went with it. \"The enemy\" tricked people\ninto putting up posters of their enemy instead of their ally and that \"proved\"\njust how diabolical they were (nevermind the fact that thousands of people were\n<em>just</em> cheering for Oceania and Eastasia). Winston and everyone else in the\nOuter Party worked several 16 hour days to remove any mention of prior facts.\nKnowing something to be false, yet believing in it anyway is referred to as\n<em>doublethink</em>. If the Party said 2 + 2 = 5, <em>you'd better believe it, or else</em>.</p>\n<p>Citizens caught by the Thought Police for <em>crimethink</em> (anything remotely\nnegative about or opposing the principles of the Party or \"Big Brother\") get\nsent to a building called \"Ministry of Love\", where they are tortured and\nstarved before being mentally broken down so brainwashing can take hold. Once\nthese people are released, they \"live\" out their lives doing menial work before\neventually getting a bullet in the back of their head.</p>\n<p>I don't think I'm doing a good job selling you on this book, especially\nconsidering how I mentioned how unpleasant I found the second half. Bear with\nme here. There was <em>one</em> neat thing and that was the creation of a new\nlanguage, <em>Newspeak<a href=\"https://en.wikipedia.org/wiki/Newspeak\">1</a></em>, which dealt with the merging of words (and eradication\nof others) to simplify English. Of course, any words that might inspire a\nrevolution of some sort were abolished (as well as the concept of freedom).\nCan't have people using a language created by the Party to overthrow them.\nTalk about a slap in the face!</p>\n<p>Similarities of American society today and the dystopia of Oceania weren't\ndifficult to see. In fact, they jumped out at me. Fake news, alternative facts,\nand blind followers of Drumpf<a href=\"https://youtu.be/DnpO_RTSNmQ?t=20m53s\">2</a> who regularly engage in doublethink. Quite\nfrankly, I found it terrifying. Thankfully, we don't live in a world where the\ndepressing society of Oceania could thrive. No one entity has control over data\nand knowledge (doesn't stop 'em from trying though). If nothing else, 1984\nserves as a cautionary tale of what <em>could</em> happen if everyone lost their damn\nminds and subsequently decided they didn't care.</p>\n<p>If you like reading about oppressive dystopias, 1984<a href=\"http://amzn.to/2vUVoiH\">3</a> is the book for you. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"7f7664773965ad0fb2e4bbf92c09a6211b20d8634a9e3d412acaac049a54a93e","category":"Sites"}