{"title":"The Shape of Wonder: N.J. Berrill on the Universe, the Deepest Meaning of Beauty, and the Highest Form of Faith","link":"https://www.themarginalian.org/2024/09/09/berrill-emerging-mind/","date":1725899507000,"content":"<h3>“We, each of us, you and I, exhibit more of the true nature of the universe than any dead Saturn or Jupiter.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/gp/product/B0000CK2XP/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"471\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/manssemergingmind_berrill.jpg?fit=320%2C471&amp;ssl=1\" alt=\"The Shape of Wonder: N.J. Berrill on the Universe, the Deepest Meaning of Beauty, and the Highest Form of Faith\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/manssemergingmind_berrill.jpg?w=666&amp;ssl=1 666w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/manssemergingmind_berrill.jpg?resize=320%2C471&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/manssemergingmind_berrill.jpg?resize=600%2C883&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/manssemergingmind_berrill.jpg?resize=240%2C353&amp;ssl=1 240w\" /></a></p><p>Looking back on her trailblazing work, which confirmed the existence of dark matter, astronomer Vera Rubin reflected: “I sometimes ask myself whether I would be studying galaxies if they were ugly… I think it may not be irrelevant that galaxies are really very attractive.” </p>\n<p>Far from a mere diversion of the senses, beauty may just be the dialogue between nature and human nature — our most expressive language for loving the universe, for loving ourselves as fractals of the universe, for living <a href=\"https://www.themarginalian.org/uiv-book/\">wonder-smitten by reality</a>. To find something beautiful is to find it interesting and meaningful in some way, often a way we can’t articulate — to render it significant and worthy of attention, to render it a wonder. In all of its forms — the beauty of a willow at night, the beauty of a noble act, the beauty of the imperfect face you love — beauty is what we find and what we create as we move through the world at our most fully human.</p>\n<p>In 1955, the English marine biologist and poetic science writer <strong>N.J. Berrill</strong> (April 28, 1903–October 16, 1996) worked out the ideas that would later bloom into his perspectival masterpiece <a href=\"https://www.themarginalian.org/2024/08/25/n-j-berrill-you-and-the-universe/\"><em>You and the Universe</em></a> on the pages of another book. Despite a title very much a product of its time — a time before Ursula K. Le Guin so brilliant <a href=\"https://www.themarginalian.org/2014/10/17/ursula-k-le-guin-gender/\">unsexed the universal pronoun</a> — <a href=\"https://www.amazon.com/gp/product/B0000CK2XP/?tag=braipick-20\" target=\"_blank\"><strong><em>Man’s Emerging Mind</em></strong></a> (<a href=\"https://search.worldcat.org/title/561839\" target=\"_blank\"><em>public library</em></a>) remains a singular and enduring reckoning with what makes us human, lensed through the majesty and mystery of beauty in all its forms, which pulsates beneath those qualities of mind we associate with terms like <em>soul</em> and <em>spirit</em>.</p>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=680%2C661&amp;ssl=1\" width=\"680\" height=\"661\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=320%2C311&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=600%2C583&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=240%2C233&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=768%2C746&amp;ssl=1 768w\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a></figcaption></figure>\n<p>Aware of himself as an individual unique in the history of a universe he doesn’t fully understand yet living with questions common to “all of us who move and think and feel and whom time consumes,” Berrill writes in the twenty-first chapter, wonderfully titled “The Shape of Wonder”:</p>\n<blockquote><p>I know beauty but I do not know what it means. Keats said that beauty is truth and so did the Greeks, although the one was concerned with loveliness and the others mainly with intellect. I do know that whatever beauty is, whether it is the kind that is woven within the mind itself or is perceived without, on this earth only the human mind can sense it… And inasmuch as we ourselves, in body, brain or mind, are as integral a part of the universe as any star, it makes little difference whether we say beauty lies only in the mind of the beholder or otherwise. We, each of us, you and I, exhibit more of the true nature of the universe than any dead Saturn or Jupiter.</p></blockquote>\n<p>With an eye to the creative impulse that is part of our humanity, part of the true nature of the universe that we refract, he echoes poet Robinson Jeffers’s <a href=\"https://www.themarginalian.org/2019/06/03/robinson-jeffers-sister-mary-james-power/\">moving meditation on moral beauty</a> and adds:</p>\n<blockquote><p>Somehow, as our brains have grown beyond a certain complexity and size, beauty emerged both as perception and as creation. We know it when we meet it and we create it when we can. And we know it in many forms and not only in sublimated senses — we know it when love becomes selfless and solicitude becomes compassion. We see it in moral stature and in hope and courage. We see it whenever the transcending quality of growth is clear and unmistakable, knowing that only in such growth do we find our own individual happiness.</p></blockquote>\n<p>Berrill considers one thing beauty shares with love (which both share with the first of <a href=\"https://www.themarginalian.org/2018/06/04/william-james-varieties-consciousness/\">William James’s four features of transcendent experiences</a>):</p>\n<blockquote><p>We can express them with words but cannot define them — we can only say that this and this are included but that is not, and wordlessly we all recognise the truth of it. Speech is limited, no matter what the language…. For in our hearts we understand more than we can possibly talk about.</p></blockquote>\n<p>A century after Walt Whitman <a href=\"https://www.themarginalian.org/2022/04/29/walt-whitman-kosmos-dustin-yellin/\">called himself a “kosmos”</a> and insisted that <a href=\"https://www.themarginalian.org/2019/10/19/lia-halloran-walt-whitman-universe-in-verse/\">“every atom belonging to me as good belongs to you,”</a> Berrill intimates that this ineffable knowledge is a way of knowing ourselves, of anchoring ourselves to time and meaning as we evolve over the course of a lifetime and face our finitude. In consonance with Annie Dillard’s piercing insistence that <a href=\"https://www.themarginalian.org/2013/06/07/annie-dillard-the-writing-life-1/\">“how we spend our days is, of course, how we spend our lives,”</a> he writes:</p>\n<blockquote><p>Your day’s activity, mental and physical, is a part of you and by extension you are all that you have ever been — like an unfinished symphony.</p>\n<p>[…]</p>\n<p>I believe… that during the closing notes of an individual life the question, if any, should be not do I have an immortal soul and what comes next, but how much of a soul have I grown? Whether individual consciousness persists at all… all that lives, all that has lived, retains its value and its meaning… I believe the past lives, that the present is eternal, and the future immanent; that we take it as an indivisible whole and that our obsession with the sweep and drama of history, our probing with fossils and other symbols of time, and our efforts to constructs theories of evolution of life and matter, are all in keeping with the craving to recreate in the human mind the unity of the universe in all its dimensions. The fact that we are so concerned and make such attempts to do this is much more significant than the results we may obtain. Space and time unite in the mind, in the organism, and in the universe as one all-inclusive whole.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/OfraAmit_6Symmetry.jpg\" width=\"1200\" height=\"1166\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a></figcaption></figure>\n<p>It is with this awareness that the Nobel-winning quantum pioneer Erwin Schrödinger made his koan-like deathbed insistence that <a href=\"https://www.themarginalian.org/2021/11/03/erwin-shcrodinger-my-view-of-the-world/\">“this life of yours which you are living is not merely a piece of the entire existence, but is in a certain sense the whole.”</a> Beauty, Berrill suggests, is how we rise out of our transient individual lives to contact this transcendent wholeness, to trust it and thus to trust ourselves. As such, it is a form of faith — the faith we most need to fully inhabit our lives, entwined as they are in that <a href=\"https://www.themarginalian.org/2015/03/18/martin-luther-king-letter-from-birmingham-city-jail/\">“inescapable network of mutuality.”</a> </p>\n<p>Berrill writes:</p>\n<blockquote><p>We need faith, a faith in ourselves as human beings and not as members of this or that race or religion or state or class of society. We need no faith in supernatural forces. We need only to recognise that our knowledge of the universe through our senses and our knowledge of the universe through our own inward nature show that it is orderly, moral and beautiful, that it is akin to intelligence, that love and hope belong in it as fully as light itself, and that the power and will of the human mind is but a symptom of reality; that we, when we are most human, most rational, most aware of love and beauty, reflect and represent the spirit of the universe. That should be enough.</p></blockquote>\n<p>And isn’t the sense of enough <a href=\"https://www.themarginalian.org/2014/01/16/kurt-vonnegut-joe-heller-having-enough/\">the triumph of life</a>?</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"7f8b4701c3d013e3a73dab30c09790f46b24ae7d10aa48d372abb2bcce718f2e","category":"Sites"}