{"title":"Cordyceps, the Carpenter Ant, and the Boundaries of the Self: The Strange Science of Zombie Fungi","link":"https://www.themarginalian.org/2024/03/09/cordyceps-ant/","date":1710023324000,"content":"<h3>“It is likely that fungi have been manipulating animal minds for much of the time that there have been minds to manipulate.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Entangled-Life-Worlds-Change-Futures/dp/052551032X/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"493\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?fit=320%2C493&amp;ssl=1\" alt=\"Cordyceps, the Carpenter Ant, and the Boundaries of the Self: The Strange Science of Zombie Fungi\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?w=973&amp;ssl=1 973w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?resize=320%2C493&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?resize=600%2C925&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?resize=240%2C370&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/entangledlife.jpg?resize=768%2C1184&amp;ssl=1 768w\" /></a></p><p>“The mind is its own place,” Milton <a href=\"https://www.themarginalian.org/2014/02/13/william-blake-paradise-lost/\">wrote</a> in <em>Paradise Lost</em>, “and in it self can make a Heav’n of Hell, a Hell of Heav’n.” While this is psychologically true — the mind is, after all, <a href=\"https://www.themarginalian.org/2023/06/20/the-experience-machine-andy-clark/\">how consciousness renders reality</a> — it is not always physiologically true: The brain and body out of which the mind arises are a physical system, contiguous with every physical force and process that touches it, permeable to myriad invasions and reconfigurations that alter the system and thus transform the mind into a wholly different place. </p>\n<p>Nowhere is this haunting vulnerability to transformation starker than in the case of the fungus <em>Ophiocordyceps unilateralis</em> and the mind of the carpenter ant, challenging our most elemental intuitions about agency, about autonomy, about what a self is. </p>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?resize=680%2C430&amp;ssl=1\" width=\"680\" height=\"430\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?resize=320%2C202&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?resize=600%2C379&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?resize=240%2C152&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/cordyceps_ant.jpg?resize=768%2C485&amp;ssl=1 768w\" /></p>\n<p>Part of a group known as “zombie fungi,” <em>Ophiocordyceps</em> hijacks an insect, driving it to disperse the fungus’s spores at the price of its own life. In his altogether fascinating book <a href=\"https://www.amazon.com/Entangled-Life-Worlds-Change-Futures/dp/052551032X/?tag=braipick-20\" target=\"_blank\"><strong><em>Entangled Life: How Fungi Make Our Worlds, Change Our Minds &amp; Shape Our Futures</em></strong></a> (<a href=\"https://search.worldcat.org/title/1127137515\" target=\"_blank\"><em>public library</em></a>), mycologist Merlin Sheldrake details this sinister puppet show of biochemistry:</p>\n<blockquote><p>Once infected by the fungus, ants are stripped of their instinctive fear of heights, leave the relative safety of their nests, and climb up the nearest plant — a syndrome known as “summit disease.” In due course the fungus forces the ant to clamp its jaws around the plant in a “death grip.” Mycelium grows from the ant’s feet and stitches them to the plant’s surface. The fungus then digests the ant’s body and sprouts a stalk out of its head, from which spores shower down on ants passing below. If the spores miss their targets, they produce secondary sticky spores that extend outward on threads that act like trip wires. </p>\n<p>Zombie fungi control the behavior of their insect hosts with exquisite precision. <em>Ophiocordyceps</em> compels ants to perform the death grip in a zone with just the right temperature and humidity to allow the fungus to fruit: a height of twenty-five centimeters above the forest floor. The fungus orients ants according to the direction of the sun, and infected ants bite in synchrony, at noon. They don’t bite any old spot on the leaf’s underside. Ninety-eight percent of the time, the ants clamp onto a major vein.</p></blockquote>\n<p>Because the marks left on leaf veins by these death-bites are so distinct, evidence of them can be found in the fossil record as far back as the Eocene, nearly fifty million years ago — the dawn of modern fauna, a time when forests covered the Earth from pole to pole. Sheldrake reflects:</p>\n<blockquote><p>It is likely that fungi have been manipulating animal minds for much of the time that there have been minds to manipulate.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2014/07/07/best-illustrations-alice-in-wonderland/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/06/tovejansson_alice7.jpg?w=600&amp;ssl=1\" /></a><figcaption>Art by <em>Moomins</em> creator Tove Jansson for <a href=\"https://www.themarginalian.org/2014/07/07/best-illustrations-alice-in-wonderland/\">a rare 1966 edition</a> of <em>Alice’s Adventures in Wonderland</em></figcaption></figure>\n<p>But unlike <a href=\"https://www.themarginalian.org/2016/08/10/i-contain-multitudes-ed-yong/\">the mind-controlling parasite that drives wasps to abandon their colonies</a>, <em>Ophiocordyceps</em> seems to manipulate the mind through the backdoor of the body: Research indicates that the fungus may not have a physical presence in the ant’s brain, instead secreting chemicals that activate the ant’s muscles and steer its central nervous system (which we now know is <a href=\"https://www.themarginalian.org/2021/12/24/feeling-knowing-damasio/\">the evolutionary underpinning of consciousness</a>).</p>\n<p>Couple with <a href=\"https://www.themarginalian.org/2018/07/11/how-to-change-your-mind-michael-pollan/\">the new science of how fungi are altering human minds</a>, then revisit Lewis Thomas’s magnificent meditation on <a href=\"https://www.themarginalian.org/2018/10/25/lewis-thomas-the-medusa-and-the-snail-self/\">how the relationship between a jellyfish and a sea slug illuminates the mystery of the self</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"80de76aa9c18244308b26bb8d1ac449556d6722f0a86f5eb0f2a17886bdd6f24","category":"default"}