{"title":"Why I let go of my U.S. citizenship","link":"https://sive.rs/xus","date":1681948800000,"content":"<p>\nI forbid myself from anything too tempting or addicting.\nI keep no cookies in my home.\nTo prevent myself from falling off the wagon, I strap myself to the mast.\n</p><p>\nI was born in California, and lived the first forty years of my life in America.\nBut I wanted to challenge myself to live in the rest of the world - to get to know it deeply - so that many countries would feel like home.\n</p><p>\nIt was a nice idea, but as soon as times abroad got a little tough, I’d move back to my comfort zone.\n<strong>\nAmerica felt like an addiction.\n</strong>\n</p><p>\nSo I decided to ban myself from returning - to burn the ships.\n</p><p>\nThere’s a legend of a military leader with a hundred men in a few ships that landed on enemy shores.\nBut waiting on land were a thousand enemy soldiers.\nSo as soon as his men disembarked, the leader ordered them to <strong>burn the ships, to prevent retreat</strong>.\n</p><p>\nFor years I thought about this story and the idea of letting go of my U.S. citizenship as a way of burning my ships and preventing my retreat.\nEventually I followed my life’s motto of “<a href=\"https://sive.rs/scares\">whatever scares you, go do it</a>”, then showed up to the U.S. embassy in Singapore, filled out the forms, and became an ex-citizen.\n</p><p>\nIf you suspect I was doing it for tax reasons, no.\nMy taxes went up, not down, since all of my income is from the U.S.\nThe IRS gets at least 30% of everything I earn, and will for the rest of my life.\n</p><p>\nI really was just forcing myself forward into the world.\nAnd it’s worked.\nNew Zealand, Singapore, England, and India are my legal and emotional homes now.\nHopefully more to come.\n</p><p>\nSince I left in 2010, I’ve only visited America for a few days.\nI don’t have the right to enter.\nThere’s always a chance I might never see my family again.\nBecause of that, <strong>I often regret it</strong>.\nIt’s usually best to keep options open.\n</p><p>\nI’ve kept this a secret for twelve years because I didn’t want to be attacked by those who might mistake my adventuring as insult.\nBut now it seemed better to just explain.\n</p><p><em>\nFor another side to this story, see “<a href=\"https://sive.rs/left\">Why I left America</a>”.\n</em></p>\n<img src=\"/images/DerekSivers-passport.jpg\" alt=\"Derek Sivers passport\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"8197e56109506298b2f7a9058d9e2e180093af437b591bd234f44b5cb0112cfe","category":"Sites"}