{"title":"From here to Harrison Bergeron via AirPods and transparency mode","link":"https://interconnected.org/home/2024/12/10/transparency","date":1733826960000,"content":"<div>\n<p>In Kurt Vonnegut’s 1961 sci-fi short <a href=\"https://en.wikipedia.org/wiki/Harrison_Bergeron\">Harrison Bergeron</a> <em>(Wikipedia)</em> it is the year 2081 and <em>\"everybody was finally equal.\"</em></p>\n<blockquote>\n<p>Nobody was better looking than anybody else. Nobody was stronger or quicker than anybody else.</p>\n</blockquote>\n<p>How? The United States Handicapper General takes care of it.</p>\n<blockquote>\n<p>Hazel had a perfectly average intelligence, which meant she couldn’t think about anything except in short bursts. And George, while his intelligence was way above normal, had a little mental handicap radio in his ear. He was required by law to wear it at all times. It was tuned to a government transmitter. Every twenty seconds or so, the transmitter would send out some sharp noise to keep people like George from taking unfair advantage of their brains.</p>\n</blockquote>\n<p><a href=\"https://www.tnellen.com/cybereng/harrison.html\">Here’s the full story</a>, it’s great, you should read it, it’ll take you like 9 minutes.</p>\n<p>ANYWAY.</p>\n<p>iOS 18.2 is shipping this week, and with it Apple will activate the Hearing Test functionality for AirPods Pro 2 in the UK.</p>\n<p>This in turn enables <a href=\"https://support.apple.com/en-gb/120992\">Hearing Assistance</a>, which means I can use my AirPods as hearing aids. Good news.</p>\n<p>My everyday hearing doesn’t (yet) require hearing aids. But I have a trance techno shaped hole from the 90s, the high end is done in from covid, and I wear earplugs to the cinema because I can’t see the pictures if I don’t knock 20 decibels off the sound.</p>\n<p>So I’m looking forward to having a bit of a compensatory boost from the wearables I already wear every day.</p>\n<p>That said, they do already have transparency mode, which is when you keep your earphones in and they proxy in external sound using tiny microphones. (Hearing aids are transparency mode plus computational adjustment from the hearing test.)</p>\n<p>And people can’t tell that you’re using it, even though you can have a conversation just fine, which means I get looks like I’m being rude when I use transparency mode to order coffee or whatever. So I end up taking my AirPods out anyhow, to be polite.</p>\n<p><em>(Obviously the next generation of AirPods should be literally transparent when transparency mode is active, like the <a href=\"https://nothing.tech/products/ear-2\">Nothing Ear range</a>. You’d be able to see the circuitry and components inside. Then when you switch them back to regular mode, they would dynamically go opaque - the same look as the current model - using electrically-triggered <a href=\"https://en.wikipedia.org/wiki/Smart_glass\">LCD smart glass</a>, perhaps with an e-ink style technology so they’re not always drawing current.)</em></p>\n<p>Also one day I’m hoping that future Vision Pro Eyeglasses will have a similar kind of compensatory boost for face blindness.</p>\n<p>Everyone would be made to look highly memorable by exaggerating their grossest features or putting them in costume, like street artist caricatures or programmatic <a href=\"https://www.charlesbonnetsyndrome.org/index.php/news/48-i-see-little-people-lilliputian-visions-in-charles-bonnet-syndrome-2\">Charles Bonnet Syndrome</a>.</p>\n<hr />\n<p>So I look forward to the coming era of everyday cyborgs.</p>\n<p>(We’re on the shallow end of the exponential. <a href=\"https://interconnected.org/home/2020/07/13/secret_cyborgs\">Pro golfers are already secret cyborgs</a> (2020). And what is Ozempic but a cyborg adaptation?)</p>\n<p>But in the spirit of predicting <a href=\"https://interconnected.org/home/2024/10/24/soup\">not just the automobile but the traffic jam</a>, what happens when ten thousand everyday cyborg prostheses are just… the everyday? What could go wrong?</p>\n<p>You can see how a well-meaning woke resurgence could be simultaneous with a new spirit of authoritarianism; then a misplaced urge to enforce equality could arise – perhaps extreme pressure on the job market caused by AI and rumours of in-utero CRISPR fiddling used to lock in secret, artificial genetic advantage for the rich. Then there’s public support for putting this through the courts, and in the same way that you’re not allowed to ask certain questions in an interview, next we all have to look the same over video calls, to reduce bias there too; and then the state always reaches for technology capabilities with centralised controls… and well, the cyborg compensators are right there, everyone has them already…</p>\n<p>And by 2081 we’ve inched our way, step by logical step, to a society where our everyday cyborg prostheses are used to bind us instead of letting us bound ahead.</p>\n<p>Hey that’s a good premise for a sci-fi short.</p>\n<p>Oh it’s been done already I forgot.</p>\n\n  <hr />\n\n\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/glimpses-of-our-cyborg-future\">glimpses-of-our-cyborg-future</a>\n\t(14).\n\t\n\t</small></p>\n\n\n  <p><small>Auto-detected kinda similar posts:</small></p>\n  <ul>\n  \n  <li><small><a href=\"https://interconnected.org/home/2019/07/04/attention_correction\">A lengthy ramble through many responses to that FaceTime Attention Correction tweet</a>\n  (4 Jul 2019)</small></li>\n  \n  <li><small><a href=\"https://interconnected.org/home/2021/01/08/transparency_mode\">Headphones need smart transparency mode with voice recognition</a>\n  (8 Jan 2021)</small></li>\n  \n  <li><small><a href=\"https://interconnected.org/home/2021/11/19/airpods\">AirPods, and the cognitive ergonomics of tools for thought</a>\n  (19 Nov 2021)</small></li>\n  \n  </ul>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"81bd477f95e512b781a23eaa779a785ae56563828530e7e13314988a8b00e13a","category":"Sites"}