{"title":"Weird","link":"https://www.usv.com/writing/2024/01/weird/","date":1704903234000,"content":"<p>The proliferation of generative AI has opened up a brand new frontier of exploration for consumer internet entrepreneurs, particularly those looking to build new types of networks around social media and communications. </p>\n\n\n\n<p>When we talk about social media as it currently exists, we think about <a href=\"https://jaredhecht.com/2023/07/13/wtf-is-social-media/\">algorithmically organized feeds that present to us different forms of media</a>: photos, videos, text, etc. For the past several years it has felt as if innovation and fun stalled. No new form factors meant content consumption was largely relegated to the mobile screen, and the algorithms coaxed creators into generating the type of content that would be most rewarded. With the advent of generative AI tools both closed and <a href=\"https://www.usv.com/writing/2023/10/open-source-the-ai-stack-and-need-for-permissionless-experimentation/\">open source</a>, builders have access to an entirely new toolbox to unleash creativity. </p>\n\n\n\n<p>There’s a linear approach to thinking about how events will unfold here: generative AI will be applied to the interfaces we are most familiar with today. What would Instagram look like if it started with “AI filters”? What if we could interact with AI chatbots in our messengers? We are already beginning to see this happen. This type of evolution is inevitable, and the obvious incrementalism will quickly make its way into incumbent applications. It is not enough to reinvent the consumer social landscape as we have come to know it. </p>\n\n\n\n<p>In order to break through and create new social applications in the age of AI, we need to get weird. The services that ultimately go mainstream always start off a little bit fringe. They push us to share new things in new ways that may make us feel uncomfortable at first: a bootleg music video, a thought we have long kept secret, an intimate photograph. This type of discomfort is an early feature. </p>\n\n\n\n<p>There are a slew of novel things emerging that may make us feel this way, like the <a href=\"https://replika.com/\">ability to have a relationship with an AI</a> of our own creation or <a href=\"https://glif.app/glifs\">generatively remixing photographs with friends and finding new ways to incept memes</a>. These are new behaviors and they’re just the tip of the iceberg. What happens when the AI characters we create begin to chat with each other behind our backs? What happens if web3 rails enable the person who incepts a new viral meme within a network to be remunerated? Network effects have historically occurred when new members or nodes are added. Will the same be true as high quality AIs are added? There are infinite new paradigms to be explored and plenty of weird to go around. </p>\n\n\n\n<p>USV was born at the dawn of Web2 which led to the emergence of today’s dominant social and communications networks. We are now entering a new era, and the emergence of AI gives us a brand new canvas to push the boundaries of what we’ve become comfortable with and we are here for it. Let’s get weird.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/01/weird/\">Weird</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"82b628a84467d4c9ca7218be05d9768a783ba084db5e8e0c934005cb630568ef","category":"default"}