{"title":"What I did belies why","link":"https://sive.rs/ww","date":1569456000000,"content":"<p>\nImagine you host a dinner party with two doctors and two accountants.\nYou introduce the doctors to each other and the accountants to each other, assuming they’d have the most in common.\n</p><p>\nBut actually one doctor got into it because her mother died unnecessarily of medical neglect, and she’s on a mission to make sure that never happens again.\nThe other doctor is in it for the money.\n</p><p>\nAnd actually one accountant got into it because her dad’s family business was the victim of embezzling, and she’s on a mission to make sure that never happens again.\nThe other accountant is in it for the money.\n</p><p>\n<strong>\nYou can’t assume the reasons why people are doing what they do.\n</strong>\n</p><p>\nI learned this slowly and uncomfortably after I sold my music distribution company.\nKnowing I had a successful exit, people assumed I was an entrepreneur, and wanted me to tell them how to be a better entrepreneur.\nThey asked me to mentor at business schools, where people would bring in PowerPoint presentations showing their financial projections, and talk about raising rounds of financing, and all this stuff I had never dealt with and knew nothing about.\n</p><p>\nIt took me a long time to realize that, like the doctor and accountant story, I must have looked like an entrepreneur from the outside.\n<strong>\nYes I founded, grew, and sold a company.\nBut really all I wanted to do was to help musicians.\n</strong>\nI could have done it by promoting concerts, or being a record producer, or donating to a musicians’ charity — but in my case I built a distribution system for those who had no other distribution.\nSo technically yes, I was an entrepreneur, but it seems I didn’t have much in common with all these entrepreneurs I was meeting.\n(When I met musicians, it was always such a welcome relief!)\n</p><p>\nI still think of everything I do as art, not business.\nIt’s personal expression, creative exploration, testing out ideas just to see what happens.\n</p><p>\nWriting a song isn’t that different from writing computer code.\nIt’s all just having a little vision or spark of an idea, then seeing how you can make it happen — for its own sake.\n</p><p>\nStarting a band isn’t that different from starting a company.\nIt’s something you do when you’re unable to make your creative vision happen by yourself.\n</p><p>\nI’ve never done anything just for the money.\nIt’s always been secondary, and always just happened as a side-effect of following my interests.\nSo I don’t have any advice for people who are trying to make money.\nI don’t know what that’s like.\n</p><p>\n<strong>\nThis is the main reason I stopped doing interviews four years ago.\n</strong>\nMost interviewers just seemed to want to ask my business advice.\nI’m feeling ready to do interviews again, as long as we can talk about creativity, identity, exploration, learning, unlearning, communication, cycling, culture, psychology, and all kinds of other things.\nBut I’m not up for talking about business.\n</p><p>\nDon’t confuse the medium with the message.<br />\nDon’t confuse the tool with the goal.<br />\nDon’t confuse the vehicle with the path.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"83b57dfa544f80bf8dbdd85d46e0900b70bc9245640b004a70d3b80149316d37","category":"default"}