{"title":"BeachfrontDigital — June Update","link":"https://blog.webb.page/2017-06-13-beachfront-digital-june-update.txt","date":1497312000000,"content":"<h2>Upcoming Features</h2>\n<p>Over the past month, I've gotten great feedback and some users have added a\n<em>lot</em> of domains to Beachfront. But, wouldn't it be nice if you could <em>manage</em>\nyour domains? I'm still hard at work on implementing domain purchasing but as I\nwrite this I realize it might've been better to implement domain <em>management</em>\nfirst…oh well.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/beachfront-digital-june-update-b.png\">Searching for domains on BeachfrontDigital</a></p>\n<p>In any event, domain management will be pretty easy <em>even if you don't</em> buy\nyour domains from Beachfront (my pricing isn't the most competitive at the\nmoment). Adjust your domain's DNS settings to my dedicated DNS servers and\nyou'll be able to make further edits from your BD account. Domain renewals and\ntransfers will come after that. And then after <em>that</em>, the real fun starts and\nI can get started on helping you get rid of domains you don't need anymore. 😉\nThis'll be a multi-tiered strategy/process, stay tuned!</p>\n<h2>Continued Improvement</h2>\n<p>I've identified low-hanging fruit thanks to a combination of early feedback and\nlittle things I've observed here and there.</p>\n<p><em>-- 2017/06/29 update start --</em></p>\n<p>New users will get both an intro email <em>and</em> a login link in a separate email.\nI initially wanted the new user to be automatically logged in but wasn't able\nto figure out how to do such a thing with Passwordless. So, this is the\ncompromise I came up with. Besides, it's kinda like verifying one's account.\nRight? <em>Right?</em></p>\n<p>In your account settings, there's now an option to choose whether you want to\nlogin via a tokenized link (default method) or via copy/pasting a token into\nthe page that pops up on Beachfront if you have that option selected (that was\na mouthful).</p>\n<p>Options are a beautiful thing to have.</p>\n<p><em>-- 2017/06/29 update end --</em></p>\n<h2>Logo!</h2>\n<p>Creating icons or logos is not easy and it often takes quite a bit of time for\nme to 1) think of something, 2) create it, and 3) like the output. I'm pleased\nto say I've done just that for BeachfrontDigital!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/beachfront-digital-june-update-a.jpg\">New BeachfrontDigital logo!</a></p>\n<p>I started with 48px and worked my way up. In the coming weeks, I'll update the\nsite and Twitter account<a href=\"https://twitter.com/@BeachfrontD\">1</a> with it. I like this so much, I feel like I should\nget some t-shirts made…maybe later this year, haha.</p>\n<h2>End</h2>\n<p>And there you have it! My goal is to send at least one newsletter a month to\nlet y'all know how development is going. Stay rad! 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"83c95d4e879d4542afc8965a7ad9d980dfdd5a674eac61e3b6c9e33eff28f03d","category":"Sites"}