{"title":"I’m a very slow thinker","link":"https://sive.rs/slow","date":1472169600000,"content":"<p>\nWhen a friend says something interesting to me, I usually don’t have a reaction until much later.\n</p><p>\nWhen someone asks me a deep question, I say, “Hmm. I don’t know.”\nThe next day, I have an answer.\n</p><p>\nI’m a disappointing person to try to debate or attack.\nI just have nothing to say in the moment, except maybe, “Good point.”\nThen a few days later, after thinking about it a lot, I have a response.\n</p><p>\nThis probably makes me look <a href=\"https://sive.rs/ss\">stupid</a> in the moment, but I don’t mind.\nI’m not trying to win any debates.\n</p><p>\nIn fact, I’ll tell you a secret.\nWhen someone wants to interview me for their show, I ask them to send me some questions a week in advance.\nI spend hours writing down answers from different perspectives, before choosing the most <a href=\"https://sive.rs/counter\">interesting</a> one.\nThen when we’re in a live conversation, I try to make my answers sound spontaneous.\n</p><p>\nPeople say that your first reaction is the most honest, but I disagree.\n<strong>\nYour first reaction is usually outdated.\n</strong>\nEither it’s an answer you came up with long ago and now use instead of thinking, or it’s a knee-jerk emotional response to something in your past.\n</p><p>\nWhen you’re less impulsive and more deliberate like this, it can be a little inconvenient for other people, but that’s OK.\nSomeone asks you a question.\nYou don’t need to answer.\nYou can say, “I don’t know,” and take your time to answer after thinking.\nThings happen.\nSomeone expects you to respond.\nBut you can say, “<a href=\"https://sive.rs/horses\">We’ll see</a>.”\n</p><p>\nAnd maybe, through example, you can show them that they can do the same.\n</p>\n<img src=\"/images/treetroll.jpg\" />\n<div>(Tree sculpture by <a href=\"http://kimbeatonstudios.com/\">Kim Beaton</a>.)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"84fa09cb3be5ec93e7c3eac846242ac65150f43d866304fb6f485cd162f2ff3c","category":"default"}