{"title":"Ok hear me out iPhones should have a sense of shame","link":"https://interconnected.org/home/2024/10/03/shame","date":1727985720000,"content":"<div>\n<p>I was flying (not this trip; I took the train to Amsterdam) and the guy in-front of me didn’t activate airplane mode, just browsed reddit till he lost reception. Then got back on coming down. I glared at him invisibly from between the seatbacks.</p>\n<p>And that’s fine I guess? Like I doubt airplane mode actually <em>matters,</em> planes have got to be pretty well radio-hardened. Do what you want.</p>\n<p>But.</p>\n<p>He was so nonchalant about the whole ignoring-the-safety-instructions thing. I wanted him to at least experience the tut of social disapproval before deciding to break the rules.</p>\n<p>Also,</p>\n<ul>\n<li>playing really loud tiktok on the bus or in restaurants, which is thing that mostly old people do for some reason</li>\n<li>or taking video calls in cafes without headphones</li>\n<li>or, again in cafes but <em>with</em> headphones this time, actually a headset with a mic, and bringing an actual whole laptop stand and typing like you’re beating a man to death, which super harshes the energy simply by proximity</li>\n<li>or making lengthy video recordings at gigs.</li>\n</ul>\n<p>Like, yes, do these things, fine, whatever, it’s like tailgating, ruuuude but you do you.</p>\n<p>Be aware that you’re crashing through some norms or another?</p>\n<p>I blame the device in a way. I can’t blame you entirely.</p>\n<p>Your phone is a little libertarian buddy who is whispering in your ear <em>yeah go for it, who’s gonna stop you, might is right.</em></p>\n<hr />\n<p>What I mean is that your phone should be aware that it being utilised in a way which is borderline not ok.</p>\n<p>Perhaps it uses AI to hear and understand it is at a gig. Perhaps it uses a built-in radar chip to understand it’s in a crowd, or the accelerometer to detect it’s on public transport, whatever.</p>\n<p>Then, when you go to play a video of your friend’s screaming kid at top volume at the next table without turning the volume down, again and again and - honestly unbelievably - again, a notification would pop up, and you would have to tap the specially-added People Will Look Hardware Action Button to do it anyway.</p>\n<p>A sense of shame is purely algorithmic here.</p>\n<p>It would have to vary by region I guess. When you travel, your phone would have to norm switch.</p>\n<hr />\n<p>I say shame, I mean your devices have politics.</p>\n<p>There are two ways to deal with the problem of noisy tiktoks on the bus.</p>\n<p>EITHER, as I say, we say it’s your problem: Apple and Google and Samsung and all the rest have to put some kind of social inhibitor in the operating system, a catch that you have to override, and that has to be required by society, legally or by media pressure or something.</p>\n<p>OR, alternatively, it’s my problem: if I don’t like it then it’s my job to do something about it. And in this case we could propose that I wear AirPods with a special kind of transparency mode – all devices should advertise to <em>other</em> devices, using Bluetooth or something, that they’re being noisy, and my AirPods can preferentially filter that out. A more independent and individualist approach.</p>\n<p>Do you see that we’re essentially talking politics here?</p>\n<p>Devices - phones, headphones, whatever - devices are negotiating the conflicting rights of individuals. <em>How</em> that is done is what we call politics.</p>\n<p>I’m not saying that we should build politics into devices.</p>\n<p>I’m saying that devices <em>already</em> embody a certain politics.</p>\n<p>Perhaps this should be debated.</p>\n<hr />\n<p>Being British, of course I am suggesting that phones should, instead of their current rugged individualistic ideology, by default moderate their behaviour using the automatic mechanisms of social pressure, i.e. shame.</p>\n<p>Like I say, if I don’t turn off airplane mode when in-flight, or I light up my whole row to check my messages at a theatre, my phone should detect that, and force me to go through a special notification.</p>\n<p>Other people nearby should get a special tut-tut button they can tap.</p>\n<p>So if I’m being tutted, my phone shouldn’t actually stop doing what it’s doing, that’s my sovereign choice to be flagrant, but it should blush on my behalf.</p>\n<p>We will implement blushing by making the offending phone perform some complex calculation internally which runs the battery super hard so it costs 1% or 2% remaining energy and also the back really heats up, a hot-faced hand-held glass slab social pariah.</p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"854776dceef889e29508a960f957e14ca172f6bab02e38bc323e7df66f6a0258","category":"Sites"}