{"title":"We Talking About Practice","link":"https://kottke.org/24/07/we-talking-about-practice","date":1720454846000,"content":"\n        <p>From Heather Cox Richardson, <a href=\"https://heathercoxrichardson.substack.com/p/june-27-2024\">writing on the night of the debate</a>, a reminder of just how bad Trump’s performance was, a shambolic spectacle that was met with shrugs because that’s what we expect of him:</p>\n\n<blockquote><p>In contrast, Trump came out strong but faded and became less coherent over time. His entire performance was either lies or rambling non-sequiturs. He lied so incessantly throughout the evening that it took CNN fact-checker Daniel Dale almost three minutes, speaking quickly, to get through the list.</p>\n\n<p>Trump said that some Democratic states allow people to execute babies after they’re born and that every legal scholar wanted Roe v. Wade overturned — both fantastical lies. He said that the deficit is at its highest level ever and that the U.S. trade deficit is at its highest ever: both of those things happened during his administration. He lied that there were no terrorist attacks during his presidency; there were many. He said that Biden wants to quadruple people’s taxes — this is “pure fiction,” according to Dale — and lied that his tax cuts paid for themselves; they have, in fact, added trillions of dollars to the national debt.</p></blockquote>\n\n<p>Richardson also quotes <a href=\"https://twitter.com/MoniquePressley/status/1806527221881847898\">Monique Pressley’s debate night tweet</a>, which is perhaps the most crisp and concise summary of the whole thing:</p>\n\n<blockquote><p>The proof of Biden’s ability to run the country is the fact that he is running it. Successfully. Not a debate performance against a pathological lying sociopath.</p></blockquote>\n\n<p>Maybe this is just me, but I immediately thought of <a href=\"https://twitter.com/MoniquePressley/status/1806527221881847898\">Allen Iverson’s response to a question about practice from the media</a>:</p>\n\n<blockquote><p>Listen, we talking about practice. Not a game, not a game, not a game. We talking about practice. Not a game, not the game that I go out there and die for and play every game like it’s my last. Not the game. We talking about practice, man.</p></blockquote>\n\n<p>While he might be fine at blustering his way through debates (practice), Trump, famously, was bad at being president and actually didn’t like the job (the game). Like, we don’t have to imagine how Trump would perform as president because he did the job, poorly &amp; ruinously, for four years. Biden has logged 3.5 years as president and has been very productive on behalf of the American people. We can directly compare them! And their teams! Politics &amp; governance is a team sport, and Trump’s team is a flaming dumpster fire. So let’s stop talking about practice (and <a href=\"https://kottke.org/23/08/focus-on-the-stakes-not-the-odds\">the media’s horse race coverage</a>) and start focusing on the game.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Allen%20Iverson\">Allen Iverson</a> · <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Heather%20Cox%20Richardson\">Heather Cox Richardson</a> · <a href=\"https://kottke.org/tag/Joe%20Biden\">Joe Biden</a> · <a href=\"https://kottke.org/tag/journalism\">journalism</a> · <a href=\"https://kottke.org/tag/Monique%20Pressley\">Monique Pressley</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"8557c7c99f814e01c0e87dfe30a2ff98d20df3725bb8fed7c3d23a9f8645ffae","category":"default"}