{"title":"How we should update our views on immigration","link":"https://feeds.feedblitz.com/~/900382334/0/marginalrevolution~How-we-should-update-our-views-on-immigration.html","date":1719811092000,"content":"<p>I am writing this post on a somewhat bumpy plane ride, so I will try doing it without links.  Most of the relevant sources you can find through perplexity.Ai, or even on MR itself.  Google too.</p>\r\n<p>Overall, I am distressed by the contagion effects when it comes to immigration views.  A large number of people are much more anti-immigration than they used to be, in part because yet others are more anti-immigration.  All sorts of anecdotes circulate.  But let’s look more systematically at what we have learned about immigration in the last ten years or so.  Not all of it should count as pro-immigration, but a lot of it should, with one huge caveat.</p>\r\n<p>When it comes to the wage effects of immigration, there is very modest additional evidence in the positive direction.  I wouldn’t put much weight on that, but it certainly is not pointing in the other direction.</p>\r\n<p>The United States is showing it can have a higher stock of immigrants and also falling crime rates.  I am not suggesting a causal model there, but again that should be more reassuring than not.</p>\r\n<p>There is additional evidence for the positive fiscal benefits of immigrants, including less skilled immigrants.  Some of this is from the CBO, some of it I outlined in a Bloomberg column maybe a month or so ago.  I don’t view those results as major revisions, but again they are not pointing in the wrong direction.</p>\r\n<p>There is reasonable though not decisive macroeconomic evidence that immigrant labor supply was a significant contributor to America’s strong post-pandemic recovery.</p>\r\n<p>If you are a right-winger who was worried that incoming Latinos would vote Democratic in some huge percentage, you can set your mind at ease on that one.  You also can take this as evidence of a particular kind of assimilation.</p>\r\n<p>Fertility rates are falling much more than we had expected, including in the United States.  This makes the case for immigration <em>much</em> stronger.</p>\r\n<p>It is increasingly evident that immigrant-rich Florida and Texas are doing just great.  The picture is decidedly less positive for many parts of California, but I suppose I see evidence that the white Progressive Left is mainly at fault there, not the immigrants. Still, I do think you can make a reasonable argument that immigrants and the Progressive Left interact in a dysfunctional manner.  It is no surprise to me that so many of the leading anti-immigrant voices come from California.</p>\r\n<p>Overall, I am struck by the fact that immigration critics do not send me cost-benefit studies, nor do they seem to commission them.  If the case against immigration is so strong, why aren’t these studies created and then sent to me?  You could have a good one for a few hundred thousand dollars, right?  Instead, in my emails and the like I receive a blizzard of negative emotion, and all sorts of anecdotal claims about how terrible various things are, but never a decent CBA.  I take that to be endogenous.  I think it is widely accepted that America having taken in the people who are now Italian-Americans would pass a cost-benefit test, even though the Mafia ruled New Jersey and Rhode Island for decades.  Somehow people are less keen to apply this same kind of reasoning looking forward, though they are happy to regale you with tales of crimes by current immigrants.</p>\r\n<p>I do see good evidence that trust in American government is falling, but I attribute that mainly to the Martin Gurri effect.  I mean look at the current gaslighters in the White House and in the media — they are not primarily immigrants, quite the contrary.  Or all the Covid mistakes, were they due to “the immigrants”?  I don’t see it.</p>\r\n<p>Now let us look at knowledge updates on the other side of the ledger, namely new knowledge that should make us more skeptical about immigration.</p>\r\n<p>We now see that external hostility to Israel and Taiwan is stronger than we had thought.  So the case for a looser immigration policy in Israel is much weaker than it used to be.  As for Taiwan, they should be more careful about letting in mainland Chinese.  Estonia needs to be more wary about letting in Russians, and indeed they are.  And there might be other countries where this kind of logic applies.  Do I really know so much about the situation between Burundi and Rwanda?  In general, as the level of conflict in the world rises, there will be more of these cases.  It is also a major consideration for anywhere near Ukraine.  Small countries need to worry about this most of all.</p>\r\n<p>I should note this problem does not seem to apply to North America, though you might require tougher security clearances for some jobs currently held by Chinese migrants.</p>\r\n<p>The second issue, and it is a biggie, is that voters dislike immigration much, much more than they used to.  The size of this effect has been surprising, and also the extent of its spread.  I am writing this post on Election Day in France, and preliminary results suggest a very real risk that France ends up ungovernable.  Immigrants are clearly a major factor in this outcome, even under super-benign views that do not “blame” the immigrants themselves at all.</p>\r\n<p>Versions of this are happening in many countries, not just a few, and often these are countries that previously were fairly well governed.</p>\r\n<p>I think it is better for countries in such positions to be much tougher on immigration, rather than to suffer these kinds of political consequences.</p>\r\n<p>But let’s look honestly at the overall revision to our views.  Politics is stupider and less ethical than before, including when it comes immigration (but not only!  Fellow citizens also have become more negative about other fellow citizens of differing views, and I view negativism as the root of the problem all around).  We need to take that into account, and so all sorts of pro-migration dreams need to be set aside for the time being, at least in many countries.  Nonetheless the actual practical consequences of immigration, political backlash excluded, are somewhat more positive than we had thought.  For some smaller countries, however, that may not hold, Israel being the easiest example to grasp but not the only.  In the longer run, we also would like to prepare for the day when higher levels of immigration might resume, even if that currently seems far off.  So we shouldn’t talk down immigration <em>per se</em>.  Instead we should try to combat excess negativism in many spheres of life.</p>\r\n<p>Somehow that view is too complicated for people to process, and so instead they instinctively jump on the anti-immigration bandwagon.  Too much negativism.  But in fact my view is better than theirs, and so they ought to hold it.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html\">How we should update our views on immigration</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/900382334/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/900382334/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/900382334/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/900382334/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/900382334/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/900382334/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comment-160776756\">In reply to Todd K.   Maybe   But even if AI has “better ...</a> <i>by Jsb (Andreas)</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comment-160776755\">In reply to Jsb (Andreas).   Yeah I was right that this would ...</a> <i>by Jsb (Andreas)</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comment-160776665\">In reply to Wondering.   households is the appropriate metric ...</a> <i>by Kyle</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comment-160776577\">In reply to Dave C.   You've made good arguments for expanding ...</a> <i>by Damian</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comment-160776560\">In reply to Richard A..   Low earners get better neighbors ...</a> <i>by Floccina</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/how-we-should-update-our-views-on-immigration.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/yet-another-kind-of-deep-roots.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=yet-another-kind-of-deep-roots\">Deep roots, the persistent legacy of slavery on free labor markets</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/milei-update-3.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=milei-update-3\">Milei update</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/06/testing-for-bird-flu-is-too-slow.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=testing-for-bird-flu-is-too-slow\">Testing for Bird Flu is Too Slow</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"857d8e943dca8131d57fdabcdc2625ce407ec98e2f76244f99cee882bec7fcbb","category":"default"}