{"title":"How Emotions Are Made","link":"https://www.themarginalian.org/2024/02/23/how-emotions-are-made/","date":1708738397000,"content":"<h3>“Emotions are not reactions to the world; they are your constructions of the world.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/How-Emotions-Made-Lisa-Barrett/dp/1328915433/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"482\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?fit=320%2C482&amp;ssl=1\" alt=\"How Emotions Are Made\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?w=996&amp;ssl=1 996w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?resize=320%2C482&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?resize=600%2C904&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?resize=240%2C361&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/howemotionsaremade.jpg?resize=768%2C1157&amp;ssl=1 768w\" /></a></p><p>“A purely disembodied human emotion is a nonentity,” William James wrote in his <a href=\"https://www.themarginalian.org/2016/01/11/what-is-an-emotion-william-james/\">revolutionary 1884 theory of how our bodies affect our feelings</a> — a gauntlet thrown at the classical view that emotions are the brain’s response to the outside world, hard-wired and universal. In the century-some since, we have come to discover that this embodied construction of emotion, known as <em>interoception</em>, is the tectonic activity shaping the psychological landscape of being, which the brain then interprets to navigate the world based on concepts derived from past experience: learned frames of reference that classify and categorize the blooming buzzing confusion of reality into comprehensible morsels of meaning.</p>\n<p>This is the model psychologist Lisa Feldman Barrett advances in her <em>constructed theory of emotion</em>, detailed in her book <a href=\"https://www.amazon.com/How-Emotions-Made-Lisa-Barrett/dp/1328915433/?tag=braipick-20\" target=\"_blank\"><strong><em>How Emotions Are Made: The Secret Life of the Brain</em></strong></a> (<a href=\"https://search.worldcat.org/title/970641543\" target=\"_blank\"><em>public library</em></a>) — a bold, empirically grounded challenge to the classical view that events in the outside world trigger emotions inside us, instead showing that our affect is largely the product of prediction and that we feel what our brain believes. Emerging from this revolutionary view of what it means to be human is the assuring intimation that by consciously reexamining the predictions and beliefs entrained by our past experience and culture, we can take charge of our own emotional experience — we can re-render the reality we live in, which is always lensed through our interpretation of meaning. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=680%2C458&amp;ssl=1\" width=\"680\" height=\"458\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?w=2099&amp;ssl=1 2099w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=320%2C216&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=600%2C404&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=240%2C162&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=768%2C517&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=1536%2C1035&amp;ssl=1 1536w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=2048%2C1380&amp;ssl=1 2048w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?w=1360&amp;ssl=1 1360w\" /><figcaption>René Magritte. <em>The False Mirror</em>. 1929. (Museum of Modern Art.)</figcaption></figure>\n<p>Barrett — who worked as a clinical psychologist before she came to lead a team of a hundred scientists at Northeastern University’s Interdisciplinary Affective Science Laboratory — writes:</p>\n<blockquote><p>An emotion is your brain’s creation of what your bodily sensations mean, in relation to what is going on around you in the world… In every waking moment, your brain uses past experience, organized as concepts, to guide your actions and give your sensations meaning. When the concepts involved are emotion concepts, your brain constructs instances of emotion.</p></blockquote>\n<p>A generation after philosopher Martha Nussbaum observed in her visionary work on <a href=\"https://www.themarginalian.org/2015/11/23/martha-nussbaum-upheavals-of-thought-neediness/\">the intelligence of emotions</a> that “emotions are not just the fuel that powers the psychological mechanism of a reasoning creature [but] parts, highly complex and messy parts, of this creature’s reasoning itself,” Barrett adds:</p>\n<blockquote><p>Emotions are not reactions to the world. You are not a passive receiver of sensory input but an active constructor of your emotions. From sensory input and past experience, your brain constructs meaning and prescribes action. If you didn’t have concepts that represent your past experience, all your sensory inputs would just be noise. You wouldn’t know what the sensations are, what caused them, nor how to behave to deal with them. With concepts, your brain makes meaning of sensation, and sometimes that meaning is an emotion.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/09/bigwolflittlewolf8.jpg\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><em>Big Wolf &amp; Little Wolf</em></a></figcaption></figure>\n<p>Unlike the core assumption of the classical view, which treats the basic emotions as inborn and universal, displayed and recognized by healthy people across different cultures in the same way, the theory of constructed emotion holds that any universality of emotion is due not to shared wiring but to shared concepts. With an eye to the various <a href=\"https://www.themarginalian.org/2014/11/24/lost-in-translation-ella-frances-sanders/\">wonderfully untranslatable words</a> denoting concepts of common experiences in a particular culture for which other cultures have no direct equivalent, she writes:</p>\n<blockquote><p>What’s universal is the ability to form concepts that make our physical sensations meaningful, from the Western concept “Sadness” to the Dutch concept <em>Gezellig</em> (a specific experience of comfort with friends), which has no exact English translation.</p>\n<p>[…]</p>\n<p>Emotions do not shine forth from the face nor from the maelstrom of your body’s inner core. They don’t issue from a specific part of the brain. No scientific innovation will miraculously reveal a biological fingerprint of any emotion. That’s because our emotions aren’t built-in, waiting to be revealed. They are made. By us. We don’t recognize emotions or identify emotions: we construct our own emotional experiences, and our perceptions of others’ emotions, on the spot, as needed, through a complex interplay of systems. Human beings are not at the mercy of mythical emotion circuits buried deep within animalistic parts of our highly evolved brain: we are architects of our own experience.</p></blockquote>\n<p>And yet our experience is shaped by our past, encoded in the very circuitry of the brain — the neural pathways that formed our frames of reference as we responded to life. Barrett writes:</p>\n<blockquote><p>Some of your synapses literally come into existence because other people talked to you or treated you in a certain way. In other words, construction extends all the way down to the cellular level. The macro structure of your brain is largely predetermined, but the microwiring is not. As a consequence, past experience helps determine your future experiences and perceptions.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/06/09/the-topography-of-tears-rose-lynn-fisher/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/06/fishergrief.jpg\" /></a><figcaption>Tears of grief from <a href=\"https://www.themarginalian.org/2017/06/09/the-topography-of-tears-rose-lynn-fisher/\"><em>The Topography Tears</em></a> by Rose Lynn Fisher</figcaption></figure>\n<p>These templates of prediction are set as much by our personal experience as by our culture:</p>\n<blockquote><p>The human brain is a cultural artifact. We don’t load culture into a virgin brain like software loading into a computer; rather, culture helps to wire the brain. Brains then become carriers of culture, helping to create and perpetuate it.</p></blockquote>\n<p>But while past experience filters the present, it does not predetermine it. The human brain is <a href=\"https://www.themarginalian.org/2023/06/20/the-experience-machine-andy-clark/\">a prediction machine that evolved to render reality as a composite of sensory input and prior expectation</a>, but by continually and consciously testing our predictions against reality, we get to construct our lived experience — largely the product of how the brain handles its natural prediction errors. Barrett writes:</p>\n<blockquote><p>It can be a responsible scientist and change its predictions to respond to the data. Your brain can also be a biased scientist and selectively choose data that fits the hypotheses, ignoring everything else. Your brain can also be an unscrupulous scientist and ignore the data altogether, maintaining that its predictions are reality. Or, in moments of learning or discovery, your brain can be a curious scientist and focus on input. And like the quintessential scientist, your brain can run armchair experiments to imagine the world: pure simulation without sensory input or prediction error.</p></blockquote>\n<p>What emerges from this new theory of emotion is nothing less than radical new understanding of being human, counter to the long-held dogma of <a href=\"https://www.themarginalian.org/2022/03/27/margaret-wise-brown-the-important-book/\">essentialism</a> — the intuitive but misguided idea, dating back to Ancient Greece, that everything has an immutable innate essence, which predetermines its destiny. The classical view that human emotions have a universal fingerprint in the brain and represent universal responses to the world is a form of essentialism Barrett indicts as “a self-perpetuating scourge in science.” Drawing on a wealth of research from her laboratory affirming the theory of constructed emotion, she distills this potent antidote to the old dogma:</p>\n<blockquote><p>Emotions are not reactions to the world; they are your constructions of the world.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/How-Emotions-Made-Lisa-Barrett/dp/1328915433/?tag=braipick-20\" target=\"_blank\"><strong><em>How Emotions Are Made</em></strong></a>, Barrett examines how the theory of constructed emotion can help recalibrate everything from mental health care to the criminal justice system, revolutionizing our very understanding of human nature along the way. Complement it with the Scottish philosopher John Macmurray on <a href=\"https://www.themarginalian.org/2023/06/29/john-macmurray-reason-and-emotion/\">the interplay of reason and emotion</a>, then revisit <em>Goodnight Moon</em> author Margaret Wise Brown’s unusual and lovely <a href=\"https://www.themarginalian.org/2022/03/27/margaret-wise-brown-the-important-book/\">dissent against essentialism</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"862018629704a9be02ce7bb77ff6b06debffcf62ec199bec0fb29857f16117ea","category":"default"}