{"title":"Healthcare at the Edge","link":"https://www.usv.com/writing/2024/01/healthcare-at-the-edge/","date":1706196440000,"content":"<p>Co-authored with<a href=\"https://www.usv.com/people/jared-hechtusv-com/\"> Jared Hecht</a></p>\n\n\n\n<p>USV invests at the <a href=\"https://www.usv.com/writing/2024/01/investing-at-the-edge-of-large-markets-under-transformative-pressure/\">edge</a> of large markets being transformed by technological and societal pressures, and we believe that healthcare is at a transformational inflection point. </p>\n\n\n\n<p>At the edge we have a confluence of movements ranging from biohackers to communities and influencers that regularly and publicly share and discuss the latest medical breakthroughs, along with a slew of services and products that are circumventing the traditional health system and going direct to consumers. There is a zeitgeist of people taking responsibility for their own wellness. </p>\n\n\n\n<p>It appears that the winds of this movement are about to find their way into the hands of everyone. Wearables are measuring everything from our heart rates to glucose levels and sleep. Connected devices are becoming at-home diagnostic tools that interact with our doctors. People are sharing bloodwork and supplement stacks on Reddit. AI is making the health data we create and collect more legible and actionable, broadening access to personalized wellness plans based on biomarkers and other individualized data. We are just beginning to see what happens when people themselves drive these advancements to intersect and compound.</p>\n\n\n\n<p>And perhaps most importantly, the medical field faces significant issues with trust, as people have valid reasons to be skeptical. This comes from many factors: high and unpredictable costs that can bankrupt families, conflicting incentives that deprioritize quality of care, challenging user experiences (try to read an Explanation of Benefits), and a focus on treating illness rather than promoting overall well-being. Doctors seem to have little incentive to embrace the Internet’s ability to empower patients. <a href=\"https://twitter.com/emollick/status/1746022896508502138?s=46&amp;t=bWdMcpsvfZ0zWi7KaItSbQ\">Some</a> lack empathy or simply ignore well-informed patients, further deteriorating our experiences with medicine.</p>\n\n\n\n<p>Occasionally, doctors themselves <a href=\"https://twitter.com/HugoJobst/status/1687878773344227328?t=kpqEtZw9nnN0ajAJffoaSg&amp;s=19\">offer</a> radical solutions:</p>\n\n\n\n<figure><div>\n<blockquote><p>I am a doctor now but have come to realise that  de-medicalisation is the most important form of care we can offer</p>— Dr Hugo Jobst (@HugoJobst) <a href=\"https://twitter.com/HugoJobst/status/1687878773344227328?ref_src=twsrc%5Etfw\">August 5, 2023</a></blockquote>\n</div></figure>\n\n\n\n<p>How do you rebuild trust? And in doing so, create new opportunities and better, faster, and cheaper healthcare?</p>\n\n\n\n<p>The single most important way is to empower people to take control of their own health.</p>\n\n\n\n<p>Anything that challenges the medical establishment by encouraging people to take control of their health – whether through social media, by empowering doctors who want to work more collaboratively with patients, or other means – is a positive development. The current trend towards self-empowerment and advocacy ranges from biohackers, <a href=\"https://www.usv.com/writing/2024/01/weird/\">weirdos</a> and advocates pushing for personal wellness and self-experimentation to more well-known figures like Dr. Peter Attia, Dr. Andrew Huberman, and Bryan Johnson.</p>\n\n\n\n<p><strong>We call this self-directed healthcare. </strong>If healthcare exists on a spectrum from preventative measures to emergency care, the self-directed movement has emerged primarily on the former front. Themes like healthspan, longevity, and cardio-metabolic health permeate the dialogue. Focusing on this area helps to keep people healthy and out of the traditional system, which should play a critical role as the place where experts treat patients with acute issues.     </p>\n\n\n\n<p>Within self-directed healthcare, several emergent themes excite us: </p>\n\n\n\n<ul>\n<li>Medicine is becoming increasingly personalized (e.g. <a href=\"https://thirtymadison.com/\">Thirty Madison’s</a> virtual specializations). Our ability to measure what is happening in our bodies has improved dramatically over the past two decades. And the combinatorial effects of those measurements coupled with AI-assisted medical guidance open up opportunities to better manage one’s health and wellness. Systematically acting on individualized data has been the missing piece to close the loop, and one outcome could be that we are edging towards a world where everyone will have both a uniquely personalized wellness advocate and doctor in their pocket, at low cost.</li>\n</ul>\n\n\n\n<ul>\n<li>To support the development of applications and services that empower individuals to take control of their own well-being, robust and evolving enablement layers have emerged. These services allow entrepreneurs to quickly innovate and experiment with new offerings by providing foundational experiences (e.g. tapping directly into networks of medical doctors for telemedicine, etc.) and empower practitioners to participate in this movement and meet patients where they are (e.g. USV investments: <a href=\"https://www.rupahealth.com/\">Rupa</a> fulfilling diagnostics for forward-thinking doctors, <a href=\"https://www.abridge.com/\">Abridge</a> bringing AI to the doctor and patient, and <a href=\"https://www.journeyclinical.com/\">Journey Clinical</a> lowering the barrier for clinicians to refer patients to psychedelic therapies).</li>\n</ul>\n\n\n\n<ul>\n<li>Specialized networks are emerging for people to gather online and share their own personal wellness stacks, stories, and learnings. These networks are powerful mechanisms to broaden access to knowledge and well-being for individuals. The important discourse here frequently finds its way into the mainstream dialogue. </li>\n</ul>\n\n\n\n<p>These themes represent a subset of examples within the movement. We are actively investing in them and being exposed to new ones every week, including those from the adjacent possible that we could have hardly imagined before. </p>\n\n\n\n<p>We think that individual, self-directed healthcare presents the fastest path to fixing core issues within the healthcare industry. By putting people at the center, we can place our highest level of trust and agency in the most vital participant – ourselves. We are paying close attention to what looks like one of the most important bottoms-up movements to impact healthcare in this generation.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/01/healthcare-at-the-edge/\">Healthcare at the Edge</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Andy Weissman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"8701dd65fe22cea2eb270038a40ae7db65f3e882368ed8d3d6f95acf3fac736f","category":"default"}