{"title":"Supreme Court: Zero Days Since Last Incident","link":"https://kottke.org/24/07/supreme-court-zero-days-since-last-incident","date":1719927221000,"content":"\n        <p><a href=\"https://heathercoxrichardson.substack.com/p/july-1-2024\">Heather Cox Richardson writing</a> last night for her Letters from an American newsletter:</p>\n\n<blockquote><p>Today the United States Supreme Court overthrew the central premise of American democracy: that no one is above the law.</p>\n\n<p>It decided that the president of the United States, possibly the most powerful person on earth, has “absolute immunity” from criminal prosecution for crimes committed as part of the official acts at the core of presidential powers. The court also said it should be presumed that the president also has immunity for other official acts as well, unless that prosecution would not intrude on the authority of the executive branch.</p>\n\n<p>This is a profound change to our fundamental law — an amendment to the Constitution, as historian David Blight noted. Writing for the majority, Chief Justice John Roberts said that a president needs such immunity to make sure the president is willing to take “bold and unhesitating action” and make unpopular decisions, although no previous president has ever asserted that he is above the law or that he needed such immunity to fulfill his role. Roberts’s decision didn’t focus at all on the interest of the American people in guaranteeing that presidents carry out their duties within the guardrails of the law.</p>\n\n<p>But this extraordinary power grab does not mean President Joe Biden can do as he wishes. As legal commentator Asha Rangappa pointed out, the court gave itself the power to determine which actions can be prosecuted and which cannot by making itself the final arbiter of what is “official” and what is not. Thus any action a president takes is subject to review by the Supreme Court, and it is reasonable to assume that this particular court would not give a Democrat the same leeway it would give Trump. </p>\n\n<p>There is no historical or legal precedent for this decision.</p></blockquote>\n\n<p>As I’ve <a href=\"https://kottke.org/23/09/democracy-awakening-notes-on-the-state-of-america-by-heather-cox-richardson\">noted before</a>, Richardson’s book <a href=\"https://www.amazon.com/exec/obidos/ASIN/0593652967/ref=nosim/0sil8\">Democracy Awakening: Notes on the State of America</a> is an excellent way to get yourself up to speed on the origins of this decades-long project by the Republicans to subvert American democracy. From <a href=\"https://www.washingtonpost.com/books/2023/09/25/heather-cox-richardson-substack-review/\">a review of the book by Virginia Heffernan</a>:</p>\n\n<blockquote><p>She has an intriguing origin point for today’s afflictions: the New Deal. The first third of the book, which hurtles toward Donald Trump’s election, is as bingeable as anything on Netflix. “Democracy Awakening” starts in the 1930s, when Americans who’d been wiped out in the 1929 stock market crash were not about to let the rich demolish the economy again. New Deal programs designed to benefit ordinary people and prevent future crises were so popular that by 1960 candidates of both parties were advised to simply “nail together” coalitions and promise them federal funding. From 1946 to 1964, the liberal consensus — with its commitments to equality, the separation of church and state, and the freedoms of speech, press and religion — held sway.</p>\n\n<p>But Republican businessmen, who had caused the crash, despised the consensus. Richardson’s account of how right-wingers appropriated the word “socialism” from the unrelated international movement is astute. When invoked to malign all government investment, “socialism” served to recruit segregationist Democrats, who could be convinced that the word meant Black people would take their money, and Western Democrats, who resented government protections on land and water. This new Republican Party created an ideology that coalesced around White Christianity and free markets.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Democracy%20Awakening\">Democracy Awakening</a> · <a href=\"https://kottke.org/tag/Heather%20Cox%20Richardson\">Heather Cox Richardson</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a> · <a href=\"https://kottke.org/tag/Virginia%20Heffernan\">Virginia Heffernan</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"872f01f0a62ad94357d1644ff69eeb1b828fc250031a2d6982b9e0c22f93480b","category":"default"}