{"title":"Writing a novel","link":"https://chias.blog/2023/writing-a-novel/","date":1674822670000,"content":"<span><span>Reading Time: </span> <span>9</span> <span>minutes</span></span>\n<p>In my last year of high school I was working on college applications in an island province in the Philippines and no one understood why I was so stressed or what I wanted to get out of it. No one was willing to listen to what was painful to me. </p>\n\n\n\n<p>I began this act of studying myself on paper more rigorously than anyone had ever afforded me—a scrutinizing and extreme new when this was never an expectation. I was supposed to live in ignorant bliss and to bend to people and pray—but instead, I looked inwards.</p>\n\n\n\n<p>In a time where I had to ‘teach’ my teachers how to write recommendation letters and in turn learned how to lie and write in voices that weren’t my own I spent every break in the guidance counselor’s office pointing at what she needed to click so I could get my fucking fee waivers until I couldn’t get the fee waivers than had to starve so it wasn’t a financial burden until she told me to just submit my college applications myself while she recited her password to me while chewing on food and I hadn’t eaten a single meal in school within that three month trimester. I wrote more things about myself than what was ever spoken about me, which is a bold claim when you’ve hated yourself into distancing in a school where you spent thirteen years of your lives with everyone else.</p>\n\n\n\n<p>I was so agonizingly exhausted of making and unmaking and making and unmaking myself that I felt like I was about to go insane. (I must have been insane and might still be.)</p>\n\n\n\n<p>I wanted to believe that there was a world in my head that wasn’t all about who I was (even if I could never separate the writing as an extension of what I wanted). I wanted to believe that there was a voice I could conjure that was just not telling me what I wanted to become (until I realized that all writing is an extension of the world we wish we could live in). I wanted to live in someone else’s head after deciphering mine. In my last year of high school I wrote a novel.</p>\n\n\n\n<p>So I wrote a novel in a winter break where I didn’t remember anything except writing about myself and hating myself and wondering what had become of me to get to this point and a breakup and a million other breakups and more fighting with my family and more pain and praying to get out of this world and writing about a new world.</p>\n\n\n\n<p>And then nothing became of the novel because it did what it needed to do: I wrote it to understand all of this until my Microsoft Word was breaking and I had to split it into segments and never sent excerpts of it to anybody. Would I be able to call it a novel if no one ever saw it? What if it gave me everything I needed? I determined that everything I do for myself must, in its collateral damage, be done for everyone else as well. I grounded myself a bit and understood that this world was not the only one that was out there for me, at the precipice of a radically altered life and the throes of one that I had tunnel visioned myself into believing I could escape. Yes. I was nowhere and then I was in this world I made.</p>\n\n\n\n<p>Despite, despite, despite, despite: I wrote a novel.</p>\n\n\n\n<p>…</p>\n\n\n\n<p>I want to write a novel again because everybody dreams of writing a novel and everyone can write a novel but no one actually does it. It’s absurd how it’s one of the easiest things you can do: put a pen to a paper and start writing some words, watch your cousins drunk at the corner of the wedding and asking you why you never talk while you’re there deciphering why this room might be part of why you’re so fucked up on your iPhone 4, and again I am writing again. I wanted to write without distance. Every time I felt like I was breaking I was writing. I was writing because there was this need to instill what I was feeling in a moment into words, lest I am never able to capture it again. So I was writing.</p>\n\n\n\n<p>I like the idea of writing a novel, and I like the actual act of writing a novel. It’s helpful to like the idea of something before you get into doing it. It’s helpful to convince yourself that you enjoy doing the things you like. I like the idea of writing a novel because of what it does to me, and I like it when I can accept that there are things I like the idea of because I like what it does to me and sometimes we need to acknowledge that we are humans who like the ideas of what things do to us and that this is a premise never really divorced from the being. I like the idea of writing a novel. If I could, I would be writing a novel forever. I want to always be writing a novel.</p>\n\n\n\n<p>I don’t think the novel has to be good. If it was good then it is good. But I want to write a novel even if I have nothing particularly interesting to say and even if I am bad, and my life has been filled with so many disinteresting things that even what I choose to reveal can’t help but be a bit disinteresting, too. I want something to be reflective of myself and a completed novel isn’t reflective enough: I want all my broken promises flayed, I want my imperfections nestled in everyone’s minds, I want my words to live uncleanly for the rest of time. If I was good then it would be good. Whatever it is, it must be. I want to write a novel.</p>\n\n\n\n<p>I’m thinking painfully about self-publishing and authorship; particularly that I’ve fallen into a life where I share things that have no traditional or historical precedent to be gathered around and I think this act of making myself visible and palatable and sharing it all is actually distancing myself from everyone I love. I have been vomiting a lot, not eating, and what somehow hurts most is the fact that my friends don’t like my Instagram posts. I am thinking about my ways of self-expression and perhaps I should just revert to doing it for my own sake; which involves this convoluted journey of distancing myself from the belief that my artifacts are my sense of self-expression and memory—the most surefire way for me to have made record of myself. What can I do when no one can tell me who I was before I started saving pieces of myself? No one is interested in the records or the story of my life. It is time to make again, to understand myself—whether I become important in that conquest, or whether I continue this life lonely and isolated and important only to myself. The world ends when I deem it no longer important. I’m coming awfully close to being disinterested in everything and all of my relations. I’ve seen the dirt and the skies and fallen in love with everything and now I am killing the love I have left for myself. Maybe I will write a novel.</p>\n\n\n\n<p>I want to write a novel because I want to be the type of person who is saying they are writing a novel. If I do nothing in particular in a day, if I’m sitting down drinking a chai latte at a cafe, once the hairdresser is taking out my depression knots one after the other and trying to make conversation, once I have to face my friends and make myself interesting, if I’m on a flight and the man asks what I’m doing before asking me to get up and fuck off—I have something interesting to say. I’m writing a novel. They will then look at me, the sad 22-year-old thing I am, with more delight and astonishment or nothing at all. I will be a sad thing or a beautiful thing. I will become a thing. I will make them feel something today. “This person told me that they’re writing a novel.” Already in these few, brief, powerful words we have made an assessment of grandeur and delusion of someone — refusing to trust that anything could come out of it. I will become as small as they want me to be, and I will maybe make them feel good. I want to write a novel.</p>\n\n\n\n<p>I want to write a novel because I have no good reasons for it and because everyone really has a good reason for it. The good reason comes once they have found what they are going to write the novel about and have finally made themselves interesting. I am already narrativizing myself and everything before me. Wouldn’t I be the perfect author? I am lying so much and hold so much and there is so much I have yet to be. When I am everything and nothing it will be an interesting response and identity, I think, to be the person who is writing a novel. I will have something to look forward to and also nothing because the novel becomes the project of my life and the novel becomes the one thing I can hinge on and I might be too complacent and happy that my being is sufficient and anything can be strung out from it, even if nothing of it is particularly holy. Each word I put on paper would be a new extension of myself and I would wield the terrible agency to make and unmake and make and unmake the self and no one except those who dare to read would ever consume any of it. Every page and note and error and mistake an extension of myself, my brutal humanity in words. What I devote myself to, what I have deemed worthy of devotion. When I am doing nothing I will be writing a novel. When I am sleeping I would be writing a novel. When I am living I would be in this grand process of putting myself down as other people might one day see me.  I should be writing a novel.</p>\n\n\n\n<p>I want to believe in self-publishing in the way that I do making anything: that I alone can name what is valid, that I don’t need a third-party actor to validate or legitimize my beliefs. I want to write because I have to understand myself; I want to write because mostly, I want to deem myself as someone worthy of understanding. I want to write because there must be some artifact that comes out of this, because I have always believed in preserving myself and believe that I’m torn in a life of constantly preserving myself to no one’s interest and I have to again, convince myself that the story of what I devote myself in this brief life to has meant something—even if it is only to myself, seen for myself. I hate how we have attached the production of the book to a need to be legitimized, verified, consumed by a third-party — it has ruined our relationship with human knowledge, production, and people. It has turned culture into a commodity, which is not a new plea or revelation at all, but it just dawned on me how painful it must be to have seeped into even the simple declaration of writing.</p>\n\n\n\n<p>This is an absurd plea at self-importance. Is there anything more narcissistic than the act of writing a novel? Do you know how much of a fucking asshole you sound like when you say you’re writing a novel? Do you know how much the world laughs at you and forgets you when you declare that you are going to make something, but haven’t even made yourself important? Do you know what to do when the world has stripped you from everything you have held holy, everything that you have poured your heart into, because they can’t remove themselves from their own capitalistic relationships with the mediums that you care about? Do you know anyone who even reads? Not for the Goodreads style of reading, but to read to determine what is important, without the list? Do you know if someone can make themselves important? Do you know anyone who would save you but yourself?</p>\n\n\n\n<p>I wish we could all write novels. I wish we could all be writing the story of ourselves. I wish we were all in love with the idea of each other putting something out into this world, of a concretization and a self-definition that we are never given the chance to explore. I wish we could take what we think of as impossible and never put it in each other’s mouths. I wish writing and making was a visible act and self-publishing was worthy of gathering around so that all of my loved ones and I could be writing our stories and that the witnessing there was enough. Or the self-witnessing. I wish it wasn’t seen only as a self-surveilling thing to care about the artifacts that you leave after you die—because it is in precisely this lack of care over what legacies we leave, or the ability to even declare our legacies and how we might be memorialized, that there is a collapse. I wish my life were extending forevermore.</p>\n\n\n\n<p>I wish I was writing a novel right now because I have so many novels left to write in me. I have so much to say and it hasn’t even begun. I must write and live and stargaze and dream and become and witness and love and live and see and be in this constant process of being, presenting, living. When I am so sick of knowing myself I will turn to a novel even if it is again, an act of meeting myself on the page. I love words because there is only truth in them. I love being a novelist before I have become one because when I am a broken thing, even when there is nothing in me, I can say that I am writing a novel — and no one would be able to take that away from me. I wish I could save myself. I wish this would save myself. I wish we all had books that captured our lives, even if only a fragment. I wish we could have the artifacts of a life that someone had dictated for themselves, in a world where we understate how much we mean to each other.</p>\n\n\n\n<p>Maybe in the next months I will get rid of all of myself after a life of only me carrying me. Maybe it is time to have another thing that contains me. Maybe it is time to see myself in something that is not myself. Maybe I will write a novel.</p>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"8792bc5a31e8d1f4052ea12dabf49738279aed179ae2a9b08b3c42c9ad4105fe","category":"Sites"}