{"title":"No rules in this game","link":"https://sive.rs/360","date":1369008000000,"content":"<p>\nEveryone thinks you have to move to the big music cities.\nBut Mihkel Raud in Estonia sold thousands of albums, 100% independent, without leaving Estonia.\n“<a href=\"http://www.amazon.com/dp/B00007MB39\">Rondellus Sabbatum</a>” was an album so unique that word-of-mouth sold thousands, with hardly any promotion.\n</p><p>\nEveryone says you need to make your music appeal to the masses.\nBut Regina Spektor proved that emphasizing your quirks gets you further.\n<a href=\"http://www.cdbaby.com/artist/ReginaSpektor\">Listen to her early albums from 2001 and 2002</a>.\nShe was more mainstream piano vocal.\nBut the weirder she got with “<a href=\"https://www.youtube.com/watch?v=ycum4o6jlzQ\">Soviet Kitsch</a>”, the more remarkable and noteworthy she became, and that’s when her career really took off.\n</p><p>\nEveryone is worried about piracy, copyright, and trademark.\nBut <a href=\"http://www.jonathancoulton.com/\">Jonathan Coulton</a> writes a song a day, gives most away, and is one of the most successful independent artists today.\nBy making more and more music, and letting it flow, his music has gotten into unusual places like webcomics, audiobooks, comedy shows, and others’ YouTube videos.\nHe disclosed that he makes about $500,000 a year by licensing, touring, donations, and people choosing to buy his music from his site, even though they could get it for free.\n</p><p>\nBecause the music business is mostly perception, and minds are irrational, you can really have some fun with the counter-intuitive pop-psychology of it.\n</p><p>\nA great way to win fans is to target a sharp niche — to <a href=\"https://sive.rs/exclude\">proudly exclude</a> 99% of the public.\nSo the way to win fans is to exclude almost everyone.\n</p><p>\nA great way to get funding is to act as if you’ll never get funding — to make <a href=\"https://sive.rs/gbp\">a plan that doesn’t need it</a>.\nSo the way to get funding is to ignore funding.\n</p><p>\nA great way to have a serious career in music is to take nothing seriously.\nDo the opposite of other musicians.\nMake up your own game.\n</p><p>\n<strong>\nGurus will say what you must do or can’t do.\nThey mean well, but they’re wrong.\n</strong>\n</p><p>\nFor every rule they tell you, there’s an exception.\n<strong>\nThey are just telling you their specific past, not your specific future.\n</strong>\n</p><p>\nThere are no rules in this game.\nYou change them as you go.\n</p>\n<img src=\"/images/bloodyclown.jpg\" />\n<div>photo by <a href=\"http://www.flickr.com/photos/zickie/4025087286/\">zickie</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"87c0b37bfa0f190a56638b561faf1c1585b5c5f43b473313ef9ff9f73c8c1689","category":"default"}