{"title":"It’s all who you know?","link":"https://sive.rs/xn","date":1360540800000,"content":"<p>\nWhen you hear, “It’s all who you know,” it sounds so intimidating — like you need to be a former roommate of Mark Zuckerburg, cousins with Richard Branson, and dating Taylor Swift.\n</p><p>\nBut simply contacting a stranger can lead to a worldwide network of connections.\n</p><p>\nWhen I was 18, at <a href=\"https://www.berklee.edu/\">Berklee College of Music</a>, we had a guest speaker named Mark Fried, who was an executive at <a href=\"https://www.bmi.com/\">BMI</a> — a big music company in New York City.\n</p><p>\nHe walked into the classroom just before class began, and I heard him ask the teacher, “Oh, I thought we were going to have food.”\n</p><p>\nThe teacher said, “Oh, no, sorry, I thought you ate already! Didn’t you have lunch?”\n</p><p>\nMark said, “Damn. No. And it’s a two hour class. Oh well.”\n</p><p>\nHearing this, I quickly ran out of the room and called the local pizza place, asking them to deliver three large pizzas to classroom #115.\n</p><p>\n45 minutes later, the pizzas showed up.\nI gave one to Mark and shared two with the class.\n</p><p>\nHe smiled at me and said, “Good move. I owe you one. Here’s my card. Call me any time, and let me know how I can help. When you come to New York City, I’ll be happy to meet up.”\n</p><p>\nFor the next two years, I took him up on that, sending him my new songs for feedback, and he’d tell me his insights and advice about the music industry.\n</p><p>\nWhen I told Mark I wanted to move to New York, he said, “Send me your resume, and I’ll find you a job.”\n</p><p>\nSure enough, a few weeks later, I got a call in my dorm room from Julie Gengo at <a href=\"https://www.warnerchappell.com/\">Warner/Chappell Music Publishing</a>, saying, “We need someone to run our tape room, and Mark Fried said we should hire you. Can you start Monday?”\n</p><p>\nJust like that, I was in.\n</p><p>\nBecause I was working inside Warner Brothers, it was easy to meet everybody in the New York City music scene.\nEvery person I met connected me to many more.\nA few years later, it was no problem to move to Los Angeles, because I now had a huge network in LA, through one degree of separation.\n</p><p>\nNow it’s grown worldwide.\nWhether I’m visiting Iceland, Shanghai, Rio, Japan, or Silicon Valley, I’ve got a wonderful network of connections to call on, and people worldwide who can call on me anytime.\nUsually we know each other loosely — having only traded a couple emails — but those quickly turn into real friendships.\n</p><p>\nAll because I bought a pizza for a stranger.\n</p>\n<h3>\nSurrounded by success\n</h3>\n<p>\nSoon after arriving in New York, I was surrounded by successful people.\nI was only 20 years old, but <strong>I learned so much from watching how people become successful, hearing their stories, philosophies, and mistakes.</strong>\nOpportunities were everywhere.\n(A chance recommendation from my roommate got me a gig touring the world, <a href=\"https://sive.rs/sakamoto\">playing guitar for Ryuichi Sakamoto</a>.)\n</p><p>\nThese people shaped the way I see the world.\n<strong>\nThe people you surround yourself with don’t just open doors. They change the way you think, and change your self-image of your capabilities!\n</strong>\n</p><p>\nWhen you’re surrounded by successful people, it feels so easy, it’s obvious.\nTheir attitude and actions rub off on you.\n</p><p>\nBut I meet so many people that feel that success is so far away, so impossible to imagine, that they act accordingly, aim low, and complete the self-defeating circle.\n</p><p>\nI know much of success is luck, but I never realized how much the mindset of success comes from who you know.\n</p><p>\nLuckily, who you know is <a href=\"https://sive.rs/ppweek\">up to you</a>, not luck.\n</p>\n<h3>\nNo need to be in the big city\n</h3>\n<p>\nI used to advise ambitious people to move to the big city, where everything is happening.\nAnd it’s still true that it offers some benefits.\n</p><p>\n<strong>\nBut now “where everything is happening” is online.\nAnd the way to be there is to create something that adds to it.\n</strong>\n</p><p>\nMost of the fascinating and successful people I know now are people I met online.\nI see something they’ve done, or they see something I’ve done, one of us sends the other an email, and that’s it.\nA few emails, maybe a phone call, and we’re friends.\n</p><p>\nWhat’s even more fascinating is finding out that the super-connectors, the people who know everybody and everybody knows, are often physically remote.\n</p><p>\nThe reasons they’re so connected are:\n</p>\n<ol><li>\nbecause they keep creating great stuff and posting it online, which gets the attention of their peers, so soon “everyone” knows who they are\n</li><li>\nbecause they reach out to say hello to the people they admire\n</li></ol>\n<p>\nSo if it seems that there’s an uncrossable canyon between you and your heroes, don’t forget that all it takes is one connection to catch your rope, so you can shimmy across.\nAnd you can do this from anywhere by creating great stuff online, and reaching out to potential friends.\n</p><p>\nNo need to attend Harvard with Mark Zuckerburg.\nNo need to become a cousin of Richard Branson.\nAnd no need to date Taylor Swift.\n</p><p>\n<em>\n(See? There are three things you can cross off your TO-DO list now.)\n</em>\n</p>\n<img src=\"/images/people-per-week.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"8850e713e3de55061dffbc46fff2b629673d5dcb697a46147c10872ada9e0851","category":"default"}