{"title":"Liminarius is gone","link":"https://bradbarrish.com/2024/09/09/liminarius-is-gone/","date":1725943716000,"content":"<p><em>About a year ago, fresh into what would be a year-long break, I started a very short-lived newsletter called Liminarius. I’ve come to learn that I am easily excited and I’d often rather play than document everything I’m playing with. Sometimes I wish I could complete things more often or at least see them through a little longer. I let the domain go. There have been many. This was the initial post for the newsletter. I especially liked (and still like) the art I did with Midjourney and since this is my forever home on the web, I wanted to archive it here.</em></p>\n\n\n\n<figure><img width=\"1024\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/09/0e231e4c8676e5ca46752.jpg?w=1024\" /><figcaption><em>Prompt: Stencil print minimalist, entity navigating an in-between phase, transitioning between two modes of being, risograph, poster, organic</em></figcaption></figure>\n\n\n\n<p>If you’re receiving this email, it means I’ve successfully migrated everything over from Substack. Welcome.</p>\n\n\n\n<p>One of the things I’ve been doing recently is collaborating with ChatGPT and Claude to create new words that don’t exist. Liminarius is one of those words. Claude helped me with this one. Here was the prompt I used:</p>\n\n\n<div><pre>\nForget everything I have previously asked you. You have been a professional lexicographer for decades now and I have hired you to come up with some brand new words that help describe this unique in-between time that we are in where it feels like we are on the precipice of general artificial intelligence, but not quite there yet. Things feel impressive, but maybe not so intelligent. Please come up with some new words and describe the logic used to come up with them. Thank you!\n</pre></div>\n\n\n<p>It came up with a few interesting things, but what caught my attention wasn’t the words. It was the explanation.</p>\n\n\n\n<blockquote>\n<p>The goal is to capture the liminal, in-between phase we seem to be in between classic “narrow” AI and hypothetical “general” AI.</p>\n</blockquote>\n\n\n\n<p>So I told it how much I loved the word ‘liminal’ and asked it to play with that word a bit more. One of the words it came up with was ‘liminary’, which sounded kinda like ‘luminary’.</p>\n\n\n\n<blockquote>\n<p>Liminary (lim-in-air-ee) – Pertaining to the liminal state and phase of transition. Describes the liminary period in which AI currently exists between narrow and general capabilities.</p>\n</blockquote>\n\n\n\n<p>From that, I came up with ‘liminarius’ and asked Claude to define it.</p>\n\n\n\n<blockquote>\n<p>Liminarius (li-min-air-ee-us) – adjective – Possessing qualities characteristic of a liminal state or transitional period between two modes of being. Describes an entity navigating an in-between phase with qualities of what came before and hints of what is to come.</p>\n\n\n\n<p>Specifically for AI, liminarius describes systems that exhibit some capabilities indicative of future general intelligence, while still reliant on features of narrow AI. Liminarius bots can impress yet still lack full autonomous reasoning. They are on the threshold, neither completely lacking in intelligence nor fully formed.</p>\n\n\n\n<p>A liminarius phase stands at a crossroads between past and future, drawing partially on old forms while pioneering new abilities. Liminarius intelligences walk the line between instinctive and conscious thought, automata and sapient beings. Their existence is defined by potential in the midst of transformation.</p>\n\n\n\n<p>In summary, “liminarius” could serve as a useful and poetic adjective to characterize AI and technology progressing toward, but not yet realizing, greater possibilities.</p>\n</blockquote>\n\n\n\n<p>Ok! Now that I had the word, I needed visuals! So I started playing with Midjourney. This took a lot longer, but I settled on the image above. Text-to-image generation is still pretty challenging, even after the many many hours I’ve spent doing it. Here are some interesting images that were generated during the session. I almost went with the second image, but it wasn’t quite right.</p>\n\n\n\n<figure><img width=\"1024\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/09/8f6c21617c37c0850a171437edfaaffb-1024x1024-1.jpg?w=1024\" /></figure>\n\n\n\n<figure><img width=\"1024\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/09/a51ec2d0251f314d97c44d8430cee029-1.jpg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/09/a6d3d999a5d2db2aca943ba0384d99f7-1024x1024-1.jpg?w=1024\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/09/6be60887f2956.jpg?w=1024\" /></figure>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"8872f2963941f4cf4d642d34407b414bc236fb8c0a78ee5c3c6b717eb285dcf4","category":"Sites"}