{"title":"The Tyranny of Content Algorithms","link":"https://om.co/2024/04/07/tyranny-of-content-algorithms/","date":1712504329000,"content":"<p>No matter who you are, how skilled you may be, or how much knowledge you possess, excessive activity will inevitably lead to a return to the average. This phenomenon is observable every day on the Internet. Before Instagram became a competition for the lowest common denominator, there were a few photographers I followed. They consistently shared captivating images, always managing to evoke a sense of inspiration with each viewing of their work. </p>\n\n\n\n<p>I wasn’t alone in this appreciation—over time, they gained more recognition and accumulated larger followings. Or perhaps it was the other way around. The ‘larger following’ meant they were able to monetize their audience. However, soon the tail was wagging the dog. </p>\n\n\n\n<p>As the years passed, I noticed them sharing more frequently, yet the quality of their work declined. They gradually transitioned from being exceptional to merely average. I suppose this is what they mean by “<a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Regression_toward_the_mean\">regression to the mean</a>.” Although Sir Francis Galton, a 19th-century scientist, originally used this phrase to describe the heights of children, its significance has since expanded. You may be familiar with the <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Sports_Illustrated_cover_jinx\">Sports Illustrated Cover Jinx</a>, an urban myth suggesting that players or teams featured on the magazine’s cover would experience a decline in performance—a prime example of it.</p>\n\n\n\n<p>This phenomenon is affecting those who earn their livelihoods by creating content on the Internet. Initially, it was the photographers, then the YouTubers I followed. They were once entertaining and intriguing, but now they seem to be pandering to the algorithms. The reality of the algorithmic world is that it rarely rewards brevity and excellence. Most modern media algorithms are tuned to reward engagement. </p>\n\n\n\n<p>Engagement comes either from posting to the platform more frequently or to what the algorithm decides is trending and fits a certain format. Machines then expose the content to as many people as they think it should. Engagement and reach go hand-in-hand in the modern content world.</p>\n\n\n\n<p>These days the ideal recommended “algorithmic” length for a YouTube video is about 14 minutes, while Instagram wants you to post 90-second Reels. Of course, engagement also comes from clickbait headlines or content that is supposed to provoke a reaction. </p>\n\n\n\n<p>It is hardly a surprise then that the photography philosophers are primarily occupied with camera reviews, while landscape YouTubers produce fewer photographs and more comedy or van life videos—all to keep the content flowing. Consequently, most of them have become uninteresting, a damning fate in our machine-powered attention-driven economy.</p>\n\n\n\n<p>I compare these algorithm-driven content producers to genuine creatives—those who have earned my subscription, notifications, and even clicks on their sponsored links. Why? Because they produce thoughtful, well-crafted, and authentic video narratives that inform, educate, and, most importantly, stimulate my mind.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.youtube.com/channel/UCYzMdQa5aD6dnKHLdBxDMkw\">Morten Hilmer</a> creates lengthy, immersive videos about wildlife photography. His channel rivals National Geographic, captivating me with its ability to transport into his world. Another favorite channel of mine is Veritasium, where <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Derek_Muller\">Derek Muller</a>, a scientist, manages to make even the most obscure topics engaging. Then there’s <a target=\"_blank\" href=\"https://www.youtube.com/@LostLakes\">Lost Lakes</a> by Jonathan Kelly, a former Canadian tech industry executive who traded it all to pursue his passion for exploring the “Canadian Lakes” and camping in the great outdoors. His videos, like Hilmer’s, are deliberate and thought-provoking, devoid of the rush to churn out mere “content.”</p>\n\n\n\n<p>This trend is not confined to YouTube or Instagram; it’s prevalent across the text-based Internet. Newsletters, blog posts, and online articles are losing significance as they conform to the demands of a content machine driven more by algorithms and revenue than by serving the reader or customer. Recently, a friend recommended a technology newsletter, so I signed up. However, I soon realized that the primary objective was not to inform or educate but to “grow” and “scale” the writer’s eventual business.</p>\n\n\n\n<p>And not just newsletters — even the rapidly expanding podcast ecosystem is following the all too familiar trajectory of increased output and decreasing quality. The chase for bigger numbers leads to the ultimate sin — forgetting that you exist in the service of your reader, listener, and viewer. </p>\n\n\n\n<p>I’ve experienced this phenomenon too. And that was before algorithms took control of the modern ecosystem. </p>\n\n\n\n<p>During my time as a professional writer, I learned that my creative productivity waned after reaching around 1250 words. While I could push through and write more, the quality inevitably suffered. I began repeating my words and thoughts to meet the requirements to get the job done. It was a valuable lesson. While consistent writing is crucial, it’s equally important to recognize one’s creative limits. This qualitative boundary extends beyond work on the Internet; it permeates various aspects of life.</p>\n\n\n\n<p>I used to enjoy listening to a particular cricket commentator whose eloquent language and leisurely style enhanced the experience of watching slow, sometimes meandering games. His voice was a rare treat, fostering a strong connection. However, in today’s landscape, it is ubiquitous—featured in IPL games, YouTube videos, and other broadcasts. His poetic commentary, unique insights, and rare value proposition—what made him special—have been diluted by overexposure. The commentator has become average, at best, and a cliche machine at worst. I don’t fault him for capitalizing on opportunities, but there comes a point where it’s essential to decline and take a break.</p>\n\n\n\n<p>I’m currently undertaking a 366-photo project, sharing one photo per day. Admittedly, it’s been challenging, and I find myself struggling to maintain my artistic integrity. My inner artist urges me to pause and reconsider my approach. Perhaps I will. The real challenge lies not in giving up but in discovering a new approach. </p>\n\n\n\n<p>Can I adapt my landscape-honed style to urban environments? How do I incorporate the colors of modern life? These are the questions I face. However, if I find straying too far from my internal quality standard, it may spell the end of the project.</p>\n\n\n\n<h4>Related Reading: </h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/10/15/social-internet-is-dead-get-used-to-it/\">Social Internet Is Dead. Get Over It.</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2018/05/26/we-are-all-trapped-in-the-feed/\">We are all trapped in the “Feed”</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/gigaom/how-internet-content-distribution-discovery-are-changing/\">How Internet Content Distribution &amp; Discovery Are Changing</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2019/06/16/the-problem-with-content/\">The Problem With “Content”  </a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"89521abfd9285abfca354499097599891ceb46b0473d877b676808ec23f76052","category":"default"}