{"title":"Disconnect","link":"https://sive.rs/dc","date":1469577600000,"content":"<p>\nAll the best, happiest, and most creatively productive times in my life have something in common: being disconnected.\n</p><p>\nNo internet.\nNo TV.\nNo phone.\nNo people.\nLong uninterrupted solitude.\n</p><p>\nWhen I was twenty-two, I quit my job and spent five months alone in a house on a remote part of the Oregon coast.\nPracticing, writing, recording, exercising, and learning.\nNo internet.\nNo TV.\nNo phone.\nNo people.\nI drove into the city only once a month to see friends and family.\nThe rest of the time, I was completely disconnected.\n</p><p>\nIn those five months, I wrote and recorded over <a href=\"https://sive.rs/music\">fifty songs</a>, made huge improvements in my musicianship, read twenty books, and got into the best physical shape of my life.\n</p><p>\nWhen I was twenty-seven, I moved to the <a href=\"http://www.jpfolks.com/ECRoadTrip00/ECpages/cdbaby.html\">woods of Woodstock</a> and did that again.\nMonths and months of lovely solitude.\nThat’s how I started CD Baby.\n</p><p>\nIt’s not that I hate people.\nThe other best times in my life were with people.\nBut it’s interesting how many highlights were just sitting in a room in that wonderful creative flow, free from the chatter of the world.\nNo updates.\nNo news.\nNo pings.\nNo chats.\nNo surfing.\n</p><p>\nSilence is a great canvas for your thoughts.\nThat vacuum helps turn all of your inputs into output.\nThat lack of interruption helps you <a href=\"https://en.wikipedia.org/wiki/Flow_%28psychology%29\">flow</a>.\n</p><p>\nEvery business wants to get you addicted to their infinite updates, pings, chats, messages, and news.\nBut if what you want out of life is to <strong>create</strong>, then those are your obstacles.\n</p><p>\nPeople often ask me what they can do to be more successful.\nI say disconnect.\nEven if just for a few hours.\nUnplug.\nTurn off your phone and Wi-Fi.\nFocus.\nWrite.\nPractice.\nCreate.\n<strong>\nThat’s what’s rare and valuable these days.\n</strong>\n</p><p>\nYou get no competitive edge from consuming the same stuff everyone else is consuming.\nIt’s rare, now, to focus.\nAnd it gives such better rewards.\n</p>\n<img src=\"/images/disconnect.jpg\" />\n<div>Illustration © 2018 John Warner</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"897cb5407edec4079e949ac5ee21c28db01d561b90e81206609f08573defe3e1","category":"default"}