{"title":"Here’s how to live: Commit.","link":"https://sive.rs/htl02","date":1638403200000,"content":"<p>\nIf you’ve ever been confused or distracted, with too many options…\n<br />\nIf you don’t finish what you start…\n<br />\nIf you’re not with a person you love…\n<br />\n… then you’ve felt the problem.\n<br />\nThe problem is a lack of commitment.\n</p><p>\nYou’ve been looking for the best person, place, or career.\n<br />\nBut seeking the best is the problem.\n<br />\nNo choice is inherently the best.\n<br />\nWhat makes something the best choice?\n<br />\nYou.\n<br />\nYou make it the best through your commitment to it.\n<br />\nYour dedication and actions make any choice great.\n</p><p>\nThis is a life-changing epiphany.\n<br />\nYou can stop seeking the best option.\n<br />\nPick one and irreversibly commit.\n<br />\nThen it becomes the best choice for you.\n<br />\nVoilà.\n</p><p>\nWhen a decision is irreversible, you feel better about it.\n<br />\nWhen you’re stuck with something, you find what’s good about it.\n<br />\nWhen you can’t change your situation, you change your attitude towards it.\n<br />\nSo remove the option to change your mind.\n</p><p>\nYou think you want more choice and more options.\n<br />\nBut when you have unlimited choice, you feel worse.\n<br />\nWhen you keep all options open, you’re conflicted and miserable.\n<br />\nYour thoughts are divided.\n<br />\nYour power is diluted.\n<br />\nYour time is thinly spread.\n<br />\nIndecision keeps you shallow.\n<br />\nGet the deeper pleasure of diving into one choice.\n</p><p>\nThe English word “decide” comes from Latin “to cut off”.\n<br />\nChoose one and cut off other options.\n<br />\nTo go one direction means you’re not going other directions.\n<br />\nWhen you commit to one outcome, you’re united and sharply focused.\n<br />\nWhen you sacrifice your alternate selves, your remaining self has amazing power.\n</p><p>\nIgnore other aspects of your life.\n<br />\nLet go of every unnecessary obligation.\n<br />\nEach one seems small, but together, they’ll drain your soul.\n<br />\nFocus your attention on the few things you’re committed to, and nothing else.\n</p><p>\nWhen our ancestors shifted from nomadic hunter-gatherers to settled land developers, human development boomed.\nWe made massive advances when we stopped moving, and committed to one place.\n<br />\nChoose your home.\n<br />\nStay there for good.\n<br />\nGet to know everything about it.\n<br />\nEven if you’ve lived there for years, hire a local expert and learn even more about the history, architecture, and areas you haven’t explored.\n</p><p>\nFind a community of like-minded people.\n<br />\nDon’t waste your energy fighting norms.\n<br />\nTrust helps your happiness more than income or health.\n<br />\nInvite your neighbors over for a meal.\n<br />\nMake friends.\n<br />\nMake the effort.\n<br />\nBorrow and lend.\n<br />\nTrust and show you can be trusted.\n<br />\nLet them know they can lean on you because you’re here to stay.\n<br />\nThey’ll reciprocate.\n</p><p>\nYou’ll be an inseparable part of your community.\n<br />\nThe good relationships you build will build you.\n<br />\nThere’s no greater strength in hard times.\n</p><p>\nWhen you stay in one place, daily life is better.\n<br />\nThere’s little incentive for businesses to give good service to someone who’s only passing through.\n<br />\nBut by committing to a community, people treat you better.\n<br />\nThe rules are different.\n<br />\nThey know they’ll see you every week so it’s in their best interest to treat you well.\n<br />\nYou’re more of a friend than a stranger.\n</p><p>\nThe more social ties we have, the happier we are.\n<br />\nThe bond of friendship is one of the deepest joys in life.\n<br />\nNotice those words: ties, bond.\n<br />\nThese are words of commitment.\n<br />\nWe say we want freedom, in theory.\n<br />\nBut we actually prefer this warm embrace.\n</p><p>\nYou and your best friends don’t decide anew each day whether you’re friends or not.\n<br />\nYou are friends, without question.\n<br />\nYou’re committed to each other, even if you’ve never said so.\n<br />\nThat’s what’s wonderful about it.\n</p><p>\nWhen people say you’re a person of good character, they mean you’re not just good, but consistently so.\n<br />\nYou’re defined by what you do repeatedly.\n<br />\nYour habits create your character.\n</p><p>\nOnce you decide what’s important to you, you know how your ideal self will act and what your ideal day will be.\n<br />\nSo why not act that way and live that day every day?\n<br />\nCommit to your habits to make them rituals.\n<br />\nIf it’s not important, never do it.\n<br />\nIf it’s important, do it every day.\n</p><p>\nRockets use most of their fuel in the first minute of flight, to escape the pull of gravity.\n<br />\nOnce they get outside that pull, it’s effortless.\n<br />\nSame with your habits.\n<br />\nStarting is hard.\n<br />\nThe rest is easy.\n</p><p>\nNew habits are what you’re trying.\n<br />\nOld habits are who you are.\n</p><p>\nCommit to one career path.\n<br />\nBuild your expertise and reputation over time.\n<br />\nBecause you cut off other options, you won’t be derailed by distraction.\n<br />\nSince you’re committed, you can’t fail.\n<br />\nEven if it takes you years longer than expected, it’s not failure until you give up.\n</p><p>\nThis even goes for technical choices, whether hardware or software.\n<br />\nPick one.\n<br />\nCommit to it.\n<br />\nLearn it deeply.\n<br />\nThis is much more rewarding than always switching and searching for the best.\n</p><p>\nMarry.\n<br />\nMarry someone full of kindness who is committed to putting you in the center of their life.\n<br />\nMarry someone you don’t want to change, who doesn’t want to change you.\n<br />\nSomeone that doesn’t punish you for mistakes.\n<br />\nSomeone who sees you as your highest potential.\n<br />\nCommit completely.\n</p><p>\nFalling in love is easy.\n<br />\nStaying in love is harder.\n<br />\nEnthusiasm is common.\n<br />\nEndurance is rare.\n</p><p>\nMarriage is for getting through the times when you’re not in love.\n<br />\nExpect things to get bad.\n<br />\nYour mutual commitment gives you the security to weather the storms, knowing they won’t destroy the relationship.\n<br />\nBe loving even when you’re not feeling loving.\n</p><p>\nCommitment gives you peace of mind.\n<br />\nWhen you commit to one thing, and let go of the rest, you feel free.\n<br />\nOnce you decide something, never change your mind.\n<br />\nIt’s so much easier to decide just once.\n</p><p>\nCommitment gives you integrity and social bonds.\n<br />\nCommitment gives you expertise and power.\n<br />\nCommitment gives you love and happiness.\n<br />\nCommitting is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"8ac8f4c0374853478e37fc2b3c561e28904920fa8e8f1b0a0d7cd395b31798d4","category":"Sites"}