{"title":"People & Blogs","link":"https://bradbarrish.com/2024/03/08/people-blogs/","date":1709919976000,"content":"<p>Manuel Moreale published <a href=\"https://manuelmoreale.com/pb-brad-barrish\">my <em>People &amp; Blogs</em> interview</a> today (hello new visitors and RSS subscribers). I’ve been enjoying Manuel’s blog for a while, so when he asked me to participate, I didn’t have to think about it. I spent an embarrassing amount of time on the answers, but I am happy with how they turned out, especially the final question, which, unlike the other answers, was basically straight from my head onto the screen. It’s sort of a microcosm of how my brain works.</p>\n\n\n\n<p>Manuel’s series is yet another signal that blogging is making some a comeback. I’m definitely not alone in seeing it. The signs are everywhere. I feel like I read and hear discussions about it all the time. Just yesterday I finished listening to <a href=\"https://www.theverge.com/24087834/hank-green-decoder-podcast-google-youtube-web-media-platforms-distribution-future\">a great episode of Decoder</a> where <a href=\"https://hankgreen.com/\">Hank Green</a> interviews the usual host, <a href=\"https://www.theverge.com/\">Verge</a> Editor-in-Chief <a href=\"https://www.theverge.com/authors/nilay-patel\">Nilay Patel</a>. They spend a bunch of time on this topic, though in a broader context. The number of sites I’ve added to my RSS feeds has exploded. I can’t think of another period where I have discovered so many blogs or came across <a href=\"https://manuelmoreale.com/blog-platforms\">so many indie CMSes</a> enabling people to publish on their own domains.</p>\n\n\n\n<p>I love that people are publishing on blogs again and I hope it continues. Maybe, just maybe, people are beginning to realize that exclusively publishing on platforms we don’t control or own never ends well. Whether you’re a blogger with tens of readers or one with tens of thousands, being able to connect directly with your readers without some intermediary platform is important. Because when the platform goes away or becomes overrun with Nazis, you can easily direct your readers elsewhere. What better place than your own domain and website?</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"8b18813c5aabf1d903447b81b203e6fc8fa6b7e5134bbe2ab19f6e596b1fca1f","category":"Sites"}