{"title":"The practice and logic behind movement","link":"https://chias.blog/2024/the-practice-and-logic-behind-movement/","date":1708499163000,"content":"<span><span>Reading Time: </span> <span>2</span> <span>minutes</span></span>\n<p>Suffering is no longer interesting, so I’ve begun the process of dying.</p>\n\n\n\n<p>I started abstracting my feelings into art, which is why it’s ever the only thing I am interested in doing these days. It feels urgent–a survival mechanism–saving myself in order to save others, understanding all human beings as consequence. I stopped writing when my anger became violent, and its visibility is difficult to display.</p>\n\n\n\n<p>Nothing new is happening but self-acceptance. I listen to myself talk about love like a child, I think about my mother who bore me as a barely-child, I live again in every abandoned world and truth. Look at how far this dependence on delusion has carried me: now I can walk to the Pacific any day and give myself to it. All grandeur is still as immense. I’m not detached enough to think that excess has become mundane, and still find myself rational enough where I create most problems in my life by delay, doing the wrong intentionally. The same logic is used to crucify myself for anyone who will bear witness. </p>\n\n\n\n<p>I looked at myself so much that I made this body of nothing into something. Before this, others had to believe that there was something in that gesture: that when I looked, there was weight, a mass, a calculation. The intention was to suppose significance, to put one thing in relation to the other thing in the world. All dead, dormant things with taste and color and hue and their own voracity. All this life might be a history of longing. I’ve become the environment, and no one can help but see me.</p>\n\n\n\n<p>Kristin Ross writes <em>“For the only way you can belong to your era is without knowing it—which is to say, through belief.”</em>…</p>\n\n\n\n<p>February is short but my life is even shorter. The more I read the more I understand invention covers emptiness; my impetus to record is mostly a sign of regression. My only faith is in the tangibility of attending, everything else so compensatory.</p>\n\n\n\n<p>I’m making things that are ambitious, and I am growing unkinder. Here is a site where the whole world can be willed, where you play god; here is another where the houses flood the screen, where people suffer and you watch them in the nook of space; here is one where my whole humanity is excised, with no one to run through. The most interesting of the past years is of field recording (and proximity) and performance (and intimacy), getting comfortable with wasting people’s lives and my own, attention to seeing, seeing becomes all surfaces. Of course in the work I put in, I want to make myself divine, or make an experience close to the divine, or represent the sublimation of the divine. Of course, there are already too many stories about 23-year-olds busy making to make themselves.</p>\n\n\n\n<p>When people ask what’s on my mind, I talk about simple things: not knowing where I can legally be in a bit over a year, a persistent detachment from America and its all, the desire to author something so heavy that everyone else has to write in it.</p>\n\n\n\n<p>There is nothing new in the morning. It is just as beautiful.</p>\n\n\n\n<p></p>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"8c7cbe03923ce2164c571ef50aa12213659a5df23b2993c8a6f4e5460be47004","category":"Sites"}