{"title":"The Undisguised Extremism of the Republican Party","link":"https://kottke.org/24/08/the-undisguised-extremism-of-the-republican-party","date":1723052395000,"content":"\n        <p>Michelle Goldberg <a href=\"https://www.nytimes.com/2024/08/05/opinion/jd-vance-fascism-unhumans.html?unlocked_article_code=1.A04.OByC.-ciThxmOYibc\">writes about</a> a new book, a fascist manifesto, written by antisemite and white nationalist Jack Posobiec (and his ghostwriter) called Unhumans.</p>\n\n<blockquote><p>The word “fascist” gets thrown around a lot in politics, but it’s hard to find a more apt one for “Unhumans,” which came out last month. The book argues that leftists don’t deserve the status of human beings — that they are, as the title says, unhumans — and that they are waging a shadow war against all that is good and decent, which will end in apocalyptic slaughter if they are not stopped. “As they are opposed to humanity itself, they place themselves outside of the category completely, in an entirely new misery-driven subdivision, the unhuman,” write Posobiec and Lisec.</p></blockquote>\n\n<p>As Goldberg notes, the endorsement of the book by prominent Republicans is a reminder of how extremist and far away from reality the Republican Party is now. Trump’s running mate JD Vance wrote a blurb for it and so did Tucker Carlson, Donald Trump Jr., and Michael Flynn, Trump’s National Security Advisor. Steve Bannon wrote the foreword. These guys are weird and unhinged and dangerous because they are somehow at the center of the Republican Party. (See also <a href=\"https://kottke.org/24/07/project-2025-the-minority-rule-by-extremists\">Project 2025</a>.)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Michelle%20Goldberg\">Michelle Goldberg</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Project%202025\">Project 2025</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"8d8de962f376abe6c29633eae345cfb6fa51124011d81cc63a39f8d82f8ca064","category":"default"}