{"title":"Supp","link":"https://www.usv.com/writing/2024/10/supp/","date":1729195273000,"content":"<p>The healthcare system can sometimes feel like it’s not working on our behalf, leading to a loss of trust. When trust erodes, we lose our sense of empowerment. Our sense of agency disappears. Outcomes deteriorate. </p>\n\n\n\n<p>This isn’t inevitable.</p>\n\n\n\n<p>Instead, people-driven exploration, sharing, and collaboration around health are ways to bring back trust. And when trust re-emerges, changes in the system occur. <a target=\"_blank\" href=\"https://x.com/mhdempsey/status/1843258372982018246\"><u>Moreover, a new system can be built.</u></a></p>\n\n\n\n<p>Our investment in <a target=\"_blank\" href=\"https://supp.co/\"><u>SuppCo</u></a>, a company founded by <a target=\"_blank\" href=\"https://supp.co/about/founder-story\"><u>Steve Martocci </u></a>(with whom we have worked many times before) and <a target=\"_blank\" href=\"https://supp.co/u/nick/products\">Nick Michlewicz</a>and focused on personalized health and wellness with a people-and data-centric approach, embodies a new such system. </p>\n\n\n\n<p>SuppCo is a service that uses community-driven sharing, collective and self-led action and a data-centric approach to allow anyone to optimize their life and health goals, starting with supplements and vitamins. My <a target=\"_blank\" href=\"https://supp.co/u/andy/products\">stack</a> looks like this:</p>\n\n\n\n<figure><img src=\"https://storage.googleapis.com/papyrus_images/1402edfd49baaca03229ba8602a5a62a.png\" /></figure>\n\n\n\n<p>You will see I have some room for improvement.</p>\n\n\n\n<p>SuppCo makes it easy to build and share a personal supplement stack. The app has 160,000+ supplement products indexed by full ingredients, searchable by barcode scanning, and <a target=\"_blank\" href=\"https://supp.co/trustscore\"><u>a rating system</u></a> with hundreds of brands evaluated by 29 key attributes (such as manufacturing standards, product certifications, product quality indicators, 3rd party testing indicators, and clinical studies).</p>\n\n\n\n<p>USV invests at the edge of large markets being transformed by technological and societal pressures. <a target=\"_blank\" href=\"https://www.usv.com/writing/2024/01/healthcare-at-the-edge/\"><u>Health and wellness markets are being transformed</u></a> by increasing user demand for agency, control, and personalized, data-driven solutions that allow for experimentation and collaboration. At the same time, technological advancements, especially in at-home health tracking, now allow for novel health solutions determined and controlled by people themselves. </p>\n\n\n\n<p>SuppCo sits at this critical intersection of personal control over health and advanced technology for consumers and represents a movement that is forming at the edge of our healthcare system. This approach has the potential to restore trust, put people at the center of their own health, and help to rebuild a system from the edge.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/supp/\">Supp</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Andy Weissman","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"8e257a522c2b8ceb589e91edda70279eddfe68e269e14d2259212e30d83a5625","category":"Sites"}