{"title":"Why my code and ideas are public","link":"https://sive.rs/ws","date":1386806400000,"content":"<p>\nOver dinner my friend Valerie said, “I’m not worried about someone finding out my secrets, because secrets are just facts, right?\nSo if someone is going through my private things, for example, and gets upset about what they find, then that’s their problem, not mine!”\n</p><p>\nI liked that attitude, and kept thinking about it.\n</p><p>\nLater as we were leaving, I helped her put on her coat, and picked up her purse.\nIt was so heavy, I had to ask, “What’s in here?”\n</p><p>\nShe said, “Oh probably my two big diaries.\nI have one diary that’s private, and another that’s like super-super private.”\n</p><p>\nBecause of what she just said about secrets, I had to ask: “Can I read the super-super private one, then?”\n</p><p>\nShe was a little shocked, thought for a few seconds, laughed, and said OK.\n</p><p>\nWe got two ciders and she patiently waited while I spent 20 minutes reading through it.\nPages filled with words about processing family drama, formulating goals, plans for life changes, romantic details, lists of regrets, contemplations, etc.\n</p><p>\nI was surprised <strong>it was all meaningless to me</strong>.\nThese pages meant the world to her, but to me they meant no more than any non-secret conversation we’d ever had.\nIt was the same stuff that we all think.\n</p><p>\nLater, I thought about the stuff I keep secret.\n</p><p>\nLike my programming code, for example.\nI had it locked in an SSH-only server, on an encrypted partition.\nMy current life’s work.\nSuper-super private.\nCan’t let anyone get access to this!\n</p><p>\nBut what did I think would really happen if someone read my code?\nThey’d steal it and thrive?\n<a href=\"https://sive.rs/multiply\">Really?</a>\n</p><p>\nThen I realized it’s like Valerie’s diary.\nMeaningful to me.\nMeaningless to others.\nSo why go to the trouble to keep it so secret?\n</p><p>\n<em>\n(I realize there’s an argument on the other side.\nWhy go to the trouble to make it public?)\n</em>\n</p><p>\nBut life is an ongoing experiment, so <strong>I decided to make all my programming code and business ideas public and open source</strong>, just to see what happens.\n</p><p>\nI wanted to <strong>challenge that fear that someone is going to steal our ideas</strong>.\n</p><p>\nActually all those business ideas have been posted freely on my site for over two years now, and nobody has “stolen” them, yet.\nYou’re welcome to try.\nI’ll keep adding more.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"8eae957f02abaacb594d03746b5de34c9f21815fab2b16e2fa61942c8704c209","category":"default"}