{"title":"Something in You Hungers for Clarity: Ta-Nehisi Coates on Writing and the Power of Words to Remake the World","link":"https://www.themarginalian.org/2024/12/11/ta-nehisi-coates-message-writing/","date":1733939630000,"content":"<p><a href=\"https://www.amazon.com/Message-Ta-Nehisi-Coates/dp/0593230388/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"483\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?fit=320%2C483&amp;ssl=1\" alt=\"Something in You Hungers for Clarity: Ta-Nehisi Coates on Writing and the Power of Words to Remake the World\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?w=994&amp;ssl=1 994w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?resize=320%2C483&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?resize=600%2C905&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?resize=240%2C362&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/12/themessage_coates.jpg?resize=768%2C1159&amp;ssl=1 768w\" /></a></p><p>“Words have more power than any one can guess; it is by words that the world’s great fight, now in these civilized times, is carried on,” Mary Shelley <a href=\"https://www.themarginalian.org/2020/07/03/mary-shelley-words-lodore/\">wrote</a> in the middle of the Napoleonic Wars that laid the template for the colonialist power structure of the modern world, in an era when her chromosomes denied her the authority of her natural powers.</p>\n<p>Who gets to write shapes what gets to be written, which shapes what is remembered — that is the making of the collective selective memory we call history, and it is made of words. We invented words to name the world and invented power to apportion the named. It is our inventions that tell the fullest story of our nature. The range of them — the range between chocolate and racism, between the <em>Benedictus</em> and the bomb — is the measure of what James Baldwin called <a href=\"https://www.themarginalian.org/2017/05/24/james-baldwin-life-magazine-1963/\">“the doom and glory”</a> of what we are, metered by the words that tell the story of our self-creation.</p>\n<figure><a href=\"https://www.themarginalian.org/2022/03/24/david-byrne-history-of-the-world-in-dingbats/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/03/davidbyrne_dingbats7.jpg\" /></a><figcaption>Drawing by David Byrne from <a href=\"https://www.themarginalian.org/2022/03/24/david-byrne-history-of-the-world-in-dingbats/\"><em>A History of the World (in Dingbats)</em></a></figcaption></figure>\n<p>“What I have always wanted is to expand the frame of humanity, to shift the brackets of images and ideas,” Ta-Nehisi Coates reflects in <a href=\"https://www.amazon.com/Message-Ta-Nehisi-Coates/dp/0593230388/?tag=braipick-20\" target=\"_blank\"><strong><em>The Message</em></strong></a> (<a href=\"https://search.worldcat.org/title/1429665392\" target=\"_blank\"><em>public library</em></a>) — his soulful and sobering reckoning with the power of words and the power structures roiling beneath the landscape of permission for making the images and ideas we call art. What emerges is a manifesto for reexamining who gets to word the world’s story and render human the worlds within the world, pulsating with the urgency of the writer’s job to clarify in order to galvanize — for “you cannot act upon what you cannot see.”</p>\n<p>Writing, Coates recalls, was one of the great “obsessions” of his childhood — he relished the “private ecstasy” found in “the organization of words, silences, and sound into stories,” in “the employment of particular verbs, the playful placement of punctuation,” this mysterious alchemy of skill and vision with the power to “make the abstract and distant into something tangible and felt,” to dismantle the myths told by the wardens of the status quo and tell a different story about the world and its horizons of possibility. An epoch after John Steinbeck insisted in his <a href=\"https://www.themarginalian.org/2019/04/29/john-steinbeck-nobel-speech/\">Nobel Prize acceptance speech</a> that a writer ought to bear the torchlight of clarity in humanity’s “gray and desolate time of confusion,” Coates considers what it takes to do that, in all its ecstasy and power:</p>\n<blockquote><p>There has to be something in you, something that hungers for clarity. And you will need that hunger, because if you follow that path, soon enough you will find yourself confronting not just their myths, not just their stories, but your own.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?resize=680%2C908&amp;ssl=1\" width=\"680\" height=\"908\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?resize=240%2C320&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?resize=320%2C427&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?resize=768%2C1025&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_BeatriceAlemagna.jpg?resize=600%2C801&amp;ssl=1 600w\" /></a><figcaption>Art by Beatrice Alemagna from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>.</figcaption></figure>\n<p>Permeating the book is Coates’s countercultural courage not to mistake for reality what he so aptly terms “the haze” of his own experience — a needed reminder that we lens everything before us through everything behind us and bow to the image in the lens, calling it the world. And yet what the visionary physicist John Archibald Wheeler wrote of the nature of reality — <a href=\"https://www.themarginalian.org/2016/09/02/it-from-bit-wheeler/\">“this is a participatory universe [and] observer-participancy gives rise to information”</a> — is true of the nature of writing. Coates reflects:</p>\n<blockquote><p>There are dimensions in your words — rhythm, content, shape, feeling. And so too with the world outside. The accretion of imperfect, discomfiting life must be seen and felt so that the space in your mind, gray, automatic, and square, fills with angle, color, and curve… But the color is not just in the physical world you observe but in the unique interaction between that world and your consciousness — in your interpretation, your subjectivity, the things you notice in yourself.</p></blockquote>\n<p>Just as the writer writes with all of themselves, the reader reads with all of themselves, adding another layer of subjectivity in the act of interpretation. Sylvia Plath understood this when she was only a teenager: <a href=\"https://www.themarginalian.org/2015/07/03/sylvia-plath-letters-home-first-tragic-poem/\">“Once a poem is made available to the public, the right of interpretation belongs to the reader.”</a> So too with all creative work, much as a child enters the world to become their own person. “Your children are not your children,” Kahlil Gibran wrote in <a href=\"https://www.themarginalian.org/2019/09/09/on-children-kahlil-gibran/\">one of his most poignant poems</a>. “They come through you but not from you.” Echoing Plath and Gibran, Coates reflects on his own writing:</p>\n<blockquote><p>I imagine my books to be my children, each with its own profile and way of walking through the world… It helps me remember that though they are made by me, they are not ultimately mine. They leave home, travel, have their own relationships, and leave their own impressions. I’ve learned it’s best to, as much as possible, stay out of the way and let them live their own lives.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=680%2C939&amp;ssl=1\" width=\"680\" height=\"939\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=240%2C331&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=320%2C442&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=768%2C1060&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_OfraAmit.jpg?resize=600%2C829&amp;ssl=1 600w\" /></a><figcaption>Art by Ofra Amit from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>. (Available <a href=\"https://society6.com/product/a-velocity-of-being-ofra-amit_print?sku=s6-10131622p4a1v1?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>This is not, however, a recusal from responsibility — over and over, Coates celebrates, demands even, the power of the written word to change the life of the world and the course of what will one day be history by changing the present landscape of possibility and permission we call politics. He writes:</p>\n<blockquote><p>History is not inert but contains within it a story that implicates or justifies political order… A political order is premised not just on who can vote but on what they can vote for, which is to say on what can be imagined. And our political imagination is rooted in our history, our culture, and our myths.</p>\n<p>[…]</p>\n<p>Politics is the art of the possible, but art creates the possible of politics… Novels, memoirs, paintings, sculptures, statues, monuments, films, miniseries, advertisements, and journalism all order our reality.</p></blockquote>\n<p>Half a century after Gwendolyn Brooks wrote in <a href=\"https://www.themarginalian.org/2017/06/07/book-power-gwendolyn-brooks-bookmark/\">her forgotten poem “Book Power”</a> that “books feed and cure and chortle and collide,” that they are “flame and flight and flower,” Coates considers the singular power of writing among the other tendrils of the creative spirit — the power of revelation and self-revelation:</p>\n<blockquote><p>Film, music, the theater — all can be experienced amidst the whooping, clapping, and cheering of the crowd. But books work when no one else is looking, mind-melding author and audience, forging an imagined world that only the reader can see. Their power is so intimate, so insidious, that even its authors don’t always comprehend it.</p></blockquote>\n<p>Complement these fragments of <a href=\"https://www.amazon.com/Message-Ta-Nehisi-Coates/dp/0593230388/?tag=braipick-20\" target=\"_blank\"><strong><em>The Message</em></strong></a> with James Baldwin’s <a href=\"https://www.themarginalian.org/2016/02/08/james-baldwin-advice-on-writing/\">advice on writing</a> and some <a href=\"https://www.themarginalian.org/2019/01/14/mary-oliver-advice-on-writing/\">excellent tips from Mary Oliver</a>, then revisit May Sarton on <a href=\"https://www.themarginalian.org/2023/03/17/may-sarton-talent/\">how to cultivate your talent</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"8f02e41d2cbed8914146d6828db814c09761cc2fec4212e98064e0256706ba5c","category":"Sites"}