{"title":"How Democracy Happens: First Gradually and Then Suddenly","link":"https://kottke.org/24/07/how-democracy-happens-first-gradually-and-then-suddenly","date":1722277035000,"content":"\n        <p><a href=\"https://heathercoxrichardson.substack.com/p/july-28-2024\">Today’s piece by Heather Cox Richardson</a> takes the form of a hopeful history lesson on how sometimes democracy happens in fits and starts.</p>\n\n<blockquote><p>At this country’s most important revolutionary moments, it has seemed as if the country turned on a dime. </p>\n\n<p>In 1763, just after the end of the French and Indian War, American colonists loved that they were part of the British empire. And yet, by 1776, just a little more than a decade later, they had declared independence from that empire and set down the principles that everyone has a right to be treated equally before the law and to have a say in their government.</p>\n\n<p>The change was just as quick in the 1850s. In 1853 it sure looked as if the elite southern enslavers had taken over the country. They controlled the Senate, the White House, and the Supreme Court. They explicitly rejected the Declaration of Independence and declared that they had the right to rule over the country’s majority. They planned to take over the United States and then to take over the world, creating a global economy based on human enslavement. </p>\n\n<p>And yet, just seven years later, voters put Abraham Lincoln in the White House with a promise to stand against the Slave Power and to protect a government “of the people, by the people, and for the people.” He ushered in “a new birth of freedom” in what historians call the second American revolution.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Heather%20Cox%20Richardson\">Heather Cox Richardson</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"8f269f860ab50d64c872395fb24d39b6a576489bdbab94291ca364de513568d1","category":"default"}