{"title":"Another YouTuber couch apology","link":"https://www.garbageday.email/p/another-youtuber-couch-apology","date":1714417200000,"content":"<div><div><p></p><p><i>Audio versions of Garbage Day back on Wednesday. You can find it on every major podcasting app (search “Garbage Day” and look for the trash can). If it’s not there, </i><a href=\"https://anchor.fm/s/f499c1b4/podcast/rss?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\"><i>here’s an RSS feed</i></a><i>.</i></p><hr /><h2>A Tale Of Two Subscriptions</h2><p>Two very interesting stories in the creator economy are playing out simultaneously right now and what's even more fascinating, they both completely contradict each other.</p><p>First, Dropout, the subscription-based digital media company launched by former College Humor employees, is playing — and selling out — Madison Square Garden. Specifically, their flagship tabletop-roleplaying show <i>Dimension 20</i>. Second, Watcher, a production company and YouTube channel created by former BuzzFeed employees, launched a subscription service, was royally torched by their audience for it, apologized, and <a href=\"https://www.themarysue.com/the-watcher-controversy-explained/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">walked it back</a> (sorta). They said they’ll continue to release their content for free on YouTube, a few weeks after it goes up on their site.</p><p>If you were to judge the health of the creator economy through the Dropout lens, well, it's never been bigger. But if you were to view it through Watcher, the only sane conclusion would be that it was well and truly over. Taken together, however, you actually get the clearest picture yet of both what the creator economy actually is and, most importantly, how fans and customers currently understand it. But let’s start with Dropout.</p><p>Dropout launched in 2018 as the subscription arm of College Humor, which, yes, sounds insane now and sounded even more insane then. College Humor’s owner, IAC, sold the College Humor brand to the company’s then-Chief Creative Officer Sam Reich right before the pandemic, which was the real beginning of the Dropout era. College Humor was largely sunset and Dropout became the flagship. It was also during the pandemic that Reich and his team fully committed to the current Dropout setup: Unscripted comedies featuring a rotating, but familiar cast of comedians, actors, and creators, distributed on their own subscription streaming platform, but advertised via clips and one-offs on social platforms like YouTube and TikTok. I first caught wind of Dropout around 2021 thanks to clips from <i>Dimension 20</i> and <i>Game Changers</i> taking over Tumblr for a while.</p><p>If you’ve never seen a Dropout show, the best way to think about it is <i>Whose Line Is It Anyway?</i> reconfigured like the WWE or the MCU. Instead of an episode of <i>Whose Line</i>… featuring a dozen smaller improv games and one cast, each improv game on Dropout becomes its own very bingeable series featuring a bunch of different players. </p><p>Dropout currently has a paying audience somewhere in the <a href=\"https://variety.com/2023/streaming/news/dropout-subscribers-double-new-shows-sam-reich-1235829675/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">“mid-six figures,”</a> but its biggest show, the one <a href=\"https://techcrunch.com/2024/04/12/a-dungeons-dragons-actual-play-show-is-going-to-sell-out-madison-square-garden/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">selling out</a> Madison Square Garden, is a tabletop-roleplaying series called <i>Dimension 20</i>. The RPG elements of <i>Dimension 20</i> are, of course, the main reason its so popular — the show’s dungeon master Brennan Lee Mulligan is arguably one of the best DMs in the world. But it’s also successful because <i>Dimension 20</i>, like all Dropout shows, functions as a hub for the cast members you’ll eventually see pop up across all of Dropout’s shows. Which is why their content is working so well right now.</p><p>The Dropout subscription is actually a very powerful feedback loop. You sign up because you like a bunch of their free clips or a creator you like goes on one of their shows. You binge one of their series, you get familiar with the cast, you binge another show, you meet more cast members, etc. It’s not dissimilar from how podcast networks used to work in their heyday. Watcher, however, is a bit different.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/1d127767-6a9c-481a-a9b8-2c5c746d97aa/Screenshot_2024-04-29_at_10.24.23_AM.png?t=1714411481\" /><div><span><p>(The dreaded YouTube couch apology.)</p></span></div></div><p>Watcher launched as a YouTube channel four years ago and has grown very fast, all things considered. It has close to three million subscribers and at their peak last year, their videos were regularly cracking five million views. And they do have “shows” on their channel, sort of. But unlike Dropout, which produces very specific formats, Watcher largely traffics in 2010s open-ended viral content — a show about eating expensive food, a show about interviewing creators while shopping for groceries, paranormal reality shows, etc. Watcher’s team is roughly one viral content micro-generation younger than the Try Guys, but it’s the same dynamic.</p><p>And there’s nothing wrong with these shows. They do well on YouTube and they work well as a funnel to Watcher’s Patreon — which has over 13,000 subscribers, it should be noted. But they aren’t enough to support an entire streaming platform. Watcher’s audience is young and — as they <a href=\"https://themiddlepart.substack.com/p/is-it-the-creator-or-the-platform?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">all screamed</a> into the comment section last week — don’t watch Watcher content because it’s premium, high-quality entertainment. They watch it because they like the channel’s three hosts. And I think this is the key takeaway here. </p><p>A subscription-based business requires an active fandom. And an ad-supported business requires a much bigger, and thus, usually more passive fandom. Due to the mechanics of the scale required to make money from digital advertising, you have to go broad. MrBeast would be the best example of what this looks like. And Watcher isn’t the first media company to think their more passive, parasocial fandom could be flipped into an active one. The most disastrous version of this <a href=\"https://www.garbageday.email/p/cnn-is-worth-0143-of-a-quibi?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">was CNN+</a>, which similarly attempted to leverage people you kinda know and like from your various screens to launch a Netflix-like streaming service. It ended up with less than 10,000 users in its first couple weeks. </p><p>But also Watcher isn’t totally to blame here. YouTube continues to push for more TV-level production from its biggest channels, but does not financially scale in a way that makes that possible without losing your mind. But I think this is, more than anything, a cultural sea change that Watcher found themselves on the wrong side of. Over the last few years, I’ve said that the way popularity works has changed post-pandemic and this is what I mean. Can Dropout sell out huge stadiums all over the world Taylor Swift-style? No, but they’ve spent four year cultivating a very active fanbase who will show up in person. While a YouTube channel with close to three million subs and over 10,000 Patreon patrons is struggling to evolve beyond the grind of platform publishing. </p><hr /><h2>There’s A Whole Bunch Of Garbage Day Events Coming Up!</h2><p><a href=\"https://www.zegfest.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\"><b>ZEG Storytelling Festival</b></a> — June 21-23, Tbilisi, Georgia</p><p><a href=\"https://www.latitudefestival.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\"><b>Latitude Festival</b></a> — July 25 - 28, Suffolk, UK (Will try and set up a London binhead meetup while I’m in town)</p><p><a href=\"https://www.fwbfest.xyz/book?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\"><b>FWB Fest 24</b></a> — August 1-4, Idyllwild, CA</p><p>For folks who don’t know, I do a range of live events. Everything from conferences to comedy clubs to concerts. I opened for the band Tanlines in New York a few weeks ago. It was awesome. Want Garbage Day at your event? Want Garbage Day to host an event in your city? Shoot me an email at <a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a>! I’ll go anywhere and do anything as long as it’s not a complete financial loss for me to get there lol. Let’s see if we can make it work.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\"><span> Upgrade </span></a></div><hr /></div><h2>Is The “Bonk Bonk Jug Song” The Song Of The Summer???</h2><blockquote><a href=\"https://www.instagram.com/p/C6MSEoyLdJc/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\"><p> Instagram post by @noshu4me </p></a></blockquote><p>In case you’re curious, this song was created by No$hu. It’s over <a href=\"https://noshumusic.bandcamp.com/track/the-bonk-song?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">on Bandcamp</a> if you want to listen to the full thing. And the beat underneath it was produced by <a href=\"https://jakeangelbeats.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">jackangelbeats</a>. The footage is from a pro-Palestine protest at California State Polytechnic University, Humboldt. Bonk bonk!</p><hr /><h2>I Can’t Believe We’re Really Doing The Whole TikTok Thing</h2><p>It’s official. ByteDance has nine months to divest TikTok to an American company or be banned in the US. I think <i>404 Media</i> has <a href=\"https://www.404media.co/the-u-s-wants-to-ban-tiktok-for-the-sins-of-every-social-media-company/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">the best overall take</a> on this, which is that TikTok is being sacrificed for the “sins” of every other social media company. Reporter Sam Biddle also <a href=\"https://twitter.com/samfbiddle/status/1783275608342221264?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">made a good point</a>, which is that TikTok’s dreaded “algorithm” is just… a bunch of code that recommends videos. Like, if US tech companies were still good and knew how to make things instead of acquire things, which they also cannot do anymore, they could just make something better. Though, ByteDance also seems to think their algorithm is one-of-a-kind because they’re debating <a href=\"https://www.theinformation.com/articles/bytedance-exploring-scenarios-for-selling-tiktok-without-algorithm?rc=5pjqe5&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">selling TikTok</a> without it. Which would honestly be the funniest outcome here.</p><p>But the last important thing here was mentioned by <i>Slate</i>’s Scott Nover, who <a href=\"https://twitter.com/scottnover/status/1783522841461174681?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">argued</a> that this is all really happening because the US government refuses to “legislate, pass data privacy legislation, and promote competition in the social media space.”</p><hr /><h2>Right-Wing Media Is Going Broke</h2><p>The same digital advertising squeeze that’s crushing mainstream publishers is also affecting right-wing media. But, also, right-wing media, in particular, has been the target of hugely effective <a href=\"https://twitter.com/nandoodles/status/1783208002625155489?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">protesting campaigns</a> from organizations like Check My Ads.</p><p>But it seems like the bottom is falling out on conservative publishers much harder and faster than their centrist counterparts. Most likely because most of these sites were just blogs run by weird old men before Facebook turned them into the future of media. Case in point: <i>Gateway Pundit</i>, one of the largest right-wing publishers of the Trump era, and ground zero for some of the biggest, most aggressive conspiracy theories of the late-2010s, <a href=\"https://www.reuters.com/business/media-telecom/conservative-news-site-gateway-pundit-files-bankruptcy-2024-04-25/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">is filing</a> for Chapter 11. Get wrecked.</p><p><i>Gateway Pundit</i> <a href=\"https://www.reuters.com/business/media-telecom/conservative-news-site-gateway-pundit-files-bankruptcy-2024-04-25/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">is also facing</a> a defamation suit, which, obviously, doesn’t help them here. But most of these sites are imploding because they were entirely dependent on platforms and now the platforms don’t need them anymore. This doesn’t mean that right-wing agitators are suddenly gone from the internet. They just need a few more months to really figure out how to make short-form video content. Then we’ll do this dance all over again.</p><hr /><h2>The <i>Stellar Blade </i>Weirdos Made The Mistake Of Recording Videos Of Themselves</h2><p>OK, I’m going to try and speedrun through this whole thing so we can get to the funny part.</p><p><i>Stellar Blade</i> is a new video game and it features a sexy lady as its main character. Reviewers say the game <a href=\"https://www.washingtonpost.com/entertainment/video-games/2024/04/24/stellar-blade-review/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">is fine, not amazing, but pretty fun</a>. But before the game came out, a bunch of gamergaters latched on to it, assuming that it would be trounced by critics because of the aforementioned sexy lady. When reviewers didn’t trash the game, the gamergaters tried to find something — anything — to rally around as a culture war thing. They settled on #FreeStellarBlade, <a href=\"https://www.change.org/p/free-stellar-blade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">which is a petition on change.org lmfao</a>. They claim the game was censored, largely the main character’s <a href=\"https://twitter.com/manfightdragon/status/1784460424278339926?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">skimpy outifts</a>, I guess. Though, the outfits are still very skimpy in the game! </p><p>Anyways, as always, none of this matters to real people with actual lives and people who care about them. And if you need proof of that, thankfully, change.org allows video uploads. And some of the #FreeStellarBlade guys are posting videos in support of the campaign. There are definitely some trolls in there, but there are a lot of very real ones, as well. Enjoy.</p><blockquote><p></p><p>So, I visited the <span>#FreeStellarBlade</span> petition website and there were some videos of people who wanted their voices and opinions to be heard.</p><p>Free speech is a wonderful thing.</p><p></p><a href=\"https://twitter.com/k__med/status/1784738806044008638?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\"><p> — K-Med (@K__Med) <br /> Apr 29, 2024 </p></a></blockquote><hr /><h2>A Famous Internet Mystery Has Been Solved (It Was From Porn)</h2><p>Internet users have spent years trying to find a piece of lost media, usually referred to as “Everyone Knows That” or “EKT”. </p><p>A 17-second clip of the song was first uploaded by a user named Carl92 back in 2021 to a website called <a href=\"http://WatZatSong.com?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">WatZatSong.com</a>. The mystery around the song would go on to spawn a <a href=\"https://www.reddit.com/r/everyoneknowsthat/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">subreddit</a> with over 50,000 users. And a user on the subreddit over the weekend finally figured out where the song came from: it’s from a porno.</p><p>u/south_pole_ball <a href=\"https://www.reddit.com/r/everyoneknowsthat/comments/1cf7fxd/ekt_is_found_heavy_nsfw_warning/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">explained</a> how they found the song. They used a tip from another member of the subreddit found “a video on YouTube of a scene from an adult movie that had a song which sounded very similar to EKT.” Uh huh, right, on YouTube. The porn had credits which led to a list of music from a composer named Christopher Saint Booth. And, sure enough, Booth composed the song specifically for a pornographic film called <i>Angels Of Passion </i>back in 1986. Here’s <a href=\"https://www.imdb.com/title/tt0180439/?ref_=nm_flmg_t_79_com&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">the IMDB page</a>. You can, uh, verify this further on your own.</p><hr /><h2><span>I Would Try This…</span></h2><blockquote><p></p><p>Be the change you wish to see in the world</p><p></p><a href=\"https://twitter.com/dontdrinkbeer/status/1783583752716988904?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\"><p> — dontdrinkbeer (@dontdrinkbeer) <br /> Apr 25, 2024 </p></a></blockquote><p>I saw a few folks calling this the “<a href=\"https://twitter.com/search?q=billie+irish&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">Billie Irish</a>,” which is real good.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://prospect.org/power/2024-04-24-my-dinner-with-andreessen/?utm_source=pocket_reader\" target=\"_blank\">“My Dinner With Andreessen”</a></p></li><li><p><a href=\"https://www.cntraveler.com/story/after-prison-i-went-to-miami-to-reacquaint-myself-with-freedom?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">“After Prison, I Went to Miami to Reacquaint Myself With Freedom”</a></p></li><li><p><a href=\"https://www.deezlinks.com/p/the-central-object-of-your-disgust?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">“The central object of your disgust over these past several weeks has not been external.”</a></p></li><li><p><a href=\"https://www.stereogum.com/2261004/cindy-lee-diamond-jubilee-concert-review/reviews/concert-review/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">“At The Cindy Lee Show, Making Sense Of The Hype”</a></p></li></ul><hr /><p><span>P.S. here are </span><span><a href=\"https://www.tiktok.com/@globetrots/video/7362608851130043681?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=another-youtuber-couch-apology\" target=\"_blank\">the top 10 largest Tesco stores in the UK</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=aec1e9db-2e8d-4688-9dc8-aec9217b2b05&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"8f6a7ecaabcc8bf3037ee8743718d77dc02978dea676c116c60967d3c11bf1af","category":"default"}