{"title":"What It’s Like to Be a Falcon: The Peregrine as a Portal to a Way of Seeing and a State of Being","link":"https://www.themarginalian.org/2024/05/09/baker-peregrine/","date":1715302742000,"content":"<h3>“You cannot know what freedom means till you have seen a peregrine loosed into the warm spring sky to roam at will through all the far provinces of light.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Peregrine-Anniversary-Afterword-Robert-Macfarlane/dp/0008216215/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"495\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?fit=320%2C495&amp;ssl=1\" alt=\"What It’s Like to Be a Falcon: The Peregrine as a Portal to a Way of Seeing and a State of Being\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?w=963&amp;ssl=1 963w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?resize=240%2C372&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_baker_macfarlane.jpg?resize=768%2C1189&amp;ssl=1 768w\" /></a></p><p>We shall never know the sky, you and I — never know how to pierce a mountain with a pupil or sweep a meadow with a wing — and so we shall never know this world in its totality. It is our creaturely destiny to remain earthbound, trapped in frames of reference shaped by our senses, but it is our biological benediction to have a consciousness crowned with an imagination — that periscope of wonder capable of reaching beyond our sensorium, beyond the self, projecting us into other realities and other ways of being.</p>\n<p>In the mid-1950s, a near-sighted English office worker set out to do for the sky what Rachel Carson <a href=\"https://www.themarginalian.org/2017/02/28/undersea-rachel-carson/\">had done for the sea</a> thirty years earlier — invite our human imagination, grounded yet boundless, into the world of another creature dwelling in another sphere. <strong>J.A. Baker</strong> (August 6, 1926–December 26, 1987) spent a decade following earth’s fastest flying bird on bicycle and on foot, possessed by its “restless brilliance.” When he unloosed <a href=\"https://www.amazon.com/Peregrine-Anniversary-Afterword-Robert-Macfarlane/dp/0008216215/?tag=braipick-20\" target=\"_blank\"><strong><em>The Peregrine</em></strong></a> (<a href=\"https://search.worldcat.org/title/749912720\" target=\"_blank\"><em>public library</em></a>) into the atmosphere of culture in 1967 — an atmosphere shaped by the new ecological conscience awakened by Carson’s <a href=\"https://www.themarginalian.org/2017/01/27/rachel-carson-silent-spring-dorothy-freeman/\"><em>Silent Spring</em></a> five years earlier — it was a clarion call and a consecration, entirely original, yet emanating Thoreau’s meticulous observation, Whitman’s ecstatic language, and Carson’s soulful reverence for the realities of nature in all their brutal beauty. An epoch later, it remains an ode to wonder, a field guide to observation as devotional practice, a passionate and poetic reminder that by attending closely and tenderly to any one thing, we recover our natural reverence for everything, our love of the world in all its strangeness and splendor.</p>\n<p>Baker writes:</p>\n<blockquote><p>You cannot know what freedom means till you have seen a peregrine loosed into the warm spring sky to roam at will through all the far provinces of light.</p></blockquote>\n<figure><a href=\"https://society6.com/product/peregrine-at-auchencairn-by-archibald-thorburn-1923-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=680%2C1073&amp;ssl=1\" width=\"680\" height=\"1073\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=320%2C505&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=600%2C947&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=240%2C379&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=768%2C1212&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines5_small.jpg?resize=974%2C1536&amp;ssl=1 974w\" /></a><figcaption><em>Peregrine at Auchencairn</em> by Archibald Thorburn, 1923. (Available as <a href=\"https://society6.com/product/peregrine-at-auchencairn-by-archibald-thorburn-1923-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/peregrine-at-auchencairn-by-archibald-thorburn-1923-benefitting-the-nature-conservancy_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>On <a href=\"https://www.themarginalian.org/2016/10/26/explainer-elucidator-enchanter-great-writing/\">the hierarchy of explanation, elucidation, and enchantment</a> to which all writing about the natural world and the science of reality belongs, Baker is a virtuosic enchanter. The writing is at times almost unbearably beautiful — about the bird (<em>“He was a small speck now, like the pupil of a distant eye. Serenely he floated. Then, like music breaking, he began to descend.”</em>), and about the world lensed through the bird (<em>“The day hardened in the easterly gale, like a flawless crystal. Columns of sunlight floated on the land. The unrelenting clarity of the air was solid, resonant, cold and pure and remote as the face of the dead.”</em>) Echoing Carson’s insistence that <a href=\"https://www.themarginalian.org/2013/12/23/rachel-carson-on-wonder/\">“it is not half so important to know as to feel”</a> — the ethos that made her own writing so enchanting and unexampled — Baker captures the key to writing at the level of enchantment:</p>\n<blockquote><p>I do not believe that honest observation is enough. The emotions and behaviour of the watcher are also facts, and they must be truthfully recorded.</p></blockquote>\n<p>Like me, Baker was a latecomer to the love of birds, having long seen them “only as a tremor at the edge of vision.” And then something broke open, broke free. For ten years, he spent his winters “looking upward for that cloud-biting anchor shape, that crossbow flinging through the air,” learning along the way a new way of seeing — the peregrine’s way. (“To see takes time,” Georgia O’Keeffe <a href=\"https://www.themarginalian.org/2018/11/15/georgia-okeeffe-flower/\">wrote</a>, “like to have a friend takes time.”) In consonance with the most eternal line from <em>The Little Prince</em> — “What is essential is invisible to the eye.” — Baker observes:</p>\n<blockquote><p>The hardest thing of all to see is what is really there.</p></blockquote>\n<figure><a href=\"https://society6.com/product/peregrine-falcon-by-henry-leonard-meyer-1853-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=680%2C1008&amp;ssl=1\" width=\"680\" height=\"1008\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=320%2C474&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=600%2C890&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=240%2C356&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=768%2C1139&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/peregrine_Marginalian.jpg?resize=1036%2C1536&amp;ssl=1 1036w\" /></a><figcaption>Peregrines from <em>Coloured Illustrations of British Birds and Their Eggs</em> by Henry Leonard Meyer, 1864. (Available as <a href=\"https://society6.com/product/peregrine-falcon-by-henry-leonard-meyer-1853-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/peregrine-falcon-by-henry-leonard-meyer-1853-benefitting-the-nature-conservancy_cards?sku=s6-28350165p22a16v71?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>There is, of course, first the biological marvel of the peregrine’s sight, which renders visible not just to the soul but the eye itself layers of reality invisible to us:</p>\n<blockquote><p>The eyes of a falcon peregrine weigh approximately one ounce each; they are larger and heavier than human eyes. If our eyes were in the same proportion to our bodies as the peregrine’s are to his, a twelve-stone man would have eyes three inches across, weighing four pounds. The whole retina of a hawk’s eye records a resolution of distant objects that is twice as acute as that of the human retina. Where the lateral and binocular visions focus, there are deep-pitted foveal areas; their numerous cells record a resolution eight times as great as ours. This means that a hawk, endlessly scanning the landscape with small abrupt turns of his head, will pick up any point of movement; by focusing upon it he can immediately make it flare up into larger, clearer view. </p>\n<p>The peregrine’s view of the land is like the yachtsman’s view of the shore as he sails into the long estuaries. A wake of water recedes behind him, the wake of the pierced horizon glides back on either side. Like the seafarer, the peregrine lives in a pouring-away world of no attachment, a world of wakes and tilting, of sinking planes of land and water. We who are anchored and earthbound cannot envisage this freedom of the eye. The peregrine sees and remembers patterns we do not know exist: the neat squares of orchard and woodland, the endlessly varying quadrilateral shapes of fields. He finds his way across the land by a succession of remembered symmetries.</p></blockquote>\n<figure><a href=\"https://society6.com/product/gyr-falcon-and-peregrine-falcon-by-archibald-thorburn-1915-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?resize=680%2C869&amp;ssl=1\" width=\"680\" height=\"869\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?resize=320%2C409&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?resize=600%2C767&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?resize=240%2C307&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/Thorburn_Peregrines_small.jpg?resize=768%2C981&amp;ssl=1 768w\" /></a><figcaption>Gyr-falcon and peregrine falcon by Archibald Thorburn, 1915. (Available as <a href=\"https://society6.com/product/gyr-falcon-and-peregrine-falcon-by-archibald-thorburn-1915-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/gyr-falcon-and-peregrine-falcon-by-archibald-thorburn-1915-benefitting-the-nature-conservancy_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>From this astonishing physiology of seeing arises an astonishing way of being, alien to ours — a vivid reminder that this one planet, this common home to every creature that ever was and ever will be, is composed of billions upon billions of different worlds, each particular to the consciousness that inhabits it. In one of the book’s most exquisite passages, Baker slips into the consciousness of the peregrine, body and soul:</p>\n<blockquote><p>Slowly he drifted above the orchard skyline and circled down wind, curving upward and round in long steep glides. He passed from the cold white sky of the south, up to the warm blue zenith, ascending the wind-bent thermal with wonderful ease and skill. His long-winged, blunt-headed shape contracted, dwindled, and darkened to the flinty point of a diamond as he circled high and far over; hanging and drifting above; indolent, watchful, supreme. Looking down, the hawk saw the big orchard beneath him shrink into dark twiggy lines and green strips; saw the dark woods closing together and reaching out across the hills; saw the green and white fields turning to brown; saw the silver line of the brook, and the coiled river slowly uncoiling; saw the whole valley flattening and widening; saw the horizon staining with distant towns; saw the estuary lifting up its blue and silver mouth, tongued with green islands. And beyond, beyond all, he saw the straight-ruled shine of the sea floating like a rim of mercury on the surface of the brown and white land. The sea, rising as he rose, lifted its blazing storm of light, and thundered to freedom to the land-locked hawk… I watched him with longing, as though he were reflecting down to me his brilliant unregarded vision of the land beyond the hill… He sank forward into the wind, and passed slowly down across the sun. I had to let him go. When I looked back, through green and violet nebulae of whirling light, I could just see a tiny speck of dusk falling to earth from the sun, flashing and turning and falling through an immense silence that crashed open in a tumult of shrilling, wing-beating birds.</p>\n<p>[…]</p>\n<p>Standing in the fields near the north orchard, I shut my eyes and tried to crystallise my will into the light-drenched prism of the hawk’s mind. Warm and firm-footed in long grass smelling of the sun, I sank into the skin and blood and bones of the hawk. The ground became a branch to my feet, the sun on my eyelids was heavy and warm. Like the hawk, I heard and hated the sound of man, that faceless horror of the stony places. I stifled in the same filthy sack of fear. I shared the same hunter’s longing for the wild home none can know, alone with the sight and smell of the quarry, under the indifferent sky. I felt the pull of the north, the mystery and fascination of the migrating gulls. I shared the same strange yearning to be gone. I sank down and slept into the feather-light sleep of the hawk.</p></blockquote>\n<p>Couple <a href=\"https://www.amazon.com/Peregrine-Anniversary-Afterword-Robert-Macfarlane/dp/0008216215/?tag=braipick-20\" target=\"_blank\"><strong><em>The Peregrine</em></strong></a> — one of Werner Herzog’s <a href=\"https://www.themarginalian.org/2016/08/19/werner-herzog-reading-list/\">five requisite books for any filmmaker</a> — with the fascinating science of <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">what it’s like to be an owl</a>, <a href=\"https://www.themarginalian.org/2022/01/22/cetacean-communication/\">what it’s like to be a whale</a>, and <a href=\"https://www.themarginalian.org/2019/09/06/alexandra-horowitz-our-dogs-ourselves/\">what it’s like to be a dog</a>, then revisit Helen Macdonald’s exquisite recollection of <a href=\"https://www.themarginalian.org/2015/12/16/h-is-for-hawk/\">what a hawk taught her about love and loss</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"903f881990521737d176ac996ef7766df8c4bfd3c939f3ccfbe0957de53c290b","category":"default"}