{"title":"USV Microfiche #4","link":"https://www.usv.com/writing/2024/10/usv-microfiche-4/","date":1728997838000,"content":"<p>Over the last few years, I’ve moved my internet life from web2 to web3 and rarely use any web2 services anymore.</p>\n<p>So I am starting a series called “I’ve Moved Onchain” to explain this journey to everyone and today’s opening post is about blogging, naturally.</p>\n<p>I’ve blogged at AVC.com for a very long time. I started out in September 2003 at avc.typepad.com but moved to avc.com a few years later.</p>\n<p>AVC.com has been my home for blogging for over twenty years.</p>\n<p>AVC.com has served me very well over the years but it lacks a few things that really matter to me.</p>\n<p>First, the posts are stored in a closed database hosted by me in the cloud.</p>\n<p>Second, the services that I use to create AVC.com are not “composable” meaning that others cannot build things on top of AVC.com and the services that create and display the posts I create here.</p>\n<p>Third, the identities of the authors (me) and readers (you) here at AVC.com are not tied to any sort of portable identity and reputation system.</p>\n<p>While none of these issues may seem like a big deal to you, they are huge deal to me as I will explain in a bit.</p>\n<p>So when web3 blogging services started cropping up, I started to use them.</p>\n<p>My first rodeo was at Mirror.xyz where I kept avc.mirror.xyz for most of 2021, 2022, and 2023. This was my first post at avc.mirror.xyz on March 18, 2021.</p>\n<p>I really wanted to blog at AVC.xyz and that became an option for me in November 2023 when I joined Paragraph.xyz and wrote this Hello World post .</p>\n<p>These web3 blogging platforms store all of my posts onchain at Arweave. These posts are available to anyone to read regardless of what blogging platform I use. And if I get abducted by an alien and fail to pay my hosting service, they will still exist onchain. Forever. That’s a huge deal to me.</p>\n<p>They are also composable web3 services. Any developer can take what I create at AVC.xyz and build on top of it. That’s also a huge deal to me. My partner Nick describes the composability benefit so well in his post today on USV.com .</p>\n<p>And my identity and the identity of my readers are mapped to a web3 wallet address that authenticates who they are, what they do onchain, and allows developers to create reputation systems on everyone. Given my fight with spam and trolls and jerks and assholes that largely drove me away from blogging and commenting in the latter part of the last decade, this last bit really matters to me.</p>\n<p>At the start of this year, I took everyone who receives an email when I post here at AVC.com and imported that email list to Paragraph.xyz. So a lot of the AVC readers have been getting emails of my posts at AVC.xyz this year. But even so, I still get a ton of daily traffic here at AVC.com and I have not posted anything new here since January 10, 2024.</p>\n<p>I do not plan to post here at AVC.com going forward, but I will keep the archive up and I may choose to cross-post a thing or two here whenever I want to reach the broadest audience.</p>\n<p>My home for blogging is and has been onchain for a while now and if you want to follow my writing, please go visit avc.xyz and subscribe to receive my blog posts via email by clicking the green subscribe button on the upper right.</p>\n<p>But what about Mirror.xyz and avc.mirror.xyz? you might ask.</p>\n<p>Well, I am also thrilled to be able to say that Mirror and Paragraph have merged and these two leading web3 blogging services will now be one. And, as you may know or suspect, USV has invested in both of them and now will be a major shareholder in the merged company. I am very excited about that. Here is Paragraph’s blog post about the transaction and here is Mirror’s .</p>\n<p>The team that built Mirror.xyz is now turning their attention to a new app called Kiosk and they blogged about that today . So USV is now also an investor in that project.</p>\n<p>Over the last thirty years, our lives moved from offline to online. They are now moving onchain. That’s a wonderful thing and I hope you will join me in moving onchain as well.</p>\n<p>USV TEAM POSTS: Nick Grossman — May 2, 2024</p>\n<p>Doubling Down on Onchain Publishing with Paragraph</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/usv-microfiche-4/\">USV Microfiche #4</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"90e457728d79e7a3f8f8ea937ca9ca198837de7b93e7c10cc84457bd6a6fda6e","category":"Sites"}