{"title":"The Kennedy v Nixon template","link":"http://scripting.com/2024/11/28/153349.html?title=theKennedyVNixonTemplate","date":1732808029000,"content":"<p>Analogously, Trump is Kennedy and Biden/Harris is Nixon.  </p>\n<p>And the social web is, in 2024, what TV was in 1960.</p>\n<p>Trump has mastered the new medium. To a large extent, he <i>created</i> the new medium, and the resulting network formed around him.</p>\n<p>So when <a href=\"https://podcasts.apple.com/us/podcast/why-did-trump-win-james-carville-has-discovered-an/id1728152109?i=1000678267539\">Carville says</a> he wants to figure out how to communicate the way Trump did, he can't because our way doesn't work in his universe. We have to create our own. </p>\n<p>Analogously Nixon might have said about TV in 1959 -- how can we get into that? If you have to ask you <i>can't</i> get there. You have to fit like a hand in a glove, like Kennedy or Trump.</p>\n<p>The next Democratic candidate to win the presidency will have to be a media creator. They must create a medium that's perfectly adapted to the communication interests of the 50 percent of the electorate that voted for Harris and the other 20 percent who would if they just knew who she was. </p>\n<p>Look at the picture of Kennedy and Nixon. Did we elect Kennedy over Nixon because he had better policy? No. We elected him because he has better hair. Because on TV what counts is your hair. A <a href=\"https://www.google.com/search?q=site%3Ascripting.com+chris+lydon\">friend</a> who was a TV news person told me that. </p>\n<p>So if you want to win, create an internet farm system. A network with everyone who wants to run for office nationwide on the Democratic ticket. And let's see how they work in the new medium. We get to know them like we knew Archie Bunker. And let's get some people we get to know who also tend to tell the truth (though they can screw up and we'll forgive them, remember the gotchas are over).</p>\n<p></p><div><img src=\"https://imgs.scripting.com/2024/11/28/kennedyNixon.png\" />Kennedy and Nixon on the debate stage in 1960.</div><p></p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"91521e76d70300610d3d60e10e697b997cea2040b38adb1bededcc98decb6a7f","category":"Sites"}