{"title":"FAA Aviation Maps","link":"https://kottke.org/24/02/faa-aviation-maps","date":1707151736000,"content":"\n        <p><img src=\"/plus/misc/images/faa-maps-01.jpg\" width=\"1000\" height=\"500\" alt=\"FAA map of Chicago O'Hare airport\" /></p>\n\n<p><img src=\"/plus/misc/images/faa-maps-02.jpg\" width=\"1000\" height=\"683\" alt=\"FAA map of an airport in Alaska\" /></p>\n\n<p><img src=\"/plus/misc/images/faa-maps-03.jpg\" width=\"1000\" height=\"516\" alt=\"FAA map of the Houston airport\" /></p>\n\n<p>On Beautiful Public Data, <a href=\"https://www.beautifulpublicdata.com/faa-aviation-maps/\">Jon Keegan highlights the extremely information-rich flight maps produced by the Federal Aviation Administration</a> that pilots use to find their way around the skies.</p>\n\n<blockquote><p>Among all of the visual information published by the U.S. government, there may be no product with a higher information density than the Federal Aviation Administration’s (FAA) aviation maps. Intended for pilots, the FAA publishes free detailed maps of the entire U.S. airspace, and detailed maps of airports and their surroundings and updates them frequently. The density of the critical information layered on these maps is staggering, and it is a miracle that pilots can easily decipher these maps’ at a glance.</p></blockquote>\n\n<p>Oh wow, this takes me back. My dad was a <a href=\"https://kottke.org/15/06/flying-with-my-dad\">pilot</a> when I was a kid and he had a bunch of FAA maps in the house, in his planes, and even on the walls of his office. I remember finding these maps both oddly beautiful and almost completely inscrutable. What a treat to be able to finally figure out how to read them, at least a little bit. And the waypoint names are fun too:</p>\n\n<blockquote><p>Orlando, FL has many Disney themed waypoints such as JAFAR, PIGLT, JAZMN, TTIGR, MINEE, HKUNA and MTATA. Flying into Orlando, your plane might use the SNFLD arrival path, taking you past NOOMN, FORYU, SNFLD, JRRYY and GTOUT.</p>\n\n<p>Based on the waypoints near Atlanta’s Hartsfield-Jackson International, this airport must be home to some of the nerdiest air traffic controllers. There’s a crazy number of Lord of the Rings waypoints: HOBTT, SHYRE, FRDDO, BLLBO, BGGNS, NZGUL, RAETH, ORRKK, GOLLM, ROHUN, GONDR, GIMLY, STRDR, SMAWG and GNDLF.</p></blockquote>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/design\">design</a> · <a href=\"https://kottke.org/tag/flying\">flying</a> · <a href=\"https://kottke.org/tag/infoviz\">infoviz</a> · <a href=\"https://kottke.org/tag/Jon%20Keegan\">Jon Keegan</a> · <a href=\"https://kottke.org/tag/maps\">maps</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/faa-aviation-maps\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"92953b7a4b0a337304b2d62e12e7068b460cdd5385cbc78a07b79708bfcab498","category":"default"}