{"title":"Why I’m not on Facebook","link":"https://sive.rs/facebook","date":1521590400000,"content":"<p>\nI tried Facebook for a few weeks in 2007, but I hadn’t really used it since then.\nI would log in once a month for a few minutes and click [ACCEPT] to all the friend requests from strangers, then log out.\nI hit the 5000 friend-limit, so I created a second profile.\nThat hit the 5000 friend-limit too, so I created a third.\nWhen the third one hit the friend-limit, I stopped.\n</p><p>\nI thought I was just being polite, accepting friend requests, but I didn’t know who most of them were.\n<strong>\nIt was very insincere.\n</strong>\nWhen real friends would ask if I’m on Facebook, I’d have to explain, “It looks like I’m there, but not really there.”\nI never posted anything personal, and never installed it on my phone.\nI was really just using it to announce new blog posts.\n</p><p>\nWhen people would do their “<a href=\"https://deletefacebook.com/\">DELETE FACEBOOK!</a>” campaigns, I didn’t bother because I wasn’t using it anyway.\n<strong>\nIt was causing me no harm.\n</strong>\nI think it’s <a href=\"https://duckduckgo.com/?q=facebook&amp;sites=calnewport.com&amp;ia=web\">net-negative for the world, and causing many people harm</a>, but not me, so why bother deleting it?\n</p><p>\n<strong>\nBut the more I thought about it, the less I liked my implied support.\n</strong>\nI’m sick of being insincere.\nI’m against centralized platforms.\nI strongly prefer a <a href=\"https://indieweb.org/\">decentralized internet</a>.\nI’m always helping friends get off of the big platforms and on to their own servers.\n</p><p>\nMaybe the fact that I use Facebook to share my blog posts is a tiny tiny reason why others are still using it.\nIt’s like I’m still visiting friends in the smoking area, even though I don’t smoke.\nMaybe if I quit going entirely, it will help my friends quit, too.\n</p><p>\n<strong>\nSo I snapped out of the silly fear that people won’t find me if I’m not there.\n</strong>\nIf they care at all, they’ll find me.\n</p><p>\nSo, yeah.\nThat decided it.\nI deleted all three accounts with 15,000 “friends”.\n</p><p>\nI had a selfish business reason to keep it.\nI’m going to be publishing three different books over the next year, and plan to launch a new business, too.\n<strong>\nBut I’m willing to take that small loss in promotion, because <a href=\"http://blog.seanbonner.com/2012/04/15/on-leaving-facebook/\">it’s the right thing to do</a>.\n</strong>\nIt always feels good to get rid of things I’m not using.\n</p><p>\nI’ve been online since 1994.\nI remember when everyone thought mp3.com was everything, and a few years later it was gone.\nThen everyone thought MySpace was everything, and a few years later it was moot.\nNow it’s Facebook, Instagram, and Google, but eventually they’ll all be moot, too.\nIt’s the natural cycle of things.\n</p>\n<img src=\"/images/adoption_life_cycle-500x414.jpg\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"92e0824822446d7d04b661322ff372f142815c817d768627734d281c28ea9e58","category":"default"}