{"title":"What Makes Life Alive: Vasily Grossman on Consciousness, Freedom, and Kindness","link":"https://www.themarginalian.org/2024/07/30/vasily-grossman-life-and-fate/","date":1722325650000,"content":"<p><a href=\"https://www.amazon.com/Life-Fate-Review-Books-Classics/dp/1590172019/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"512\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/lifeandfate_grossman.jpg?fit=320%2C512&amp;ssl=1\" alt=\"What Makes Life Alive: Vasily Grossman on Consciousness, Freedom, and Kindness\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/lifeandfate_grossman.jpg?w=750&amp;ssl=1 750w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/lifeandfate_grossman.jpg?resize=320%2C512&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/lifeandfate_grossman.jpg?resize=600%2C960&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/lifeandfate_grossman.jpg?resize=240%2C384&amp;ssl=1 240w\" /></a></p><p>“Every thing that lives is holy, life delights in life,” William Blake wrote in an era when science first began raising questions with spiritual undertones: </p>\n<p>What is life? </p>\n<p>Where does it begin and end? </p>\n<p>What makes it alive? </p>\n<p>But in the epochs since, having discovered muons and mitochondria, having discerned the elementary building blocks of matter and the synaptic infrastructure of the mind, we — <a href=\"https://www.themarginalian.org/2022/04/22/richard-feynman-yo-yo-ma/\">“atoms with consciousness,”</a> in physicist Richard Feynman’s poetic words — seem to be haunted all the more urgently by the question of what makes life sacred and worthy of living.</p>\n<p>The Ukrainian Jewish writer <strong>Vasily Grossman</strong> (November 29, 1905–September 14, 1964), who had spent a thousand days as a correspondent on the frontlines of humanity’s unholiest war and composed some of the earliest eyewitness accounts of Nazi extermination camps, takes up these urgent and eternal questions in his 1959 novel <a href=\"https://www.amazon.com/Life-Fate-Review-Books-Classics/dp/1590172019/?tag=braipick-20\" target=\"_blank\"><strong><em>Life and Fate</em></strong></a> (<a href=\"https://search.worldcat.org/title/61228713\" target=\"_blank\"><em>public library</em></a>) — the story of a visionary physicist named Viktor and his search for meaning amid the radical mathematics of reality. </p>\n<p>A generation after the mathematical prodigy William James Sidis bent Einstein’s equations into a provocative model of <a href=\"https://www.themarginalian.org/2022/06/09/the-animate-and-the-inanimate-william-james-sidis/\">what distinguishes inanimate matter from life</a>, Viktor’s colleague taunts him with a daring definition of life:</p>\n<blockquote><p>There is a boundary limiting the infinity of the universe — life itself. This boundary’s nothing to do with Einstein’s curvature of space; it lies in the opposition between life and inanimate matter… Life can be defined as freedom. Life is freedom. Freedom is the fundamental principle of life. That is the boundary — between freedom and slavery, between inanimate matter and life.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=680%2C801&amp;ssl=1\" width=\"680\" height=\"801\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=320%2C377&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=600%2C707&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=240%2C283&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/03/downadownderry_dorothylathrop17.jpg?resize=768%2C905&amp;ssl=1 768w\" /></a><figcaption>Art by <a href=\"https://www.themarginalian.org/2021/03/09/dorothy-lathrop-down-adown-derry/\">Dorothy Lathrop</a>, 1922. (Available <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_print?curator=brainpicker\" target=\"_blank\">as a print</a> and <a href=\"https://society6.com/product/art-by-dorothy-lathrop-for-down-adown-derry-by-walter-de-la-mare-19224642772_cards?curator=brainpicker\" target=\"_blank\">as stationery cards</a>.)</figcaption></figure>\n<p>Viktor shudders at the notion. (So did James Baldwin, who <a href=\"https://www.themarginalian.org/2021/06/06/james-baldwin-giovannis-room-love-choice/\">wrestled with the illusion of choice</a> and concluded “nothing is more unbearable, once one has it, than freedom.”) When the other physicist prophecies that in the coming century — the century in which we are living out our lives — “the abyss of time and space will be overcome” as science unravels the mystery of energy and matter to solve “the creation of life itself” and thus liberates humanity from its mortal destiny, Viktor pushes back against this escapist fantasy with the full force of the human struggle:</p>\n<blockquote><p>On this very day the Germans are slaughtering Jewish children and old women… And we ourselves have endured 1937 and the horrors of collectivization — famine, cannibalism and the deportation of millions of unfortunate peasants… You say life is freedom. Is that what people in the camps think? What if the life expanding through the universe should use its power to create a slavery still more terrible than your slavery of inanimate matter? Do you think this man of the future will surpass Christ in his goodness? That’s the real question. How will the power of this omnipresent and omniscient being benefit the world if he is still endowed with our own fatuous self-assurance and animal egotism? Our class egotism, our race egotism, our State egotism and our personal egotism? What if he transforms the whole world into a galactic concentration camp? What I want to know is — do you believe in the evolution of kindness, morality, mercy?</p></blockquote>\n<p>In the end, Grossman intimates, these are the elementary particles of life — the building blocks of its significance and sanctity. Given the miracle of <a href=\"https://www.themarginalian.org/2022/08/22/victor-johnston-consciousness/\">how a cold cosmos kindled consciousness</a>, given the everlasting wonder of <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\">what happens when we die</a>, given <a href=\"https://www.themarginalian.org/2021/07/25/richard-dawkins-death/\">the luckiness of death</a>, it seems that each life is a reliquary of itself — that we exist only to discover that what makes the interlude between inanimacy and death alive with meaning is love, no matter the names we give it: kindness, friendship, forgiveness.</p>\n<figure><a href=\"https://society6.com/product/the-triumph-of-life8889063_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=680%2C850&amp;ssl=1\" width=\"680\" height=\"850\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?w=1398&amp;ssl=1 1398w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=320%2C400&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=600%2C750&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=240%2C300&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=768%2C960&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PigeonCross_by_MariaPopova.jpg?resize=1228%2C1536&amp;ssl=1 1228w\" /></a><figcaption>Available as <a href=\"https://society6.com/product/the-triumph-of-life8889063_print?curator=brainpicker\" target=\"_blank\">a print</a></figcaption></figure>\n<p>Grossman writes:</p>\n<blockquote><p>When a person dies, they cross over from the realm of freedom to the realm of slavery. Life is freedom, and dying is a gradual denial of freedom. Consciousness first weakens and then disappears. The life-processes — respiration, the metabolism, the circulation — continue for some time, but an irrevocable move has been made towards slavery; consciousness, the flame of freedom, has died out. </p>\n<p>The stars have disappeared from the night sky; the Milky Way has vanished; the sun has gone out; Venus, Mars and Jupiter have been extinguished; millions of leaves have died; the wind and the oceans have faded away; flowers have lost their colour and fragrance; bread has vanished; water has vanished; even the air itself, the sometimes cool, sometimes sultry air, has vanished. The universe inside a person has ceased to exist. This universe is astonishingly similar to the universe that exists outside people. It is astonishingly similar to the universes still reflected within the skulls of millions of living people. But still more astonishing is the fact that this universe had something in it that distinguished the sound of its ocean, the smell of its flowers, the rustle of its leaves, the hues of its granite and the sadness of its autumn fields both from those of every other universe that exists and ever has existed within people, and from those of the universe that exists eternally outside people. What constitutes the freedom, the soul of an individual life, is its uniqueness. The reflection of the universe in someone’s consciousness is the foundation of his or her power, but life only becomes happiness, is only endowed with freedom and meaning when someone exists as a whole world that has never been repeated in all eternity. Only then can they experience the joy of freedom and kindness, finding in others what they have already found in themselves.</p></blockquote>\n<p>This, of course, is also the fundamental constitution of love — it is the singularity of a person, the dear particularity unexampled in all of space and time, that we love. That is why the loss of love feels like a death — when the universe between two people who have loved each other ceases to exist, a part of each soul also dies, a part of each consciousness ceases to reflect the universe and is extinguished. </p>\n<p>But there, amid the desolate haunts of eternity, we discover that the only shelter is the naked now — the only place where we have any freedom at all, including freedom from fear. Hannah Arendt knew this when she observed in her <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">timeless reckoning with love and how to live with the fundamental fear of loss</a> that “fearlessness is what love seeks” and “such fearlessness exists only in the complete calm that can no longer be shaken by events expected of the future,” which makes “the only valid tense” of love the present — the only place where life is truly alive, and holy.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"935bafcb3829e5f19b6c010169ec13cf75d5a2d615ce009769753d27480725c4","category":"default"}