{"title":"Reality check: AI Hardware is experimental","link":"https://om.co/2024/04/30/the-reality-optimism-of-ai-hardware/","date":1714491122000,"content":"<p>Rabbit, a startup making new AI-enabled personal hardware, recently launched its new device, R1. The orange-colored, plasticky toy-like device was designed by Teenage Engineering, a Stockholm-based design and product company. The company (TE) started out making minimalistic (and yet iconic) musical devices that packed a powerful punch behind a seemingly toy-like exterior. R1 is a perfect example of the Teenage Engineering aesthetic.</p>\n\n\n<div>\n<figure><img width=\"768\" height=\"1024\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-768x1024.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-768x1024.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-225x300.jpg 225w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-1152x1536.jpg 1152w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-1536x2048.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-144x192.jpg 144w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-1100x1467.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-420x560.jpg 420w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-1800x2400.jpg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/IMG_1021-scaled.jpg 1920w\" /></figure></div>\n\n\n<p>R1 is the second of the more hyped AI devices to launch in recent days — the other being Humane’s AI Pin. The reviews have been less unkind to the device, compared to the AI Pin. A lot has to do with the fact that Rabbit costs $200 and that the founder admitted to it being an early work-in-progress type product. Aside from that “PR” masterstroke, R1 too, is an imperfect device — not quite ready for prime time. </p>\n\n\n\n<p>My recent experience with R1 highlighted some of these challenges firsthand. The setup and onboarding process was marred by technical glitches. The additional costs for features like Midjourney raised questions about the overall value proposition. If you start to ask some serious questions, it stumbles. Even simple things can be a strain on it. I kept asking for the score of the Yankees’ latest baseball game, and it kept giving me scores from a day earlier. </p>\n\n\n\n<p>Nevertheless, R1 is still able to do quite a few things, such as transcribing hand-drawn spreadsheets into digital versions. Or act as a voice remote for Spotify across devices, though not quite well. It can summarize voice notes and show key points. It does all these things and more — it just doesn’t do any of them well. It doesn’t excel at anything. </p>\n\n\n\n<p>And it is okay. Just as it was okay for Humane’s product to feel inadequate and incomplete. (I am using AI Pin <em>only </em>as a lapel camera and hopefully will become a good lapel-camera-photographer.) Sure, these devices feel like a letdown, but if you are an optimist, then you know these devices point to an exciting new future. We are only just getting going on this journey <a href=\"https://om.co/2023/11/09/ai-pin-humane/\" target=\"_blank\">towards a real personal (AI) computer</a>. </p>\n\n\n\n<hr />\n\n\n\n<p><br />Back in 1995, I met with the team from Ricochet, a wireless service being planned by a company called Metricom. It was a very long time ago. As a young reporter and a broadband believer, I bought into their vision of a seamless data network that would allow me to hook up my computer and other devices to this network. The network would be built using radios hooked up on electricity poles, amongst other locations. Its initial speed was 128 kbps. In 2001, the company <a href=\"https://www.nytimes.com/2001/08/16/technology/ricochet-network-lived-fast-and-died-young.html\">went belly up</a>. They had 51,000 subscribers and owed almost a billion dollars in debt. (PS: Check out this <a href=\"https://www.joelonsoftware.com/2000/12/20/the-ricochet-wireless-modem-a-review/\">review of Ricochet</a> by old friend Joel Spolsky, the guy behind many well-known products such as Trello and Stack Overflow.)</p>\n\n\n\n<p>Today, we don’t even bat an eyelid when our network connects at a mere 50 Mbps (450 times the initial Ricochet speed) when hiking in the Sierras. The future they promised has arrived, and there are few places on the planet where you can’t send a selfie or rage against someone on Twitter. <a href=\"https://om.co/2024/02/15/travel-tech-notes-delhi-edition/\">Even our airplanes are connected</a>. </p>\n\n\n\n<p>Ricochet’s story is one we should all remember. We should remember it as followers of technology, as investors, as founders, and even as members of the media. This is the story of pain and the promise of being involved with technology. Ricochet, (like many others), is a reminder of the harsh reality of technology. Just because you imagine a future and want it to manifest itself, doesn’t mean it will happen on a predetermined timeline. </p>\n\n\n\n<p>Reality is real. And this story is also a good reminder that just because something doesn’t work today as promised, it won’t work as imagined in the future. This fusion of reality and optimism has created my own “reality distortion field” that I use when I come across the new, the novel, and the future. </p>\n\n\n\n<p>This weird lens allows me to be excited about everything from vehicle-to-vehicle networks, mesh technologies, distributed infrastructure, synthetic biology, and of course, the possibilities of augmenting human capabilities with “synthetic intelligence.” Perhaps, that’s why it is easy to imagine a future beyond the smartphone, a desktop computer, or life without a cinema or a television screen. </p>\n\n\n\n<p>These days, “AI” is all we are obsessed with. Everyone is talking about AI hardware. Even mouse-makers are sending press releases about “AI” inside their gear. Nothing, the gadget-hype company, which is more hype than gadgets, announced headphones with AI. It is just a way to launch OpenAI, as long as you have their Nothing phone. Logitech has a button to launch OpenAI. Let’s call this <em>bullshit 101</em>.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://arstechnica.com/gadgets/2024/04/ai-marketing-hype-is-coming-for-your-favorite-gadgets/\">ArsTechnica puts it well</a>:</p>\n\n\n\n<blockquote>\n<p>AI will likely continue becoming a bigger part of tech gadgets’ marketing points, especially devices targeting those who are eager to own the latest and greatest but have varied understandings of what AI can do and its relevance for them.</p>\n\n\n\n<p>There are times when AI can improve a gadget. But over the next months and years, I expect that more devices that aren’t necessarily better with AI integration will advertise questionable features related to the tech.</p>\n</blockquote>\n\n\n\n<figure><img width=\"1024\" height=\"751\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-1024x751.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-1024x751.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-300x220.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-768x563.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-1536x1127.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-2048x1502.jpg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-192x141.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-1100x807.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-560x411.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/04/AIPinPhoto-1800x1320.jpg 1800w\" /><figcaption>Screenshot</figcaption></figure>\n\n\n\n<p>Regardless of these marketing shenanigans, we are stepping into a new phase — artificial intelligence will become omnipresent in our lives. This will include devices that will change the way we interact with technology. But the journey to this future will be long, frustrating at times, and sometimes downright discouraging. Think back to the early days of smartphones — aka dark ages before the iPhone. </p>\n\n\n\n<p>Before the iPhone, there were numerous experiments and attempts to create the ultimate mobile device. From the early days of Palm Pilots and BlackBerry devices to the rise of Symbian-powered smartphones, each version brought us closer to the seamless, intuitive experience we now take for granted. </p>\n\n\n\n<p>The AI industry faces a similar journey, requiring not only technological progress but also a fundamental shift in how we interact with and understand these devices. Similarly, the AI industry is currently in a phase of experimentation.</p>\n\n\n\n<p>By giving whiz-bang demonstrations, the AI hardware devices create expectations, and that leads to ultimate disappointment. I learned a lot from my experiments with AI Pin and Rabbit’s R1. The biggest lesson — these (and other such devices) need to really hone in on compelling use cases that justify the investment for consumers.</p>\n\n\n\n<p>Just as the early smartphones and wireless broadband struggled to find their footing, AI devices are facing similar hurdles. The key to success lies in identifying and addressing the pain points of users. In the case of smartphones, it was the integration of intuitive touchscreens, app ecosystems, and seamless connectivity that ultimately propelled them to mainstream adoption. </p>\n\n\n\n<p>For wireless broadband, it was the development of robust infrastructure and the introduction of data-hungry applications that drove demand. AI devices must find their <em>unique</em> killer applications and use cases that truly enhance our lives and become indispensable. For an AI device to truly succeed, it must become an integral part of our daily lives and routines.</p>\n\n\n\n<p>While AI Pin and R1 are coming in for criticism, let’s not forget these companies are working with some of the more popular “AI” platforms — OpenAI, Microsoft, and Perplexity. The challenges of these devices are a good reflection of the problems facing the AI-platforms. If they are going to get better — then so will the hardware platforms. </p>\n\n\n\n<p>There is no doubt in my mind that the AI devices are good signposts to a future that goes beyond the phones, and screens into a realm of invisible information interfaces. </p>\n\n\n\n<p>Don’t be surprised if the work of R1 and AI Pin encourages Apple to “AI” enable its “watch and headphones” or Google to launch a new integrated “AI” in its operating system that does the same if not, more as say, a r1. The smartphones didn’t kill the desktop or the notebook computer — it just took away its preeminence as a platform of technology’s future. The “AI” devices are going to do the same for the smartphone — not today, but eventually. </p>\n\n\n\n<hr />\n\n\n\n<p>As to these two devices, new firmware is on the way — and hopefully, that will improve their capabilities. And soon enough we will see new “AI” features in Apple and Google’s operating systems. It is a good time to be excited, <a href=\"https://om.co/2023/11/09/ai-pin-humane/\" target=\"_blank\">for the real personal (AI) computer</a>. </p>\n\n\n\n<blockquote>\n<p><em>Smartphones changed personal computing by making it “everywhere.” Personal computing, as we know it, is once again evolving, this time being reshaped by AI, which is making us rethink how we interact with information. There are many convergent trends — faster networks, more capable chips, and the proliferation of sensors, including cameras. </em></p>\n\n\n\n<p><em>Smaller, lower energy, more powerful, and more capable chips mean we can now build smaller, more capable devices. The faster networks of today can deliver the power of the cloud instantly. More importantly, what is different is the emergence and progress made by what is colloquially called AI.  Large Language Models (LLMs) and Natural Language Processing (NLP) progress means we no longer need old methods to acquire and interact with information.</em></p>\n</blockquote>\n\n\n\n<h4>ADDITIONAL READING</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/11/30/nostalgia-is-a-curse-in-life-and-tech/\">Nostalgia is a curse in life and tech.</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/11/09/ai-pin-humane/\">The Real Personal (AI) Computer</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2015/08/03/dont-call-it-ai/\">Don’t call it AI</a></blockquote>\n</div></figure>\n\n\n\n<h4>WATCH THIS</h4>\n\n\n\n<p>There are many reviews of Rabbit R1. There is <a href=\"https://www.youtube.com/watch?v=ddTV12hErTc\">Marques Brownlee</a>. Macrumors’ Dan Barbera <a href=\"https://www.youtube.com/watch?v=aqb3u5mXcl4\">does a great job of digging</a> into the device, with much less sarcasm and more measured.  I like <a href=\"https://www.youtube.com/watch?v=ZMqhE9r5JuI\">Dave2D’s review</a> the most — it is no less critical, but it is not clickbaity and uses words very effectively. </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"938837979c4aa2d8985da0c0a3b593bba3a08406950296faa182c0ae31eabfab","category":"default"}