{"title":"Push, push, push. Expanding your comfort zone.","link":"https://sive.rs/comfort","date":1344816000000,"content":"<p>\nI’m 40 meters underwater.\nIt’s getting cold and dark.\nIt’s only the third dive in my life, but I’m taking the advanced scuba course, and the Caribbean teacher was a little reckless, dashing ahead, leaving me alone.\n</p><p>\nThe next day I’m in a government office, answering an interview, raising my right hand, becoming a citizen of Dominica.\n</p><p>\nI’m backstage at the TED Conference, about to go on, but I can’t remember my lines.\nIn the audience are Bill Gates, Al Gore, Peter Gabriel, and a few hundred other intimidating geniuses.\nHeart pounding so fast and hard, I think I’m going to explode.\nThey call my name.\nAck!\nI still can’t remember my lines!\nBut <a href=\"https://sive.rs/dancingguy\">I hit the stage</a> anyway.\n</p><p>\nI’m alone on a bicycle in a forest in Sweden.\nI left Stockholm six hours ago, headed south, with only 50 kronor, and I’m getting hungry.\nI don’t know the way back.\n</p><p>\nI’m in a filthy dorm-room apartment in Guilin, China, studying at the local university.\nAt the local grocery store, I choose from a bin of live frogs.\n</p><p>\nThe India Embassy official hands me a pseudo-passport that says I am now officially an Overseas Citizen of India.\n</p><p>\nI’m in the back of a truck in Cambodia, soaking wet, hitching a ride back to Phnom Penh after an all day bike ride.\nThe roads were flooded but we rode our bikes through anyway, Mekong River water waist-high.\n</p><p>\nThat week I speak at four conferences in Cambodia, Singapore, Brunei, and Indonesia.\nBy the fourth one, my American accent has started to morph into something kind of Asian.\n</p><p>\nWe’re in a hospital in Singapore, having a baby.\nIt’s a boy, which means he’ll serve in the Singapore military in the year 2030.\nThe birth certificate says his race is Eurasian, a word I’ve never heard.\n</p><p>\nI’m on a diplomatic mission in Mongolia with the Singapore Business Federation, talking with the Mongolian government’s head of business development, walking with the next mayor of Ulaanbaatar.\n</p><p>\nI have to laugh at the ridiculousless of this situation.\n</p><p>\nI’m just a musician from California!\nWhat the hell am I doing here?\n</p><p>\n<strong>\nBut that feeling lets me know I’m on the right track.\n</strong>\nThis is exactly what I wanted.\n</p><p>\nSome people push themselves physically, to see how far they can go.\nI’ve been doing the same thing culturally, trying to expand my California-boy perspective.\n</p><p>\nI love that when we push push push, we expand our comfort zone.\n<strong>\nThings that used to feel intimidating now are as comfortable as home.\n</strong>\n</p><p>\nI remember how scary New York City felt when I moved there in 1990, just 20 years old.\nTwo years later it was “my” city — my comfort zone.\nI’d love to keep repeating that process — to eventually move to Berlin, Rio, Beijing, Lagos, and Mumbai — to feel overwhelmed when I arrive, but stay until it feels like home.\n</p><p>\nAfter years of stage fright, performing over a thousand shows, I have a strong case of “stage comfort”.\nBeing the lead singer or speaker on stage is now my comfort zone.\n</p><p>\nA lot of my musician friends feel this when playing on stage with their legendary heroes.\nYou push push push, then one day find yourself on the very stage you used to dream about.\nAnd it feels so natural — almost relaxing.\nIt’s your new comfort zone.\n</p><p>\n<strong>\nWhat scares you now?\nWhat’s intimidating?\nWhat’s the great unknown?\n</strong>\n</p><p>\nI keep using those questions to guide my next move.\n</p>\n<a href=\"https://sive.rs/images/Mongolia-meeting-table-DerekSivers.jpg\"><img src=\"/images/Mongolia-meeting-table-DerekSivers-600.jpg\" alt=\"Mongolia meeting\" /></a>\n<div>(click for a picture of me at last week’s diplomatic mission in Mongolia)</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"939a3be2f79b5cccbea40ceb41b150a299a1bcae652417db217c51e35be610e8","category":"default"}