{"title":"The Secret Life of Chocolate: Oliver Sacks on the Cultural and Natural History of Cacao","link":"https://www.themarginalian.org/2024/02/15/oaxaca-journal-sacks-chocolate/","date":1708014814000,"content":"<p><a href=\"https://www.amazon.com/Oaxaca-Journal-National-Geographic-Directions/dp/0792265211/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"494\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?fit=320%2C494&amp;ssl=1\" alt=\"The Secret Life of Chocolate: Oliver Sacks on the Cultural and Natural History of Cacao\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?w=778&amp;ssl=1 778w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?resize=320%2C494&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?resize=600%2C925&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?resize=240%2C370&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/sacks_oaxacajournal.jpg?resize=768%2C1185&amp;ssl=1 768w\" /></a></p><p>Without chocolate, life would be a mistake — not a <a href=\"https://www.themarginalian.org/2015/09/18/nietzsche-on-music/\">paraphrasing of Nietzsche</a> he would have easily envisioned, for he was a toddler in Germany when a British chocolatier created the first modern version of what we now think of as chocolate: a paste of sugar, chocolate liquor, and cocoa butter, molded into a bar. As the making of bars entered the factories over the course of the next century, chocolate — further and further removed from the lush life of cacao, stripped of its cultural history and botanical wonder — became a microcosm of our progressive commodification of delight, our aggressive erasure of ancient cultures, our self-expatriation from the living reality of nature.</p>\n<p>To retrace the roots of chocolate across space, time, and culture is to reclaim its status as a pinnacle of the creative conversation between nature and human nature, to recapture some of the lost wonder.</p>\n<p>That is what <a href=\"https://www.themarginalian.org/tag/oliver-sacks/\">Oliver Sacks</a> does in some wonderful passages from his <a href=\"https://www.amazon.com/Oaxaca-Journal-National-Geographic-Directions/dp/0792265211/?tag=braipick-20\" target=\"_blank\"><strong><em>Oaxaca Journal</em></strong></a> (<a href=\"https://search.worldcat.org/title/61477986\" target=\"_blank\"><em>public library</em></a>) — the altogether marvelous record of a botanical expedition animated by his love of ferns and his largehearted humanistic belief in “how crucial it is to see other cultures, to see how special, how local they are, how un-universal one’s own is.”</p>\n<figure><a href=\"https://society6.com/product/cacao-from-flore-damerique-by-etienne-denisse-1840s_print?sku=s6-20991970p4a1v45?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=680%2C939&amp;ssl=1\" width=\"680\" height=\"939\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=320%2C442&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=600%2C829&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=240%2C331&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=768%2C1060&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/07/etiennedenisse_cacao_sm.jpg?resize=1112%2C1536&amp;ssl=1 1112w\" /></a><figcaption>Cacao by Étienne Denisse from his <a href=\"https://www.themarginalian.org/2021/07/08/etienne-denisse-american-flora/\"><em>Flore d’Amérique</em></a>, 1846. (Available as <a href=\"https://society6.com/product/cacao-from-flore-damerique-by-etienne-denisse-1840s_print?sku=s6-20991970p4a1v45?curator=brainpicker\" target=\"_blank\">a print</a>, a <a href=\"https://society6.com/brainpicker/collection/vintage-science-cutting-boards?curator=brainpicker\" target=\"_blank\">cutting board</a>, and <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>Detailing the wonder of cacao at the crossing point of the sensual and the scientific, Sacks writes:</p>\n<blockquote><p>Cacao trees have large glossy leaves, and their little flowers and great purplish pods grow directly from the stem. One can break open a pod to reveal the seeds, embedded in a white pulp. The seeds themselves, the cacao beans, are cream-colored when the pod is opened, but with exposure to air may turn lavender or purple. The pulp, though, has almost the consistency of ice cream, Robbin says, and a delicious, sweet taste… The sweet, mucilaginous pulp attracts wild animals… They eat the sweet pulp and discard the bitter seeds, which can then grow into new seedlings. Indeed, the tough pods do not open spontaneously, and would never be able to release their seeds, were it not for the animals attracted to their pulp. Early humans must have watched animals and then imitated them… opening the pods and enjoying the sweet pulp.</p></blockquote>\n<p>Nested into the story of chocolate is a miniature of the scientific method itself, with its twin prongs of observation and empiricism:</p>\n<blockquote><p>Over thousands of years, perhaps, early Mesoamericans had learned to value the beans as well, discovering that if they were scooped out of the pod with some pulp still attached, and left this way for a week or so, they would become less bitter as fermentation occurred. Then they could be dried and roasted to bring out the full chocolate flavor… </p>\n<p>The roasted beans, now a rich brown, are shelled and moved to a grinder — and here the final miracle happens, for what comes out of the grinder is not a powder, but a warm liquid, for the friction liquefies the cocoa butter, producing a rich chocolate liquor.</p></blockquote>\n<p>And yet this liquor is almost undrinkably bitter. What lodged cacao into Mesoamerican culture and what first made it appealing to Europeans was not its taste but its bioactive properties, channeled through culture before science uncovered the underlying chemistry — Montezuma is said to have consumed forty or fifty cups a day as an aphrodisiac, and we now know that the flavonoids, polyphenols, theobromine, and magnesium in cacao vitalize the body in various ways. </p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?resize=680%2C846&amp;ssl=1\" width=\"680\" height=\"846\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?w=823&amp;ssl=1 823w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?resize=320%2C398&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?resize=600%2C747&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?resize=240%2C299&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/Montezuma_AntonioRodriguez.jpg?resize=768%2C956&amp;ssl=1 768w\" /><figcaption>Portrait of Montezuma by Antonio Rodríguez, 1600s.</figcaption></figure>\n<p>Tracing the trajectory of the bitter chocolate liquor across time and cultures, Sacks writes:</p>\n<blockquote><p>[The Mayan] <em>choco haa</em> (bitter water) was a thick, cold, bitter liquid, for sugar was unknown to them — fortified with spices, corn meal, and sometimes chili. The Aztec, who called it <em>cacahuatl</em>, considered it to be the most nourishing and fortifying of drinks, one reserved for nobles and kings. They saw it as a food of the gods, and believed that the cacao tree originally grew only in Paradise, but was stolen and brought to mankind by their god Quetzalcoatl, who descended from heaven on a beam of the morning star, carrying a cacao tree.</p></blockquote>\n<p>The tree itself is an evolutionary miracle — <a href=\"https://www.themarginalian.org/2013/12/04/avocado-ghosts-of-evolution/\">like the avocado</a>, it went almost extinct in the wild. But, for more than two millennia, humans cultivated it in present-day Mexico as a source of that divine drink. Sacks writes:</p>\n<blockquote><p>Cacao pods served as symbols of fertility, often portrayed in sculptures and carvings, as well as a convenient currency (four cacao beans would buy a rabbit, ten a prostitute, one hundred a slave). Thus Columbus had brought cacao beans back to Ferdinand and Isabella as a curiosity, but had no idea of its special qualities as a drink.</p></blockquote>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?resize=680%2C522&amp;ssl=1\" width=\"680\" height=\"522\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?w=800&amp;ssl=1 800w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?resize=320%2C246&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?resize=600%2C461&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?resize=240%2C184&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/aztec_chocolate.jpg?resize=768%2C589&amp;ssl=1 768w\" /><figcaption>1671 engraving of Aztec chocolate-making by John Ogilby.</figcaption></figure>\n<p>By the middle of the 17th century, chocolate houses populated Europe — the progenitor of the soon ubiquitous coffeehouses and teahouses; without cacao, we would not have neighborhood cafés. Goethe, who traveled widely, always carried his own chocolate pot — an emblem of the spell chocolate would soon cast upon humanity with its dual enchantment of chemistry and culture. </p>\n<p>Cross-pollinating physiology, psychology, and philosophy the way only he could, Sacks leaves the story of cacao with a rosary of questions painted at the mystery that haloes all knowledge:</p>\n<blockquote><p>why, I wonder, should chocolate be so intensely and so universally desired? Why did it spread so rapidly over Europe, once the secret was out? Why is chocolate sold now on every street corner, included in army rations, taken to Antarctica and outer space? Why are there chocoholics in every culture? Is it the unique, special texture, the “mouth-feel” of chocolate, which melts at body temperature? Is it because of the mild stimulants, caffeine and theobromine, it contains? The cola nut and the guarana have more. Is it the phenylethylamine, mildly analeptic, euphoriant, supposedly aphrodisiac, which chocolate contains? Cheese and salami contain more of this. Is it because chocolate, with its anandamide, stimulates the brain’s cannabinoid receptors? Or is it perhaps something quite other, something as yet unknown, which could provide vital clues to new aspects of brain chemistry, to say nothing of the esthetics of taste?</p></blockquote>\n<p>Couple with <a href=\"https://www.themarginalian.org/2022/07/13/avocado/\">the fascinating evolutionary and creative history of the avocado</a>, then revisit Ellen Meloy on <a href=\"https://www.themarginalian.org/2021/06/02/ellen-meloy-anthropology-of-turquioise/\">how chemistry and culture created color</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"939b518e71cd3da5d951a2d65f7ce7d546b6451add13ee622079b08569bdec45","category":"default"}