{"title":"Life will imitate Laurie’s art","link":"https://bradbarrish.com/2024/03/11/life-will-imitate-lauries-art/","date":1710196679000,"content":"<p>I finally got around to reading <a href=\"https://www.theguardian.com/music/2024/feb/28/laurie-anderson-ai-chatbot-lou-reed-ill-be-your-mirror-exhibition-adelaide-festival\">a Guardian article from last month</a> about Laurie Anderson creating an AI chatbot of her deceased husband, Lou Reed. I had it queued up in one of my many many browser tabs and was reminded of it by Kottke, who<a href=\"https://kottke.org/24/03/0044156-the-artist-laurie-anderso\"> linked to it today</a>. </p>\n\n\n\n<figure><blockquote><p>“I’m totally 100%, sadly addicted to this,” she laughs. “I still am, after all this time. I kind of literally just can’t stop doing it, and my friends just can’t stand it – ‘You’re not doing that again are you?’<br /><br />“I mean, I really do not think I’m talking to my dead husband and writing songs with him – I really don’t. But people have styles, and they can be replicated.”</p><cite>Laurie Anderson referring to her Lou Reed chatbot</cite></blockquote></figure>\n\n\n\n<p>My initial reaction was, ‘Of course, Laurie Anderson did this very on-brand thing.’ My brain was immediately flooded with all kinds of questions. What technology stack is she using? How did she go about training the chatbot? Did someone help her with it? How often does she interact with it? Does she only use it for artistic purposes to create things? Did she let others interact with it? Does it ever make her emotional? It must. Does it help her grieve? And on and on.</p>\n\n\n\n<p>I’m generally fascinated by the topic of death and dying, though not in a morbid way. I am especially interested in how AI will inevitably change how we think about and experience death from the perspective of the dying and the survivor(s). If some version, some essence, of who we are can live on beyond our physical existence with increasing realness, what will it mean to die? How much data and of what sort is necessary to create a chatbot that feels convincing to a widow or widower?</p>\n\n\n\n<p>Experimenting with the creation of chatbots and what amounts to deep fakes of the deceased will feel gross to some and exciting to others. Just like art. </p>\n\n\n\n<p>Related: In 2009, while at Topspin Media, we worked on the Ray Kurzweil documentary <a href=\"https://www.youtube.com/watch?v=UCov79Blk9Q\">Transcendent Man</a>. The film is ultimately about Ray’s obsession with bringing some version of his father back to life by feeding a machine with what amounts to a storage space full of his father’s ledgers and journals. I attended a screening and met Ray, which was super cool.  </p>\n\n\n\n<figure><img width=\"780\" height=\"583\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=780%2C583&amp;ssl=1\" srcset=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=1024%2C765&amp;ssl=1 1024w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=300%2C224&amp;ssl=1 300w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=768%2C574&amp;ssl=1 768w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=1536%2C1147&amp;ssl=1 1536w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=2048%2C1530&amp;ssl=1 2048w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=400%2C300&amp;ssl=1 400w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=200%2C150&amp;ssl=1 200w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?resize=1200%2C896&amp;ssl=1 1200w, https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/03/Photo-5455649328.jpg?w=2340&amp;ssl=1 2340w\" /><figcaption>Me and Ray, taken at a screening of Transcendent Man in Los Angeles on February 17, 2011</figcaption></figure>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"94559952fa89c7edcd5dbd6a6184e647d60b0fe71b6f42fcb473f8155610ab48","category":"default"}