{"title":"Socii Dispatch 01","link":"https://blog.webb.page/2018-01-19-socii-dispatch-01.txt","date":1516320000000,"content":"<p>For the past month I've been hard at work, developing basic social network\nfeatures. Namely, account and post creation and editing your profile. To be\nhonest, it's not glamorous work but I've been having a blast doing it. Here's\nwhat's been completed thus far.</p>\n<h2>Profile</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-01-a.jpg\">First look at your profile</a></p>\n<p>On your profile, you'll see your avatar in whatever shape you choose from\navailable options which are a triangle (the default), circle (classic), square\n(old-school), diamond, and inverted triangle. Below your avatar in the first\nsidebar, you'll find your name and username.</p>\n<p>When you sign up for Socii, you're automatically logged in and given a\ngenerated username based on your email address so feel free to change it if\nsomething like <code>paul927465</code> doesn't quite fit you. Anecdotally, I've noticed\nthat as people go through life changes they tend to want user/name changes as\nwell so I've made Socii unreliant on usernames on the back-end. Friends and\nfollowers would want to know if you go from <code>SuperAwesomeMegaTon</code> to\n<code>netop://~tonton</code> and I'm building a notification system to accommodate that.</p>\n<p>There are currently no limits on username changes and I can conceivably see\nhow harassment could occur with it. You'll be equipped with proper muting and\nblocking tools should you unwittingly connect with an annoying person.</p>\n<p>In the other sidebar, you'll see something called \"top 8\". Older readers will\nremember the <em>glory</em> that was MySpace and I wanted to bring that back as I\nfound it useful.</p>\n<p>Sometimes I just want to visit a friend's page and I forget what their\nusername is (and, if you follow a lot of people who post more often than your\nfriend(s), you'll miss their posts). I sure know what my friends <em>look</em> like\nthough and it'll be pretty sweet to see which shapes they choose for their\navatars.</p>\n<p>And of course you'll find your personal stream of posts. Within each post\nblock is a menu indicator that contains actions for editing your post, quick\ncopying of the direct link to the post, pinning the post to your profile, and\ndeleting the post. If you want to like your own post for some reason, you can\ndefinitely do that. You can also create threads by responding to your own\nposts.</p>\n<h2>Post creation</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-01-b.jpg\">Post creator, clean</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-01-c.jpg\">Post creator with a code snippet</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-01-d.jpg\">That rendered code snippet…wish it had color</a></p>\n<p>Socii supports Markdown! I'm using a customized version of Showdown<a href=\"https://github.com/showdownjs/showdown\">1</a> to\nenable it. The eye icon in the footer of the post creator allows for\npreviewing what your post will look like when it's live. The character limit\nis 150 for reasons that will become apparent in a couple months, after I ship\na major (secret) feature.</p>\n<p>However, your post can be up to <em>5,000 characters</em> long if you so choose! 😰\nThat'd be <em>extremely</em> annoying to attempt scrolling in a feed so posts longer\nthan 150 characters will be truncated by default with a button to expand it\nshould anyone want to read the entire thing. The question mark icon will give\nyou quick tips on how to use Markdown to add a bit of flavor to your posts.</p>\n<p>If you'd like to read a long post but don't have time at the moment, you can\nsave that post for future reading.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2018/socii-dispatch-01-e.jpg\">Respond to your own post to create a thread</a></p>\n<p>For the moment, only one post status type is available and that is \"publish\".\nForthcoming updates will bring three more: drafts, queues, and schedule.\nSimilarly, the only post creator mode available is \"text\" but future updates\nwill bring photo, audio, and video options.</p>\n<h2>In progress</h2>\n<p>There's still a good amount of work to get done. For starters, there's no way\nfor you to change your avatar and that's the <em>first</em> thing I do when joining a\nnew service. I also want to get notifications and the global/top 8 feeds\nworking. I think being able to toggle between what everyone is talking about\nversus whomever in your top 8 is talking about will be neat.</p>\n<p>I want to be more open about developing Socii for a couple reasons:</p>\n<ol>\n<li>I want this social network to be good for people.</li>\n<li>I develop in a vacuum and while I share updates with a couple people IRL, I\nthink other people could benefit from what I'm learning in the process.</li>\n<li>External reminder of what I have accomplished. Most people can agree that\nwe accomplish things but beat ourselves up for that <em>one</em> thing we didn't\ndo. That's demoralizing and I don't want to stop before Socii gets into\npeople's hands.</li>\n</ol>\n<p>With that said, I'm making a new commitment to releasing Socii at the end of\nthis month for alpha access to members of my mailing list. If you haven't\njoined yet, you can find it at socii.network<a href=\"https://socii.network/welcome\">2</a>. For more information about\nSocii, you can read this post<a href=\"/2017-12-30-who-creates-social-networks.txt\">3</a> or check out the manifesto on Socii's\nofficial marketing page.</p>\n<h2>Things I've learned</h2>\n<p>I figured it'd be a good idea to share what I've learned since my last blog\npost about Socii:</p>\n<ol>\n<li>I'm tired of rounded corners everywhere. I've removed <code>border-radius</code> from\nall the Sass files.</li>\n<li>GraphQL is awesome. However, I've been building REST APIs for the past\nmonth and have two microservices to handle things thus far and that means\nI'm not transitioning to GraphQL until maybe version 1 of Socii is\nsolidified. 😤 Wish I learned of it sooner (it's basically a better way to\ndo REST and talk to servers).</li>\n<li>Styling with <code>:root</code>. This<a href=\"https://developer.mozilla.org/en-US/docs/Web/CSS/:root\">4</a> is how everyone will have customized profile\npages. I don't know why every example I've seen it used has root styles\noverriding each other. I try to write my CSS in a way that doesn't have\nstyle overrides because it's a hassle to deal with. If you have\n<code>:root.user</code> styling, just have <code>:root:not(.user)</code> for your default\nstyling. Easy.</li>\n</ol>\n<p>That's all for now, see ya! 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"94667783f09e1145b0f733e21adb86b581e11ab1915ccb99c7ccfab454717684","category":"Sites"}