{"title":"Shine Theory","link":"https://bradbarrish.com/2023/08/04/shine-theory/","date":1691187278000,"content":"<p>I grabbed coffee with <a href=\"https://www.julianbleecker.com/\">Julian</a> yesterday. It was a energizing two-hour discussion about many topics, but one of things we talked about was this idea of supporting creative people because you want them to keep doing their creative work. And in order for them to keep doing the work you enjoy on some level, you need to give them money for the work they are doing. I often support people I know, even casually, but also support people I don’t know, especially if they are making a thing that I find useful or wonderful. There are certain people that, no matter what they do, I will support. Julian happens to be one of those people and I shared that with him. Others that immediately come to mind are <a href=\"https://kottke.org/\">Jason Kottke</a>, <a href=\"https://astralcodexten.substack.com/\">Scott Alexander</a>, <a href=\"http://seanbonner.com/\">Sean Bonner</a>, <a href=\"https://craigmod.com/\">Craig Mod</a>, <a href=\"https://getjoydays.com/pages/about\">Amy Cohn</a> and <a href=\"https://scale.us/about-virginia\">Virginia Bauman</a>. There are others. And it’s not always about supporting the people as much as it is about supporting ideas or things that just make the world a better place. Indie apps is probably the best example I can think of—software that does a thing. Apps like <a href=\"https://screenotate.com/\">Screenotate</a> by <a href=\"https://omar.website/\">Omar Rizwan</a>, <a href=\"https://raindrop.io/\">Raindrop</a> by <a href=\"https://github.com/exentrich\">Rustem Mussabekov</a>, <a href=\"https://leondo.gumroad.com/l/Rgbu?layout=profile\">SubClock</a> by <a href=\"https://leondo.gumroad.com/\">Leon Do</a> and <a href=\"https://matthewpalmer.net/rocket/\">Rocket</a> by <a href=\"https://matthewpalmer.net/\">Matthew Palmer</a> are things that I use every day, sometimes many times per day, all made by individual people.</p>\n\n\n\n<p>At some point Julian brought up a term called Shine Theory. He explained that it wasn’t some academic term, but made a connection with our conversation to this term, which I hadn’t heard before. So naturally when I returned home, I looked it up. Turns out, it’s a term coined by <a href=\"https://www.aminatou.com/\">Aminatou Sow</a> and <a href=\"https://www.annfriedman.com/\">Ann Friedman</a>. I was happy to see the domain and website were actually owned by the two writers that coined the phrase.</p>\n\n\n\n<blockquote>\n<p>Shine Theory is an investment, over the long term, in helping someone be their best self—and relying on their help in return. It is a conscious decision to bring your full self to your friendships, and to not let insecurity or envy ravage them. Shine Theory is a commitment to asking, “Would we be better as collaborators than as competitors?” The answer is almost always yes.</p>\n<cite>From <a href=\"https://www.shinetheory.com/\">shinetheory.com</a></cite></blockquote>\n\n\n\n<p>It wasn’t a direct connection to what I was talking about, but I understood why the discussion brought this term to mind for him. I also really like the term. Without previously being aware of it, it’s something present in my best and most cherished relationships, both personally and professionally. I love that there’s a term for it and hope it catches on.</p>\n\n\n\n<p></p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"946b2f872a13f84206edc9a2c8d08d88ce6f5a5592bc3cd71d1d5327d8cf13c6","category":"default"}