{"title":"I hated Dubai until I learned about it","link":"https://sive.rs/dxb","date":1731715200000,"content":"<p>\nDubai was in my “Top 5 places where I NEVER want to go”.\nI heard it was commercialized hedonism, glorified overindulgence, pandering to millionaires and influencers — extravagance and opulence.\nEverything I hate.\nThat's why I had never gone there.\n</p><p>\nLast year, when I was booking a flight to attend a conference, there was going to be a short layover in Dubai.\nMy first thought was “yuk”.\n<strong>\nBut when I notice I’m prejudiced against something, it makes me curious.\n</strong>\nSo I made it a 3-day layover, to see Dubai for myself.\n</p>\n\n<h2>\nlearning before going\n</h2>\n<p>\nBefore going to Dubai, I read <a href=\"https://sive.rs/book/UAECS1\">two</a> <a href=\"https://sive.rs/book/UAECS2\">books</a> about the culture of United Arab Emirates, and one about <a href=\"https://sive.rs/book/CityOfGold\">the history of Dubai</a>.\nAnd WOW, it was so fascinating.\n</p><p>\nFirst, about the United Arab Emirates. (U.A.E.)\nLike the United States or Switzerland, it’s a collection of states — called emirates — of which Dubai is just one.\nLike New York, Dubai can refer to the big state or the city inside it.\n<strong>\nDubai the city is in Dubai the state, which is one of the seven emirates of the U.A.E.\n</strong>\nAbu Dhabi is the biggest emirate, and Abu Dhabi the city is the capital of the country.\n</p><p>\nOK, so two quick things I like about U.A.E. as a country:\n</p><p>\n<strong>#2:</strong><br />\nPart of the problem in African countries is due to European leaders in the 1880s carving up African territories with straight lines, ignoring ethnic and linguistic divides, tribal territories, existing kingdoms, and even geography.\nSo when United Arab Emirates was becoming a country in 1971, its founders did the opposite.\nThey went village to village, tribe to tribe, asking each which ruling family they were loyal to.\nThen that's where they drew the boundaries between states.\nIt’s more complex but more accurate, as it respects personal allegiances and relationships.\n</p><p>\n<strong>#1:</strong><br />\n<a href=\"https://en.wikipedia.org/wiki/Zayed_bin_Sultan_Al_Nahyan\">Sheikh Zayed</a>, the father of the nation and its first president.\nI love this guy.\nThe folk-legends of his generosity inspire me.\nHe gave UAE its moral DNA.\nReligious tolerance, women’s rights, helping poorer nations, and gentle diplomacy to settle disputes.\nLike <a href=\"https://en.wikipedia.org/wiki/Lee_Kuan_Yew\">Lee Kuan Yew</a> in Singapore, some founders leave such an influence on the culture of a country that <strong>just being in that place makes me want to be a better man</strong>.\n</p><p>\nUAE constitution guarantees women the same legal status as men, and equal pay.\n<strong>\nUAE has a greater percentage of women in parliament than do the US, UK, France, Canada, Greece, Ireland, Japan or Poland.\n</strong>\nCompanies and government agencies are required to have women on their boards of directors.\n</p><p>\nThe book “<a href=\"https://sive.rs/book/CityOfGold\">City of Gold</a>”, about the history of Dubai, was so good — so well-written — that it made me really admire Dubai and <a href=\"https://en.wikipedia.org/wiki/Rashid_bin_Saeed_Al_Maktoum\">Sheikh Rashid</a>, its ruler who was responsible for the bold and savvy decisions that turned it from a tiny village into what it is today.\nSee, Abu Dhabi has 95% of the oil, Dubai only has 4%, so Dubai had to be smarter, more competitive, and attract business to thrive.\nSheikh Rashid was thinking long-term, had a vision of Dubai’s huge potential, and invested everything into its development in the 70s, even against his advisors’ advice.\nIt seemed crazy at the time, but paid off in a big way 15-30 years later.\nIt was quite entrepreneurial.\n</p><p>\nAfter reading these three books, I was so excited to go.\n</p>\n<h2>\nArab hospitality\n</h2>\n<p>\nI especially love that Arab culture’s top value is hospitality.\nIt’s understandable when you consider its <a href=\"https://en.wikipedia.org/wiki/Bedouin\">Bedu</a> origins.\nA stranger, riding across the harsh desert, arrives at your home, hungry and thirsty.\nYou welcome them in, no matter who they are.\nYou give them food and drink, and let them stay as long as they need.\n</p><p>\nThe book “<a href=\"https://sive.rs/book/ArabianSands\">Arabian Sands</a>”, set in the 1940s, describes this well.\nHis Bedu colleagues had the absolute highest admiration for a man they knew that used to be wealthy, but slowly gave absolutely everything he had to his community and visiting strangers, leaving him with literally nothing.\n</p><p>\nBefore flying to Dubai, I contacted a Saudi guy I met once in England.\nHe had emailed me out of the blue a few years earlier and we had a meal and great conversation in Oxford.\nIt was my first time meeting someone in full Arab outfit - the white robe and headdress with the black rope.\nI emailed him to say I was coming to Dubai, asking if he’d be around to meet.\nHe replied, “My friend! Cancel your hotel! You will stay at my home in the <a href=\"https://en.wikipedia.org/wiki/Burj_Khalifa\">Burj Khalifa</a>!”\nI said, “Wow! Thank you. OK. It’ll be great to see you.”\nHe said, “No, I won’t be there. I'm in Riyadh. But my uncle will pick you up at the airport and give you the keys, so you can stay as long as you like.”\n</p><p>\nThe legendary hospitality is real.\nI had his home to myself for those three days.\nIt was amazing.\nThat’s <a href=\"https://x.com/alballaa/photo\">Ali AlBallaa</a> of <a href=\"https://azm.sa/en/about-azm/\">AZM</a>.\nSo kind.\n</p>\n<h2>\nlocal tips before my trip\n</h2>\n<p>\n<a href=\"https://lucasskrobot.com/\">Lucas Skrobot</a> is an American living in Muscat, Oman.\nHe noticed <a href=\"https://sive.rs/book\">I was reading</a> books about UAE and Dubai, and asked about my interest.\nI told him I want to understand the local culture.\nHe said I must meet <a href=\"https://tamashee.com/\">Mohammed Kazim from Tamashee</a> who leads <a href=\"https://tamashee.com/tamashee-experience-2/\">cultural trips</a> around the region, and is a wealth of historical and cultural knowledge.\nI thought he was going to be an ancient man with a long beard, but we’ll get back to him in a minute.\n</p><p>\n<a href=\"https://www.aivantage.info\">Elliot Shimmin</a> is a Brit who was living in Abu Dhabi.\nHe emailed me in advance and said I must go to the <a href=\"https://cultures.ae/\">Centre for Cultural Understanding</a>, and most of all, the <a href=\"https://alshindagha.dubaiculture.gov.ae/\">Al Shindagha Museum</a>.\nI’m so glad he did.\nWe’ll get to that in a minute, too.\n</p>\n<h2>\nDubai is the bar in Star Wars\n</h2>\n<img src=\"/images/cantina.jpg\" width=\"400\" height=\"262\" alt=\"Dubai is the bar in Star Wars\" />\nAs soon as I arrived at the Dubai Airport, I felt like I was in the cantina in Star Wars.\nPeople from all over the galaxy, wearing traditional clothes from Nigeria, Qatar, Ethiopia.\nSome women covered in full niqab.\nSome wearing almost nothing and covered in tattoos.\nRussians, Indians, and sunburnt Brits.\nBig bushy beards and hippie dreadlocks.\nThree-piece suits and shiny shoes.\nFlowing robes and sandals.\n<p></p><p>\nLater in the Dubai Mall, I sat sipping tea for hours on the middle floor, just people-watching.\nI could sit in this place and watch all of humanity go by.\nAs an <a href=\"https://sive.rs/joke\">amateur anthropologist</a>, it’s heaven.\nThis is the modern international trading port, like the legends of the Silk Road.\nIntersections of culture.\nEast-meets-west, etc.\nThis is it, here and now.\nThis is where everything converges.\n</p><p>\nI’ve lived in New York City, London, Los Angeles, San Francisco, and Singapore.\nI love how multi-cultural they are.\nBut nothing like this!\nThose cities are about 35% immigrants, whereas Dubai is almost 90%.\n<strong>\nMy cultural curiosity has found its culmination.\n</strong>\n</p><p>\nI asked random strangers where they’re from.\nEvery answer was different.\nCameroon.\nKerala.\nPakistan.\nTanzania.\nPhilippines.\nKuwait.\nKazakhstan.\nEach was happy to tell me their story of why they moved to Dubai.\n</p><p>\nA man from the border of Pakistan and Afghanistan told me how he moved here twenty years ago, and has been bringing over family members every year, so now where he lives in Sharjah, just north of the city, there are over 120 of his relatives living in the same neighborhood.\nUAE welcomes immigrants and makes it easy for anyone talented to come and work.\nThe population is 11 million but they are planning for 20 million, in infrastructure and housing.\n</p>\n\n<h2>\nThe perfume house at Al Shindagha\n</h2>\n<img src=\"/images/perfume-house.jpg\" width=\"800\" height=\"300\" alt=\"perfume house at Al Shindagha\" />\n<p>\nI spent my first day in Dubai at the <a href=\"https://alshindagha.dubaiculture.gov.ae/en/About/Pages/default.aspx\">Al Shindagha museum</a>, which I highly recommend.\nIt shows you Emirati culture, history, geography, and artifacts.\nIt’s made up of a bunch of little buildings that were traditional homes.\nOne subject per building.\n</p><p>\nOne of the buildings is just about perfume, so I tried to skip it.\nI had no interest in girly perfume.\nBut when I asked the guide how to go around it, she explained that it would be kind of difficult, so I might as well just go through it.\nI’m so so glad I did.\n<strong>\nThis little building is now one of my favorite places on earth.\n</strong>\n</p><p>\nIt has many different scents kept in airtight cylinders, so you can press a button to release a bit of the aroma, smell it, and close it again.\nNo need to dab it on anything.\nYou can smell the origin of incense, like <a href=\"https://en.wikipedia.org/wiki/Agarwood\">oud</a>, amber, and musk.\nOud was my favorite.\nI couldn’t get enough.\nI kept going back to that cylinder.\n</p><p>\nAnd <a href=\"https://en.wikipedia.org/wiki/Frankincense\">frankincense</a>!!\nOh my god.\nNo wonder this stuff is legendary.\nWait until you smell it.\nIt’s amazing.\n</p><p>\nIncense is used all around public spaces in UAE, so to me it’s the first thing I remember when I think of being there.\nThose wonderful smells.\nI miss them so much.\n</p>\n\n<h2>\nOne of the most interesting men I’ve ever met\n</h2>\n<img src=\"/images/skrobot-kazim.jpg\" width=\"400\" />\n<p>\n<a href=\"https://lucasskrobot.com/\">Lucas</a> drove up from Oman, and met me with <a href=\"https://tamashee.com/our-story-2/\">Mohammed Kazim at the Tamashee store-front</a>.\nThe next four hours with them was one of the most interesting conversations I've ever had in my life.\n</p><p>\nFirst, since he was described as a wealth of cultural and historical knowledge, I was expecting to meet an old man, but he's younger than me!\nAnd though he's dressed in full Kuwait-style thobe, he has an American accent, and talks just like my old friends.\n</p><ul><li>\nhis grandfather built the first building in central Dubai\n</li><li>\nhe went to Boston for college\n</li><li>\nback in Dubai after America, felt that the Bedu roots of Arab culture were getting lost\n</li><li>\nleft the world of finance to start two passion projects: Tamashee traditional sandals, and cultural tours around the Arabian Peninsula\n</li></ul><p>\nAfter I arrived, and he gave me the traditional coffee and dates, I asked his interest in traditional Arab culture.\n</p><p>\nHe said:\n</p><blockquote>\n“In Boston, I was missing home, and read <a href=\"https://sive.rs/book/ArabianSands\">a book about the Bedu culture in the 1940s</a>.\nWe used to let nothing go to waste.\nA foreigner threw a date pit in the fire, and the local Bedu man immediately rescued it, saying ‘In the desert, we can’t afford to waste anything.’\nNow look around at all the water we waste.\nWe’ve lost touch with what made this culture great, so I want to help people reconnect with the roots of our culture.”\n</blockquote>\n<p></p><p>\nI asked him a question about the local culture, and he said, “It depends if you’re talking about the people from the desert, versus the coast, versus the mountains.”\n</p><p>\nI said, “Where is your family from?”\n</p><p>\nHe said, “From the desert, but then two uncles got in a fight, splitting the family, and half went to Iraq for a while.\nThey reunited in Abu Dhabi, but then Islam came along...”\n</p><p>\nI interrupted, “Wait. Islam came around the year 620. Have you been telling me your family history from <em>two thousand years ago?</em>”\n</p><p>\nHe said, “Well, 1800 years ago, yeah.”\n</p><p>\nI said, “How on earth do you know your family history back that far?”\n</p><p>\nHe shrugged, “We keep good records.”\n(I’ve asked other Emiratis since, and they all seem to know their family history this far back.)\n</p><p>\nWow.\nMohammed and Lucas and I ended up talking for hours about culture, history, religion, and more.\nNow I meet up with Mohammed every time I go through Dubai, and I hope to eventually take all of his <a href=\"https://tamashee.com/tamashee-experience-2/\">cultural trips</a>.\n</p>\n<h2>\nI want to live there\n</h2>\n<p>\nI’ve been back to UAE a few times since, getting to know many people that live there, and still love it.\nMy best friend grew up in Abu Dhabi and raves about it.\nMy interest in this part of the world feels bottomless.\nI love the culture and people.\nI still haven’t been to the other <a href=\"https://en.wikipedia.org/wiki/Gulf_Cooperation_Council\">GCC countries</a>, but I want to live there.\nThen you can all stay at my home, so I can return some of that hospitality.\n</p>\n<h2>\nBooks to learn more:\n</h2>\n\n<div>\n<a href=\"https://sive.rs/book/CityOfGold\"><img src=\"/images/book/CityOfGold.webp\" alt=\"City of Gold: Dubai - by Jim Krane\" /></a>\n<a href=\"https://sive.rs/book/Arabs\"><img src=\"/images/book/Arabs.webp\" alt=\"Arabs - by Tim Mackintosh-Smith\" /></a>\n<a href=\"https://sive.rs/book/ArabianSands\"><img src=\"/images/book/ArabianSands.webp\" alt=\"Arabian Sands - by Wilfred Thesiger\" /></a>\n<a href=\"https://sive.rs/book/UAECS1\"><img src=\"/images/book/UAECS1.webp\" alt=\"UAE Culture Shock - by Gina Crocetti Benesh\" /></a>\n<a href=\"https://sive.rs/book/UAECS2\"><img src=\"/images/book/UAECS2.webp\" alt=\"UAE Culture Smart - by John Walsh\" /></a>\n</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"946ff420556bf72ff41e75d92113ba8882a0697343a7a57df09ab5b3d990b846","category":"Sites"}