{"title":"Think like a bronze medalist, not silver","link":"https://sive.rs/bronze","date":1489363200000,"content":"<p>\nImagine the Olympics, where you have the three winners of a race standing on the podium: the gold, the silver, and the bronze.\n</p><p>\nImagine what it’s like to be the silver medalist.\nIf you’d been just one second faster, you could have won the gold!\nDamn! So close! Damn damn damn!\nFull of envy, you’d keep comparing yourself to the gold winner.\n</p><p>\nNow imagine what it’s like to be the bronze medalist.\nIf you’d been just one second slower, you wouldn’t have won anything!\nAwesome!\nYou’d be thrilled that you’re officially an Olympic medalist and get to stand on the winner’s podium.\n</p><p>\nComparing up versus comparing down:\nYour happiness depends on where you’re focusing.\n</p><p>\nThe metaphor is easy to understand, but hard to remember in regular life.\nIf you catch yourself burning with envy or resentment, think like the bronze medalist, not the silver.\nChange your focus.\n<strong>\nInstead of comparing up to the next-higher situation, compare down to the next-lower one.\n</strong>\n</p><p>\nFor example, if you aim to buy “the best” thing, you may feel like gold when you get it, but when the new “best” thing comes out next year, you’ll feel that silver envy.\nInstead, if you aim to buy the “good enough” thing, it will keep you in the bronze mindset.\nSince you’re not comparing to the best, you’ll feel no need to keep up.\n</p><p>\nI’ve met a lot of famous musicians.\nThe miserable ones were upset that they weren’t more famous, because they’d bitterly compare themselves to the superstars.\nThe happiest ones were thrilled to be able to make a living making music.\n</p><p>\nOn the other hand, when you’re being ambitious, trying to be the best at a specific skill, it’s good to be dissatisfied, like that silver medalist focusing on the gold.\nYou can use that drive to practice and improve.\n</p><p>\nBut most of the time, you need to be more grateful for what you’ve got, for how much worse it could have been, and how nice it is to have anything at all.\nAmbition versus gratitude.\nComparing up versus comparing down.\n</p><p>\nFor funnier thoughts on this, search the web for <a href=\"https://www.youtube.com/results?search_query=louis+ck+everything+amazing+nobody+happy\">Louis C.K.’s “everything is amazing and nobody is happy”</a> and <a href=\"https://www.youtube.com/results?search_query=seinfeld+silver+medal\">Jerry Seinfeld’s “silver medal”</a> routines.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9497157362053c001e61ca8b46a12cdee2c0991740ae0e0d27ab1a47092e5e7b","category":"default"}