{"title":"My 4 magic moments with Vision Pro","link":"https://om.co/2024/01/31/my-4-magic-moments-with-vision-pro/","date":1706715716000,"content":"<p>No, not again! Not another Vision Pro Review! I feel you — <a href=\"https://om.co/2024/01/30/apples-vision-pro-the-meta-review/\">after all the reviews yesterday</a>, I am pretty sure you don’t want to read another review. Here’s the good news — it’s not a review. Instead, I will share my quick impressions from a deep dive at Apple Park, and my four magic moments with the Vision Pro.</p>\n\n\n\n<span></span>\n\n\n\n<p>Unlike the reviewers who published their reviews, my access to the device has come in dribs and drabs. It has been a carefully managed experience — an early demo, exposure to the photos app, and the spatial video capabilities. A few days ago, I got to use the device for less than two hours. </p>\n\n\n\n<p>This was a highly curated experience — so this doesn’t and won’t qualify as a review. I am skipping all the stuff that has been covered by the deep dive that professional reviewers have already published. WSJ’s Joanna Stern’s review is amazing — <a href=\"https://youtu.be/8xI10SFgzQ8?feature=shared\">especially the video version.</a> It is best to consider these as my considered impressions.</p>\n\n\n\n<p>First, can I wax eloquent about the technological achievement of Vision Pro? As a chip and hardware nerd, I think Vision Pro is a witches’ brew of the latest of all types of technologies. <a href=\"https://om.co/2024/01/30/apples-vision-pro-the-meta-review/\">Let me quote my post from yesterday</a>:</p>\n\n\n\n<blockquote>\n<p>Vision Pro is, after all, a full-blown computer. It’s made from magnesium, carbon fiber, and aluminum. It has two high-resolution front-facing cameras (video pass-through), two cameras that face down to track your hands and gestures, a LiDAR, TrueDepth cameras, and some kind of infrared lights. The device has two tiny MicroOLED displays packed with a total of 23 million pixels. (As I noted in an earlier piece, these displays are the magic and the primary reason why Vision Pro is so expensive.)</p>\n\n\n\n<p>All these sensors, cameras, and displays are powered by an M2 chip and an R1 spatial coprocessor, and fans. Apple has packed this in an enclosure that is about three times the weight of the iPhone 15 Pro Max and is still lighter than the iPad 12.9. Paint me impressed purely from a technological standpoint.</p>\n\n\n\n<p>What’s even more impressive is the sound — Apple is using beamforming to direct the sound into your ears. And unless you are really blasting it out loud — you could get away with wearing it in a public place — though people in Business Class will notice the slight din from the seat next to them. Apple is hoping you will splurge on AirPods Pro.</p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<figure><img width=\"1024\" height=\"576\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-1024x576.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-1024x576.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-300x169.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-768x432.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-1536x864.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-192x108.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-1100x618.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-560x315.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon-1800x1012.jpg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/Apple-Vision-Pro-entertainment-App-Store-Environments-moon.jpg 1960w\" /></figure>\n\n\n\n<p>No matter how you see the device — love it or hate it, you can’t deny that it is yet another amazing computer built by a company that knows how to build great consumer computers.</p>\n\n\n\n<p>My quasi-hands-on experience started with me unpacking my custom lenses from Zeiss, installing them in the Vision Pro, and then wearing it on my face. The next steps were a breeze for me. Having used the device previously on a couple of occasions, I knew how to attach (and remove) the straps — and how to make it fit on my face. I had to change the nose-face pad, as the default one didn’t fit my face as well: I have lost a bit of weight in my face.</p>\n\n\n\n<p>It is very simple to calibrate the lenses, eye movement, and my hands. Just press the digital crown and follow the instructions. This is very different from other VR headset setups I have experienced in the past. (From the reviews published today, I think you can sync all my iOS settings including passwords by bringing my iPhone close to Vision Pro, though I have not personally experienced it.)</p>\n\n\n\n<p>Apple’s team ran me through multiple scenarios, including the idea of using it for work and collaboration. In one such scenario, Vision Pro became a replacement for my desktop screen, for editing videos and other such applications. I used the apps in the Vision OS environment.</p>\n\n\n\n<p>I swapped emails and used continuity to flit between iPad, Mac, and Vision OS apps. I could cut and paste objects out of Vision OS apps to iPad apps, and vice versa. This shouldn’t come as a surprise — after all, these were all Apple apps and the company has had ample time to finesse the experience.</p>\n\n\n\n<p>The “continuity” technology that allows you to seamlessly work between various Apple OS environments is much better on Vision Pro than on any other Apple device I have experienced it thus far. Be prepared to be pleasantly surprised. That said, I left feeling lukewarm on the work apps, mostly because, well, I haven’t used them for a length of time to form an opinion.</p>\n\n\n\n<p>Now for my magic moments!</p>\n\n\n\n<p><strong>My first magic moment</strong> with Vision Pro came when I opened the Safari app and let a giant browser window float right in front. Push it back into the virtual environment and enjoy reading news or whatever. Pinch and hold your thumb and index finger to swipe up and down. Flick your wrist up (or down) to go up and down the page quickly. Reading has become such a “peering into the screen experience,” and I look forward to “leaning back” and reading. I know it sounds like such a little thing, but as an information omnivore, I am looking forward to it.</p>\n\n\n\n<p><strong>My second magic moment</strong> came when I used Algoriddim’s deejay app.</p>\n\n\n\n<figure><img width=\"1024\" height=\"768\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-1024x768.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-1024x768.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-300x225.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-768x576.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-1536x1151.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-2000x1500.jpeg 2000w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-192x144.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-1100x824.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-560x420.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048-1800x1349.jpeg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/01/2048.jpeg 2048w\" /></figure>\n\n\n\n<p>Back in the day, I used to love mixing music. I still do. And that is why I am very familiar with the turntables and deejay booth setups. However, I had switched away from physical devices to using software — desktop apps, and more recently iPad apps to mix music for my own personal consumption.</p>\n\n\n\n<p>Algoriddim’s Vision Pro app marries the ease of use of software and the realism of a proper deejay booth set-up. And the whole setup works just as you would expect it to work in the real world. The sliders, the fader, the special effects, and ability to control the records. It didn’t take long for me to fall back into the all too familiar mixing routine — much to the amusement of the Apple folks who were in the room.</p>\n\n\n\n<p>For me, that was pure magic — and that one moment of joy and one single app, highlighted the singular problem Apple has with its new device — the lack of apps that truly showcase the magic of the device is the biggest challenge for Apple. This reminds me of the early days of the iPad.</p>\n\n\n\n<p>On January 27, 2010, when the late Steve Jobs launched the iPad, it set me off on a path of imagination. The reality was different. The iPad suffered from the lack of applications that took real advantage of its capabilities.</p>\n\n\n\n<p>There were very few developers who understood the magic of a keyboard-less, touch-first, and sensor-packed connected screen with hours of battery power. What we got was predictable repurposing of what already existed — magazines, video services, and some social networking apps. Apple’s own developer relationship teams could inspire the developers to think bold and bigger. Apple itself failed to create anything meaningful for the new OS — one stellar app that really showed the potential of this new computing platform.</p>\n\n\n\n<p>Since then, the iPad has found its own equilibrium. The emergence of the “Pencil” has helped it become a powerhouse of creativity. It has found uses in places where no one thought it would. Airline pilots walk around with it with their flight plans and data. Fast food outlets are using the iPads to take orders. And my mom can now FaceTime without mucking about with a computer. I like its ease of use, its minimal footprint in my bag, the long battery, and the built-in 5G connection.</p>\n\n\n\n<p>But let’s face it — a majority of iPad owners use it for “content consumption.” Very few iPad apps are taking advantage of everything Apple has packed into the iPads — graphic processing units, neural chips, and a panoply of sensors.</p>\n\n\n\n<p>I worry that Vision Pro might find itself in that same trap of mundanity. As I said on CNBC, Vision Pro’s future will be determined by developers. The device is being launched at a fraught time for Apple — its developer relations have lost the loving feeling. The good news is that its nearest rival, Meta’s Quest, is viewed even more suspiciously by developers.</p>\n\n\n\n<p>Back to the magic moments!</p>\n\n\n\n<p><strong>My third magic moment</strong> came thanks to the much-maligned “Personas” that you have to create for using FaceTime inside of Vision Pro. I am ambivalent about personas and how you look in them. I am betting Apple will only make this better.</p>\n\n\n\n<p>I got a call from another Apple employee and he too was using his own persona. He proceeded to show me a series of costumes — real and virtual that were in his room. We “collaborated.” And that’s when I realized that sharing your entire view with a vision pro is a whole new way of collaborating. It is as if you are letting someone inside your eyes. This point of view sharing is way more normal and natural than screen sharing. This is a radically new experience. I should have expected this from Meta, which was talking about working in the Metaverse. It makes you realize that you need a lot of hardware expertise to think differently.</p>\n\n\n\n<p><strong>My last magic moment</strong> came when the Vision Pro became what I have always wanted — the future of television (and video.) A screen like none before. I opened up the Apple TV app, and picked an immersive video film of highliner Faith Dickey.</p>\n\n\n\n<p>I watched Dickey walk across a highline across the cliffs of Norway, but I felt as if I was there. It was so breathtaking — and in that moment, I thought maybe someday this is how all movies, televisions, and even home videos are going to be made for all to experience them live. </p>\n\n\n\n<p>Involuntarily, my eyes welled up a little — I had experienced something beautiful. And that it was made possible by technology and a computer. For that one brief moment, I felt not the power of technology, but its joy.</p>\n\n\n\n<p><strong>January 31, 2024. San Francisco</strong></p>\n\n\n\n<h4>ALL MY VISION PRO ESSAYS</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2019/01/13/so-what-can-apple-do-next/\">What’s the future of TV? (&amp; what can Apple do about it)</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/06/26/why-apples-vision-pro-will-change-movie-watching/\">Why Apple’s Vision Pro Will Change Movie-Watching</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/12/14/why-vision-pro-will-change-photography/\">Why Vision Pro Will Change Photography</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/06/07/hot-or-not-our-dystopian-vision/\">Hot or Not: Our Dystopian Vision</a></blockquote>\n</div></figure>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"9499a8c19666e62f24380e528e586a267c11548b996588d3eaf2bc5b276913e5","category":"default"}