{"title":"On Wanting to Change: Adam Phillips on Our Capacity for Transformation","link":"https://www.themarginalian.org/2024/06/05/on-wanting-to-change-adam-phillips/","date":1717604529000,"content":"<h3>“There is no description of a life without an account of the changes that are possible within it.”</h3>\n<hr />\n<p><img width=\"320\" height=\"487\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?fit=320%2C487&amp;ssl=1\" alt=\"On Wanting to Change: Adam Phillips on Our Capacity for Transformation\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?w=985&amp;ssl=1 985w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?resize=320%2C487&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?resize=600%2C914&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?resize=240%2C365&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/adamphillips_change.jpg?resize=768%2C1170&amp;ssl=1 768w\" /></p><p>When <a href=\"https://orionmagazine.org/article/maria-popova-orion-questionnaire/\">answering the <em>Orion</em> questionnaire</a>, a question stopped me up short by contracting an incomprehensible expanse of complexity into a binary: </p>\n<p><em>Are you the same person you were as a child?</em> </p>\n<p>It is fundamentally a question about change — its possibility and its paradoxes, our yearning for it and our ambivalence toward it. Here I am, living on a different landmass from the one I was born on, in a body composed of cells not one of which existed in its present form at my birth, but my sources of joy and suffering feel largely unchanged since I was a child. What, then, is change — and who is it doing the changing? </p>\n<p>“We create ourselves. The sequence is suffering, insight, will, action, change,” the psychoanalyst Allen Wheelis wrote in his 1973 <a href=\"https://www.themarginalian.org/2023/07/04/allen-wheelis-how-people-change/\">field guide to how people change</a>. But when we wish to recreate ourselves, to change for the better, how do we know what to want, what is truly and dependably better? “The things we want are transformative, and we don’t know or only think we know what is on the other side of that transformation,” Rebecca Solnit wrote in her wonderful <a href=\"https://www.themarginalian.org/2014/08/04/field-guide-to-getting-lost-rebecca-solnit/\"><em>Field Guide to Getting Lost</em></a>, shining a sidewise gleam on <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">our staggering blind spot about transformation</a> — we are simply incapable of imagining ourselves on the other side of a profound change, because the present self doing the imagining is the very self that needs to have died in order for the future self being imagined to emerge. </p>\n<figure><a href=\"https://society6.com/product/butterfly-metamorphosis-by-maria-sibylla-merian-1705_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=680%2C912&amp;ssl=1\" width=\"680\" height=\"912\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=320%2C429&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=600%2C805&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=240%2C322&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=768%2C1030&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/Merian_metamorphosis_small.jpg?resize=1145%2C1536&amp;ssl=1 1145w\" /></a><figcaption>Butterfly metamorphosis by <a href=\"https://www.themarginalian.org/2014/11/25/summer-birds-maria-merian-butterflies\">Maria Sibylla Merian</a>, 1705. (Available as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-maria-sibylla-merian-1705_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-maria-sibylla-merian-1705_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>This is why the profoundest changes tend to happen not willed but spawned by fertile despair — the surrender at the rock bottom of suffering, where the old way of being has become just too painfully untenable and a new way must be found. (Such changes tend to happen <a href=\"https://www.themarginalian.org/2024/03/03/the-middle-passage-john-hollis/\">especially in midlife</a>, when the accumulation of familiar suffering collides with our diminishing store of time to press us against the blade of urgency.)</p>\n<p>The psychoanalyst <a href=\"https://www.themarginalian.org/tag/adam-phillips/\">Adam Phillips</a> takes up these restive questions with his characteristic rigor and sensitivity in <a href=\"https://www.amazon.com/Wanting-Change-Adam-Phillips/dp/0374172048/?tag=braipick-20\" target=\"_blank\"><strong><em>On Wanting to Change</em></strong></a> (<a href=\"https://search.worldcat.org/title/1246141951\" target=\"_blank\"><em>public library</em></a>) — an insightful investigation of the paradoxes and possibilities of change, at the heart of which is our fundamental confusion about knowing what we really want, and what to want. He writes:</p>\n<blockquote><p>Wanting to change is as much about our wanting, and how we describe it, as it is about the changes we want. Getting better means working out what we want to get better at.</p>\n<p>When we want to think of our lives as progress myths, in which we get better and better at realizing our so-called potential; or conversely as myths of degeneration — as about decay, mourning and loss (ageing as the loss of youth, and so on) — we are also plotting our lives. Giving them a known and knowable shape and purpose; providing ourselves with guidelines, if not blueprints, of what we can be and become. It is not that our lives are determined by our descriptions of them; but our descriptions do have an effect, however enigmatic or indiscernible it might be. And there is no description of a life without an account of the changes that are possible within it.</p></blockquote>\n<figure><a href=\"https://society6.com/product/jacobs-dream-by-william-blake-1805_print?sku=s6-22921179p4a1v1?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?resize=680%2C865&amp;ssl=1\" width=\"680\" height=\"865\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?resize=320%2C407&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?resize=600%2C764&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?resize=240%2C305&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/williamblake_jacobsdream_small.jpg?resize=768%2C977&amp;ssl=1 768w\" /></a><figcaption><em>Jacob’s Dream</em> by William Blake, 1805. (Available <a href=\"https://society6.com/product/jacobs-dream-by-william-blake-1805_print?sku=s6-22921179p4a1v1?curator=brainpicker\" target=\"_blank\">as a print</a> and as <a href=\"https://society6.com/product/jacobs-dream-by-william-blake-1805_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Change is often a consequence of, and a coping mechanism for, the contradictions we live with — an attempt at greater cohesion. With an eye to the various divides that sunder our lives — nature and culture, appearance and reality, the private and the public, the conscious and the unconscious — Phillips considers this essential fulcrum of change:</p>\n<blockquote><p>The so-called self is what we have come to call, in William James’s phrase, “a divided self”; and after James and Winnicott, a true and false self, or a self in language, in fantasy, but perhaps, or really, no self at all. A self and its absence co-existing, in its most modern form and formulation. A self always, at least, having to manage conflicting and competing versions of itself; a self always having to get its representations of itself right, even while knowing, in the modern way, that they are only representations, pictures and descriptions of something that may only exist in its pictures and descriptions. A self riddled with conflict, having to straddle the contradictions; or, at its most minimal, do something with or about them.</p></blockquote>\n<p>In the Judeo-Christian tradition, Phillips observes, the need for resolving and reconciling these inner contradictions has culminated in the notion of conversion, which he defines as “the exchange that demands change, and claims to know the change that is needed,” often “prompted by something unbearable.” But the two most formative conversions in that tradition, Paul and Augustine, “simply expose the conflicts they were meant to resolve and clarify.” (“The trouble with human happiness is that it is constantly beset by fear,” Hannah Arendt wrote in her incisive <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">Augustine-lensed meditation on love and loss</a>, and nowhere is our happiness more beset by fear than in our fear of change.) Phillips writes:</p>\n<blockquote><p>This tells us something revealing, so to speak, about our modern scepticism about personal change at its most dramatic and significant. This profound modern ambivalence about conversion experiences — mostly but not always from the non-religious — leads to many questions not only about people’s relationship to God, but about their relationship to change, to transformation itself; questions about how it occurs, and what it might be for (what it might be in the service of).</p></blockquote>\n<p>At the center of these ambivalences, of course, is <a href=\"https://www.themarginalian.org/2023/05/13/free-will-bbc/\">the problem of free will</a> and the fact that myriad unchosen variables, from genetic and cultural inheritance to accidents and natural disasters, constrain our capacity for change. But beyond this question of whether and how we can choose our transformation is the question of what transformation to choose at all — a fundamental question of self-knowledge, riddled with all the ways in which we are fundamentally opaque to ourselves. </p>\n<p>Phillips observes:</p>\n<blockquote><p>Change as an object of desire is a question of knowledge, of in some sense knowing what we want to be, or to become, or knowing that we don’t know what we want but that we want something.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=680%2C811&amp;ssl=1\" width=\"680\" height=\"811\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?w=1161&amp;ssl=1 1161w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=320%2C382&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=600%2C716&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=240%2C286&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=768%2C916&amp;ssl=1 768w\" /></a><figcaption>Art by Sophie Blackall from <a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><em>Things to Look Forward to</em></a></figcaption></figure>\n<p>A great deal of change takes place in relationships. “What’s the use of falling in love if you both remain inertly as-you-were?” Mary McCarthy <a href=\"https://www.themarginalian.org/2016/06/10/mary-mccarthy-hannah-arendt-love/\">wrote to Hannah Arendt</a>. With an eye to Donald Winnicott’s pioneering work in developmental psychology, which illuminated <a href=\"https://www.themarginalian.org/2016/05/08/winnicott-mothers-contribution-to-society/\">how the mother-child relationship lays the foundation of future relationships</a>, Phillips writes:</p>\n<blockquote><p>People are only ever converted to something they believe they can depend on… For Winnicott… the developmental question for everyone is: how can I depend on someone whose reliability can never be guaranteed? It is a straight line from this to the idea of faith; and the equation between believing in and depending on… Questions like this might help us to clarify the differences between conversion, addiction, entrapment and ownership; and whatever the alternatives could be in human relations. Conversion, addiction, entrapment and ownership, we should note, are all forms of consistency; and if and when consistency is equated with reliability, or dependability, or trust, these will be alluring, if malign, options. Winnicott proposes a capacity for surprise as an alternative to the need to be believed; an openness to surprise, a desire for it being integral, in his view, to a realistic and enlivening dependence on anything or anyone.</p></blockquote>\n<p>That capacity for surprise is another way of saying we must trust the uncertainty inherent in change if we are to reap the rewards of true transformation, undergo an inner conversion — one of “those momentous changes of belief that are changes of life.” And the refusal to ossify, the wish to change one’s life, shimmers with the deepest desire to live it. Virginia Woolf <a href=\"https://www.themarginalian.org/2014/11/20/the-humane-art-virginia-woolf/\">knew this</a>: “A self that goes on changing is a self that goes on living.” </p>\n<p>Complement <a href=\"https://www.amazon.com/Wanting-Change-Adam-Phillips/dp/0374172048/?tag=braipick-20\" target=\"_blank\"><strong><em>On Wanting to Change</em></strong></a> with poet and philosopher John O’Donohue on <a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\">the art of beginnings</a> — that supreme springboard of change — then revisit Phillips on <a href=\"https://www.themarginalian.org/2024/05/17/adam-phillips-giving-up/\">knowing what you want and the courage to change your mind</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"94d4923d924ac2a199229c5b57b4603f2b5f6a9e026b13692f1c187375faab2b","category":"default"}