{"title":"Here’s how to live: Value only what has endured.","link":"https://sive.rs/htl14","date":1639440000000,"content":"<p>\nThe longer something lasts, the longer it will probably last.\n<br />\nSomething that’s been around for a year will probably be around for another year.\n<br />\nSomething that’s been around for fifty years will probably be around for another fifty years.\n</p><p>\nOnly the strong survive, so what’s still here after decades is proven to be well-made and well-loved.\n<br />\nThe longer something lasts, the more people know and depend on it, solidifying its place in our world.\n<br />\nOnly these proven things are worth your time and attention.\n</p><p>\nThink back to ten years ago.\n<br />\nRemember the technologies that the media were hyping as the future?\n<br />\nHow many lasted?\n<br />\nIt’s hard to remember because we haven’t heard of most of them since then.\n<br />\nThey didn’t stand the test of time.\n</p><p>\nOld technologies aren’t exciting because they aren’t changing as fast.\n<br />\nBut they’re more important.\n<br />\nCryptocurrency versus water filtration.\n<br />\nVirtual reality versus air conditioning.\n<br />\nWhich gets more media attention?\n<br />\nWhich is more important?\n</p><p>\nThe media focuses on what’s new, because that’s what pays.\n<br />\nTheir attention makes new things seem important.\n<br />\nBut only time will tell.\n</p><p>\nNew things have some benefits but deeper downsides like addiction, pollution, scattered focus, or wasted time.\n<br />\nThe marketing shouts the benefits and hides the harm.\n<br />\nBut the benefits rarely outweigh the downsides.\n<br />\nOnly time will tell.\n</p><p>\nThe pleasure of buying a new thing disappears in days, even hours.\n<br />\nSo much misery comes from indulgences in current junk.\n</p><p>\nSo the way to live is to ignore everything new.\n<br />\nAll of it.\n<br />\nLet the test of time filter everything.\n<br />\nValue only what has endured.\n</p><p>\nIgnore all marketing and advertising.\n<br />\nNobody is pushing what really matters.\n<br />\nFriendships, nature, family, learning, community.\n<br />\nThe best things in life aren’t things.\n</p><p>\nIgnore all news.\n<br />\nIf it’s important, there will eventually be a good book about it.\n<br />\nWhen people ask you about current news, proudly have no opinion.\n<br />\nAdmit you’ve given it no thought at all — and don’t plan to — because it’s not important.\n<br />\nIndulging is common.\n<br />\nRefraining is rare.\n</p><p>\nThe world of news is noisy, because they have to hype it.\n<br />\nThey try to get you to pay attention to something that’s not actually important.\n<br />\nThey create a false sense of urgency, social status, fear, shock, or any tricks possible to manipulate your psychological triggers, and ultimately help them profit.\n<br />\nBy contrast, the truly important things are quiet.\n<br />\nLife is incredibly peaceful when you shut out the noise.\n</p><p>\nThe modern life is shallow and distracted.\n<br />\nThe timeless life is deep and focused.\n</p><p>\nLive in the past.\n<br />\nWatch the greatest movies of all time.\n<br />\nRead the classics.\n<br />\nListen to the legends.\n<br />\nThese things have lasted because they work so well.\n<br />\nTime is the best filter.\n</p><p>\nWhat technologies have the best future?\n<br />\nThe ones with the best past.\n<br />\nBe the last to adopt a technology, after it’s cheaper, better, and no longer changing.\n<br />\nPity the early adopters, exploring the pitfalls, like the first mouse caught in the mousetrap.\n<br />\nTechnology advances faster than wisdom.\n<br />\nIt’s smarter to move at wisdom’s pace.\n<br />\nDon’t buy a bandage unless you have a wound.\n</p><p>\nWhen you need a coat, table, or house, find one old and used.\n<br />\nThey’re incredibly well-crafted — sturdier and more beautiful than anything new.\n<br />\nThey’ll outlive you.\n</p><p>\nBefore trying to improve something old, find out why it is the way it is.\n<br />\nNever assume people in the past were ignorant.\n<br />\nThey did it that way for good reasons.\n<br />\nStudy the past — understand Chesterton’s fence — before thinking you know better.\n</p><p>\nStudy history, tradition, and culture.\n<br />\nGet to know places that haven’t been homogenized by globalization.\n<br />\nWhen a person loses their memory, they lose their sanity.\n<br />\nWhen a culture loses its traditions, it loses its sanity too.\n<br />\nThe world is acting crazy because it doesn’t know who it is anymore.\n</p><p>\nMove to a small self-sufficient town that has resisted modernization — ideally an untouched place that hasn’t changed in a hundred years, and won’t change in a hundred more.\n<br />\nSpend time outside.\n<br />\nFind happiness and perspective in nature.\n<br />\nIt reminds you that you don’t need anything the modern world is pushing.\n<br />\nEverything they’re shouting about will soon be gone.\n</p><p>\nLearn time-tested skills that were just as useful in your grandparents’ time as they are today.\n<br />\nSpeaking, writing, gardening, accounting, persuasion, and survival skills.\n<br />\nThese skills have hardly changed in a century.\n<br />\nThey’re unlikely to change in your lifetime.\n</p><p>\nMaster the fundamentals, not new tricks.\n<br />\nLearn the timeless aspects of your craft.\n<br />\nThis knowledge will never lose its value.\n<br />\nIn any given field, learn the oldest thing still around, since it’s the one most likely to last.\n</p><p>\nBecome a geologist.\n<br />\nYou’ll measure things in millions of years.\n<br />\nYour timeline will be so long that mountains seem fluid.\n<br />\nThe whole modern world will seem like a sandcastle, built and washed away in a single day.\n</p><p>\nAnd so, by ignoring the new, you will improve your life in every way.\n<br />\nBetter investment of your time.\n<br />\nBetter peace of mind.\n<br />\nBetter quality items and entertainment.\n<br />\nBetter skill set.\n<br />\nBetter perspective.\n<br />\nBetter everything.\n</p><p>\nThe best way to live is to value only what has endured.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"951bb85fa0afbd54a7b777f056bd9597587a25a6113f705e3349b21115ea5545","category":"Sites"}