{"title":"Happy birthday to the BBC In Our Time podcast, 20 years old today","link":"https://interconnected.org/home/2024/11/11/in-our-time","date":1731326520000,"content":"<div>\n<p>I mention Melvyn Bragg’s BBC Radio 4 show <em>In Our Time</em> <a href=\"https://interconnected.org/home/tagged/in-our-time-episode-mentions\">pretty frequently</a> on this blog. It’s my favourite podcast.</p>\n<p>A quick pitch for the show, if you don’t know it:</p>\n<p>Each week Melvyn Bragg invites three guests to discuss a different cultural or historical topic. It’s incredibly varied: in recent weeks they’re tackled the history of Venice, wormholes, Monet, the book <em>Little Women,</em> bacteriophages and so on. Next week it’s the Antikythera Mechanism.</p>\n<p>It also has incredibly high signal-to-noise. An episode as broadcast is just 30 minutes, plus an extra 15 minutes of discussion in the podcast version. The guests are teaching academics, so they’re practiced at getting across ideas with clarity and engagement… and without getting distracted by the meta-discourse (this is my frustration when I listen to current affairs, where you spend longer hearing about why somebody might be adopting a position and the consequences than understanding the idea itself).</p>\n<p>So for me, it’s ideal. 45 minutes is running-an-errand length. By the time I’ve returned from the shops I’ve got enough of a grounding in the Permian-Triassic boundary to pull on a few new Wikipedia threads and to recognise that the Monkey Puzzle tree at the top of my road is absolutely ancient; there’s a herbivorous sauropod munching on it in my imagination that wasn’t there when I passed the tree heading out.</p>\n<p>The show has been going for 26 years. There are a 1,000 episodes and change. They’re all still online and still free.</p>\n<hr />\n<p>Another reason I have a soft spot for <em>In Our Time</em> is that I was involved in setting up the podcast, 20 years ago this week.</p>\n<p>The show itself started late 1998. So it was established by the time the podcast began in 2004. Podcasting as a medium however was very new.</p>\n<p>To give you an idea about how early it was:</p>\n<ul>\n<li>Dave Winer and Adam Curry invented podcasting in a technology and cultural bootstrap <a href=\"http://scripting.com/2017/04/23/theCreationStoryOfPodcasting.html\">from June 2004</a>. People had been experimenting with audioblogging and RSS since 2003, but this was the tipping point.</li>\n<li>Apple’s iPod was already wildly popular but required files to be added to iTunes to get them onto the device. Apple didn’t add podcasts to iTunes until June 2005.</li>\n</ul>\n<p>The BBC has always been a pioneer in new ways to reach audiences, from radio and popularising colour TV to contributing to new streaming compression standards.</p>\n<p>In 2004, BBC radio had a popular “listen again” streaming service based on RealAudio, and a time-limited MP3 trial with several programmes including <em>In Our Time</em> – pragmatically, because it could clear the rights. There was more going on across the BBC but that was the part I knew about; I was working in BBC Radio &amp; Music at the time.</p>\n<p>I don’t recall whose idea it was to use the MP3 trial to experiment with podcasts. Ultimately I credit everything that came out of the technology and design team in that era (it was a very special time) to my boss <a href=\"https://cityofsound.medium.com/about\">Dan Hill</a> who originated, connected, amplified and taste-made ideas like you wouldn’t believe.</p>\n<p>But I do remember hand-typing the podcast XML files and working with the programme team each week to upload the file to the webserver. That was my contribution.</p>\n<p><a href=\"https://interconnected.org/home/2004/11/11/you_can_now_get\">Here’s the In Our Time podcast announcement</a> exactly 20 years ago today, on this very blog:</p>\n<blockquote>\n<p>You can now get Melvyn Bragg’s In Our Time as a Podcast using this link: …</p>\n</blockquote>\n<p>As far as I can tell, this was the <em>first</em> podcast from any national broadcaster, anywhere.</p>\n<p><em>(Here’s <a href=\"https://podnews.net/article/history-uk-podcasts\">a UK history of podcasting</a> and <a href=\"https://en.wikipedia.org/wiki/History_of_podcasting\">Wikipedia’s history of podcasting</a>.)</em></p>\n<p>It’s probably my most consequential work! Back in 2014 the BBC marked a decade of podcasting and announced they’d hit <a href=\"https://www.bbc.co.uk/mediacentre/latestnews/2014/10years-podcasting\">over 1 billion downloads</a>. Goodness knows what the numbers are today.</p>\n<p>Is <em>In Our Time</em> really a podcast? My view: yes. If it’s not a podcast then it’s not radio either. It’s discursive and speech-based; more structured and denser than most other interview-based podcasts (I can only think of <a href=\"https://conversationswithtyler.com\">Conversations with Tyler</a> as a show that matches it); but with that podcast feel that I’m “listening in”  rather than being <em>broadcasted at.</em></p>\n<p>Anyway.</p>\n<p>Happy 20th birthday to the <em>In Our Time</em> podcast!</p>\n<hr />\n<p>I now run an <em>unofficial</em> companion site for <em>In Our Time</em> called <a href=\"https://www.braggoscope.com\">Braggoscope</a>. My story with this site is yet another reason I’m into the show.</p>\n<p>Braggoscope is there because an archive of 1,000 shows is a <em>lot</em> and spelunking the archive to find episodes to listen to is not always easy (podcast apps always focus on the most recent episodes). So it aims to help with that.</p>\n<p>I put Braggoscope out into the world in February 2023. <a href=\"https://interconnected.org/home/2023/02/07/braggoscope\">Here’s the announcement post.</a> You can browse episodes by date, by guest (if you’re into Ancient Greece then listen to <a href=\"https://www.braggoscope.com/guests/edith-hall.html\">all the episodes with Edith Hall</a> for example), and in a directory of <a href=\"https://www.braggoscope.com/directory\">episodes organised by Dewey Decimal</a>, i.e. library code, which is frankly pretty neat.</p>\n<p>What’s unusual is how I built the site.</p>\n<p>I initially just wanted to be able to click on links to books (each episode has a reading list) because the official BBC archive doesn’t include links. Copy and paste a title into Amazon? I’m too lazy.</p>\n<p>So I realised that I would have to clone the BBC’s entire <em>In Our Time</em> archive site, somehow grabbing 25+ years of data that… well, it’s decently structured I suppose, but there are a lot of inconsistencies that creep in over that amount of time.</p>\n<p>This job is called web scraping and I’ve done a lot of it before, so I estimated this was about a 4 day job.</p>\n<p>Did I mention I’m lazy? <a href=\"http://wiki.c2.com/?LazinessImpatienceHubris\">One of the great virtues of a programmer.</a></p>\n<p>I realised that, instead of doing the work myself, I could feed the webpages into OpenAI’s GPT-3 and ask it to extract to data for me. It took 20 minutes to write the code and cost me $30 to run it overnight (it would cost 30 cents today, just 18 months later).</p>\n<p>Asking GPT-3 to give each episode a Dewey classification was a last minute addition. I was astounded it worked.</p>\n<p>I wrote up the project and released it.</p>\n<p>I was one of the first people to use gen-AI for data extraction instead of chatbots. I submitted my announcement post to Hacker News… and it sunk without trace.</p>\n<p>Some time later, the folks at Hacker News got in touch and asked to me to re-submit. This time the post sat in the #1 spot for 12 hours and kicked off <a href=\"https://news.ycombinator.com/item?id=35073603\">an amazing discussion</a>. Here’s the top comment, my favourite:</p>\n<blockquote>\n<p>Finally, my interest in LLMs is piqued!</p>\n<p>Seems like everyone has been getting excited around the search or code-generation use cases … or simply trying to make it say naughty things (boring, not interested, wake up in a few more years), but this is eye opening.</p>\n<p>The idea of this as a “universal coupler” is fascinating, and I think I agree with the author that we are probably standing at an early-90s-web moment with LLMs as a function call (the technology is kinda-there and mostly-works, and people are trying out a lot of ideas … some work, some don’t).</p>\n<p>My mind is racing. Thanks for the epiphany moment.</p>\n</blockquote>\n<p>So I like to think that my post about Braggoscope is responsible, in a small way, for incepting the idea of <em>programmatic AI</em> into the minds of Silicon Valley hackers.</p>\n<p>Another point:</p>\n<p>That development time acceleration of 4 days down to 20 minutes… that’s equivalent to about 10 years of Moore’s Law cycles. That is, using generative AI like this is equivalent to computers getting 10 years better overnight.</p>\n<p>That was a real eye-opening framing for me. AI isn’t magical, it’s not sentient, it’s not the end of the world nor our saviour; we don’t need to endlessly debate “intelligence” or “reasoning.” It’s just that… computers got 10 years better. The iPhone was first released in 2007. Imagine if it had come out in 1997 instead. We wouldn’t even know what to do with it.</p>\n<p>So getting my hands dirty with Braggoscope really helped me come to terms with today’s frontier tech, without getting (too) dazzled or despondent.</p>\n<p>Would I have had that realisation without the motivation of <em>In Our Time?</em> Maybe eventually. I didn’t go into the project with the intention to use AI.</p>\n<hr />\n<p>I have some a new Braggoscope features to show you!</p>\n<p>I keep adding to Braggoscope. It’s my test-bed for trying AI tech in a low-stakes, very practical environment.</p>\n<p>So here’s a grab-bag of additions since the site launched 18 months ago.</p>\n<p><strong>Search.</strong> There’s a search link in the top nav. You’ll notice that <em>\"Jupiter\"</em> and <em>\"the biggest planet\"</em> both bring up the episode about Jupiter. Semantic search like this used to be hard. It’s trivial using large language models. The code is open, and I wrote up a technical deep dive when I was working on a project with PartyKit: <a href=\"https://blog.partykit.io/posts/using-vectorize-to-build-search\">an unreasonably good search engine in 160 lines of code</a>.</p>\n<p><strong>Prompts.</strong> Are you interested in seeing the actual prompts given to the AI to perform the data extraction? <a href=\"https://www.braggoscope.com/about/prompts\">I’ve published them here.</a></p>\n<p><strong>Hello. A transcription Easter Egg.</strong> Famously each episode has a cold start as Melvyn Bragg abruptly introduces the topic:</p>\n<ul>\n<li><em>\"Hello. Everyone’s been a baby.\"</em></li>\n<li><em>\"Hello. In California in January 1848, James Marshall was building a sawmill by the American River.\"</em></li>\n<li><em>\"Hello, considering he ruled as Roman Emperor for less than two years, 361 to 363 AD, Julian the Apostate made an extraordinary impression on history.\"</em></li>\n</ul>\n<p>I would never share the transcriptions. They don’t belong to me. But I did want to get my hands on those openers. So I downloaded 30GB of MP3s, auto-transcribed them, and pulled out just that first sentence. (There’s an automated process to keep this up to date as each podcast file comes available.)</p>\n<p>So… want to see a massive list of all of Bragg’s Hello intros? <a href=\"https://www.braggoscope.com/hello\">Here you go.</a></p>\n<p>Finally, a brand new feature: the Braggoscope <strong><a href=\"https://www.braggoscope.com/explore\">Visual Explorer</a>.</strong></p>\n<p>It’s a big page of circles that you can drag around like Google Maps. Each circle is an episode; nearby circles are related.</p>\n<p>Empires and battles are on the left. Pan across through literature, history, artists. Onto philosophy and philosophers, then sociology, the history of ideas, and into science. Technology first and scientists at the bottom, and finally geology and astronomy on the right.</p>\n<p><a href=\"https://www.braggoscope.com/explore#p004y24y\">Explore the episode on Tea</a> for example. Next to it you’ll find episodes about Coffee, The Opium Wars, The East India Company. Then British Empire… which is next to an episode about Africa… which is next to an episode on the Heart of Darkness. And suddenly I’m exploring and being tantalised and finding new episodes to listen to, exactly as I originally wanted.</p>\n<p>(When you tap on a circle, it updates the URL in the address bar. So you can save or share a link to that episode in the explorer too.)</p>\n<hr />\n<p>I’ll leave you with 6 favourite episodes.</p>\n<p><a href=\"https://www.braggoscope.com/2004/09/30/politeness.html\">Politeness</a> (2004) – <em>\"A new idea that stalked the land at the start of the eighteenth century in Britain.\"</em> <a href=\"https://www.braggoscope.com/explore#p004y29m\">Explore.</a></p>\n<p><a href=\"https://www.braggoscope.com/2008/03/13/the-greek-myths.html\">The Greek Myths</a> (2008) <em>\"from Achilles to Zeus.\"</em> <a href=\"https://www.braggoscope.com/explore#b0093z1k\">Explore.</a></p>\n<p><a href=\"https://www.braggoscope.com/2016/06/16/the-bronze-age-collapse.html\">The Bronze Age Collapse</a> (2016), <em>\"a sudden, uncontrolled destruction of dominant civilizations around 1200 BC in the Aegean, Eastern Mediterranean and Anatolia.\"</em> <a href=\"https://www.braggoscope.com/explore#b07fl5bh\">Explore.</a></p>\n<p><a href=\"https://www.braggoscope.com/2019/06/27/doggerland.html\">Doggerland</a> (2019), <em>\"the people, plants and animals once living on land now under the North Sea, now called Doggerland after Dogger Bank, inhabited up to c7000BC or roughly 3000 years before the beginnings of Stonehenge.\"</em> <a href=\"https://www.braggoscope.com/explore#m0006707\">Explore.</a></p>\n<p><a href=\"https://www.braggoscope.com/2022/04/07/polidoris-the-vampyre.html\">Polidori’s The Vampyre</a> (2022), <em>\"attributed first to Lord Byron (1788-1824) who had started a version of it in 1816 at the Villa Diodati in the Year Without A Summer.\"</em> <a href=\"https://www.braggoscope.com/explore#m00162xz\">Explore.</a></p>\n<p><a href=\"https://www.braggoscope.com/2022/10/20/the-fishtetrapod-transition.html\">The Fish-Tetrapod Transition</a> (2022), <em>\"one of the greatest changes in the history of life on Earth.\"</em> <a href=\"https://www.braggoscope.com/explore#m001d56q\">Explore.</a></p>\n<hr />\n<p><a href=\"https://www.bbc.co.uk/programmes/b006qykl\">Here’s the official BBC In Our Time website.</a></p>\n<p>To Melvyn Bragg and the <em>In Our Time</em> production team: thank you.</p>\n<p>You should totally listen. Subscribe, <a href=\"https://russelldavies.typepad.com/planning/2024/11/wherever-you-get-your-podcasts.html\">as they say</a>, wherever you get your podcasts.</p>\n\n\t<hr />\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/in-our-time-episode-mentions\">in-our-time-episode-mentions</a>\n\t(10).\n\t\n\t</small></p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"9585ac32f8116631164986e97a2be968ad59d6f006c1fffa2bdf4e29589683bb","category":"Sites"}