{"title":"How to learn JavaScript","link":"https://sive.rs/learn-js","date":1709856000000,"content":"<p>\nSince I <a href=\"https://sive.rs/prog\">mentioned</a> that I learned JavaScript, people have asked me how and what I recommend.\nSo here’s my experience and best advice for 2024.\n</p><h3>\nLearn plain JavaScript\n</h3><p>\nFirst, it’s important to <strong>learn plain JavaScript</strong>.\n</p><p>\nDon’t depend on a library of shortcuts.\nJavaScript will be around for many years, while libraries and frameworks come and go every year.\n</p><h3>\nHow to begin\n</h3><p>\nDon’t just learn from little bits of tutorials, tips, or tricks online.\nInstead, you want a real foundation and solid understanding.\nThen all your future learning will be so much faster.\n</p><p><strong>\nStart with the book: “<a href=\"https://eloquentjavascript.net/\">Eloquent JavaScript</a>”.\n</strong>\nIt’s free to read there on his website.\nIt’s deep and thorough.\nA great start-to-finish JavaScript tutorial.\nRelax.\nFocus.\nDo it in order.\nYou’ll know more than most once you get to the end.\n</p><p><strong>\nDo <a href=\"https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures-v8/\">Free Code Camp</a>.\n</strong>\nSomeone who had 600 JavaScript learners <a href=\"https://news.ycombinator.com/item?id=11048409\">said</a> Free Code Camp had the best results.\nDo it at the same time as you’re reading books and articles.\nLearning sticks better when coming through different senses.\n</p><h3>\nMake it stick\n</h3><p>\nI highly recommend you <strong>write down every new thing you learn</strong>, ideally into a flashcard program, <a href=\"https://sive.rs/srs\">like this</a>.\nIt’s a lot to digest, so you’ll have to remind yourself of what you’ve learned, or you’ll immediately forget.\n</p><h3>\nAvoid the shortcuts\n</h3><p>\nWhen solving a problem, everyone will point you to some pre-made solution.\n“Use jQuery! Use React! Use this library and save yourself some typing!”\n</p><p><strong>\nBut no!\nNot yet!\nDo it the hard way.\nSolve everything yourself with plain JavaScript.\n</strong>\nIt’s the best way to learn.\n</p><h3>\nWhat next?\n</h3><p>\nIf you had a web app in mind, start building it now.\nAfter you wrestle with using plain “vanilla” JavaScript, then learn <a href=\"https://react.dev/\">React</a> to see the shortcuts it gives you.\n</p><p>\nIf you want a good-paying job, you can <a href=\"https://sive.rs/gethired\">get hired</a> almost anywhere.\nSince you know the real JavaScript foundations more than most people, you’re very valuable.\nYou can quickly learn whatever framework they’re using.\n</p><h3>\nAny other suggestions?\nWhat worked for you?\n</h3><p>\nPlease share any other suggestions or experiences, here:\n</p>\n<img src=\"/images/js.png\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9589ca08437790f817a2ff5acafa005d893eb40eeceaef3c97ab895380ef7094","category":"Sites"}