{"title":"Jac Holzman","link":"https://sive.rs/jac","date":1387843200000,"content":"<p>\nI met Jac Holzman the same day I met Bill Gates, but Jac made a much bigger impression, and he’s been my friend and mentor ever since.\n</p><p>\nJac Holzman is a living legend.\nHe founded <a href=\"https://en.wikipedia.org/wiki/Elektra_Records\">Elektra Records</a> in 1950.\n(Yeah! 1950! Let that soak in a minute. That’s years before rock music was even invented!)\nHe signed artists like The Doors, Carly Simon, Harry Chapin, and Judy Collins to their first record deal.\nIn 1964, he founded the amazing <a href=\"https://en.wikipedia.org/wiki/Nonesuch_Records\">Nonesuch Records</a>, too.\n</p><p>\nHe’s done a lot more than that, so you can <a href=\"https://en.wikipedia.org/wiki/Jac_Holzman\">read his Wikipedia page</a> for more.\nHe was inducted into the Rock &amp; Roll Hall of Fame, so <a href=\"https://www.rockhall.com/inductees/jac-holzman\">there’s a good biography of him on their site</a>.\n</p><p>\nBack in 2005, a <a href=\"https://en.wikipedia.org/wiki/Michael_L._Nash\">mutual friend</a> said Jac wanted to meet me, so we set a lunch date a couple weeks in advance, because I wanted to read his autobiography first.\n</p><p>\nI was deep in the middle of running CD Baby.\nBusiness was booming almost out of control.\nIt was a little lonely, because all my friends are musicians but the stuff I was going through — trying to lead a company of 85 employees and thousands of clients — was something that none of my friends could relate to.\n</p><p>\nBut when I read Jac’s book, <strong>it was like I had been walking a mountain path alone, then came upon a cabin with the diaries of someone who had walked that track 50 years earlier.</strong>\n</p><p>\nEverything I was going through, he had gone through 50 years ago.\nKeeping musicians happy, managing crazy employees, satisfying the needs of music lovers, navigating a booming music business — I thought it was just me, but nope.\nJac had been there and done that.\n</p><p>\nThe book is called “<a href=\"https://www.amazon.com/dp/0966122100\">Follow the Music: The Life and High Times of Elektra Records in the Great Years of American Pop Culture</a>.”\nI spent 16 kindred hours in his head, reading that 400 page book, before we finally met.\n</p><p>\nI was nervous before our lunch.\nI expected him to be aloof on a pedestal, while I fawned over him in awe.\n</p><p>\nInstead, he bounded up to me, warm as can be, giving me a big hug, saying he was so honored to meet me, and had been looking forward to our lunch for weeks.\nTo this day, I think it’s one of the warmest greetings I’ve ever had from anyone.\n</p><p>\nWe talked for hours about music, and had lots of questions for each other. \nIt was awesome.\n</p><p>\nJac has these enormous blue eyes.\nIt’s amazing to think about what his eyes have seen.\nNot just Jim Morrison showing up drunk on his doorstep and all of that.\n<strong>\nThis world of modern music that has been my whole life — Jac was right there in the middle of the creation of it.\nThe stories and the characters are mythical legends to me, but recent memories to him.\n</strong>\n</p><p>\nHe’s a real music and audio afficianado.\nHe always puts the music and musicians first, whether it later made money or not.\n</p><p>\nHe has this great story about needing to get the Beatles’ permission to license something from them in the 60s.\nHe met with them and asked.\nGeorge Harrison said, “Elektra Records? Didn’t you put out <a href=\"https://en.wikipedia.org/wiki/Koerner,_Ray_%26_Glover\">Koerner, Ray &amp; Glover</a>?”\nWhen Jac said yes, John Lennon said, “Anyone who puts out Koerner, Ray &amp; Glover is OK by us,” and gave his OK.\n</p><p>\nHe later told me that it was actually a long-term strategy of Elektra.\nThat sometimes he’d release records by amazing artists, knowing they’d probably lose money, because not only was it the right thing to do, but other successful artists would later choose to sign with Elektra instead of another label, because he had proven that Elektra would support their artistic exploration.\n</p><p>\nI look up to him so much that when he tells me to do something, I do it.\nHe’s the one that told me to go to New Zealand, the first time.\n</p><p>\nHe tried to get CD Baby to work with Warner Music at one point, which was a nice gesture, though not the best fit.\nStill it led to some priceless moments like sitting around the pool at the Beverly Hills Hotel, talking with a shirtless <a href=\"https://en.wikipedia.org/wiki/Lyor_Cohen\">Lyor Cohen</a>, smoking a cigar.\n</p><p>\nJac is such a perfectionist, always insisting that everything is the best possible quality it can be.\nFrom his early hands-on audio recordings in the early 1950s — bringing his equipment on his back on his Vespa, recording in musicians’ apartments — to 2013 when he just spent countless hours making <a href=\"https://itunes.apple.com/us/app/the-doors/id609344635?mt=8\">The Doors iPad app</a>.\n</p><p>\nClearly, we hit it off so well that we made a point of meeting up every month or so after that.\nHe’s an avid hiker, so many times we’d go on long hikes up the hills of Los Angeles.\nHe was impressed I could keep up with him.\n</p><p>\n<strong>\nThere’s no conclusion to this story.\n</strong>\n</p><p>\nI called Jac just now while writing this article, and he wanted to hear all about how my family is doing.\nWarm as always.\n</p><p>\nGo <a href=\"https://www.amazon.com/dp/0966122100\">get his autobiography of the Elektra years</a>, or <a href=\"https://www.youtube.com/results?search_query=jac+holzman\">search YouTube for Jac Holzman</a> to see some great interviews and such.\n</p><p>\n<img src=\"/images/JacHolzman-600x300.jpg\" alt=\"Jac Holzman photo\" />Photo of Jac Holzman then and now.  Both at home with a microphone. <img src=\"/images/JacHolzman-600x359.jpg\" alt=\"Jac Holzman photo\" />\n</p><p>\n<strong>\nP.S.  One more story:\n</strong>\n</p><p>\nWhen I was 16, I heard this album called “<a href=\"https://www.nonesuch.com/albums/bali-music-morning-world\">Music From the Morning of the World</a>”.\nIt blew my mind.\nIt changed my life.\nI listened to that album over and over again all year, and a hundred times since.\n</p><p>\nBecause of that album, I got interested in Asia in general, and Bali in particular.\nI swear it’s to blame for a lot of my life’s journeys.\nSo <strong>24 years after hearing that album, I finally booked my flight to Bali.</strong>\n</p><p>\nThe night before I left, Jac called out of the blue to say hi, and ask what I was doing.\nI said I was packing to go to Bali, and how it’s something I’ve always wanted to do, since I was 16 and heard this record…\n</p><p>\nThen I stopped.\nWait.\nWasn’t that album on Nonesuch Records?\nYes! It was!\n</p><p>\nI said, “Jac! <strong>I’m going to Bali because of YOU!</strong>\nBecause of the obscure record of Balinese Gamelan music you put out in 1967, I moved to Asia, and now I’m about to go to Bali for the first time because of you!”\n</p><p>\nAh, the loops and circles of life.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"95ddea2968fb4a175e8d01f3a49599770b3f0b3af2e4034339ac50c28f827e87","category":"default"}