{"title":"Here’s how to live: Laugh at life.","link":"https://sive.rs/htl17","date":1639699200000,"content":"<p>\nA gorilla, speaking with sign language, makes a joke.\n<br />\nWe’re amazed.\n<br />\nShe’s showing the fullest expression of a soul.\n</p><p>\nBut when a person is humorless, it’s the opposite.\n<br />\nThey’ve lost the point of life.\n</p><p>\nA recovering hospital patient makes a joke.\n<br />\nWe’re relieved.\n<br />\nNot just their body, but their soul is alive.\n</p><p>\nBut when a previously jovial patient loses their humor, we’re rightfully concerned.\n<br />\nThey’re losing the spark of life.\n</p><p>\nWhat does this tell us?\n</p><p>\nHumor is the spirit of life — a sign of a healthy, vibrant mind and soul.\n</p><p>\nHumor means using your mind beyond necessity, beyond reality, for both noticing and imagining.\n<br />\nThat’s why we admire a quick wit.\n<br />\nIt shows you quickly looked at something from many angles, found the one that amused you the most, and considerately expressed it to someone else.\n<br />\nObservation, creativity, and empathy, all in an instant.\n<br />\nWhat could be a better sign of a healthy mind?\n</p><p>\nThink of any action movie where the hero thinks he’s got the villain trapped, but then the villain starts laughing.\n<br />\nLaughing?\n<br />\nWhat does he know that we don’t?\n<br />\nWhat unseen advantage would make him laugh when he seems to be at an end?\n</p><p>\nTo laugh at something is to be superior to it.\n<br />\nHumor shows internal control.\n</p><p>\nThink of the comic heroes, like Charlie Chaplin, Jackie Chan, Jim Carrey, Kung Fu Panda, or Roberto Benigni in “Life Is Beautiful”.\n<br />\nThey win by being playful, creative, adaptive, irreverent, and unbound by norms.\n<br />\nThose who take life too seriously are the opposite, and at a disadvantage.\n</p><p>\nNo matter what you need to do, there’s a playful, creative way to do it.\n<br />\nPlaying gives you personal autonomy and power.\n<br />\nWhen kids play make-believe, anything goes.\n<br />\nTo play is to be free from constraints.\n</p><p>\nYou can make light of anything.\n<br />\nRespond to life’s events however you want.\n<br />\nNothing has to get you down.\n</p><p>\nA bad situation can feel all-consuming.\n<br />\nA laugh shows you’ve escaped.\n<br />\nHumor puts distance between an event and yourself.\n<br />\nComedy is tragedy plus time.\n<br />\nTime belittles anything by showing it’s not as bad as it seemed.\n<br />\nHumor does that instantly.\n</p><p>\nSomeone says life is hard.\n<br />\nThe comedian says, “Compared to what?”\n<br />\nComedians are philosophers.\n</p><p>\nHumor helps you see the familiar from a surprising new perspective.\n<br />\nIt reminds you that there is no grand truth.\n<br />\nAny belief can be up-ended.\n<br />\nEvery belief can be mocked.\n<br />\nNobody knows anything.\n<br />\nSee?\n<br />\nLaughing is subversive.\n</p><p>\nComedy doesn’t care what’s true, and neither should you.\n<br />\nWhatever makes you happy is what works.\n<br />\nHumor transcends reason.\n</p><p>\nLife is meaningless.\n<br />\nThat’s what’s funny.\n</p><p>\nBesides, it makes you very appealing.\n<br />\nEveryone wants to be with someone who’s having more fun.\n</p><p>\nAt every moment in life, choose whatever action or angle amuses you.\n<br />\nLaughing at life is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"95e113e8e70bdd18584ad8130ed5a7c8c4cc4365f743c2a9704264004d4ca50f","category":"default"}