{"title":"The Origin of Delay, Deny, Defend","link":"https://kottke.org/24/12/the-origin-of-delay-deny-defend","date":1733934728000,"content":"\n        <p>In the wake of the murder of UnitedHealthcare’s CEO, a book published in 2010 by Rutgers Law professor Jay Feinman has hit the bestseller charts: <a href=\"https://www.amazon.com/exec/obidos/ASIN/B086Z2HGWM/ref=nosim/0sil8\">Delay, Deny, Defend: Why Insurance Companies Don’t Pay Claims and What You Can Do About It</a>. The book’s title is a reference to an insurance industry strategy of denying legitimate claims to boost profits. Bullet casings at the scene of the shooting referenced the same strategy: they were labelled “deny”, “defend”, and “depose”.</p>\n\n<p><a href=\"https://delaydenydefend.com/excerpt/\">The introduction to the book is available online</a> and it describes the origin of delay, deny, defend:</p>\n\n<blockquote><p>Delay, deny, defend violates the rules for handling claims that are recognized by every company, taught to adjusters, and embodied in law. Within the vast bureaucracy of insurance companies, actuaries assess risks, underwriters price policies and evaluate prospective policyholders, and agents market policies. The claims department’s only job is to pay what is owed, no more but no less. A classic text used to train adjusters, James Markham’s The Claims Environment, states the principle: “The essential function of a claim department is to fulfill the insurance company’s promise, as set forth in the insurance policy… The claim function should ensure the prompt, fair, and efficient delivery of this promise.”</p>\n\n<p>Beginning in the 1990s, many major insurance companies reconsidered this understanding of the claims process. The insight was simple. An insurance company’s greatest expense is what it pays out in claims. If it pays out less in claims, it keeps more in profits. Therefore, the claims department became a profit center rather than the place that kept the company’s promise.</p>\n\n<p>A major step in this shift occurred when Allstate and other companies hired the megaconsulting firm McKinsey &amp; Company to develop new strategies for handling claims. McKinsey saw claims as a “zero-sum game,” with the policyholder and the company competing for the same dollars. No longer would each claim be treated on its merits. Instead, computer systems would be put in place to set the amounts policyholders would be offered, claimants would be deterred from hiring lawyers to help with their claims, and settlements would be offered on a take-it-or-litigate basis. If Allstate moved from “Good Hands” to “Boxing Gloves,” as McKinsey described it, policyholders would either take a lowball offer from the good hands people or face the boxing gloves of extended litigation.</p></blockquote>\n\n<p>I don’t know about you, but the violence implied by the “Boxing Gloves” metaphor is particularly galling — but also germane to the national conversation we’re currently having about violence, culpability, and who is and isn’t sanctioned by the state to decide who suffers or dies.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/crime\">crime</a> · <a href=\"https://kottke.org/tag/healthcare\">healthcare</a> · <a href=\"https://kottke.org/tag/Jay%20Feinman\">Jay Feinman</a> · <a href=\"https://kottke.org/tag/murder\">murder</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"95ebae713500961b875b847a86aef70134f6be8092a335aef6e3fc4a63da2667","category":"Sites"}