{"title":"Blue Glass","link":"https://www.themarginalian.org/2024/01/11/blue-glass/","date":1705010534000,"content":"<p>Not long after writing about <a href=\"https://www.themarginalian.org/2023/10/29/bowerbird/\">the bowerbird’s enchantment in blue</a>, I walked out of my house and gasped at the sight of what looked like two extraordinary jewels sparkling on a bed of yellow leaves, right there on the sidewalk — chunks of cobalt glass, much larger than what a broken bottle would yield, luminous in the low afternoon light. </p>\n<p>I held one up to the sun and gasped deeper.</p>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/blueglass_TheMarginalian.jpg?w=500&amp;ssl=1\" /></p>\n<p>For millennia — since long before cobalt became the blood diamond of the digital age, pillaged from the Earth by child labor for its extraordinary usefulness in storing energy and stabilizing the conductors in every laptop and smartphone — cobalt glass has been answering the soul’s cry of the great uselessness that makes life not just livable but worth living: beauty. </p>\n<p>Cobalt blue is almost as old as the written word, also forged in Mesopotamia four millennia ago. Within five centuries of its invention, Egyptian pottery was making ample and dazzling use of cobalt glass. And then, after the Eighteenth Dynasty of Egypt at the end of the Late Bronze Age, it suddenly vanished — after 1250 BC, both cobalt and glass almost completely disappear from the archeological record. It took more than a millennium for it to recast its enchantment in Chinese porcelain, slowly migrating west toward the Victorian craze for blue glass. </p>\n<p><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/blueglass_TheMarginalian1.jpg?w=500&amp;ssl=1\" /></p>\n<p>The mystery of its disappearance has never been solved — a harrowing reminder that ideas, even magnificent ideas, can fall into oblivion for epochs: just look at <a href=\"https://www.themarginalian.org/2022/03/24/david-byrne-history-of-the-world-in-dingbats/\">Democritus and the atom</a>.</p>\n<p>And yet the birth of an idea in a mind — the conception of something improbable and lovely out of the cold clay of the ordinary — is one of the great miracles of existence. Looking through the sunlit blue on a Brooklyn sidewalk, I can’t help but think of cobalt glass a supreme emblem of human ingenuity and the blessed conspiracy of chance and choice behind all creativity: Who was it, the first ancient person to unearth a piece of meteoric iron, throw it into the fire pit to see what happens, watch it release a dazzling silvery metal, compact that metal to the point of liquefaction, and then watch it bleed that loveliest of colors, cobalt blue? What elemental hunger for beauty drove them then to add this strange creation to that supreme triumph of human genius, <a href=\"https://www.themarginalian.org/2014/06/23/stuff-matters-miodownik-glass/\">glass</a>? </p>\n<p>How they too must have gasped when the sun first shone through it. </p>\n<p>Cupping this blue marvel in my hand, I feel instantly connected to that anonymous ancestor, connected to the entire lineage of human curiosity and creativity that made so improbable and lovely a thing consecrate an ordinary afternoon with wonder. And none of it had to exist — not this dazzling blue, not the consciousness that dreamt it up: all of it a miracle of chemistry and chance, a great cosmic gasp at these slender sunlit odds against nothingness and eternal night. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"960d9fbff0c139d9634f2e71b113f8d3576a6fb832dd723910e59418335e21ea","category":"default"}