{"title":"Microsoft’s Brazen AI Inflection","link":"https://om.co/2024/03/22/microsofts-brazen-ai-inflection/","date":1711142751000,"content":"<p>Microsoft has hired a big chunk of the team that started Inflection, an AI startup developing large language models. They will lead Microsoft AI, a new division within the company that consolidates its consumer AI initiatives with Copilot, Bing, and Edge. DeepMind co-founder Mustafa Suleyman, who co-founded the company alongside Karén Simonyan, and LinkedIn co-founder Reid Hoffman, are coming on board at Microsoft as the leader of the division. Simonyan is also joining the team.</p>\n\n\n\n<p>Inflection, <a target=\"_blank\" href=\"https://inflection.ai/the-new-inflection\">itself, was going to change</a> directions and focus on helping businesses on their AI journey under a new CEO, Sean White. It also noted it “will now host Inflection-2.5 on Microsoft Azure helping us get it into the hands of creators everywhere.” You might think that this is business as usual. But look closer, and you might think otherwise.</p>\n\n\n\n<p>Hoffman wrote on LinkedIn that “this agreement with Microsoft means that all of Inflection’s investors will have a good outcome today, and I anticipate good future upside.” In announcing the deal, this language is unusual — considering there were no specifics mentioned in either Microsoft or Inflection press releases.</p>\n\n\n\n<p>Later, The Information <a target=\"_blank\" href=\"https://www.theinformation.com/articles/microsoft-agreed-to-pay-inflection-650-million-while-hiring-its-staff?rc=u0mfcb\">reported </a>that Microsoft was paying Inflection “$650 million” in a deal that would allow it to license the company’s models to be sold on Azure. This is an unusually large price to pay for a model that has marginal traction in the market place — its chatbot Pi barely got 2 million monthly active users. It has little or no developer traction. Ask any AI practitioner, and it isn’t even considered by most developers who are entirely focused on OpenAI, Anthropic, and other more open models.</p>\n\n\n\n<p>Microsoft is also a very large investor in OpenAI and a recent investor in Mistral, another LLM startup. The “$650 million” license fee is essentially a way to circumvent the growing hostility in Washington DC towards “big tech” companies buying “startups.” <em>This isn’t technically an acquisition, but it is a good way to get all its benefits.</em> If the DoJ had any real desire to do something meaningful, it would go after Microsoft. Otherwise, we are going to see this innovative technique become very common in Silicon Valley. Smaller public companies have been using this structure regularly for their “acquisitions”.</p>\n\n\n\n<p>Anyway, the Inflection investors aren’t complaining about the structure of this Microsoft-Inflection deal. The company was able to raise a whopping <a target=\"_blank\" href=\"https://inflection.ai/inflection-ai-announces-1-3-billion-of-funding\">$1.5 billion in funding</a> from Hoffman, Bill Gates, Eric Schmidt, Greylock Partners, Microsoft, and Nvidia (among others) thanks to the reputation of the co-founders.</p>\n\n\n\n<p>Hoffman, co-founder of Inflection, <a target=\"_blank\" href=\"https://greylock.com/team/reid-hoffman/\">is also a partner</a> at Greylock Partners and an investor in it. He also sits on the board of Microsoft, which owns LinkedIn (the company he co-founded). Bill Gates, too, is an investor in it, and while he might not be a Microsoft board member, we all know he is still Mr. Softie.</p>\n\n\n\n<p>Looks like Microsoft is back to making brazen moves, <em>much like the 1990s.</em></p>\n\n\n\n<p>PS: <a target=\"_blank\" href=\"https://www.ftc.gov/news-events/news/press-releases/2024/01/ftc-launches-inquiry-generative-ai-investments-partnerships\">FTC has started</a> investigating investments and partnerships in the AI space. Companies like Nvidia, Microsoft and others are using their financing arm to secure tenants for their products. “Such deals were known as ‘vendor financing’ and were commonplace” back in the Internet 1.0 bubble, <a target=\"_blank\" href=\"https://om.co/2023/08/15/a-letter-from-om-issue-11-2023/\">and at the time</a>, large networking hardware companies such as “Lucent, Nortel, and Cisco were well-known practitioners of vendor financing.”</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"96338d272f3f91df20c019eda53254208a5d73f9616201bd631093386f038253","category":"default"}