{"title":"rewriting anxiety: an illustrated mind map of USA travels","link":"https://keningzhu.com/journal/a-mind-map-of-usa-travels","date":1719405984000,"content":" \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=1000w\" width=\"2916\" height=\"3097\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/ac5234fe-3201-4d0d-9b44-b4b99b20fc14/usa_trip_depositions-6.19.24.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr /> \n\n\n  <p><strong><em>this: a context</em></strong></p><p>this is an illustrated mind map of my three weeks in the US - a trip I did shortly after three weeks of <a href=\"https://keningzhu.com/journal\" target=\"_blank\">deep encounters in China</a>. in May I took a small, 5 day rest stop in Istanbul (<em>my chosen third home, midway between China, my birth home, and the US, my adopted home). </em></p><p>in retrospect, traveling for six weeks across five cities in three countries on the opposite sides of the world is a really bad idea if you’re trying to hold onto any kind of emotional center or ground. it’s too little time to settle into a routine, and too much time for it to be merely a fun getaway. <br /></p><p><strong>bad psyche days </strong></p><p>before illustrating this mind map, I might’ve said that I didn’t have a great time in the US, because it was stressful and busy and over-stimulated, and I felt my mind morph into a carnivorous flower; sticky and obsessive, reactive and anxious. there were days in which I felt completely disembodied. I was spiral-y and pulled by psychic quicksand into the vortex of my own anxieties.</p><p>some days, my mind felt like a trap. these bad psyche days happened in the backdrop of good things — roadtrips with my father, evening walks in the forest, and cozy weekends with my closest, old female friends. </p><p>the thing about anxiety is that it dulls the colors and tastes of everything you experience in life. it makes you a spectator of your own life, pushing you into the back row of the auditorium, instead of allowing you to embody yourself as the main character. </p><p></p><p><strong>drawing as an act of rewriting the story</strong></p><p>initially I drew this mind map as a reflection of that anxiety, like a map of my inner landscape. then, somehow, it didn’t feel right. </p><p>so I searched inside myself and my memories for all the experiences and things I tasted and felt and did — all the small adventures I had. I made more space in this mind map: for my father’s seafood breakfasts, for 2am ice cream with H, for that last bowl of ramen in the east village, for cocktails and hotpot with old friends. </p><p>somehow, I look back on this mind map and I’m able to tell myself — rewrite, redraw — a different story. </p><p>yes, I was exhausted and overwhelmed, but also: life also gave me so many beautiful gifts, and precious time with people I love. I’m able to focus on the moments in which my mind felt like a spacious flower. I hold that and put it front and center. and when I see all these gifts and experiences on one page, I feel grateful to be alive. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />  ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"969ab2a64ffbd37875ae76234936dd907e47904cd7349980d7625ea50bc88463","category":"Sites"}