{"title":"The status of Twitter's API","link":"http://scripting.com/2024/08/26/133249.html?title=theStatusOfTwittersApi","date":1724679169000,"content":"<p>The Twitter API still works, with some serious limits. Not easily incorporated into products, but useful for individuals with developer accounts. Not an insurmountable hurdle, it seems, though I was a developer from before. A few bullet points.</p>\n<ul>\n<li>My linkblog now reliably works on <a href=\"https://x.com/davewiner\">Twitter</a> and <a href=\"https://www.threads.net/@davew\">Threads</a>, in addition to <a href=\"https://social.masto.land/@dave\">Mastodon</a>, <a href=\"https://bsky.app/\">Bluesky</a>, <a href=\"http://data.feedland.org/feeds/davewiner.xml\">RSS</a> and <a href=\"https://linkblog3.wordpress.com/\">WordPress</a>.   </li>\n<li>I was confused about the status of the Twitter API, but it turns out it's still there, and there is a <a href=\"https://www.npmjs.com/package/twitter-api-v2\">package</a> that connects to it for Node apps. </li>\n<li>It took me a few hours to add <a href=\"https://github.com/scripting/textcasting/blob/main/textcasting.js#L543\">support for Twitter</a> in my <a href=\"https://github.com/scripting/textcasting/tree/main\">textcasting</a> server app which is how my software connects to all the various services. </li>\n<li>I should probably add a plugin abilitiy for textcasting so that other services could easily be added, without modifying the core app. Totally doable. It's already factored that way internally.</li>\n<li>I should probably write <a href=\"https://github.com/scripting/textcasting/blob/main/README.md\">some docs</a> for it too. <span>😄</span></li>\n<li>Anyway, the <a href=\"https://developer.x.com/en/docs/x-api/getting-started/about-x-api\">deal with Twitter</a> is that it's free for up to 1500 posts per month, as I read it, which seems manageable for one person (me), but no way is it enough for a community of users. </li>\n<li>Why connect to Twitter? People are there. Until they aren't we're going to need a way to push stuff to Twitter.</li>\n</ul>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"9725453a6aa4e487f9ceea9eb6c6ce84d6efaa94d2e4575ea0f0b069cb71dd91","category":"Sites"}