{"title":"Can EU be tough on China Inc?","link":"https://om.co/2024/03/25/can-eu-be-tough-on-china-inc/","date":1711409497000,"content":"<p>The European Union <a target=\"_blank\" href=\"https://ec.europa.eu/commission/presscorner/detail/en/IP_24_1689\">has opened</a> a non-compliance investigation under the <a target=\"_blank\" href=\"https://eur-lex.europa.eu/legal-content/EN/TXT/PDF/?uri=CELEX:32022R1925\">European Digital Markets Act (DMA)</a> against Apple, Google and Meta. It is evident that there is intensified scrutiny on the (US) Big Tech, in Europe. Before today’s investigations, over the past few years, the EU has:</p>\n\n\n\n<ul>\n<li><em>fined Google <u>a total of €8.25 billion</u> for three separate breaches of EU’s antitrust laws.</em></li>\n\n\n\n<li><em>fined Apple <u>€</u>1.84 billion for thwarting competition in music streaming rivals.</em></li>\n\n\n\n<li><em>fined Meta €1.2 billion due to privacy violations.</em></li>\n\n\n\n<li><em>fined Amazon €746 million for data protection violations</em></li>\n</ul>\n\n\n\n<p>Steve Sinofsky, a former high-ranking Microsoft executive, points out in his essay, <a target=\"_blank\" href=\"https://hardcoresoftware.learningbyshipping.com/p/215-building-under-regulation\">Building Under Regulation</a>, that DMA’s primary targets are <em>mostly large American tech companies</em>. (His analysis of EU vs Apple is a <a target=\"_blank\" href=\"https://hardcoresoftware.learningbyshipping.com/p/215-building-under-regulation\">long but highly recommended read.)</a></p>\n\n\n\n<blockquote>\n<p>There are no EU tech companies that meet the criteria to be covered—hardcoded revenue of EUR 7.5 billion for three years, EUR 7.5 billion market cap, or 45 million MAU—with Alphabet, Amazon, Apple, ByteDance, Meta, Microsoft, and Samsung acknowledging the criteria apply to various units in addition to the following other “very large online platforms”: Alibaba AliExpress, <a target=\"_blank\" href=\"http://Booking.com\">Booking.com</a>, Pinterest, Snapchat, Twitter, Wikipedia, Zalando [German fashion retailer]. Those thresholds seem strangely not round.</p>\n</blockquote>\n\n\n\n<p>By that definition, there are a few members of China Inc. who should come under EU’s scrutiny. The real question is — will the EU have the courage to take on China Inc?</p>\n\n\n\n<p>How will it deal with Temu, a <a target=\"_blank\" href=\"https://www.fashiondive.com/news/temu-class-action-lawsuit-data-collection/699328/\">known data abuser with questionable business practices</a> and <a target=\"_blank\" href=\"https://www.cnn.com/2023/04/02/tech/china-pinduoduo-malware-cybersecurity-analysis-intl-hnk/index.html\">its owner, Pinduoduo</a>? <a target=\"_blank\" href=\"https://www.euronews.com/next/2024/03/13/e-commerce-platform-temu-quizzed-by-irish-regulator\">How about Shein</a>? These companies have been accused of abusing privacy and data of everyday people. Can EU have the resolve to bring TikTok to account? What about the companies like DJI and car makers like BYD that are capturing data in Europe, but are mandated by the <a target=\"_blank\" href=\"https://www.dhs.gov/sites/default/files/publications/20_1222_data-security-business-advisory.pdf\">Chinese authorities to capture data and maintain</a> their cloud operations in the mainland?</p>\n\n\n\n<p>It would be a good bet that the EU won’t touch the (digital) China Inc. After all, they can’t antagonize the Chinese — the Germans have to sell their cars and heavy machinery there. The French need open access to the Chinese market to keep LVMH successful and selling its other fineries. The American tech companies, on the other hand, are large, trillion-dollar enterprises whom even their own government doesn’t like much.</p>\n\n\n\n<p><em><strong>March 25, 2024. San Francisco</strong></em></p>\n\n\n\n<hr />\n\n\n\n<h3>The Key Points of EU Investigation into Apple, Google and Meta (Summarized by ChatGPT:</h3>\n\n\n\n<ol>\n<li>Alphabet’s and Apple’s rules on steering in their respective app stores, Alphabet’s self-preferencing on Google Search, Apple’s choice screen for Safari, and Meta’s “pay or consent” model.</li>\n\n\n\n<li>The Commission is examining whether Alphabet and Apple are restricting app developers’ ability to direct consumers to external offers, which could breach the DMA’s requirements for gatekeepers to allow such steering without imposing charges or limitations.</li>\n\n\n\n<li>The Commission is investigating Alphabet for potentially favoring its own services (like Google Shopping, Google Flights) in Google Search results over those of competitors, which could violate DMA’s fair co<a href=\"http://rules.Apple\" target=\"_blank\">mpetition r</a>ules.</li>\n\n\n\n<li>Apple is under scrutiny for possibly hindering users’ ability to easily uninstall apps, change default settings, and effectively choose alternative default services on iOS devices, potentially contravening the DMA.</li>\n\n\n\n<li>The Commission is probing Meta’s “pay or consent” model to determine if it effectively forces users to consent to data collection without offering a real alternative, possibly breaching DMA’s personal data use regulations.</li>\n\n\n\n<li>The Commission is gathering information on Amazon’s product ranking practices and Apple’s fee structure for alternative app stores to assess compliance with the DMA.</li>\n</ol>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"975b4d9f30788edb3b71fed89bfa1e6f2087f75b6f2032788ac190947349e254","category":"default"}