{"title":"Art is useless, and so am I","link":"https://sive.rs/useless","date":1489104000000,"content":"<p>\nArt is useless by definition.\n<strong>\nIf it was useful, it would be a tool.\n</strong>\n</p><p>\nFor the past twenty years, I was obsessed with being useful.\nThat one measure drove all of my daily decisions:\n“How can I be the most useful to the most people today?”\n</p><p>\nThat question served me well but had its downsides.\nIt kept me from playing and doing things just for me.\nIt’s no coincidence that I stopped making music twenty years ago.\nIt didn’t qualify as the most useful thing I could be doing.\n</p><p>\nA few months ago, I decided to stop trying so hard to be useful.\nI needed a little more me-time.\nI stopped spending hours per day answering strangers’ emails.\n</p><p>\nI started seriously learning my first foreign language.\nIt’s totally useless to anyone else, but I love it.\nNow I realize why all my previous attempts to learn a language didn’t happen.\nIt was always a lower priority under all of my useful goals.\n</p><p>\nI started playing music again, for the first time in twenty years.\nNot trying to be famous this time.\nNo care whether anyone else ever hears it or not.\nThis is just for me — just playing for its own sake and loving it.\n</p><p>\nIt’s hard to relax into this mindset, after twenty years of the opposite.\nIt’s such a luxury to not think about you, out there, and how you might value me.\n</p><p>\nAt the top of every page of my website, I used to have a sentence that describes what I do — another way of saying how I might be useful to the stranger browsing my site.\nBut I erased it last week.\n</p><p>\nFor now, I’m nobody’s tool.\n</p>\n<img src=\"/images/hammer.jpg\" />\n<div><a href=\"https://www.flickr.com/photos/39718079@N00/261054170/\">Hammer photo by David Blaine</a>.</div>\n<p>P.S.  The original source of the “art is useless” idea is Oscar Wilde.  See <a href=\"https://sive.rs/useless#comment-61585\">see J.J. Vicars’ comment, below</a>, with a letter further explaining the thought.</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9773b7a9479c1679e1d2d3307ef21cdaf4a29ccbcca8c04123739efe83bb931e","category":"Sites"}