{"title":"Listening to Tyler Cowan DJ for Rick Rubin","link":"https://bradbarrish.com/2023/10/20/listening-to-tyler-cowan-dj-for-rick-rubin/","date":1697830795000,"content":"<p>I’ve been listening to what may be <a href=\"https://overcast.fm/+_cBe_lock\">my favorite podcast episode in some time</a>. It’s a bonus episode of Rick Rubin’s podcast <a href=\"https://tetragrammaton.com/\">Tetragrammaton</a> with economist and renaissance man, <a href=\"https://marginalrevolution.com/\">Tyler Cowan</a>. I highly recommend <a href=\"https://overcast.fm/+_cBeSQEZ0\">the main episode with Tyler</a>, but this bonus episode rare and wonderful. The concept is brilliantly simple. Tyler wants to share music with Rick and in doing so, their combined encyclopedic knowledge of music is laid bare. It’s highly engaging and educational.</p>\n\n\n\n<p>I have often said there are few people I have learned as much from, both directly and indirectly, than Tyler. My father is, perhaps, the only exception that comes to mind. In any case, I was well aware of <a href=\"https://marginalrevolution.com/marginalrevolution/category/music\">Tyler’s love of music</a>, but I don’t think I realized just how insanely and broadly knowledgeable he is about it. This will be an episode I’ll enjoy over and over.</p>\n\n\n\n<p><strong>Some related links:</strong><br /><a href=\"https://conversationswithtyler.com/episodes/rick-rubin/\">Tyler interviewed Rick</a> on his podcast, <a href=\"https://conversationswithtyler.com/\">Conversations with Tyler</a>.</p>\n\n\n\n<p>Rick’s book, The Creative Act: A Way of Being is one of my favorite books of the year. You can <a href=\"https://bookshop.org/a/9430/9780593652886\">purchase it on Bookshop.org</a> in the US or grab it <a href=\"https://amzn.to/404xl0i\">in print</a> or <a href=\"https://amzn.to/46Cskid\">audio</a> from Amazon.</p>\n\n\n\n<p><a href=\"https://onbeing.org/programs/rick-rubin-magic-everyday-mystery-and-getting-creative/\">Rick’s conversation with Krista Tippett</a> was wonderful. <a href=\"https://onbeing.org/series/podcast/\">On Being</a> is one of my favorite podcasts.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"97d8ba00f02a57706f2f6ccff0e0fa2f9a51fea479960d409d0f170ebad76c37","category":"default"}