{"title":"Road Snacks #1","link":"https://kottke.org/24/03/road-snacks-1","date":1711590280000,"content":"\n        <p>Because I don’t hardly blog anymore, I turned the email newsletter for my ice cream shop into kind of a blog where sure I talk about ice cream a good amount, but I also tell stories about when I was a tour manager for a band, document how terribly hostile Intuit is towards their business customer base, and share internet ephemera my customers might not have seen. It’s been feeling a little stale lately, because after three years I think I finally told all my tour stories so I wanted to do something new. </p>\n\n<p>The new thing is Road Snacks, a semi-regular feature where an ice cream shop interviews a touring musician asking questions about the food situation on tour. I think it’s changed a lot and probably not too much since I was doing it. <a href=\"https://mailchi.mp/graciesicecre/love-yourself-779197?e=129c3583ca\">The first interview ran today featuring Cary Ann Hearst from the Charleston band Shovels &amp; Rope, who is great</a>. Click through to read the whole thing. If you’d like to sign up for the newsletter, <a href=\"https://graciesicecre.us6.list-manage.com/subscribe?u=ae47fcd0dd189c1f3af4d0d5f&amp;id=291969f53f\">you can do that here</a>, and we’ll see if it’s interesting even if you don’t live in Boston.</p>\n\n<blockquote><p><strong>How has eating on tour changed for you since you first started touring?</strong></p>\n\n<p>Eating definitely changes! We used to just eat pizza everyday after the show, but that will kill you eventually so we changed! Everyone watching their water and their fiber intake. It’s wild - we pop vitamins now. But in Indy the other night a man made us pizza in his shop after the show. Sam’s Square Pies?! The best pizza I have ever had. Detroit Style. We literally wrapped and froze individual pieces so that we wouldn’t waste a slice of the 30lbs of pie - thanks Jeff!</p>\n\n<p><strong>It’s 12:30am and you’re at the gas station before a five hour drive to the next city. What snacky treat(s) are you grabbing and why</strong>?</p>\n\n<p>My trash snacks from the gas station are an Arizona Green Tea in a can, pork rinds, a bag of lemon heads and pack of bubble gum. We get a gallon of water and fill our canteens. I need a mix of sweet and savory - and since we only get the opportunity to indulge those trashy snack instincts every once in a while I indulge and then remember not to do that once my blood sugar crashes.</p></blockquote>\n\n<p>Jason doesn’t know it yet, but I’m probably gonna ask if I can run the interviews here, too. </p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Cary%20Ann%20Hearst\">Cary Ann Hearst</a> · <a href=\"https://kottke.org/tag/interviews\">interviews</a> · <a href=\"https://kottke.org/tag/music\">music</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/road-snacks-1\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"983eab3e4467eded4127390e2b1edcb126674d138b511092030a3a5ae3ab0f34","category":"default"}