{"title":"Some will always say you’re wrong","link":"https://sive.rs/wrong","date":1370217600000,"content":"<p>\nSome people are into money. Some aren’t.\nSome people are inspired by helping the needy. Some aren’t.\nSome people are into fame, power, and prestige.\nOthers are into anonymity and freedom from responsibility.\n</p><p>\nPeople have different preferences in different parts of their lives.\nFamous online, but anonymous in their neighborhood.\nGenerous with time, but stingy with money.\nIntrovert when working, but extrovert when not.\n</p><p>\nYou have to <a href=\"https://sive.rs/why\">know your preferences well</a> because no matter what you do, someone will tell you you’re wrong.\n</p><p>\nIf you’re not into money, many people will say you’re foolish.\nIf you’re not into charity, many people will say you’re greedy.\nIf you’re not into crowds, many people will say you’re missing out.\n</p><p>\nSome careers come with excuses:\nThe classic novelist thrives in solitude, alone in a cabin in the woods, writing books that reach millions.\nThe classic journalist thrives in a crowd, talking with everyone, building the story from a thousand accounts.\nThe quiet librarian.\nThe aggressive lawyer.\nThe flaky artist.\nNo explanation needed.\n</p><p>\n<strong>\nBut when you go against the stereotype, people get confused.\n</strong>\n</p><ul><li>\nThe entrepreneur who’s not into money\n</li><li>\nThe musician who avoids crowds\n</li><li>\nThe ambitious conservationist\n</li><li>\nThe artist who’s into discipline\n</li></ul><p>\nIf you expect criticism in advance and take pride in your unusual stance, you can bash on with a smile, being who you want to be.\n</p><p>\nThen every time they say you’re wrong, that’s a sign you’re doing it right.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"990b3361c21ae0ed1acbb45b361485f0c164b9050309dffd98f14d6fa5c4e4e1","category":"default"}