{"title":"Mediaeater Digest Vol. 30,  No. 149","link":"https://ghuneim.com/2024/05/28/mediaeater-digest-vol-30-no-149/","date":1716896931000,"content":"<p><a href=\"https://www.ohchr.org/sites/default/files/documents/issues/business/b-tech/taxonomy-GenAI-Human-Rights-Harms.pdf\">Taxonomy of Human Rights Risks – Connected to Generative AI</a> this document explores human rights risks stemming from the development, deployment, and use of generative AI technology. Establishing such a rights-based taxonomy is crucial for understanding how the United Nations Guiding Principles on Business and Human Rights (UNGPs) should be operationalised in addressing human rights risks connected to generative AI. This taxonomy is concerned with demonstrating how the most significant harms to people related to generative AI are in fact impacts on internationally agreed human rights.</p>\n<p><a href=\"https://arxiv.org/abs/2405.14975\"><span>Surveilling the Masses with Wi-Fi-Based Positioning Systems</span></a><span>, we show that Apple’s WPS can be abused to create a privacy threat on a global scale. We present an attack that allows an unprivileged attacker to amass a worldwide snapshot of Wi-Fi BSSID geolocations in only a matter of days. Our attack makes few assumptions, merely exploiting the fact that there are relatively few dense regions of allocated MAC address space. Applying this technique over the course of a year, we learned the precise locations of over 2 billion BSSIDs around the world. (Location has become a victim of tech moving unchecked – wtf happend to Carpenter -ed)</span></p>\n<p><a href=\"https://www.nytimes.com/2024/05/27/arts/design/hackers-claim-christies-attack.html\"><span>Ransomware Group Claims Responsibility for Christie’s Hack</span></a><span> At Christie’s, a spokesman said in a statement, “Our investigations determined there was unauthorized access by a third party to parts of Christie’s network.” The spokesman, Edward Lewine, said that the investigations “also determined that the group behind the incident took some limited amount of personal data relating to some of our clients.” He added, “There is no evidence that any financial or transactional records were compromised.”  (White glove opsec is not a thing here -ed)</span></p>\n<p><span>OpenAI has</span><a href=\"https://openai.com/index/openai-board-forms-safety-and-security-committee/\"><span> announced that it is training its next generation of AI models,</span></a><span> the follow-up to its state-of-the-art GPT-4 software which powers ChatGPT.   (what will be notable is what data is in and what data is opted out and what that looks like in product. -ed)</span></p>\n<p><a href=\"https://x.com/ylecun/status/1795034443809165464\"><span>LeCun to Elon Musk on X about his latest AI goals- Join xAI if you can stand a boss who:</span></a><br />\n– claims that what you are working on will be solved next year (no pressure).<br />\n<span>– claims that what you are working on will kill everyone and must be stopped or paused (yay, vacation for 6 months!).<br />\n</span><span>– claims to want a “maximally rigorous pursuit of the truth” but spews crazy-ass conspiracy theories on his own social platform.</span></p>\n<p><a href=\"https://www.youtube.com/watch?v=9n1OqPzIKH4\"><span>Ken Burns, H’24 Keynote Address to Brandeis University’s 2024 Graduates</span></a><span>  “The checks of conscience are thrown aside and a deformed picture of the soul is revealed. The presumptive Republican nominee is the opioid of all opioids, an easy cure for what some believe is the solution to our myriad pains and problems. When in fact with him, you end up re-enslaved with an even bigger problem, a worse affliction and addiction, ‘a bigger delusion’, James Baldwin would say, the author and finisher of our national existence, our national suicide as Mr. Lincoln prophesies. Do not be seduced by easy equalization. There is nothing equal about this equation. We are at an existential crossroads in our political and civic lives. This is a choice that could not be clearer. (this is a text antidote to Harrison Butker’s BS -ed)</span></p>\n<p><a href=\"https://www.forbes.com/sites/joannechen/2024/05/24/the-promise-of-multi-agent-ai\">The Promise of Multi-Agent AI </a> Think of multi-agent systems as teams of experts, each contributing unique knowledge and abilities to collectively tackle difficult problems. Tasks are broken down into components and assigned to the agent best equipped to handle them. As each agent processes its part of the task and passes information to the next, the output is progressively refined and improved. Through such specialization, the resulting systems can achieve results that generalist agents struggle to match.</p>\n<p><a href=\"https://www.ft.com/content/4e0d1823-8ae9-42dc-837f-94b790464158\">Steven Chu: ‘Wall Street analysts are totally amoral’ on climate</a> FT In a lecture at the UK’s Royal Academy of Engineering, where he is an international fellow, Chu laid out the challenge. We sometimes refer to previous energy transitions — from wood to coal, or from coal to gas. Chu points out that they never really happened. Humans mostly added new sources of energy. Now, in less than three decades, we hope to transition away from oil, gas and coal. Chu doesn’t believe it’s possible, but he argues we must go as fast as we can.</p>\n<p>The good news is the f</p>\n<p> </p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"992c9e96926f3614bce34d80e7d77ca5571e4d849584a5ca4f8a841f74d66bb4","category":"default"}