{"title":"You and the Universe: N.J. Berrill’s Poetic 1958 Masterpiece of Cosmic Perspective","link":"https://www.themarginalian.org/2024/08/25/n-j-berrill-you-and-the-universe/","date":1724612118000,"content":"<h3>“The universe is as we find it and as we discover it within ourselves.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/gp/product/B0018UXAN0/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"545\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?fit=320%2C545&amp;ssl=1\" alt=\"You and the Universe: N.J. Berrill’s Poetic 1958 Masterpiece of Cosmic Perspective\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?resize=320%2C545&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?resize=600%2C1022&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?resize=240%2C409&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?resize=768%2C1308&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/berrill_universe.jpg?resize=902%2C1536&amp;ssl=1 902w\" /></a></p><p>In her <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">stunning space-bound ode to the human condition</a> inspired by Carl Sagan, Maya Angelou wrote of us as cosmically lonesome creatures “traveling through casual space past aloof stars, across the way of indifferent suns” — and yet these selfsame stars made us; out all this indifference arose all our capacity for feeling, our poems and our postulates. That every single atom in your body, if tagged and traced back in time, would lead to the core of a particular star in the early universe is a truth pulsating with transcendence, a truth Nick Cave channels beautifully in <a href=\"https://www.youtube.com/watch?v=0yvX_SAzkmQ\" target=\"_blank\">one of my favorite songs</a>, singing of the stars as “bright, triumphant metaphors of love.”</p>\n<p>An epoch ago, before we set foot on the Moon and sent rovers to Mars, before we built supercolliders to search for the “God particle” and heard the sound of spacetime in a gravitational wave, the cosmically curious English marine biologist <strong>N.J. Berrill</strong> (April 28, 1903–October 16, 1996) took up the eternal question of how to harmonize our cosmic smallness with the immensity of our creaturely experience in his slender, splendid 1958 book <a href=\"https://www.amazon.com/gp/product/B0018UXAN0/?tag=braipick-20\" target=\"_blank\"><strong><em>You and the Universe</em></strong></a> (<a href=\"https://search.worldcat.org/title/1648432\" target=\"_blank\"><em>public library</em></a>).</p>\n<figure><a href=\"https://society6.com/product/pillars-of-creation-eagle-nebula-in-infrared-nasaesa-hubble-space-telescope_print?sku=s6-22845835p4a1v1?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=680%2C638&amp;ssl=1\" width=\"680\" height=\"638\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?w=1280&amp;ssl=1 1280w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=320%2C300&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=600%2C563&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=240%2C225&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/PillarsOfCreation_infrared.jpg?resize=768%2C720&amp;ssl=1 768w\" /></a><figcaption>Pillars of Creation, Eagle Nebula, Messier 16. Infrared photograph. NASA / Hubble Space Telescope. (Available as <a href=\"https://society6.com/product/pillars-of-creation-eagle-nebula-in-infrared-nasaesa-hubble-space-telescope_print?sku=s6-22845835p4a1v1?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Berrill — a writer partway between Rachel Carson and Carl Sagan in both subject and poetic sensibility — begins with the basic question of being alive:</p>\n<blockquote><p>Just what are we doing here, spinning on a tilted planet swinging round a star? … Where do we stand, with our few pounds of flesh and bones and our fleeting lives?… Only a short while ago we were all God’s children, holding most of His attention, and the world was exclusively ours for better or for worse. The sun shone to give us warmth and light, the moon to bewitch us, the stars were there to be born under, and the volcanic depths to serve as hell. Now paradise is lost and we find ourselves in limbo, inhabiting one of the minor planets of a middle-class star drifting in the outer arm of a spiral galaxy no different from a hundred million more that are visible through our telescopes. Space and time and stellar systems are overwhelming and to face the twinkling sky of night with any sense of what you see requires either courage or a great amount of faith. Stars are no longer baleful or beneficial, an have no concern with us, but they leave a lonely terror striking at the heart. So here we stand, looking wistfully into the void and nostalgically back into time, for knowledge has put us outside our house.</p></blockquote>\n<p>And yet, in consonance with Richard Feynman’s <a href=\"https://www.themarginalian.org/2013/01/01/ode-to-a-flower-richard-feynman/\">poetic meditation on the relationship between knowledge and mystery</a>, Berrill insists that greater intimacy with the raw reality of the universe, rather than further evicting, would reopen the door to our sense of belonging:</p>\n<blockquote><p>Perhaps in the end we can rediscover the reality of our home with a greater sense of wonder and a more mature appreciation.</p></blockquote>\n<p>He places at the heart of this possibility “the need to join outward observation with inner intuition.” In a passage that calls to mind the French paleontologist, Jesuit priest, and philosopher Pierre Teilhard de Chardin’s elegant case for <a href=\"https://www.themarginalian.org/2023/05/06/the-heart-of-matter-pierre-teilhard-de-chardin/\">bridging the scientific and the sacred</a>, Berrill writes:</p>\n<blockquote><p>It is the aim of science to coordinate all observable phenomena within a single natural order and it is its faith that such is possible. Hence the basic objection to acceptance of the supernatural. If the scientific stand is justified, then everything, whether of matter, energy, mind or spirit, belongs to one vast scheme — it is all one and every part has meaning in relation to the whole. This is as much a tenet of faith as any other belief, but it forms the working hypothesis of all real scientific endeavor.</p></blockquote>\n<p>Rather than being in conflict with the miraculousness of life, our material nature is the miracle itself:</p>\n<blockquote><p>Put together in the proper way and we all turn out to be a rather weak watery solution of salts and carbon compounds, more or less jellified. You and I, with all that we eat and the various bacteria, fungi and viruses that live so happily within us, are a mingling of the wind and water and dust that constitute the surface of the earth. The miracle is that such stuff as we are made of should walk and talk and know such things as song and sadness.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/&quot;&quot;\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-snake-bird-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-snake-bird-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>In consonance with Loren Eiseley’s poetic insistence that life itself is <a href=\"https://www.themarginalian.org/2017/06/22/loren-eiseley-muskrat/\">“is one vast miracle transcending the reality of night and nothingness”</a> — a miracle each of us repeats in our particular constitution of indifferent atoms forged in long-dead stars — Berrill writes: </p>\n<blockquote><p>Life… is not something set in motion long ago to get along as best it can ever since, whether by some sort of divine intervention or a peculiar concatenation of circumstances: it must be maintained and incessantly driven along its path of freedom, hour by hour and year by year throughout the ages, coerced into being from moment to moment and forced willy-nilly into the channels of time.</p></blockquote>\n<p>For us humans, he observes, “life is a dance of hydrogen and electrons along the atomic pathways of the body” — but life abounds and insists on itself, in every living form:</p>\n<blockquote><p>In every second of time the visible beings, large and not so large, vegetable and animal, are growing out of the invisible with a force so subtle yet so irresistible they can break a rock or split an atom. Out of almost nothing came the leviathans of trees and beasts, inexorably expanding to a destined size. Out of a almost nothing, almost but not quite — for there is the fact we tend to overlook or take for granted: the capacity of the smallest unit of living matter to grow into stupendous and bewilderingly complicated wholes. It goes on around us all the time; it is the world we live in, and it is ourselves, you and I. We are the event itself, or at least a very significant part of it — giant examples of expansion, marvelously elaborated, and of exceptionally long duration.</p></blockquote>\n<p>Alluding to <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\">the strangely spiritual science of what happens when we die</a>, Berrill adds:</p>\n<blockquote><p>Duration is hard to achieve, not that which belongs to crystals and rock but duration of the transcendent form and sparkle that belong to life. Hence the need for continual renewal, of birth from death, of the corn king who dies and the spring queen who brings forth life again. Life is forever being resurrected, not from nothing but from that speck of continuity that breaks off as a bud or seed or egg, leaving the old blown-up construction of the body lagging behind in time to stumble and die. Each fragment that begins anew, no matter what we call it, has time built into it.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/OfraAmit_5DarkMatter.jpg\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a> book</figcaption></figure>\n<p>A century after Whitman wrote that “the whole theory of the universe is directed unerringly at a single individual, namely, you,” and a generation after quantum pioneer Erwin Schrödinger made the koan-like quantum-infused observation that <a href=\"https://www.themarginalian.org/2021/11/03/erwin-shcrodinger-my-view-of-the-world/\">“this life of yours which you are living is not merely a piece of the entire existence, but is in a certain sense the whole,”</a>, Berrill writes:</p>\n<blockquote><p>Nature, in the intimate and in the vast, is not designed. It is designing. Our own nature confirms it.</p>\n<p>[…]</p>\n<p>The merging qualities of hope, courage, love, intellectual quest and the sense of beauty, as represented to some degree in every human being, are emergent qualities of all that the universe is made of… Whether you wish to call this the path to God or to use some other term is not important, for the meaning if far older than any language and is both supernal and transcendent. At this level the spiritual and scientific ventures become one, and any experience derived from either source must be scrutinized in the light of the other. Above all we need not be afraid, either of the universe at large in all its oneness and multiplicity, or of our own nature which has itself been created by a star.</p></blockquote>\n<p>In soulful defiance of the materialist reductionism with which some apprehend the elemental nature of the universe, Berrill anticipates physicists Alan Lightman and Sean Carroll’s respective notions of <a href=\"https://www.themarginalian.org/2023/03/14/the-transcendent-brain-alan-lightman/\">“spiritual materialism”</a> and <a href=\"https://www.themarginalian.org/2016/05/31/sean-carroll-the-big-picture/\">“poetic naturalism,”</a> and adds:</p>\n<blockquote><p>If mind and spirit grow out of matter they are nonetheless what they have been thought to be. It is our conception of matter that needs revision. All that is included in thought, perception and spiritual harmony belong as naturally in the universe as visible energy and tangible matter, and it is our peculiarly human task at the moment to see them all as facets of a whole.</p>\n<p>[…]</p>\n<p>The universe is as we find it and as we discover it within ourselves.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=680%2C829&amp;ssl=1\" width=\"680\" height=\"829\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?w=1800&amp;ssl=1 1800w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=320%2C390&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=600%2C731&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=240%2C293&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=768%2C936&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=1260%2C1536&amp;ssl=1 1260w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?resize=1680%2C2048&amp;ssl=1 1680w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/OfraAmig_TheUniverseInVerse1.jpg?w=1360&amp;ssl=1 1360w\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a> book</figcaption></figure>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"9998541d31e82fcd8dc9c3b4b4787b47dbb717f3d826e398599915a220438070","category":"Sites"}