{"title":"Hollywood vs. the attention economy","link":"https://www.garbageday.email/p/hollywood-vs-attention-economy","date":1709576404000,"content":"<div><div><h2>MrBeast Begins The Big Pivot</h2><p>MrBeast, in a <a href=\"https://twitter.com/MrBeast/status/1764293361437909406?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">recent X post</a>, wrote that he’s spent the last year experimenting with the pace of his videos, making them decidedly less YouTube-y. “This past year I’ve slowed down our videos,” he wrote. “Focused on story telling, let scenes breathe, yelled less, more personality, longer videos, etc. And our views have skyrocketed!”</p><p>We can argue all day long about whether or not this is actually true, but the fact he thinks it is and the fact he’s talking about it publicly is important. Though, that said, I’ve watched a decent amount of his videos over the last year and I do think he’s moving towards a slightly more TV-friendly style. In his X post, he used this recent video as an example.</p><p>It’s, frankly, a bizarre video. It was filmed in Kupari, Croatia, which is never acknowledged, aside from a few passing mentions to how the titular abandoned city was destroyed in “the war,” which was, apparently, the Croatian War of Independence. Also, the majority of the video is an ad for MrBeast’s candy bar, Feastables. There’s also a sponsored segment in the middle for a flavored water brand.</p><p>But back to MrBeast’s initial point. His videos usually feel like a trailer for a TV show that doesn’t exist. They tend to clock in around 12 minutes and feature a bunch of people screaming nonstop, punctuated by ugly motion graphics that show how much things cost. This video has all of that, sure, but it’s less concentrated. It’s probably the closest he’s come to a video that has a discernible beginning, middle, and end. Though, as someone who is not 12 years old and hypnotized by parasociality, I personally think the extended runtime and slower pacing just reveals how unpleasant MrBeast is to watch on camera. But I’m not really the target audience here. </p><p>The fact remains, though, he is attempting to mature his style. This is something Garbage Day researcher Adam Bumas actually predicted would happen soon in an issue <a href=\"https://www.garbageday.email/p/mrbeast-getting-old-make-content-slop?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">last month</a>, writing, “MrBeast, the consummate optimizer, knows he's getting too old to keep up.” </p><p>So now, we'll finally get to see whether MrBeast can survive the Big Pivot. This is either happening because he got a note from Hollywood execs saying that it’s time to grow up ahead of his rumored <a href=\"https://variety.com/2024/digital/news/mrbeast-reality-show-amazon-prime-video-1235882230/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">Amazon Prime show</a> or because he’s turning 26 this year, the unofficial age at which all YouTubers begin outgrowing their young audiences.</p><p>There are, frankly, more that have tried and failed to do this pivot than those that have succeeded. Figures like Tyler “Ninja” Blevins, PewDiePie, Casey Niestat, or Rhett and Link have all been held up by the mainstream, deemed a bad fit for true superstardom, and trudged back to the content mines. In fact, Rhett and Link <a href=\"https://www.youtube.com/watch?v=eEb9niZF-ik&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">recently put out a video</a> detailing how they’ve been stuck in development hell for years trying to get a proper TV show produced. (They’re going to try and self-fund it and release it on YouTube.) </p><p>But I was curious about those who were able to pull this off. This coveted shift from gaming algorithms and hijacking attention to working within the rigid structures of traditional entertainment, as frail as they feel these days. </p><p>So I asked my Discord this morning an annoyingly open-ended question: Has an influencer, creator, or youtuber ever pivoted and made a truly classic work? They begged for more context, but I wanted to see what they came up with. They mentioned people like Justin Bieber, Kim Kardashian, Quinta Brunson, and Lil Nas X, who all, yes, initially blew up online and became genuine celebrities. But Bieber’s biggest hits were after he was discovered by Usher. Kardashian entered the public consciousness as a reality TV star, not the MySpace famous assistant to Paris Hilton. Brunson’s most well-known work is a TV sitcom, not viral YouTube videos. And even Lil Nas X’s independently-produced “Old Town Road,” didn’t morph into a global phenomenon until Billy Ray Cyrus jumped on the remix.</p><p>Which reveals the formula for this sort of thing. Someone is making something online and then, one day, they’re either plucked from relative obscurity and canonized as a Real Celebrity by traditional media or they disappear for a year and try and cash in their chips in the attention economy and see what it buys them in Hollywood.</p><p>MrBeast, though, is different. His entire project, from the start, has been about trying to maximize YouTube as a medium. Everything he has done since his first viral video has been about converting money and resources into internet traffic to gain more money and resources to convert into more traffic. There is, simply, nothing else there.</p><p>Which means the question isn’t whether or not MrBeast can suddenly become a normal game show host or Gen Z’s Ryan Seacrest, or something. Can you imagine him on a red carpet? Also, there is, simply, no evidence that MrBeast, aside from imperceptible editing tweaks, is changing all that much about how he makes videos. Which means the question is actually whether or not YouTube can finally beat television. Can a creator, a youtuber, arguably the biggest ever, just keep doing what he’s been going and cross over regardless?</p><p>And this makes MrBeast’s Big Pivot less of a test of whether or not he is fit for the world of traditional media and, actually, a much more interesting referendum on whether or not algorithmic entertainment means anything beyond the recommendation widgets it was born in. </p><hr /><div><h2><span><b>Think About Supporting Garbage Day!</b></span></h2><p><span>Garbage Day is primarily supported by readers like you. It’s $5 a month or $45 a year and you get lots of fun extra stuff, like Discord access and the coveted weekend issue. Hit the green button below to find out more!</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\"><span> Upgrade </span></a></div><hr /></div><h2>A Month Beyond Substack</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/93a76de3-4b8e-4f42-8c2b-d6e4e7f14c3d/Screenshot_2024-03-04_at_10.36.39_AM.png?t=1709559435\" /></div><p>My first month off Substack was probably the most stressful thing I’ve gone through since I first launched Garbage Day, but I’m glad I did it and I’m happy to report that I am through the worst of it (I think). And so, I wanted to jot down a few things here in case there are other writers that follow me who are thinking about making a similar move. </p><p>I also want to personally thank Rusty Foster over at <i>Today In Tabs,</i> not just for writing this <a href=\"https://www.todayintabs.com/p/migration-report?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">incredibly useful migration report</a>, but for fielding my panicked Discord messages over the last month. And I want to thank you, the reader, as well, for bearing with me while I worked through a bunch of unforeseen glitches, which, also, seem to be mostly sorted out now.</p><p>My biggest takeaway is that Substack is a social network. Full stop. Many of its community features are really nice! Especially when you’re just starting out. But those community features paper over the fact that the growth you experience on Substack does not really mean much. It’s not you or your publication that is building an audience on Substack, you’re just maintaining Substack’s. Much like in the 2010s, when publishers raced to build Facebook pages with “millions” of “followers,” only to turn around and realize those people weren’t “readers” or an “audience,” but just numbers on a chart, so too are Substack signups plentiful, but ultimately not worth much. And I learned this first hand last month.</p><p>When I moved to Beehiiv, their very good email importer flagged about 2,000 of my 68,000 readers as “inactive”. And I then lost about 1,000 more on top of that because when you move email hosts a lot people who muted you in some capacity over the years suddenly see you in their inbox again and unsubscribe for real this time. Eventually this process ends, and it’s not like you’re actually losing readers in real time, but Number Go Down Feel Bad In Brain. There are ways to remove inactive subscribers on Substack, a process that’s often referred to as “pruning,” but it’s not easy and, at one point, Substack’s documentation even advised against it. Because they want you to play house on their network and imagine building a <a href=\"https://www.zeteonews.com/p/a-new-media-company-is-here-and-ready?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">new media company that’s ready to make some noise</a>, turn on paid subscriptions, and give them their 10% cut. I don’t even blame Substack for this, uh, triangular-shaped business structure. They’ve got investors and they’re trying to monetize literally the oldest and hardest form of publishing that exists. But the longer you use Substack, the more you’re tied to them. </p><p>Garbage Day was born on that platform and removing it from the network was brutal. But if I had waited longer, it would have been even worse. As podcaster and writer Aaron Ross Powell <a href=\"https://www.aaronrosspowell.com/p/substack-doesnt-want-leave?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">recently noted</a>, the fact Substack is adding direct messaging to the platform — a platform that is supposedly focused on direct messaging via email — is a bad sign. The financials Substack has been reporting are an even worse one.</p><hr /><h2>The Haunted Mario Blog Did A Q&amp;A</h2><blockquote><p></p><p>This month's experimental post: <br />I frequently receive questions about certain aspects of my personal life, my Mario game preferences, and my history with Mario and the blog. The document below compiles my answers to some of your most common inquiries!</p><p></p><a href=\"https://twitter.com/MarioBrothBlog/status/1764355303896752487?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\"><p> — Supper Mario Broth (@MarioBrothBlog) <br /> Mar 3, 2024 </p></a></blockquote><p><a href=\"https://www.suppermariobroth.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">Supper Mario Broth</a> (not Super, mind you) is an extremely weird <i>Super Mario</i> fan account that I first started following on Tumblr years ago. It has been often called a “haunted blog,” due to the mildly detached and creepy way the whole thing is written. The details it highlights from the games are extremely esoteric and it’s gone viral more than few times for noticing minute details about, for instance, single pixels inside of Mario’s mustache.</p><p>On X, the blogger behind the account recently shared some “answers to frequently asked questions,” which are fascinating. </p><p>It changed authors in 2016, which I never even noticed tbh. The writer is German, which may explain the weird syntax it’s written in. And when the blogger behind the account isn’t writing about Mario, they work as a caretaker, primarily for patients with Alzheimer’s.</p><hr /><h2>For My Own Sanity, I Have To Believe That This Is Satire</h2><blockquote><a href=\"https://www.instagram.com/reel/C2upHaaBRKg/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\"><p> Instagram post by @shaxx.ai </p></a></blockquote><p>OK, so I saw this video going around and tried to figure out whether or not it was for real. And I think I understand what’s happening here.</p><p>It was created by a Melbourne-based “comedian” and prankster named Kshitij Makkar, who goes by Shaxx on most platforms. Makkar has made a bunch of videos like the one above, which claim that he’s making thousands of dollars a day screenshotting ChatGPT prompts and putting them over <i>Minecraft</i> footage. That does not appear to be true and he’s just saying that for ragebait.</p><p>But Makkar is big on social. He has four million followers <a href=\"https://www.tiktok.com/@its_shax?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">on TikTok</a> and another million <a href=\"https://www.youtube.com/channel/UCb5NuUv1oseIPRJm3MyJUUw?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">on YouTube</a>. And the content he puts there is just other, different kinds of engagement bait, like bad street pranks and reaction videos.</p><p>So, no, he’s not going viral (I don’t think) by making bad AI videos. But he is going viral in every other awful way imaginable. </p><hr /><h2>Newgrounds Banned AI Art</h2><blockquote><p></p><p>Newgrounds just introduced “AI” as a flagging option for submissions!</p><p></p><a href=\"https://twitter.com/dungeonation/status/1764024943782633910?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\"><p> — Dungeonation (@dungeonation) <br /> Mar 2, 2024 </p></a></blockquote><p>Newgrounds has largely banned all forms of AI content. Which is surprising! First, because I just forgot it existed and, second, because every other website on the internet seems to be more than happy to liquidate their users’ trust and dump it into a large language model.</p><p>Newgrounds has a <a href=\"https://www.newgrounds.com/wiki/help-information/terms-of-use/art-guidelines?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">pretty extensive AI art policy</a> (the only thing that’s not banned is human-made art inspired by AI images) and the community has been discussing the nuances of it since 2022.</p><p>Their policy essentially boils down to, “We want to keep the focus on art made by people and not have the Art Portal flooded with computer-generated art.”</p><p>Wow! See how easy that is?</p><hr /><h2>I’m Obsessed With The AI-Generated Adam Curtis Video</h2><p>The video above is the second part of a series that Italian filmmaker and internet researcher Silvia Dal Dosso has made featuring an AI-generated audio clone of British documentarian Adam Curtis. I was lucky enough to see Dal Dosso perform one of these videos live last year in Milan and my head is still spinning.</p><hr /><h2><b>Some Stray Links</b></h2><ul><li><p><a href=\"https://www.404media.co/wordpress-firehose-allows-ai-companies-to-buy-access-to-a-million-posts-a-day/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">“A WordPress ‘Firehose’ Allows AI Companies to Buy Access to a Million Posts a Day”</a></p></li><li><p><a href=\"https://gizmodo.com/heres-the-full-ai-generated-script-from-the-willy-wonka-1851295448?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">“Here's the Full AI-Generated Script From the Willy Wonka Disaster”</a></p></li><li><p><a href=\"https://www.rollingstone.com/culture/culture-features/nara-smith-lucky-blue-smith-tiktok-mormon-tradwife-1234979241/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">“Meet the Hot Young Tradwife Making Everyone on the Internet Mad”</a></p></li></ul><hr /><p><span>P.S. here’s a </span><span><a href=\"https://twitter.com/nn_ni_7/status/1764312328877887521?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=hollywood-vs-the-attention-economy\" target=\"_blank\">good Japanese X post</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=f1e234ea-42b6-4972-9490-f44758122332&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"99b3eeea4181e8136d18ef5bb42f5f14ccea6c718106f5f32e776fc9db84fbe7","category":"default"}