{"title":"&#8220;We Choose Freedom&#8221;","link":"https://kottke.org/24/07/we-choose-freedom","date":1721922383000,"content":"\n        <p></p>\n\n<p>Vice President Kamala Harris has debuted her first ad for her presidential run and it’s a good one. First of all: <a href=\"https://www.cnn.com/2024/07/22/entertainment/beyonce-freedom-harris-campaign/index.html\">Beyoncé</a>. But also: “freedom” is a great theme for Harris. For too long Republicans have defined what that word means in America and now’s the time for Democrats to assert their vision. From the ad:</p>\n\n<blockquote><p>The freedom not just to get by but get ahead. The freedom to be safe from gun violence. The freedom to make decisions about your own body. We choose a future where no child lives in poverty, where we can all afford health care, where no one is above the law.</p></blockquote>\n\n<p>I think a lot about <a href=\"https://www.rollingstone.com/politics/politics-news/pete_buttigieg-36-year-old-mayor-south-bend-indiana-2020-713662/\">this 2018 Rolling Stone interview with Pete Buttigieg</a> (when he was still mayor of South Bend, Indiana) in which he offers his thoughts on recasting “concepts that conservatives have traditionally ‘owned’ — like freedom, family, and patriotism — in more progressive terms”.</p>\n\n<blockquote><p>You’ll hear me talk all the time about freedom. Because I think there is a failure on our side if we allow conservatives to monopolize the idea of freedom - especially now that they’ve produced an authoritarian president. But what actually gives people freedom in their lives? The most profound freedoms of my everyday existence have been safeguarded by progressive policies, mostly. The freedom to marry who I choose, for one, but also the freedom that comes with paved roads and stop lights. Freedom from some obscure regulation is so much more abstract. But that’s the freedom that conservatism has now come down to.</p>\n\n<p>Or think about the idea of family, in the context of everyday life. It’s one thing to talk about family values as a theme, or a wedge — but what’s it actually like to have a family? Your family does better if you get a fair wage, if there’s good public education, if there’s good health care when you need it. These things intuitively make sense, but we’re out of practice talking about them.</p>\n\n<p>I also think we need to talk about a different kind of patriotism: a fidelity to American greatness in its truest sense. You think about this as a local official, of course, but a truly great country is made of great communities. What makes a country great isn’t chauvinism. It’s the kinds of lives you enable people to lead. I think about wastewater management as freedom. If a resident of our city doesn’t have to give it a second thought, she’s freer.</p></blockquote>\n\n<p><a href=\"https://kottke.org/18/08/offering-a-more-progressive-definition-of-freedom\">To which I added</a>:</p>\n\n<blockquote><p>Clean drinking water is freedom. Good public education is freedom. Universal healthcare is freedom. Fair wages are freedom. Policing by consent is freedom. Gun control is freedom. Fighting climate change is freedom. A non-punitive criminal justice system is freedom. Affirmative action is freedom. Decriminalizing poverty is freedom. Easy &amp; secure voting is freedom. This is an idea of freedom I can get behind.</p></blockquote>\n\n<p>Compare that to <a href=\"https://kottke.org/24/07/project-2025-the-minority-rule-by-extremists\">the “freedoms” that Republicans are pushing for in Project 2025</a> — and have been pressing on Americans <a href=\"https://kottke.org/23/05/the-four-republican-freedoms\">even before that</a>:</p>\n\n<blockquote><p>There is the freedom to control — to restrict the bodily autonomy of women and repress the existence of anyone who does not conform to traditional gender roles.</p>\n\n<p>There is the freedom to exploit — to allow the owners of business and capital to weaken labor and take advantage of workers as they see fit.</p>\n\n<p>There is the freedom to censor — to suppress ideas that challenge and threaten the ideologies of the ruling class.</p>\n\n<p>And there is the freedom to menace — to carry weapons wherever you please, to brandish them in public, to turn the right of self-defense into a right to threaten other people.</p></blockquote>\n\n<p>The Declaration of Independence stated our fledgling nation’s assertion that people are endowed “with certain unalienable Rights, that among these are Life, Liberty and the pursuit of Happiness”. It’s pretty clear which of the two parties’ interpretations of freedom hews closer to that assertion.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Beyonc%C3%A9\">Beyoncé</a> · <a href=\"https://kottke.org/tag/Kamala%20Harris\">Kamala Harris</a> · <a href=\"https://kottke.org/tag/language\">language</a> · <a href=\"https://kottke.org/tag/Pete%20Buttigieg\">Pete Buttigieg</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"9a230b9be46977804ee7b92c37d5171ef76b46a7c12ba69f7459b68bba4e26a7","category":"default"}