{"title":"The part of my quote Piers Morgan doesn't want you to see","link":"https://www.usermag.co/p/the-part-of-my-quote-piers-morgan","date":1734037826000,"content":"<p><em>Did you know <a href=\"https://urlgeni.us/youtube/channel/taylorlorenz\">I have a YouTube channel</a>? Subscribe <a href=\"https://urlgeni.us/youtube/channel/taylorlorenz\">here</a> for weekly videos and deeper online culture commentary.</em></p><div><figure><a target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png\"><div><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png\" width=\"1456\" height=\"803\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2F4f357e5e-f490-4474-8edd-635ef8f15675_3016x1664.png 1456w\" /><div><div><div></div><div></div></div></div></div></a></figure></div><p>Over the past few days, dozens of media outlets have been running non stop headlines smearing me and pushing a deceptively edited clip that claims I felt “joy” over the UnitedHealth CEO’s death. Let’s get one thing out of the way up top: <strong>that literally never happened.</strong> <strong>That’s a gross and intentional mischaracterization of what I said, made clear if you listen to my full comment, and there’s a reason why the media is misleading people about it.</strong></p><p>In an interview on Piers Morgan, this week about Brian Thompson’s killing and Piers asked me, “Why would you be in such a celebratory mood about the execution of another human being?\"</p><p>I replied, regarding the online reaction to Thompson’s killing: \"I do believe in the sanctity of life, and I think that's why I felt, along with so many other Americans, joy unfortunately, because…. “. </p><p>Before I could utter another word, Piers Morgan interrupted me and began shouting at me, screaming that I was basically an evil and horrible because I felt “joy” in another person’s death, something I never said. </p><p>He replayed the clip again where he’s clearly cutting me off and, after a fellow panelist defended me, saying that Piers had, in fact, completely put words in my mouth, I finished my sentence:</p><p><strong>“I feel joy because people like you, who are rich and powerful and on TV and have all the access to all the healthcare privileges in the world are finally being forced to pay attention to the barbaric healthcare system, that murders tens of thousands of innocent Americans, and that is what I feel joy in. I feel joy that people like you are forced to confront these systemic problems.”</strong></p><p><a href=\"https://youtu.be/m7AOuBfdKXQ?si=ylTJn-sMAuzWkHRc&amp;t=1871\">You can watch exactly where Piers cuts me off and misrepresents what I said here</a>.</p><p>How did Morgan respond? He abruptly ended the segment and proceeded to promote a dubiously edited clip designed to mischaracterize what I said and generate outrage and headlines.</p><p>As usual, the mainstream media took the bait. Dozens of media outlets republished the edited clip, cutting off my full comments and twisting their meaning. “Ex-WaPo reporter Taylor Lorenz tells Piers Morgan she felt ‘joy’ over assassination of UnitedHealthcare CEO Brian Thompson,” a New York Post headline read. Fox News began boosting the false story relentlessly. I found out that just last night, a Puck journalist was promoting the false story to other media figures at an in-person event.</p><p>As a result of this smear campaign I’ve received a non stop tidal wave of harassment. Friends of mine have been attacked just for their affiliation with me and media reporters have been harassing companies I’ve worked with in the past, threatening them with bad press if they don’t condemn me. I’m completely fine, but I think it’s crucial that people recognize exactly how the media pushes false narratives like this and why. </p><p>I was one of the first media figures to express publicly, that we should feel empathy for the millions of Americans murdered by our for-profit insurance system, not just an insurance CEO, in the wake of the shooting. </p><p>I explained that, instead of centering the stories of those harmed by UnitedHealth and the very real outrage that most Americans feel about the way the healthcare system is run today, much of the media, including people like Piers Morgan, is publishing a tidal wave of breathless articles about the loss of \"civility\" and \"respect\" online and tone policing those victimized by the insurance industry. </p><p>As I said on Piers’ show, despite the media’s efforts to claim otherwise, I obviously don’t endorse people going around shooting CEOs in the streets. As fellow journalist Ken Klippenstein explained well: no shit murder is bad, but the commentary about the UnitedHealth CEO isn’t about him, “it is about the rapacious healthcare system he personified and which Americans feel deep pain and humiliation about.\" </p><p>This intentional effort to downplay and ignore the systemic cruelty of our healthcare system by willfully stripping all context from comments like mine and other online outpourings, is part of an ongoing effort to discredit anyone who speaks out about the mass death and suffering that executives like Thompson facilitate. </p><p>Media like Piers Morgan and everyone else pushing this fake, deeply misleading clip and “story,” want you to be more outraged that some people might not feel the utmost sympathy for a healthcare executive responsible for tens of thousands of Americans deaths, rather than question the system that led to these conditions in the first place.</p><p>Millionaires like Piers want the public to clutch their pearls and direct their anger at people like me or random people on Twitter who \"took things too far,\" rather than those in power who perpetuate this system. Don’t fall for it. </p><div><div><div><p>User Mag is a 100% reader-supported publication. To receive new posts and support my work, become a free or paid subscriber.</p></div><div><div></div><div></div></div></div></div><div><figure><a target=\"_blank\" href=\"https://substackcdn.com/image/fetch/f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png\"><div><img src=\"https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png\" width=\"1407\" height=\"27\" srcset=\"https://substackcdn.com/image/fetch/w_424,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png 424w, https://substackcdn.com/image/fetch/w_848,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png 848w, https://substackcdn.com/image/fetch/w_1272,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png 1272w, https://substackcdn.com/image/fetch/w_1456,c_limit,f_auto,q_auto:good,fl_progressive:steep/https%3A%2F%2Fsubstack-post-media.s3.amazonaws.com%2Fpublic%2Fimages%2Fd4e3b64b-ddab-426d-8b88-15f744b8b191_1407x27.png 1456w\" loading=\"lazy\" /><div></div></div></a></figure></div><p><strong>For more great content <a href=\"https://www.instagram.com/taylorlorenz3.0/\">follow my meme page</a>, subscribe to <a href=\"https://www.youtube.com/taylorlorenz\">my YouTube channel</a>, and <a href=\"https://www.instagram.com/channel/AbZQPs8zLytuVxvh/\">join my Instagram broadcast channel</a> where I share links all week long.</strong></p><p><strong>Listen to my podcast Power User on Apple Podcasts:</strong></p><div></div><p><strong>Or follow Power User on Spotify:</strong></p><p><a href=\"https://www.usermag.co/p/the-woman-behind-the-viral-texas?utm_source=substack&amp;utm_medium=email&amp;utm_content=share&amp;action=share&amp;token=eyJ1c2VyX2lkIjoxMTUzMDc5LCJwb3N0X2lkIjoxNTA1OTMxMjUsImlhdCI6MTcyOTcyMjg3OCwiZXhwIjoxNzMyMzE0ODc4LCJpc3MiOiJwdWItMzIzOCIsInN1YiI6InBvc3QtcmVhY3Rpb24ifQ.ddgUPVHk3Rd4mMzYAqDk4PzMRpLapQB5daoZVKwNBxo\"><span>Share</span></a></p>","author":"Taylor Lorenz","siteTitle":"usermag.co","siteHash":"95f273abc07d53f60c12a9877d5e701fc5d46103659afbdcd53f0429eec6280d","entryHash":"9a79826c36db9b9c149c444c4a0538bb3ac9f85812259add343917fe5ecfd41c","category":"Sites"}