{"title":"The Kids Are Right (and Alright)","link":"https://kottke.org/24/05/the-kids-are-right-and-alright","date":1715625189000,"content":"\n        <p><a href=\"https://www.theguardian.com/commentisfree/article/2024/may/13/campus-gaza-protests-student-protesters-role-history\">Osita Nwanevu on the recent US campus protests</a>:</p>\n\n<blockquote><p>The student left is the most reliably correct constituency in America. Over the past 60 years, it has passed every great moral test American foreign policy has forced upon the public, including the Vietnam war, the question of relations with apartheid South Africa, and the Iraq war. Student activists were at the heart of the black civil rights movement from the very beginning. To much derision and abuse, they pushed for more rights, protections and respect for women and queer people on their campuses than the wider world was long willing to provide. And over the past 20 years in particular, policymakers have arrived belatedly to stances on economic inequality, climate change, drug policy and criminal justice that putative radicals on campus took up long before them.</p>\n\n<p>They have not always been right; even when right, their prescriptions for the problems they’ve identified and their means of directing attention to them have not always been prudent. But time and time and time again, the student left in America has squarely faced and expressed truths our politicians and all the eminent and eloquent voices of moderation in the press, in all of their supposed wisdom and good sense, have been unable or unwilling to see. Straining against an ancient and immortal prejudice against youth, it has made a habit of telling the American people, in tones that discomfit, what they need to hear before they are ready to hear it.</p></blockquote>\n\n<p>(via <a href=\"https://bsky.app/profile/anildash.com\">@anildash.com</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Osita%20Nwanevu\">Osita Nwanevu</a> · <a href=\"https://kottke.org/tag/politics\">politics</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"9b7ff64381a7a35495f2b1b97bf10969dbc466e2737630f8fddbb30c05195435","category":"default"}