{"title":"You don’t need confidence, just contribution.","link":"https://sive.rs/contrib","date":1533513600000,"content":"<p>\nYears ago, I was so confident and so naive.\nI was sure I was right and everyone else was wrong.\n</p><p>\nAfter I <a href=\"https://sive.rs/done\">sold my company</a>, I felt ready to do something new, so I started to <a href=\"https://sive.rs/book\">learn</a>.\nBut the more I learned, the more I realized how little I knew and how dumb-lucky I had been.\n</p><p>\nI continued learning until I felt like an absolute idiot.\nBy then I was paralyzed, unable to create anything new.\n</p><p>\nI’d <a href=\"https://sive.rs/projects\">start to make new things</a>, but then see how stupid they revealed me to be, so I’d stop.\nI lost all confidence.\nI spent a few years completely stuck.\n</p><p>\nEventually, some new thoughts helped:\n</p><ul><li>\n<strong>\nLearning without doing is wasted.\n</strong>\nIf I don’t use what I learn, then it was pointless!\nHow horrible to waste those hundreds of hours I spent learning, and not turn it into action.\nLike throwing good food in the trash, it’s morally wrong.\n</li><li>\n<strong>\n<a href=\"https://sive.rs/you-not-them\">\nThis isn’t about me.\n</a>\n</strong>\nHow I feel in this moment doesn’t matter — it will pass.\nNobody’s judging me because nobody’s thinking of me.\nThey’re just looking for ways to improve their own lives.\n<a href=\"https://sive.rs/publicu\">The public me is not the real me</a> anyway, so if they judge my public persona, that’s fine.\n</li><li>\n<strong>\nThe work is the point, and my work is unique.\n</strong>\nIf I can do something that people find useful, then I should.\nIt doesn’t matter if it’s a masterpiece or not, as long as I enjoy it.\nI’ve got my own weird angle on things that’s <a href=\"https://sive.rs/counter\">a useful counter-melody</a> in the big orchestra of life.\n</li></ul><p>\nI’m glad my old confidence is gone because it thought I was right, and maybe even great, but not anymore.\n</p><p>\nNow I aim to make my work — my little contribution to the world — just unique and useful.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9d1d5f41f8f6791fdac37679c1c79451b9a192e843d1424438568af7ff0433c1","category":"Sites"}