{"title":"What happens when we ignore plans?","link":"https://sive.rs/ldn","date":1570233600000,"content":"<p>\nI took my 7-year-old to London today.\nI made two plans: if it rains, we go to a museum, if not, we go to the zoo.\n</p><p>\nBut when the train arrived in London, he said he didn’t really want to do either one.\nSo we just walked with no plans.\n</p><p>\nWe immediately ran across some random building with a big art installation on its side.\nThere was nobody around.\nWe played there for a long time.\n</p><p>\nAt each intersection, we just went whichever way looked most interesting.\nHe lept around park benches, tickling some kids from Croatia.\nHe found a huge cardboard box in the trash, and kept it around him like a turtle shell, as we walked through the city.\nHe found a discarded paint brush and twirled it around his fingers for the rest of the day.\n</p><p>\nWe were in front of the theater with the musical “<a href=\"https://en.wikipedia.org/wiki/Wicked_(musical)\">Wicked</a>”, just as they were about to begin.\nWe bought last-minute tickets, 8th row center, and watched the show.\nHe held hands with a girl sitting next to him.\n</p><p>\nI’m so glad we didn’t follow any plans today.\n</p><p>\nWe make plans to make the most of our time — but thinking again about that idea, that doesn’t make sense, does it?\n</p><p>\nUnless we’re actually shut out of great things for lack of planning, <strong>following no plans is the ideal way to make the best of each moment.</strong>\nEvery moment provides new information, which changes the situation.\nThen we can act on what we know now, instead of what we previously predicted.\n</p><p>\nI don’t regret having plans, because sometimes following the plan is the best choice.\n</p><p>\nSo I guess the lesson is to <strong>make plans, but feel free to ignore them</strong> — to see them as an option, not a requirement.\n</p><p>\nAfter eight hours of walking, we took a night train home.\nTucking him into bed, I asked what was his favorite part.\n</p><p>\n“The cardboard box.”\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9d8d7de13e0b8b9ddbaff891c22bda1ba5459ab9ff73ae78538b48658cd8610f","category":"default"}