{"title":"Here’s how to live: Make change.","link":"https://sive.rs/htl26","date":1640476800000,"content":"<p>\nChange the world as much as you can.\n<br />\nAll your learning and thinking is wasted if you don’t take action.\n<br />\nPeople try to explain the world, but the real point is to change the world.\n</p><p>\nIf you go through life without changing anything, what have you done?\n<br />\nJust observed?!\n<br />\nThe world doesn’t need more audience.\n<br />\nThe world needs changing.\n<br />\nWhat’s broken needs fixing.\n<br />\nWhat’s OK needs improving.\n<br />\nWhat’s harmful needs destroying.\n</p><p>\nPeople dream or complain about how the world should be, but nothing improves without action.\n<br />\nYou have to go change things yourself.\n</p><p>\nPeople say the world is the way it is, and that’s just how it’s going to be.\n<br />\nThey’re hopeless, complacent, or entrenched.\n<br />\nThey expect life to stay within its current boundaries and rules.\n<br />\nBut all progress comes from those who ignore the boundaries, break the rules, or make a whole new game.\n</p><p>\nDon’t accept anything as-is.\n<br />\nEverything you encounter must change.\n<br />\nPreservation is your enemy.\n<br />\nOnly dead fish go with the flow.\n</p><p>\nThink of the scientific method.\n<br />\nSomeone proposes an idea, then others skeptically and rigorously try to disprove it.\n<br />\nUse this approach on the world.\n<br />\nAssume everything is wrong the way it is.\n<br />\nDoubt it and attempt to change it, to prove it’s not correct.\n</p><p>\nThis is how we make progress.\n<br />\nWhat fails is forgotten.\n<br />\nWhat works is called innovation.\n</p><p>\nBegin by righting what’s wrong.\n<br />\nLook for what’s ugly: ugly systems, ugly rules, ugly traditions.\n<br />\nLook for what bothers you.\n<br />\nIf you can fix it, do it now.\n<br />\nOtherwise, aim lower until you find something you can do now.\n<br />\nMake it how it should be.\n<br />\nDon’t complain.\n<br />\nJust make the change.\n</p><p>\nThis gives you a new perspective on work.\n<br />\nWork is whatever you want to change.\n</p><p>\nRemove what needs to die.\n<br />\nInstead of fixing, destroy what was there and replace it with something better.\n<br />\nSometimes you don’t know what to add, but you know what to remove.\n</p><p>\nWorried you’ll make things worse?\n<br />\nWho’s to say whether the change you’ll make is good or bad?\n<br />\nOnly time will tell.\n<br />\nGenghis Khan killed 11% of the world’s population, but he’s seen as having a net-positive influence on the world in the long run.\n<br />\nYet people with the best intentions can end up doing harm.\n<br />\nSo stop judging and start changing the world any way you can.\n</p><p>\nRearrange and remix.\n<br />\nThat’s how nature grows.\n<br />\nA cow is rearranged grass.\n<br />\nAll the atoms get reused.\n<br />\nEvery time you hear a song, watch a show, or read an idea, think of how you’d change it or combine it with something else.\n<br />\nKeep your tools handy to rearrange, remix, and edit what you encounter.\n<br />\nThen share your alterations.\n</p><p>\nDon’t worship your heroes.\n<br />\nSurpass them.\n</p><p>\nChanging the world includes changing yourself.\n<br />\nChange your beliefs, preferences, acquaintances, hobbies, location, and lifestyle.\n<br />\nYour only constant habit will be looking for what else to change.\n</p><p>\nChange others.\n<br />\nChanging minds and hearts can have more impact than physical change.\n<br />\nA great speech can do the work of a thousand soldiers.\n</p><p>\nGo where there’s a revolution.\n<br />\nThat’s where people are questioning old norms, and looking for new solutions.\n<br />\nCreativity comes from shaking things up.\n<br />\nPeople that were left out of the old game can get in early on the new game.\n</p><p>\nAfter years of doing this, you’ll be ready to make institutional change.\n<br />\nHow?\n<br />\nBy using the techniques of lobbyists.\n<br />\nSet up a company or foundation to act through.\n<br />\nMake institutional change anonymously from behind the company, so your personality is not distracting the point.\n<br />\nCall it something generic and impossible to oppose, like “Better World LLC”.\n<br />\nKeep your public profile small.\n<br />\nBe humble and likable.\n<br />\nPrevent the straw man attack.\n<br />\nFor each change you seek to make, find someone effective to be the face for the campaign.\n<br />\nLet the company and its contributors make the change.\n<br />\nStay behind the scenes and quietly pull the strings.\n</p><p>\nChanging culture makes revolution.\n<br />\nBut it’s not a revolution if nobody loses.\n<br />\nSomeone will have to lose.\n<br />\nPeople will be furious.\n<br />\nWhen the bad people are mad, you’re doing it right.\n</p><p>\nIn the end, the highest praise of a life is to say that person “made a difference”.\n<br />\nDifference!\n<br />\nDo you hear that word?\n<br />\nDifference refers to what’s changed.\n<br />\nTo live a praise-worthy life, to make a difference, you have to make change.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9db555926cf1ff16e69917bc06437b42765a065c863c0a6ce2e9787679283ae5","category":"Sites"}