{"title":"Digital pollution","link":"https://sive.rs/polut","date":1571097600000,"content":"<p>\nYou couldn’t just roll down the street leaving huge piles of garbage everywhere you go, making life slower for everyone as they climb over your mountains of junk, just to get on with their life.\nYou’d feel bad about it, right?\n</p><p>\nThat’s how I feel about the digital things we put out into the world: websites, apps, and files.\n</p><p>\nI prefer coding everything by hand, because I don’t like the huge piles of garbage that the automated generators create.\nThese programs that generate a website, app, or file for you spit out thousands of lines of unnecessary junk when really only 10 lines are needed.\nThen people wonder why their site is so slow, and they think it’s their phone or connection’s fault.\n</p><p>\nYesterday I needed to make a little vector logo.\nTwo lines and two triangles.\nI tried to use a couple different vector drawing programs but they saved it as hundreds of lines.\nI knew it could be simpler, so I read up on SVG and made exactly what I wanted:\n</p>\n<pre><code>\n&lt;svg height=\"54\" width=\"54\"&gt;\n&lt;defs&gt;&lt;style type=\"text/css\"&gt;&lt;![CDATA[line,polygon{stroke:black;stroke-width:4} polygon{fill:black}]]&gt;&lt;/style&gt;&lt;/defs&gt;\n&lt;line x1=\"2\" y1=\"2\" x2=\"2\" y2=\"52\" /&gt;\n&lt;line x1=\"52\" y1=\"2\" x2=\"52\" y2=\"52\" /&gt;\n&lt;polygon points=\"2,2 27,27 2,27\" /&gt;\n&lt;polygon points=\"52,2 27,27 52,27\" /&gt;\n&lt;/svg&gt; \n</code></pre>\n<img src=\"/images/HitMediaLogo-54.svg\" alt=\"Hit Media logo\" />\n<p>\nMuch better!\n95% smaller file size, and the joy of making something by hand instead of having it done for me.\nBut I think my biggest joy is <strong>eliminating the digital pollution</strong> that the auto-generated one created.\nIt makes everything faster, easier, and cleaner for anyone involved.\n95% less junk over the wires.\n</p><p>\nSame thing with the EPUB file for my new book.\nToday I spent the day creating the EPUB’s XML and XHTML by hand, instead of using a generator.\nI love the manual control and again - 90% smaller file size.\n</p><p>\nThis makes me unreasonably happy.\nIt feels like cleaning up the neighborhood.\nOr at least my yard.\n</p><p>\n(And I love it when people notice how fast my site loads.)\n</p>\n<img src=\"/images/HitMediaLogo-54.png\" alt=\"Hit Media logo\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9de4cb872de3928e49f1c49b261140f1e204dae1f6326579f4021c1e565951a5","category":"default"}