{"title":"the three rhythms of the creative process","link":"https://keningzhu.com/journal/the-three-rhythms-of-the-creative-process","date":1723040357000,"content":" \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=1000w\" width=\"2000\" height=\"1600\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/0ab3192f-3770-4edc-993c-a6be050c8b0f/three_rhythms_8%3A5.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n \n\n\n  <p><em>ongoing explorations on creative time</em> </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p>lately, I’ve been thinking of how each stage of the creative process has its own rhythms, but we’ve been taught that there’s only one rhythm: <em>consistency</em>. </p><p>I’ll propose a framework of 3 rhythms, which map onto the seasons: </p><ol><li><p><strong>Inspiration/Ideation</strong> — new visions and ideas arriving (spring season)  </p></li><li><p><strong>Production</strong> — the focused, deep flow of materializing an idea into form (summer season) </p></li><li><p><strong>Release </strong>- the act sharing your work (autumn season).   </p><p><em><br />… and winter, of course, is a season of hibernation and silence.<br /></em></p></li></ol><h1>releasing the pressure to be consistent</h1><p>we’ve been taught that creative production requires consistency, which requires <em>timeblocking</em> — that is, to break a project down into steady, parceled pieces — and to prioritize <em>the idea of linear progress and consistent output</em>. </p><p>this kind of capitalist relationship to time feels the most recognizable to us. it’s a satisfying metric to measure creative productivity by. </p><p>but I’ve often found this measured productivity to feel oppressive. the creative process is not a machine. we are not machines. we are vessels of nature and spirit; and thus, our rhythms resemble more the cyclical, organic processes with their own life cycle and metabolisms. </p><p>over the years, I’ve caused myself a lot of stress and overwhelm trying to funnel my energy into a consistent, rhythmic output. I may intend to show up at those specific rhythms: <em>daily, weekly, monthly</em>, and then I find myself completing things last minute, in a rush of deadline, adrenaline-fueled energy. </p><p>sure, this works. but, I’m not being “consistent.” my creative output only <strong><em>appears</em></strong> consistent at the very end stage — in the act of sharing. </p><p>I mapped out these three rhythms: <em>inspiration, production, release</em> — as a framework of thinking about how creative energy changes form and rhythms across its life cycle. let’s explore them, one by one. <br /></p><h1>the rhythm of inspiration (spring) </h1><p>cultivating inspiration feels less like completing a strict daily to-do list, and more like keeping an ongoing conversation with creative spirit. </p><p>in a particular creative project, this phase represents <strong><em>spring</em>: the initiation and birthing of new ideas.</strong> its rhythm feels fluid and spontaneous. it can happen to you at any time — in the form of a faint tugging, a quiet whisper, or a sudden bolt of inner electricity. it might resemble something more of a wild animal, or a force of nature, or whatever spirit yours takes the form of. when it arrives, it arrives like a gust of wind. you become the vessel to hold it, the channel to coax it into being. </p><p>its ways <em>are</em> seemingly unpredictable. but, it doesn’t mean that you can’t care for it, offer it sustenance at regular rhythms, or sit on the forest floor and provide a safe sanctuary for it to arrive. yes, its mood and energy will change, like weather patterns, day by day. but over time, this mysterious force will come, whenever summoned. <br /></p><p><strong>how I practice this (daily-ish):</strong> </p><ul><li><p>I practice daily creative rituals in <a href=\"https://keningzhu.com/journal/morning-ritual-stone-dial\" target=\"_blank\">my morning routine</a> — writing, visual, ideas. sometimes, I do small projects with an output, like <a href=\"https://keningzhu.com/journal/a-santorini-still-life-on-drawing-everyday\" target=\"_blank\">the practice of drawing everyday.</a></p></li><li><p>everyday, I make space to listen to what inspired urges are stirring within me, and I write them down in my journal. </p></li><li><p>throughout my day, when I hear a whisper of an idea, I make sure to collect it as soon as possible. </p></li><li><p>I start every project with half an hour of idea sketches — explorations of a concept, until I see its shape emerging with some amount of clarity. </p></li></ul><p></p><h1>the rhythm of production (summer) </h1><p>production sounds like a mechanical word — but by production I mean: <em>taking an idea from its fluid, nascent forms (inspiration) into developed materialization.</em> </p><p>production represents the <strong>summer season of a creative idea.</strong> it is the process of maturation into adulthood. this phase can feel like the sensation of endless, deep time — to be in the focused flow of one project. </p><p>some examples of production: </p><ul><li><p>taking a raw recording <em>(inspiration)</em> and editing it into a podcast episode </p></li><li><p>taking idea sketches <em>(inspiration)</em> and creating a mostly complete art  </p></li><li><p>taking very rough notes and refining it into a completed draft</p></li></ul><p>there is certainly spontaneity and creative evolution in production, but the bulk of it is <em>the</em> <em>work itself</em>; bringing an idea through iterations into an 80% complete form. this is the phase where there’s a danger of endless revisions. the purpose of it, however, is simply the deliberate channeling of creative energy into a clearly defined vessel. </p><p><strong>how I practice production:</strong> </p><ul><li><p>I plan my day and weeks with <a href=\"https://keningzhu.com/journal/creative-immersion-deck\" target=\"_blank\">my creative immersion cards</a> to help me focus. </p></li><li><p>for some projects, I create my own intensive creative sprints that last 1-2 days. </p></li><li><p>I use time rocks to allocate time for each project.  </p><p></p></li></ul><h1>the rhythm of release (fall) </h1><p>the act of completion and release is the only rhythm that is visible to the external world. this is when you publish something on your website, release an episode on your podcast, or send a newsletter. </p><p>sharing is the act of releasing and ending the creative cycle, so release is like the <strong>autumn phase</strong> of harvest, death, and surrender. <br /></p><p><strong>how I practice release</strong></p><ul><li><p><strong>weekly:</strong> I release new work on my podcast, newsletter, and website. </p></li><li><p><strong>monthly:</strong> I also send a monthly artist digest newsletter</p></li><li><p><strong>seasonally:</strong> I work on longer, ongoing projects and offerings. <br /></p></li></ul><p>my intention is to find more separation between my rhythms of sharing + creation, rather than be driven by deadlines to share. </p><p>that is, I’d like to find more spaciousness between the rhythms. I’d like to create according to my own spring/summer energy flow, accumulate the creations, and time their release on a rhythmic (monthly, weekly, moonly, seasonally) pattern. </p><p>in doing so, this establish an ongoing, continuous flow — even if and when my inner creative flow is in hibernation (winter) or incubation (spring) mode. <br /></p><h1>changing rhythms is an ongoing practice </h1><p>I drew these three rhythms to help me create distinctions between being inspired by new ideas, the focused work of bringing an idea to fruition, and the act of releasing them into the world. </p><p>sometimes, I find myself being too directed by the adrenenline focus of consistent release, or I fall into an endless rabbit hole of production, or I rolling around too long in the nebulous possibilities of inspiration and spring.</p><p>the work, then, is to be <em>in</em> the dance — to move seamlessly between the rhythms, the melodies, harmonies, and to savor the silences of the creative process. </p><p>to move between rhythms and seasons — even multiple times a day. </p><p>always, the first step begins with being present with what feels alive in you. </p><p>what season are you in, right now? </p><p>which rhythm do you want to move to, today? this moment? </p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><strong>see related:</strong></p><p><a href=\"https://keningzhu.com/journal/declogging-your-creative-workflow\" target=\"_blank\">declogging your creative workflow</a><br /><a href=\"https://keningzhu.com/journal/the-lifecycle-of-a-creative-project\" target=\"_blank\">the lifecycle of a creative seed</a><br /><a href=\"https://keningzhu.com/journal/how-to-grow-a-vision\" target=\"_blank\">how to grow a vision: the cyclical path of unfolding</a></p><p></p><p><em>💌 I write a weekly newsletter on creative alchemy called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>. Find me also on my podcast: </em><a href=\"https://keningonline.squarespace.com/podcast\" target=\"_blank\"><em>botanical studies of internet magic</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n  ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"9e1bd6811fd747fb0ca1362f3c182d009b70dc05d1114e75675859d56d971b0e","category":"Sites"}