{"title":"Pedestals prevent friendships.","link":"https://sive.rs/pedestal","date":1518480000000,"content":"<p>\nI was a struggling musician, with big ambitions but not much success, when I went to a music industry conference in Las Vegas to promote my music.\n</p><p>\nI was nervous, but doing everything I could to make connections with the managers at all the big music companies.\nI attended every panel of experts, noting everyone’s name, and approaching the stage afterwards to introduce myself.\n<strong>\nI had these people up on a pedestal.\nI was terrified of them.\n</strong>\nThe stakes were high.\nThese were the people who could make my career.\nIt was mentally and emotionally exhausting.\n</p><p>\nSo during lunch I went out to the pool and stuck my feet in the water, just to silently retreat.\nSome dude sat next to me and did the same.\nHe said, “I see you’ve noticed the bikini girls, too.”\nI had.\nSo we sat there, feet in the pool, talking about those girls over there, how weird Las Vegas is, how his friend was up all night gambling, and other random chit-chat.\nHe was a really cool dude — the rare kind I just click with right away.\nI assumed he must be a fellow musician.\n</p><p>\nBut when he got up to leave, he said, “Really great talking with you. Let’s keep in touch,” and handed me his business card.\nHoly shit!\nHe was the vice president of one of the biggest record labels!\n</p><p>\nI learned a huge lesson that day.\n</p><p>\n<strong>\nIf I would have known who he was in advance, I never would have had a real conversation with him.\n</strong>\nI would have been awkward and self-conscious, trying to promote myself.\nBut because I didn’t know, I could connect on a personal level, and be a real friend.\n</p><p>\nI used to think that having connections in the music industry meant that you’d have business meetings, and only talk about your mutual business interests.\nBut again and again I’ve realized that we make real connections by talking about anything else, and just clicking as friends.\n<strong>\nPeople send business to people they like.\n</strong>\n</p><p>\nSo beware of putting people on a pedestal.\nIt can prevent a real friendship.\n</p><p>\nPostscript to this story:\nWe kept in touch, and he ended up sending me some of my most successful CD Baby clients.\nNow, twenty years later, I just emailed him to tell him I’m writing this story.\n</p>\n<img src=\"/images/pedestal.jpg\" title=\"https://www.flickr.com/photos/caochopp/7028335609\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9e8c7447b228366dcfb8d15c41b9430809081ae2f51abea213d641470b5b7638","category":"Sites"}