{"title":"“The Simple Macroeconomics of AI”","link":"https://feeds.feedblitz.com/~/882086129/0/marginalrevolution~The-Simple-Macroeconomics-of-AI.html","date":1713676748000,"content":"<p>That is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://economics.mit.edu/sites/default/files/2024-04/The%20Simple%20Macroeconomics%20of%20AI.pdf\" target=\"_blank\">the new Daron Acemoglu paper</a>, and he is skeptical about its overall economic effects.  Here is part of the abstract:</p>\r\n<blockquote><p>Using existing estimates on exposure to AI and productivity improvements at the task level, these macroeconomic effects appear nontrivial but modest—no more than a 0.71% increase in total factor productivity over 10 years. The paper then argues that even these estimates could be exaggerated, because early evidence is from easy-to-learn tasks, whereas some of the future effects will come from hard-to-learn tasks, where there are many context-dependent factors affecting decision-making and no objective outcome measures from which to learn successful performance. Consequently, predicted TFP gains over the next 10 years are even more modest and are predicted to be less than 0.55%.</p></blockquote>\r\n<p>Note he is not suggesting TFP (total factor productivity, a measure of innovation) will go up by 0.71 percentage points (a plausible estimate, in my view), he is saying it will go up 0.71% over a ten year period, or by 0.07 annually.  Here is the explanation of method:</p>\r\n<blockquote><p>I show that when AI’s microeconomic effects are driven by cost savings (equivalently, productivity improvements) at the task level—due to either automation or task complementarities—its macroeconomic consequences will be given by a version of Hulten’s theorem: GDP and aggregate productivity gains can be estimated by what fraction of tasks are impacted and average task-level cost savings. This equation disciplines any GDP and productivity effects from AI. Despite its simplicity, applying this equation is far from trivial, because there is huge uncertainty about which tasks will be automated or complemented, and what the cost savings will be.</p></blockquote>\r\n<p>Mostly I think this piece is wrong, and I think it is wrong for reasons of economics.  It is not that I think the estimate is off, I think the method is misleading altogether.</p>\r\n<p><a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://scholar.harvard.edu/files/melitz/files/jep_final.pdf\" target=\"_blank\">As with international trade</a>, a lot of the benefits of AI will come from getting rid of the least productive firms from within the distribution.  This factor is never considered.</p>\r\n<p>And as with international trade, a lot of the benefits of AI will come from “new goods,”  Since the prices of those new goods previously were infinity (do note the degree of substability matters), those gains can be much higher than what we get from incremental productivity improvements.  The very popular <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://character.ai/\" target=\"_blank\">Character.ai</a> is already one such new good, not to mention I and many others enjoy playing around with LLMs just about every day.</p>\r\n<p>By the way, the core model of this paper — see pp.6-7 — postulates only a single good for the economy.  Mention of the contrary case does surface on p.11, and starting with p.19, where most of the attention is devoted to bad new goods, such as more effective manipulation of consumers.  Note the paper doesn’t have any empirical argument as to why most new AI goods might be bad for social welfare.</p>\r\n<p>pp.34-35 focus on the possibility of a public goods problem for AI use, similar to what has been suggested for social media.  That discussion seems very far from both current practices with AI and most of the speculation from AI experts.  Do I have to use Midjourney because all of my friends do, and I wish the whole thing didn’t exist?  Or rather do I simply find it to be great fun, as do many people when they create their own songs with AI?  It is dubious to play up the prisoner’s dilemma effects so much, but Acemoglu returns to this point with much force in the conclusion.</p>\r\n<p>Toward the end he writes:</p>\r\n<blockquote><p>Productivity improvements from new tasks are not incorporated into my estimates. This is for three reasons. First and most parochially, this is much harder to measure and is not included in the types of exposure considered in Eloundou et al. (2023) and Svanberg et al. (2024). Second, and more importantly, I believe it is right not to include these in the likely macroeconomic effects, because these are not the areas receiving attention from the industry at the moment, as also argued in Acemoglu (2021), Acemoglu and Restrepo (2020b) and Acemoglu and Johnson (2023). Rather, areas of priority for the tech industry appear to be around automation and online monetization, such as through search or social media digital ads. Third, and relatedly, more beneficial outcomes may require new institutions, policies and regulations, as also suggested in Acemoglu and Johnson (2023) and Acemoglu et al. (2023).</p></blockquote>\r\n<p>While many of the points in that paragraph seem outright wrong to me (such as the industry attention point), what he can’t bring himself to say is that the gains from such new tasks will in fact be small.  Because they won’t be.  But whether or not you agree, what is going on <em>in the paper</em> is that the gains from AI measure as small because it is <em>assumed</em> AI will not be doing new things.  I just don’t see why it is worth doing such an exercise.</p>\r\n<p>A more general question is whether this model can predict that TFP moves around <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.frbsf.org/research-and-insights/data-and-indicators/total-factor-productivity-tfp/\" target=\"_blank\">as much as it does</a>.  I am pretty sure the answer there is “no,” not anywhere close to that.</p>\r\n<p>On the general approach, I found this sentence (p.4) very odd: “…my framework also clarifies that what is relevant for consumer welfare is TFP, rather than GDP, since the additional investment comes out of consumption.”  I would say what is relevant for consumer welfare is the sum of consumer and producer surpluses, of which TFP is not a sufficient statistic.  This unusual “redefinition of all welfare economics in a single sentence” perhaps follows from how many other gains from trade he has abolished from the system?  And footnote six is odd and also wrong: “For example, if AI models continue to increase their energy requirements, this would contribute to measured GDP, but would not be a beneficial change for welfare.”  Even for dirty energy that might be wrong, not to mention for green energy.  If an innovation induces the market to invest more in a service, the costs of that added investment simply do not scuttle the gains altogether.  And if Acemoglu wants to argue that weird welfare economics is true in his model, that is a good argument against his model, not a good argument that such gains would not count in the real world, which is what this paper is supposed to be about.</p>\r\n<p>Acemoglu explicitly rules out gains from doing better science, as they may not come within the ten-year time frame.  On that one, he is the prisoner of his own assumptions.  If many gains come in say years 10-15, I would just say the paper is misleading, even if his words are defensible in the purely literal sense.</p>\r\n<p>That said, just how much does the “no new science” clause rule out?  In terms of an economic model, how does “new science” differ from “TFP”?  I am not sure, not are we given clear guidance.  Is better software engineering “new science”?  Maybe so?  Won’t we get a lot of that within ten years?  Don’t we have some of it already?</p>\r\n<p>In sum, I don’t think this paper at all establishes the “small gains point” it is trying to promote in the abstract.</p>\r\n<p>It is perfectly fair to point out that the optimists have not shown large gains, but in this paper the deck is entirely — and unfairly — stacked in the opposite direction.</p>\r\n<p>For the pointer I thank Gabriel.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html\">“The Simple Macroeconomics of AI”</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/882086129/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/882086129/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/882086129/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/882086129/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/882086129/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/882086129/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comment-160747316\">In reply to M.   I didn’t get the «  new goods «  ...</a> <i>by mento</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comment-160747313\">In reply to Anoniemoose.   Maybe, but this stuff is getting ...</a> <i>by Anon</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comment-160747312\">In reply to Marshall.   That would be a dream, but I am ...</a> <i>by AI - the Over...</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comment-160747311\">In reply to driver Benny.   &gt; I have heard of at least one call ...</a> <i>by PHinton</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comment-160747308\">In reply to Anoniemoose.   I'm not a programmer. I took one ...</a> <i>by Dylan</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-simple-macroeconomics-of-ai.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/south-africa-fact-of-the-day.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=south-africa-fact-of-the-day\">South Africa fact of the day</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/dwarkesh-interviews-mark-zuckerberg-on-llama-3-and-more.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=dwarkesh-interviews-mark-zuckerberg-on-llama-3-and-more\">Dwarkesh interviews Mark Zuckerberg on Llama 3 and more</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/the-shortage-of-housing-and-the-rising-numbers-of-houses-per-capita.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-shortage-of-housing-and-the-rising-numbers-of-houses-per-capita\">Why a Housing Shortage Exists Despite More Houses Per Person</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"9e90f42cfe51cbaa9b9d9a37ddf761a4ddac7cba2cf13ce52239f1b7538f4d61","category":"default"}