{"title":"Trump&#8217;s Historically Small Victory","link":"https://kottke.org/24/11/trumps-historically-small-victory","date":1731946317000,"content":"\n        <p>I honestly did not read most of <a href=\"https://www.nytimes.com/2024/11/17/us/politics/trump-signals-a-seismic-shift-shocking-the-washington-establishment.html?unlocked_article_code=1.a04.OrYT.YjB9aG72XlFf\">this article</a>, but I wanted to draw your attention to some facts about the recent presidential election that you might find surprising:</p>\n\n<blockquote><p>While Mr. Trump won the popular vote for the first time in three tries, he garnered just 50.1 percent nationally, according to the latest tabulation by The Times, just 1.8 percentage points ahead of Vice President Kamala Harris. When the slow-counting blue giant of California finally finishes tallying its votes, that margin is likely to shrink a bit more. The Cook Report already calculates that his percentage has fallen below 50 percent, meaning he did not win a majority.</p>\n\n<p>Wherever it eventually falls, Mr. Trump’s margin of victory in the national popular vote will be one of the smallest in history. Since 1888, only two other presidents who won both the Electoral College and the popular vote had smaller margins of victory: John F. Kennedy in 1960 and Richard M. Nixon in 1968. (Both Mr. Trump in 2016 and George W. Bush in 2000 won the Electoral College, and therefore the presidency, without winning the popular vote.)</p>\n\n<p>Mr. Trump can boast that he increased his margin in the Electoral College, winning 312 votes this year to the 306 he garnered eight years ago. But according to nearly complete totals, he secured his most recent victory by just a cumulative 237,000 votes in three states that, had they gone the other way, would have meant victory for Ms. Harris.</p></blockquote>\n\n<p>It’s fine for Trump to crow about his massive election win, but everyone else should realize how historically small his victory actually was. And how he might not have won at all if not for the pressure the Republicans have put on our systems of voting over the past decades (all manner of voter suppression), the billionaires propping up his campaign with hundreds of millions of dollars when he couldn’t keep pace with his opponent in non-PAC fundraising, and the will of post-pandemic voters worldwide who wanted the incumbents out no matter what. Mandate schmandate.</p>\n\n<p><strong>Note:</strong> You wouldn’t even need all of those “cumulative 237,000 votes” to go the other way — all you’d need is half + 1. So we’re talking about ~118,500 voters out of ~155 million. That’s <em>razor thin</em>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Kamala%20Harris\">Kamala Harris</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/USA\">USA</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"9e910ff8fc2a944eebc98090dc6d4cc1c0145b2abea5e16196b824dcad1b82c7","category":"Sites"}