{"title":"Happy, Smart, and Useful","link":"https://sive.rs/hsu","date":1456963200000,"content":"<img src=\"/images/hsu.gif\" />\n<p>\nThere are three things to consider when making life-size decisions:\n</p><ul><li>\nWhat makes you happy\n</li><li>\nWhat’s smart — meaning long-term good for you\n</li><li>\nWhat’s useful to others\n</li></ul><p>\nWe have a tendency to forget one of these.\nFor example:\n</p><h3>\nSmart and useful (but not happy)\n</h3><p>\nThis is the stereotype of the strict parent who says, “You will go to the best school, get perfect grades, get a degree in law or medicine, and make lots of money. What you want does not matter. This is what’s best for you and your family.”\n</p><p>\nSmart and useful isn’t bad.\nIt’s rational, like a machine.\n<strong>\nBut happiness is the oil.\n</strong>\nWithout it, the friction kills the engine.\n</p><h3>\nHappy and smart (but not useful)\n</h3><p>\nThis is the stereotype of the “lifestyle design” or self-help addict: always learning, always improving, and obsessively focused on how to be happy and create the perfect life.\n</p><p>\nThey look for “passive income” instead of focusing on doing something that’s <a href=\"https://sive.rs/starv\">really valuable to others</a>.\n</p><p>\nHappy and smart isn’t bad.\nThe self-focus feels great at first.\nBut you can’t actually <a href=\"https://en.wiktionary.org/wiki/pull_oneself_up_by_one%27s_bootstraps\">pull yourself up by your bootstraps</a>.\n<strong>\nUltimately you must be lifted by those around you.\n</strong>\n</p><h3>\nHappy and useful (but not smart)\n</h3><p>\nThis is the stereotype of charity volunteers.\nAfter getting expensive university degrees, they spend years flying to exotic impoverished places to dig wells and thatch roofs.\n</p><p>\nBut if a graduate’s time could be worth $200 per hour, yet they’re doing work that locals could do better for $10 per hour (and without airfare and hotels), then they’re actually doing a disservice to others.\n(For more thoughts on this, find two articles online: “<a href=\"https://www.lesswrong.com/posts/pC47ZTsPNAkjavkXs\">Efficient Charity: Do Unto Others</a>” and “<a href=\"https://medium.com/the-development-set/the-reductive-seduction-of-other-people-s-problems-3c07b307732d\">The Reductive Seduction of Other People’s Problems</a>.”)\n</p><p>\nIn this same category are people who stay at the same jobs for life without improvement, and the musicians who always perform at the local venues but never make good recordings.\n</p><p>\nHappy and useful isn’t bad.\nThese people are doing good for the world, so it’s hard to find fault.\n<strong>\nThey have great intentions but lame strategies — wasted effort and unused potential.\n</strong>\n</p><h3>\nJust happy (not smart or useful)\n</h3><p>\nThis is the <a href=\"https://duckduckgo.com/?q=mexican+fisherman+american+business\">parable of the Mexican fisherman</a>.\n</p><p>\nSome say, “Just be happy. That’s all that matters.”\nIt sounds so simple, it must be profoundly true, right?\n</p><p>\nBut, as in Aesop’s fable of “<a href=\"https://duckduckgo.com/?q=ant+grasshopper+fable\">The Ant and the Grasshopper</a>,” you’ll be full of regret if you think of nothing but today and don’t prepare for tough times.\n</p><p>\nAnd you’ll be very unrewarded if you serve only yourself, not others.\n</p><h3>\nSo…?\n</h3><p>\nWhen life or a plan feels ultimately unsatisfying, I find it’s because I’ve forgotten to find the intersection of all three:\n</p><ul><li>\nWhat makes me happy\n</li><li>\nWhat’s smart\n</li><li>\nWhat’s useful to others\n</li></ul>\n<img src=\"/images/hsu.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9ea92bb86ec87b05e896100019f076e4d381e733a200fcc58b72b6e93343b1ea","category":"Sites"}