{"title":"Future, Civilization & Change","link":"https://om.co/2024/03/05/future-civilization-change/","date":1709656260000,"content":"<pre>What is dystopia? <br />What is technology? <br />What is progress? <br />What is society? <br />What is civilization?</pre>\n\n\n\n<p>It’s all a moving target. What seems like dystopia, seems normal eventually. I was reminded of this when I read a piece by Mahatma Gandhi, originally published in 1909. He was writing about a future now all too present around us. Everything is all about change. Eventually, the future dystopia becomes the new normal now.</p>\n\n\n\n<span></span>\n\n\n\n<blockquote>\n<p>Formerly the fewest men wrote books that were most valuable. Now anybody writes and prints anything he likes and poisons people’s minds. </p>\n\n\n\n<p>It has been stated that, as men progress, they shall be able to travel in airships and reach any part of the world in a few hours. Men will not need the use of their hands and feet. They will press a button and have their clothing by their side. They will press another button and have their newspaper. A third, and a motor­car will be waiting for them. They will have a variety of delicately dished-up food. Everything will be done by machinery. </p>\n\n\n\n<p>They are obliged to work, at the risk of their lives, at most dangerous occupations, for the sake of millionaires. Formerly men were made slaves under physical compulsion; now they are enslaved by the temptation of money and of the luxuries that money can buy. There are now diseases of which people never dreamed before, and an army of doctors is engaged in finding out their cures, and so hospitals have increased. This is a test of civilization. </p>\n\n\n\n<p>Formerly special messengers were required and much expense was incurred in order to send letters; today anyone can abuse his fellow by means of a letter for one penny. True, at the same cost, one can send one’s thanks also. Formerly people had two or three meals consisting of homemade bread and vegetables; now they require something to eat every two hours, so that they have hardly leisure for anything else. <br /><br />These are all true tests of civilization. And if anyone speaks to the contrary, know that he is ignorant. This civilization takes note neither of morality nor of religion. Its votaries calmly state that their business is not to teach religion. Some even consider it to be a superstitious growth. Others put on the cloak of religion and prate about morality. </p>\n\n\n\n<p>But after twenty years’ experience, I have come to the conclusion that immorality is often taught in the name of morality. Even a child can understand that in all I have described above there can be no inducement to morality. <strong>Civilization seeks to increase bodily comforts, and it fails miserably even in doing so.<br /><br />Mahatma Gandhi / </strong><a href=\"https://laphamsquarterly.us2.list-manage.com/track/click?u=8be778c42e715e178d4dca04e&amp;id=7365899d9a&amp;e=2f817a6f1e\">Civilization</a></p>\n</blockquote>\n\n\n\n<p>March 5, 2024, San Francisco</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"9ebf4e331aa41d4541ae7cddb294047dc8e3a3bf656ba02bac1fe940823aa869","category":"default"}