{"title":"Twitter","link":"https://blog.webb.page/2023-07-17-twitter.txt","date":1689552000000,"content":"<p>I've been banned from Twitter.</p>\n<p>It happened suddenly, without warning. After dinner, I loaded up Twitter for\nsomething and saw:</p>\n<p>Your account is suspended\nAfter careful review, we determined your account broke the Twitter Rules.\nYour account is permanently in read-only mode, which means you can’t Tweet,\nRetweet, or Like content. You won’t be able to create new accounts. If you\nthink we got this wrong, you can submit an appeal.</p>\n<p>The (indefinite) suspension email:\nYour account, NetOpWibby has been suspended for violating the Twitter Rules.\nSpecifically, for: <strong>Violating our rules against platform manipulation and\nspam.</strong>\nYou may not use Twitter’s services in a manner intended to artificially amplify\nor suppress information or engage in behavior that manipulates or disrupts\npeople’s experience on Twitter. Note that if you attempt to evade a suspension\nby creating new accounts, we will suspend your new accounts. If you wish to\nappeal this suspension, please contact our support team.</p>\n<p>I've since sent two appeals, the first basically confused and the second,\ninquiring which tweets fell under \"platform manipulation and spam.\"</p>\n<p>Twitter's reply to both appeals:\nYour account was suspended due to violations of our Terms of Service. After\nreviewing for reinstatement your account will not be restored.</p>\n<p>I have a couple ideas as to what Twitter could <em>possibly</em> mean by \"platform\nmanipulation and spam.\" Bit of a reach IMHO, but hey.</p>\n<p>The first is my usage of the hashtag, \"#StoppableDomains.\" If that sounds\nfamiliar, you're probably thinking of Unstoppable Domains.</p>\n<p>From DomainNameWire<a href=\"https://domainnamewire.com/2022/07/20/unstoppable-domains-threatens-rival-handshake-domain-name/\">1</a>:</p>\n<blockquote>\n<p>Blockchain domain name company Unstoppable Domains has threatened to sue a\nHandshake domain name service for offering registrations under the .wallet\nHandshake domain name.</p>\n</blockquote>\n<p>Basically, Unstoppable thought they could use the might of their VC dollars to\nbully a company and the blockchain it's built on, into submission. I happen to\nenjoy that blockchain quite a bit, so that's where my beef comes in.</p>\n<p>Using the hashtag #StoppableDomains, I also exposed UD's sketchy W3DA, or,\n\"Web3 Domain Alliance,\" which is actually just a vehicle for them to legitimize\nfuture lawsuits and protect pending trademarks. Did you know they filed for\n\"Bitcoin\"?<a href=\"https://tsdr.uspto.gov/#caseNumber=97095196&amp;caseType=SERIAL_NO&amp;searchType=statusSearch\">2</a> In five countries? A company, built on Ethereum, trying to\ntrademark the <strong>original</strong> blockchain. These folks are nuts. But I digress, my\ninitial blog post on the topic is here.<a href=\"https://blog.neuenet.com/post/stoppable-domains\">4</a> I just wish I took screenshots of\nall my tweets or put them on Wayback Machine.</p>\n<p>When you're suspended, all of your tweets disappear. All that investigative\nwork, gone. GG</p>\n<p>My second theory is, maybe I mentioned too many other social networks in one\ntweet. I recently got an invite to Farcaster and have been loving it, so I\ntweeted about it, comparing it to Bluesky and Mastodon. Can you get banned over\nsomething like that? Who knows, it's Elon's world over there.</p>\n<p>In any event, this ban feels retaliatory. I'm unable to concieve how this could\nhappen, accidentally. I didn't have a lot of followers and certainly never had\nviral tweets. I'm frustrated because I've been on the site since 2009…that's\n14 years ago. I'm unable to even export my data. It's gone, wiped.</p>\n<p><em>spends a few minutes searching computer for possible exports</em></p>\n<p>My last Twitter export is from November of last year so at least I have\nmost of it.</p>\n<p>If nothing else, this experience highlights the need for cultivating your own\nspace online. Thankfully, I'm technical, so writing this blog post and SFTP'ing\n(shh, I know I know) it to my server isn't a big deal. I'm also not enthused\nabout using any of my other (14) Twitter accounts (most of them placeholders\nfor future or postponed products). I've already intended to get back to working\non my paid social network<a href=\"https://socii.network\">5</a> after I launch the registry<a href=\"https://neuenet.com\">6</a> and registrar<a href=\"https://twitter.com/beachfront_\">7</a>\nfor my Handshake TLDs and now I'm motivated to work harder.</p>\n<p>SIGH.</p>\n<p>End of an era. 🕸️</p>\n<p>P.S. Oh good, my #StoppableDomains tweets were in my 2022 export.<a href=\"https://imgur.com/gallery/VhG3uC6\">8</a></p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"9eddf1d416ce7e663f7e7962625b8148a9522322f7e61c1efa5c3d02544bb8fe","category":"Sites"}