{"title":"Vitalik: An Ethereum Story","link":"https://www.usv.com/writing/2024/07/vitalik-an-ethereum-story/","date":1721765519000,"content":"<p>For the past several years my wife Carrie has been working with Optimist and Linda Xie to make a documentary film about Vitalik Buterin , the creator of Ethereum.</p>\n<p>Inspired by what they learned, they have developed the film in a crypto-native way and will release it in a similar fashion. In 2021, they raised funds for the film through a pplpleasr NFT crowdfund on Mirror (a USV company that has since merged with Paragraph, another USV company).</p>\n<p>pplpleasr NFT for the film They plan to continue to release the film and a variety of other associated stories onchain through a combination of mints on Zora and Base. They have thoughtfully detailed their release plan in this post . The gist is summed up in the article:</p>\n<p>Minting the trailer, tickets and ancillary content for the film not only unlocks viewing access but will help to fund the feature documentary’s self-release in theaters and on streaming platforms worldwide, making it accessible to people both within and outside of the crypto space…</p>\n<p>…By harnessing the power of crypto for the film’s trailer, ancillary content and ticketing, we’re creating a distribution model that gives the community direct access to the film while funding a decentralized release of Vitalik: An Ethereum Story in theaters around the world and on a traditional streaming platform.</p>\n<p>This is a film that is pioneering a new model in how stories can be financed, distributed and experienced. It has been inspiring to watch how this plan has evolved in conjunction with the growth of web3. Today, the team released the trailer for the film, which is now available to mint . Soon, tickets for the film will be available for purchase onchain, and the film will premiere IRL in theaters across the globe. Ultimately, it will be distributed on traditional streaming platforms, but the Ethereum community and anyone who wants to will be able to experience it together in person and online beforehand.</p>\n<p>film trailer I’m excited for the world to see this film and to watch how creators all over the world can learn from this model, build on top of it, and transform the way film and other types of content and art are funded, distributed, and owned in the future.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/vitalik-an-ethereum-story/\">Vitalik: An Ethereum Story</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"9f474645bdd7d6d80829d1c8d55f4879dfc0d539c43a368cf303c46b152166d7","category":"default"}