{"title":"walk and talk","link":"https://sive.rs/wt","date":1702339200000,"content":"<p>\n<a href=\"https://kk.org\">Kevin Kelly</a> invited me to walk 100 kilometers (62 miles) through northern Thailand for seven days, ending in Chiang Mai.\nWalking with us were ten other smart interesting people, including five other authors whose work I’ve loved for years.\nIt’s a “Walk and Talk”.\n</p><p>\nOne of the walkers lives in Thailand, speaks Thai, and made all the local arrangements, scoping the track in advance.\nTwo of the walkers had done this many times before, in Uzbekistan, Spain, Japan, and China.\nThe rest of us were in good hands, going with the flow of the unknown.\n</p><p>\nA sweet wild dog joined our pack halfway through, walking and sleeping with us for four days and 70km, until we brought him to a vet at the end, and found him a good permanent home.\n</p><p>\nRead the write-ups by <a href=\"https://danwang.co/2023-letter/\">Dan Wang</a>, <a href=\"https://craigmod.com/ridgeline/175/\">Craig Mod</a>, <a href=\"https://kottke.org/23/12/where-do-you-call-home\">Jason Kottke</a>, and <a href=\"https://bobulate.com/2023/12/expanding-home/\">Liz Danzico</a>, who were also on this walk, and go into more depth than I do here.\n</p><p>\n<strong>\nI highly recommend this activity and format.\n</strong>\nYou can start one yourself.\nIt goes like this:\n</p>\n<p><strong>UPDATE:</strong>\nKevin Kelly and Craig Mod released their <a href=\"https://kk.org/thetechnium/files/2023/12/howtowalkandtalk.pdf\">“Walk and Talk: Everything We Know” PDF</a> which is much more thorough and helpful than my brief overview, below.  <a href=\"https://kk.org/thetechnium/files/2023/12/howtowalkandtalk.pdf\">Download it here</a>.\n</p>\n<hr />\n<ol><li>\nChoose <strong>where</strong> to walk — somewhere with lodging for 8 people every 15 km — where someone else can drive everyone’s bags from place to place.\n</li><li>\nSomeone (local person or business) walks it all in advance to make sure it’s actually good.\nThis person is the navigator.\n</li><li>\nMake a shared document of details of where to meet and what to bring, a group chat for questions, and a shared place to upload photos afterwards.\n</li><li>\nInvite a <strong>diverse group of conversationalists</strong> — ideally eight.\nWalkers send money to the local navigator to pre-pay for the lodging and meals.\n</li><li>\nMeet at the initial hotel for dinner and introductions.\n</li><li>\n<strong>Walk together for the next 6-7 days</strong> — ideally without phones — about <strong>3-5 hours of walking per day</strong>, led by the navigator, with long breaks every two hours.\nEveryone naturally goes in and out of little 2-3 person conversations while walking.\n</li><li>\nEvery night over a private dinner, the entire group has <strong>a single conversation around one subject</strong>, which the group chose the night before.\nEveryone stays involved in this one conversation, exploring one topic to exhaustion.\n</li></ol>\n<p>\nDuring this Thailand walk, our nightly conversation topics were:\n</p><ul><li>\nHow do you stay motivated?\n</li><li>\nWhat do you escape or resist?\n</li><li>\nWhat does home mean to you?\n</li><li>\nShocking solutions to public problems.\n</li><li>\nTell us about a failure.\n</li><li>\nFrameworks to make big decisions.\n</li><li>\nWhat is your health regime?\n</li><li>\nHow do you use lists?\n</li><li>\nWhat do you believe that your heroes do not?\n</li></ul>\n<p>\nSome people spout their thoughts as soon as they come to mind.\nOther people need to be persuaded to share.\nIt helps to <strong>moderate the conversation</strong> to keep the contributions balanced.\n</p><p>\nMore than half of the conversations were during the day, one-on-one, while walking or resting.\nIt’s wonderful that you can come back to something someone said a day or two before, and share more thoughts or questions that came to you overnight.\n</p><p>\nIt’s one of the best things I’ve ever done.\n<strong>\nVery healthy for your brain, body, and friendships.\n</strong>\nI highly recommend it for anyone.\n</p><p>\nI plan to host some in the future.\n<strong>If you know a good place to do a “walk and talk”</strong>, (see criteria #1 above), please leave a suggestion in the comments here.\n</p>\n\n<figure>\n<img src=\"/images/thaidog-2.jpg\" alt=\"Thai dog photo by Craig Mod\" />\n<img src=\"/images/thaidog-1.jpg\" alt=\"Thai dog photo by Craig Mod\" />\n<img src=\"/images/thaidog-3.jpg\" alt=\"Thai dog photo by Craig Mod\" />\n<figcaption>\nThis is the wild dog that adopted us.\nI love him and miss him.\nPhotos by <a href=\"https://craigmod.com/\">Craig Mod</a>.\n</figcaption></figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"9fc43c45ac09e38a68d72195b775db3655e9c23e7946373fb952e410b597f4b1","category":"default"}