{"title":"Universal Healthcare","link":"https://www.usv.com/writing/2024/11/universal-healthcare/","date":1732537729000,"content":"<p>Universal healthcare is a doctor that:</p>\n<p>you can speak with 24/7, is infinitely patient, and never rushes you</p>\n<p>has access to all of the latest medical knowledge and literature</p>\n<p>has a superb bedside manner</p>\n<p>can communicate with you however and whenever you want: text, voice, or video</p>\n<p>knows all about your medical history and doesn’t have to ask you the same question twice</p>\n<p>has memorized the results of all the medical tests you’ve had</p>\n<p>focuses on keeping you healthy and proactively checks in on you</p>\n<p>has breadth and depth – it can be your primary care physician and a specialist</p>\n<p>can create a personalized wellness plan that’s unique to you and help you stick to it</p>\n<p>is free to interact with or as close to free as possible</p>\n<p>This is universal healthcare, and it’s around the corner. It will be available to everyone.</p>\n<p>OpenAI, Anthropic, and Gemini are already better at diagnosing conditions than most doctors. They have better bedside manners, too.</p>\n<p>They and Consensus are the doctors I turn to first when I have a medical question for myself or my family.</p>\n<p>I feed the results of my lipid panels to them and ask them what I should do to improve my biomarkers, and I get answers that are just as good as those of doctors I know and trust.</p>\n<p>The foundational models already have the wisdom and wherewithal to deliver personalized healthcare to everyone with an internet connection. They just need a friendly wrapper and trusted UX (likely one that is heavy on voice ). It’s time to make it so.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/universal-healthcare/\">Universal Healthcare</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"9fd100967de597868bc4ec2d59c647a29b0c2e1c02f194ab60b4f45faaf8029d","category":"Sites"}