{"title":"An Excerpt of Sally Rooney&#8217;s Intermezzo","link":"https://kottke.org/24/07/an-excerpt-of-sally-rooneys-intermezzo","date":1719841229000,"content":"\n        <p>For their fiction issue, the New Yorker has <a href=\"https://www.newyorker.com/magazine/2024/07/08/opening-theory-fiction-sally-rooney\">an exclusive excerpt</a> from <a href=\"https://www.amazon.com/exec/obidos/ASIN/0374602638/ref=nosim/0sil8\">Sally Rooney’s forthcoming book, Intermezzo</a>.</p>\n\n<blockquote><p>Ivan is standing on his own in the corner while the men from the chess club move the chairs and tables around. The men are saying things to one another like: Back a bit there, Tom. Mind yourself now. Alone, Ivan is standing, wanting to sit down but uncertain which of the chairs need to be rearranged still and which are in their correct places already. This uncertainty arises because the way in which the men are moving the furniture corresponds to no specific method Ivan has been able to discern. A familiar arrangement is slowly beginning to emerge — a central U shape composed of ten tables, with ten chairs along the outer rim of the shape, and a general seating area around the outside — but the process by which the men are reaching this arrangement seems haphazard. Standing on his own in the corner, Ivan thinks with no especially intense focus about the most efficient method of arranging, say, a random distribution of a given number of tables and chairs into the aforementioned shape. It’s something he has thought about before, while standing in other corners, watching other people move similar furniture around similar indoor spaces: the different approaches you could use, if you happened to be writing a computer program to maximize process efficiency. The accuracy of these particular men would be, Ivan thinks, pretty low, like actually very low.</p></blockquote>\n\n<p>You can also <a href=\"https://pod.link/geZrW/episode/b017df8213c240a33edb860881834ad4\">listen to Rooney reading the excerpt</a>. You can preorder Intermezzo at <a href=\"https://www.amazon.com/exec/obidos/ASIN/0374602638/ref=nosim/0sil8\">Amazon</a> or <a href=\"https://bookshop.org/a/2966/9780374602635\">Bookshop</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Intermezzo\">Intermezzo</a> · <a href=\"https://kottke.org/tag/Sally%20Rooney\">Sally Rooney</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/07/an-excerpt-of-sally-rooneys-intermezzo\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"a0971a52e6778039b76033f034e9a2a56af79b35ab6dcb07c34cd6da92b230b9","category":"default"}