{"title":"(Midweek Edition) Field Notes 06.26.2024","link":"https://om.co/2024/06/26/midweek-edition-field-notes-06-26-2024/","date":1719439200000,"content":"<figure><img width=\"1024\" height=\"768\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-1024x768.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-1024x768.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-300x225.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-768x576.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-1536x1152.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-2000x1500.jpg 2000w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-192x144.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-1100x825.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-560x420.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580-1800x1350.jpg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/06/IMG_1580.jpg 2048w\" /></figure>\n\n\n\n<h4>On My Mind</h4>\n\n\n\n<p>I recently shared on Threads the following: </p>\n\n\n\n<blockquote>\n<p>“Social Media is like a mirror that makes objects appear bigger than they really are. It amplifies what was already there.” </p>\n</blockquote>\n\n\n\n<p>To expound on it a bit further, what I mean is that no matter what we do, somehow we let our true selves out. No amount of image management is going to prevent you from being you. If you’re a smart person, social media only amplifies that. If you’re a jerk, then you’ll act like a bigger jerk. And you’ll do it to attract more attention. If you’re a nice person, you’ll retreat to your small circle of niceness.</p>\n\n\n\n<p>What we see on social media is often an exaggerated version of reality, not reality itself. Social media is a funhouse mirror that distorts our reflection, often making it appear larger than life. This is reinforced to me everyday when I come across comments and commentary on social media from people I know or have known in real life.</p>\n\n\n\n<hr />\n\n\n\n<blockquote>\n<p>“If a writer wants to play around with AI as the writer and see if it helps him, I mean, I regard it as no different than him having a thesaurus or a dictionary on his desk or a book of quotable quotes. Play around with it.” David Simon, creator of The Wire in a <a target=\"_blank\" href=\"https://www.npr.org/2023/05/19/1177194215/tv-writer-david-simon-weighs-in-on-the-writers-guild-of-america-strike\">conversation with NPR.</a></p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<h4><strong>Noted: </strong></h4>\n\n\n\n<ul>\n<li>Fantasy Chess? Now We’re Talking: Chess superstar Magnus Carlsen <a href=\"https://archive.is/L8cGo\" target=\"_blank\">has launched “Fantasy Chess” and</a> raised $3 million in funding from SNÖ Ventures, Coatue, Yuri Milner and Peter Thiel. The startup aims to bring fantasy sports and streaming to the world of chess. Mats André Kristiansen will serve as CEO. Fantasy Chess will offer ways for fans to engage with top players and tournaments. The online realm has been a significant boost for chess. This startup should be an interesting one to watch.</li>\n\n\n\n<li>ICC (the cricket governing body) has a new app for Vision Pro. <a href=\"https://www.icc-cricket.com/tournaments/t20cricketworldcup/news/icc-unveils-revolutionary-icc-immersive-app-for-fans?appview=true\" target=\"_blank\"><em>“ICC Immersive”</em></a> is uninspired, boring and, well, forgettable. </li>\n\n\n\n<li><a href=\"http://smashing.xyz\">Smashing</a>, a new AI-assisted reader app from Goodreads founder Otis Chandler, <a href=\"https://www.prnewswire.com/news-releases/daily-reader-labs-announces-smashing-an-easier-way-to-find-content-you-love-302181836.html\">launched this week</a>. It is backed by True Ventures (where I am a partner emeritus.) I have participated in the beta. And I like what they have done so far. <a href=\"https://techcrunch.com/2024/06/25/smashing-from-goodreads-co-founder-curates-the-best-of-the-web-using-ai-and-human-recommendations/\">TechCrunch has the story</a>. </li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>Great Reads</strong></h4>\n\n\n\n<ul>\n<li>Snapchat has emerged as a platform for dealers to sell counterfeit pills laced with lethal fentanyl to teenagers. The app’s disappearing messages feature facilitates this dangerous trade. After her 14-year-old son died, one mother is spearheading a legal battle to hold Snap Inc. accountable for its alleged role in the crisis. (<a href=\"https://www.rollingstone.com/culture/culture-features/inside-snapchat-teenage-opioid-crisis-1235036691/?src=longreads\" target=\"_blank\">Rolling Stone</a>)</li>\n\n\n\n<li>Did you know that “$400 billion will be needed by 2040 to build sea walls to protect U.S. communities against floods expected to occur once per year? Or that $104 billion needed to refurbish the nation’s dams?” No matter how you look at it, the U.S. is woefully unprepared for worsening climate extremes. Transformative adaptation like managed coastal retreat is needed, not just incremental efforts, and yet it seems collective action is out for a swim. (Yale<a href=\"https://yaleclimateconnections.org/2024/06/the-u-s-is-nowhere-near-ready-for-climate-change/\" target=\"_blank\"> Connections</a>)</li>\n\n\n\n<li>Cricket, they say, is surging in the U.S. thanks to immigrant communities. It’s not true. The game, despite its recent hype, has limited mainstream media coverage even as the country hosted the T20 World Cup. There is minimal TV exposure. It’s going nowhere fast, thanks to unimaginative organizations behind modern cricket. <a href=\"https://www.cjr.org/the_media_today/cricket_usa_world_cup_media_coverage.php\" target=\"_blank\">CJR </a></li>\n</ul>\n\n\n\n<hr />\n\n\n\n<h4><strong>I Read About It:</strong></h4>\n\n\n\n<ul>\n<li><strong>Bad Bots: </strong><a href=\"https://www.prnewswire.com/news-releases/bots-compose-42-of-overall-web-traffic-nearly-two-thirds-are-malicious-reports-akamai-302180377.html\" target=\"_blank\">According to an Akamai research</a> study, 42.1% of overall traffic came from bots, with 65.3% of that bot activity classified as malicious.</li>\n\n\n\n<li><strong>Nicholas Carr </strong>i<a href=\"https://www.roughtype.com/?p=9258\" target=\"_blank\">s working on a new book</a> — <a href=\"https://www.nicholascarr.com/?page_id=664\" target=\"_blank\">Superbloom: How Technologies of Connection Tear Us Apart</a> — to be published in January 2025. I have always enjoyed Carr’s books, even if I don’t always agree with him. However, I can’t disagree with his analysis of the socioeconomic and psychological impact of connectedness. I am excited to read this as well.</li>\n\n\n\n<li><strong>WTF Apple?</strong> How are QQ, Jabber, ICQ even in your address book? How lazy are you not update the “contacts” app. Where are entries for Twitter, IG, Snapchat et al. You know, the stuff we actually use!   <a href=\"https://www.threads.net/@owangutann/post/C8pfg3vvpra?xmt=AQGzPirPrCza-S2ZWQDkgDZw4i1dTHcHfi1vH0dK5tZK9w\" target=\"_blank\">Via</a></li>\n\n\n\n<li><strong>You can opt out of Meta’s AI training</strong> by following specific steps for Facebook and Instagram accounts. TechReview shows you how to do it. (<a href=\"https://www.technologyreview.com/2024/06/14/1093789/how-to-opt-out-of-meta-ai-training/\" target=\"_blank\">MIT Tech Review</a>)</li>\n</ul>\n\n\n\n<hr />\n\n\n\n<p><strong>What Are My Field Notes</strong>: Notable pieces of information gathered during Internet travels. Field notes record<strong> observations and activities encountered or participated in during fieldwork</strong>. Internet is my fieldwork. John Naughton inspired this format.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"a0e21eda6ab6b40a08eaa6ea6c8e1b596c537dfbf3f4bbfa0758747d4c6fd959","category":"default"}