{"title":"Why are my best friends Jewish?","link":"https://sive.rs/jf","date":1733875200000,"content":"<p>\nThis is a real question.\nI don’t know the answer and I’m curious.\n</p><p>\nI lived in New York City for ten years and Los Angeles for seven years, and there are a lot of Jewish people in those two cities, so it could be coincidence.\n</p><p>\nBut I honestly didn’t realize it until one day I was thinking about the difference between shallow versus deep friendships, and made a list of my closest friends.\nAfter I looked at the short list, smiling and appreciating, I looked again.\nWow.\nAll of them are Jewish.\n<strong>\nIs it coincidence, or a cultural attraction?\n</strong>\n</p><p>\nI meet a lot of people and like most of them, but it’s rare I feel that extra-extra click with someone.\nIn Buenos Aires this year, I met with <a href=\"https://sive.rs/met/127\">a musician named Alejandro Staro</a>, and we instantly felt like old friends.\nThen two hours into the conversation, he said something about his Jewish culture, and I was shocked.\nI had no idea.\nIf that was part of the reason I felt an instant click with him, how could that be?\n</p><p>\nWhen I got home to New Zealand, I called one of my best <strong>non</strong>-Jewish friends, to ask her about this.\nShe’s from Iran, <a href=\"https://en.wikipedia.org/wiki/Bah%C3%A1%CA%BC%C3%AD_Faith\">Bahá’í faith</a>, and spent twenty years fighting terrorism on the front-lines of Afghanistan, Somalia, and Kenya, before taking a nice peaceful post in 2019, in Kyiv Ukraine.\nOops.\n(Yes she’s a magnet for disaster, and has also been attacked by a dolphin and silverback gorilla.)\nBut anyway.\nShe’s also one of those rare people that I super-clicked with the minute we met, years ago.\nSo I explained the situation and asked her why I’m so drawn to Jewish people.\n</p><p>\nShe said, “Maybe that’s why you and I clicked so well.”\n</p><p>\nI said, “Ha. Wait. What? No. You’re Bahá’í.”\n</p><p>\nShe said, “Yeah but my mom’s mom is Jewish, so it was always part of my family’s culture.”\n</p><p>\nAgain!\nI had no idea, so it was another blind taste test.\n</p><p>\nSo if this is a cultural attraction, then what is that really?\nMy friends are <a href=\"https://sive.rs/book/InventJewish\">vastly different</a>, some religious, some not at all, from different countries and backgrounds, so any cultural similarity must be subtle.\n</p><p>\nCould the <a href=\"https://sive.rs/book/JudaismCI\">Talmudic tradition</a> of questioning pass down through non-religious families?\nIs it a shared love of discussion?\n</p><p>\nI could relate to the worldview presented in “<a href=\"https://sive.rs/book/JudaismCI\">The Complete Idiot’s Guide to Understanding Judaism</a>” — a surprisingly great book, written by a rabbi.\nMy friend <a href=\"https://www.mayasolovey.com/\">Maya</a> inducted me as an honorary “member of the tribe”.\n</p><p>\nAm I recognizing a shared worldview in strangers, even though they seem to have nothing in common?\nOr is it something else entirely?\nI don’t know, so I’m asking the world for ideas.\nPlease leave a reply here if you have any thoughts.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a0e32f5c6c691531f7cef6e2c5e118c7c3e1ca0d60bc201b33ccce2c6c0bc793","category":"Sites"}