{"title":"Back and forth between super-hot and super-cold","link":"https://sive.rs/sauna","date":1570492800000,"content":"<p>\nThe most relaxed feeling I know is after going back and forth between a super-hot pool and super-cold pool.\n</p><p>\nStay in the super-hot pool until you can’t stand it.\nThen go in a super-cold pool until you can’t stand it.\nRepeat that a few times, and you’ve never felt so relaxed.\n</p><p>\nToday I went to the <a href=\"https://www.loylyhelsinki.fi/en/the-loyly-story/gallery/\">Löyly sauna</a> in Helsinki, Finland.\nI stayed in the super-hot sauna room until I couldn’t stand it.\nThen I’d jump in the icy ocean until I couldn’t stand it.\nI went back and forth like this for almost two hours.\nIt’s so wonderful.\n</p><p>\nThere was also a medium-hot sauna room.\nI tried that for a while, but it just felt “eh” — neither here nor there — not as fulfilling or relaxing as the extremes.\n</p><p>\n…\n</p><p>\nI like <a href=\"https://sive.rs/erra\">trying different ways to approach life</a>.\n</p><p>\nI’ll maximize my input for a while — say yes to everything, meet everyone, go everywhere.\nThen I’ll maximize my output for a while — say no to everything, and just focus on my work.\n</p><p>\nI’ll do the domestic life for a while — with a house, car, dog, furniture, stocked kitchen, and stuff.\nThen I’ll give it all away, until I’m back to the one suitcase of the things I really need.\n</p><p>\nAnd yes, I tend to do each one until it feels like I can’t stand it anymore.\n</p><p>\nIt’s fun to push the boundaries — to explore the edges — to see what I can do.\nI’ve never been interested in pursuing a normal life.\nThere are enough people doing that.\nMore growth and discovery seems to happen when I’m uncomfortable.\n</p><p>\nSome people think it’s strange, and ask why I feel the need to be so all-or-nothing.\nThey ask why I don’t just find the middle ground.\n(Neither here nor there.)\n</p><p>\nBut there’s something more fun and fulfilling about experiencing the more interesting extremes.\nKnowing I can live in these different scenarios is ultimately more relaxing.\n</p>\n<img src=\"/images/sauna.jpg\" alt=\"sauna\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a10b95e99fe75f0f23c94e2c1088b96f405a0b064aebd4f65b7ef71d095bfee5","category":"Sites"}