{"title":"What Really Matters: Memories","link":"https://om.co/2024/12/14/what-really-matters-memories/","date":1734200574000,"content":"<blockquote>\n<p>“It’s generally human nature to overestimate risk and underestimate opportunity. Thinking small is a self-fulfilling prophecy.”</p>\n\n\n\n<p>Jeff Bezos, founder, Amazon</p>\n</blockquote>\n\n\n\n<hr />\n\n\n\n<h3>On My Mind</h3>\n\n\n\n<p><br />We, as modern humans, try to control everything. In reality, though, we can’t really control the infinite number of ever-changing data points or the eventual outcomes. We can try, and in some cases, position ourselves to be in places that give us illusion of control. However, events have a way of happening and perhaps exerting undue influence on the direction of our days, our months, and even years.</p>\n\n\n\n<p>What is in our control, though, is how we choose to view the world around us — we can edit the reality that can push us forward in a positive direction. Take the current year — 2024 — as an example. To say that it has been a lot is an understatement. We can choose to remember it by what went wrong. Alternatively, no matter who you are, there is something that went right during this year. In our personal lives, there has to have been a moment that was simply awesome.</p>\n\n\n\n<p>For instance, earlier this year, I went on a road trip to Yellowstone. In Twin Falls, Idaho, I entered Twin Beans Cafe and walked out with a near-perfect cup of pour-over coffee that tasted like strawberries soaked in bourbon, delicious even when cold. What a great barista, what a great establishment, and a memorable cup of coffee. That great memory is now associated with that specific road trip with my friend Rod. I’ll remember the year by that road trip. And every time, it will bring a smile to my face.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://bsky.app/profile/om.co/post/3lcsj2addbs2m\">I asked this question</a> on Bluesky this morning and got some wonderful responses. So, I ask you, dear reader — what is your favorite memory of this year so far? Leave a comment and let me relive your joy with you.</p>\n\n\n\n<hr />\n\n\n\n<h3>My Reading Recommendations:<br /></h3>\n\n\n\n<ul>\n<li>We learn from failure. Even chips that fail reveal something beautiful. The images, captured during routine semiconductor failure analysis, showcase a remarkable range of naturally occurring patterns that mirror familiar objects and living forms – from ballerinas to sunflowers. The International Symposium on the Physical and Failure Analysis of Integrated Circuits (IPFA) has cleverly leveraged this intersection of science and art through its annual contest, celebrating the unexpected beauty found in technological imperfection. To view the images, head over to<a href=\"https://spectrum.ieee.org/the-art-of-failure\" target=\"_blank\"> IEEE Spectrum</a>.<br /></li>\n\n\n\n<li>Tim Cook is focused on making health a cornerstone of his vision for Apple. The iPhone maker’s next frontier isn’t just smarter tech—it’s longer lives. The intersection of AI and health technology presents Apple’s most compelling opportunity. While competitors focus on generative AI’s creative and productivity applications, Apple appears to be laying the groundwork for AI-powered health diagnostics and preventive care. Cook’s recent interview with <a href=\"https://www.wired.com/story/big-interview-tim-cook-wants-apple-to-literally-save-your-life/\" target=\"_blank\">Steven Levy of Wired is worth reading</a>.<br /></li>\n\n\n\n<li>The macroeconomic implications of changes in U.S. immigration policy will be significant, argues Brookings in a research paper, with GDP growth potentially reduced by 0.1 to 0.4 percentage points in 2025. This translates to $30 billion to $110 billion in lost economic output. <a href=\"https://www.brookings.edu/articles/immigration-and-the-macroeconomy-second-trump-administration/\" target=\"_blank\">Read their full paper</a>.<br /></li>\n</ul>\n\n\n\n<hr />\n\n\n\n<p>December 14, 2024. San Francisco</p>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"a10f867eaa87674fdbf9ae1661aba9e3d6727cef37dc2bfe6e05fb431ee3b0df","category":"Sites"}