{"title":"Why I redesigned my home page?","link":"https://om.co/2024/03/16/why-i-redesigned-my-home-page/","date":1710610150000,"content":"<p><strong><em>tldr</em></strong>: I have rearranged my internet homestead into three sections — the front of the book (blog posts), the feature well (essays, long analysis &amp; interviews), and the back of the book (my podcast, obsessions, travels, recommendations &amp; photography). If you are interested in digging into the why of this change, read on. I think it is worth your time, but I also understand if you don’t give two hoots about it. </p>\n\n\n\n<hr />\n\n\n\n<p>The best part of the Internet is that it is always evolving. It is nothing, if not a reflection of us the people, who use, evolve and shape the network. Just as the network shapes us. This truth about constant change has helped me embrace and evolve with it. And a lot of that is reflected in what I write, both here and elsewhere. </p>\n\n\n\n<p>My blog is where I think out loud. In my mind, it’s my web homestead. If you show up here often, or if you have been for a while, you know the what and why of my thinking. Whenever I think about my own blog and blogging in general, I can’t help but notice that the art and craft of “internet writing” has been changing. </p>\n\n\n\n<p>My blog was a representation of me. That is why in the early days, like many others, I put a lot of effort into how the “blog” looked to my visitors. Most of my readers came to the posts via RSS and never really visited the site, unless of course they wanted to comment and be part of the community. </p>\n\n\n\n<p>I am a big believer in having beautiful, elegant tools and environments and their impact on my creativity. Whether it is vintage pens, the right notebook, the proper camera, or the optimal computer, I care how they work and look. That combination makes me happy and that is what makes me do my best work. </p>\n\n\n\n<p>And having a beautiful website is exactly the same. It was and still is one of my favorite obsessions — how to build a beautiful destination. It was always trying to find a balance between posts, blogrolls, and other “stuff” in the website design templates. And I tinkered endlessly. Matt (Mullenweg) joked that I changed web designs more often than most dudes changed their wardrobe. No words have ever been more accurate.</p>\n\n\n\n<p>Since those days, the “blogs” as we knew them have been atomized. Now, even the individual post itself is (wrongly) conflated with the platform it is published on — a Medium, a Substack, or a LinkedIn post. The blogrolls have vanished(Hopefully not for long, if Dave Winer has anything to do with it.) The platforms have taken over, and blogging is everywhere: social media, newsletters, and communities – they do what we all used to do on a blog. Of course, all this has made the web a bit homogenous. </p>\n\n\n\n<p>But ultimately, the ideology of blogging is still the same. Whether you post a piece on Twitter or on LinkedIn, you are doing what I have been doing for a long time — blogging. But, I have also evolved. Sure, I still use RSS to keep tabs on things. However, I also use social media, and I subscribe to newsletters. I use Feedbin to read, listen, and view all that is relevant for my information diet. I even have a blog roll that keeps evolving based on who (and what) I am reading. </p>\n\n\n\n<p>And of course, I still blog. In other words, I write posts. I ponder on things. I link to good work around the Internet. I curate as much as I create. In my early days as a blogger, my day job was writing for magazines. My features and interviews, what is now known as long reads, were published by them. Today, my essays and interviews find home on my website. </p>\n\n\n\n<p>When I started blogging, it focused primarily on broadband and the Internet. It was about the potential of the “network” and the people who were working to take it to all places and to connect others. And very occasionally I wrote about non-tech topics on my blog. But it was not often — because the young, spouting Internet was a big enough story in itself. It was what I loved and obsessed about. (I still do.) </p>\n\n\n\n<p>Since those early days, I have grown, both as a writer, as a professional, and as a man. My other interests — books, music, photography, and analog objects like paper, ink, and pens— are as important to me as my ongoing interest in the network and its impact. It is not a surprise that I write about them too. </p>\n\n\n\n<p>And again, no surprise, my web homestead is a bit bigger and cluttered. I mean, I have nearly 24 years’ worth of “stuff” around here. So I started to think about coming up with a better way to organize the home page (and my website) not just for the visitors, but also for myself.</p>\n\n\n\n<p>** </p>\n\n\n\n<p>To do so, I went back to my roots. When working for the magazines, I learned to think of what I wrote in terms of where it would sit in the publication: the front of the book, the feature well, and the back of the book. Much as I liked writing cover stories and doing deep interviews, I absolutely loved writing for the “front of the book.” </p>\n\n\n\n<p>Writing the front of the book pieces took longer because of the limitation of space and perceived topicality. You had to make an impact quickly with fewer than 500 words &amp; maybe a graphic, even though there is a good chance no one would remember reading these pieces. </p>\n\n\n\n<p>For me, there has always been a clear parallel between the front of the book and a good blog post. A good blog post is short, pithy, dense with information, and topped off with clear, clever writing. I think my blogging and my magazine writing started to influence each other around 2001.</p>\n\n\n\n<p>As an aside, my favorite piece that I had ever written for Red Herring magazine was a comparison of the per-square-foot revenues of data center operators and big box retailers. I still try to think of such analogies when writing for my blog (and elsewhere).</p>\n\n\n\n<p>And then there was the “back of the book” where you wrote about things that were marginally tangential to the magazine’s core focus — such as travel or new devices and objects. Of course, there were reviews of devices and books. But it was part of giving a more comprehensive feel to the magazine. </p>\n\n\n\n<p>The three-bucket system made a lot of sense when it came to reorganizing the blog (and streamlining the publishing process). So, I have rearranged my internet homestead into three buckets — the front of the book (blog posts), the feature well (essays, long analysis &amp; interviews), and the back of the book (my podcast, obsessions, travels, recommendations &amp; photography).</p>\n\n\n\n<p>From a reader’s perspective, nothing has really changed except that there is a modified new home page. When you arrive at the website, you get the latest from all three categories. If you receive my writings via email or RSS or social media, there is no impact. You don’t visit the homepage and you don’t need to, though if you do, now there is a quick and easy way to glance at the latest. (If you want to get my latest writing in your <a href=\"https://om.co/newsletter/#subscribe\" target=\"_blank\">inbox by signing-up here. It is free and simple</a>.)</p>\n\n\n\n<p>But if you are a newcomer or a casual visitor to the website, then you get a very good idea about me – the person behind the blog and my various interests—with a quick scan. I believe this reflection of “self” or a person will be important in the times ahead. The rise of generative AI means that there will be more indistinguishable content on the internet, and the only way to stand out — is by reminding people that you are human.</p>\n\n\n\n<p>I hope you are going to come along with me on this journey until it is time to hit the proverbial archive button.</p>\n\n\n\n<p>March 16, 2024. San Francisco </p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"a1813df1d012925b884cf3d266438e53bb62e4bc5a18494711d2f32d22fc3ee1","category":"default"}