{"title":"Move to the big city.","link":"https://sive.rs/city","date":1518307200000,"content":"<p>\nI hate to admit this, but it’s true.\n</p><p>\nOne of the best things you can do for your career is to move to a big city — one of the major media centers — the places that broadcast to the entire world.\n<strong>\nNothing less than New York, Los Angeles, London, Mumbai, Hong Kong, or maybe San Francisco.\n</strong>\n(Nashville, Paris, Seoul, or Tokyo only count if you’re limiting yourself to those markets.)\n</p><p>\nIt’s the place where everything happens.\nWhere the biggest media companies in the world are based.\nWhere the money is flowing.\nWhere the most successful agents, producers, and executives live and work.\nWhere the most ambitious people go.\n</p><p>\nIt has a serious energy, because the stakes are high.\nIt’s not casual.\nIt’s not a place for a comfortable work/life balance.\nIt’s fueled by ambition.\nPeople go go go. \n</p><p>\nI’ve lived in a bunch of places now, but when I look back at my career, it’s obvious that the biggest breakthroughs happened because I was living in the heart of the music industry in New York and Los Angeles.\n</p><p>\n<strong>\nIt shows that you’re in the game.\n</strong>\nIt shows you’re serious.\nIt gives you healthy competition, knowing that today’s biggest stars and legends are there with you, too.\nIt challenges you to push your skills to the best of the best, instead of just the best in your home town.\n</p><p>\nOnce you’re famous, and the media is carrying your reputation, you can move away if you want.\nBut even then you’ll be a little out of the game.\nYou can decide if that’s OK with you.\n</p><p>\nI lived in New York City for nine years, and Los Angeles for seven years.\nI met so many wonderful kindreds — other ambitious people like me that had moved there from around the world to get successful.\n</p><p>\nSo why do I hate to admit this?\n</p><p>\nBecause I love how the internet has made it possible for anyone to get successful, anywhere.\nI love the idea of living in the middle of nowhere, surrounded by nature, yet being connected to the world.\n</p><p>\nBut still, when I look at the facts, it’s impossible to deny.\n<strong>\nLiving in the big city, and being where everything is happening, will help your career the most.\n</strong>\nBeing anywhere else won’t hurt you, but it won’t help.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a236016fcab2f922112e407d7b19082a720068ee0c38b01e8d8f981102a9f079","category":"default"}