{"title":"Overcompensate to compensate","link":"https://sive.rs/compensate","date":1456185600000,"content":"<p>\nYou have something you want to change: a thought process or habit you want to fix.\n</p><p>\nLet’s use the metaphor of a bunch of bricks on a seesaw.\nRight now all the bricks are stacked on one side.\nThis is the way you have been.\n</p>\n<img src=\"/images/compensate-l.jpg\" />\n<p>\nTo make a change, <strong>most people don’t do enough.</strong>\n</p><p>\nIf you do something small and sensible, it’s like moving one brick to the other side.\nYou’re still unbalanced.\n</p>\n<img src=\"/images/compensate-l1.jpg\" />\n<p>\nYou think you made the change, but it’s not accounting for:\n</p><ul><li>\na lifetime of doing it the other way,\n</li><li>\nthe environment that made you that way, and\n</li><li>\nthe pressure from friends to stay that way.\n</li></ul><p>\n<strong>\nTo make a change, you have to be extreme.\n</strong>\nGo all the way the other way.\n<strong>It will feel like overcompensating</strong>, but you have to stack a huge pile of bricks on the other side.\n</p>\n<img src=\"/images/compensate-r.jpg\" />\n<p>\nThis new you sounds extreme and exciting.\nYou’ll think you’re going to be completely changed.\n</p><p>\nBut actually the old stuff is still there.\nSo really this is what you needed to do to balance — to compensate for that cultural baggage, self-identity, habit, and history.\n</p>\n<img src=\"/images/compensate-b.jpg\" />\n<p>\nOnce you’re balanced, the new perspective will sink in and become your new normal.\n</p>\n<img src=\"/images/compensate-b2.jpg\" />\n<br />\n<img src=\"/images/compensate-b3.jpg\" />\n<div>Illustrations by <a href=\"http://portfolios.ru/cherry_inspiration\">Victoria Medvedeva</a> in Saint Petersburg, Russia.  They are free for you to use.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a24cc75a6477e76f3f63ca8c6c03ad4233dcae8dc0b49304551cfe3719fab0e2","category":"Sites"}