{"title":"The importance of play and what I’m doing next","link":"https://bradbarrish.com/2024/07/18/the-importance-of-play-and-what-im-doing-next/","date":1721324608000,"content":"<p>It’s been over a year since I left Oura and decided to take some time to recharge, reconnect and, most importantly, play. I have never not worked. Even through college I worked as a college marketing rep for Sony Music, worked in a recording studio, worked at the college radio station and eventually started my own record label. For the first time in my adult life I consciously decided not to work. While I couldn’t afford to stop working for too long without touching savings, I also didn’t want to wait until later in life to take some time to myself, letting random interests and intellectual curiosities take me where they may. Oh, the rabbit holes I’ve visited!</p>\n\n\n\n<p>Settling into taking a break from work is similar to taking a vacation. You know how it is – you only really get to the vacation part after a few days have passed. Your brain, body and nervous system realize, yes, you are <em>actually</em> on vacation. And that’s when it really begins. There was a similar unwinding but also an unlearning experience I had to go through. I had to fight the urge to have structure and purpose in my day. I had to let go of the notion that I would somehow be forgotten or less valuable by taking a break. I gave myself explicit permission to play. I implored myself to play. Because I wasn’t likely to get this chance again anytime soon. Life is short and all of that.</p>\n\n\n\n<p>May to September were truly some of the best days. Those were peak play months. There was hiking, reconnecting with friends, going to therapy, making new friends, coding, jamming on ideas with many brilliant people, helping people, playing around with AI, sharing meals, thinking, writing, walking, reading, surfing (the web) a lot and just letting my mind wander. Throughout the last many months, one of the highlights has been <a href=\"https://www.wired.com/story/the-science-of-having-a-great-conversation-research-social-connection/\">having conversations</a> with people absent an agenda other than connecting. The feeling I get from connecting with someone through conversation is unlike any other. It feels electric. Nothing energizes me quite like it. And I’m not talking about romantic feelings. I’m talking about deep connection, togetherness with a single person or maybe a few, in deep conversation about things that matter.</p>\n\n\n\n<p>As adults, we’re trained and conditioned to have an agenda or a reason for doing a thing, especially voice or video calls. So for many of us adults, it feels a little weird not to do a thing or to do a thing with no real intention or aim of achieving something, earning money, earning a certification or otherwise accomplishing something, maybe anything! Realizing I didn’t <em>actually</em> have to do anything after many thousands of days of obligations felt profound and downright irresponsible. I have kids! I live in one of the most expensive cities in the U.S.! I have a mortgage! What am I doing?! And then it occurred to me that squandering this time would be genuinely irresponsible. So, I played!</p>\n\n\n\n<p>Much of my playtime has been on a computer, messing around with artificial intelligence. In order for me to understand things, particularly technical things, I need to immerse myself. I estimate spending around 30% of my time on AI exploration and me-search. It’s impossible to understand the implications of a new technology without directly interacting with it. Sure, you can read what others say, but at some point, you’re just taking their word for it. I’m not sure how much the stats have changed since Pew Research showed<a href=\"https://www.pewresearch.org/short-reads/2023/05/24/a-majority-of-americans-have-heard-of-chatgpt-but-few-have-tried-it-themselves/\"> that most Americans have heard of ChatGPT, but only 18% had tried it</a>. I’m sure that number has gone up since the survey. In my own experience with friends and family, when someone says they have used it, what they often mean is they have attempted to use it like they use Google search or ask it dumb questions, but that really isn’t <em>using</em> it. At this point, I use AI throughout the day, every day, mainly through a chat interface.</p>\n\n\n\n<p>Like I’ve said before – I haven’t been this consumed by a technology since the web in the 1990s. The only way you would have seen what was coming with the web was to participate directly and play with it. And while, yes, similarly exploring AI might require a bit more technical knowledge, but you’re not going to begin to understand how AI will impact (or not) unless you’re playing with it.</p>\n\n\n\n<p>One of the other areas of interest I’ve had for many years and spent a lot of time exploring and thinking about has been the intersection of health and technology. I’ve been tracking various biometrics since the first Fitbit came out and my interest eventually led me to Oura. I still love my ring and wear it every day. The health space is absolutely blowing up. For most people around the world, healthcare is sick care. It’s reactive. However the barrier to individuals quantitatively understanding their health with wearables and other health and med tech is becoming increasingly accessible. This is leading consumers to take a much more proactive and even preemptive approach to their health. Getting your entire genome sequenced, having a full-body MRI, getting deep insight into insulin resistance and many other diagnostics are available for a fraction of the cost they were a few short years ago. Winners in the space will focus on the patient experience first and foremost. Those who don’t will do so at their peril.</p>\n\n\n\n<p>An incredibly fascinating area of health diagnostics is the early detection of neurodegenerative disease. I suspect we’ll see various minimally invasive and non-invasive options available to consumers in the next 12-24 months. And while it will be possible to get earlier indications that you could develop Alzheimer’s, Parkinson’s and other similar diseases, there are virtually no treatments for an early diagnosis short of lifestyle and diet changes at this point. Even when a diagnosis is given, typically based on someone developing symptoms, options are pretty limited and costly, and treatments can be worse than the disease itself. This is one of the reasons I got involved as an advisor with a company called <a href=\"https://clarity-technologies.com\">Clarity</a> at the beginning of 2023. Clarity is developing the first immersive neuromodulation platform utilizing a unique combination of light and sound stimulation and artificial intelligence to slow down the progression of neurodegenerative diseases, beginning with Alzheimer’s. I was impressed, not just by what they were trying to achieve, but by everyone at the company working to achieve it.</p>\n\n\n\n<p>Last summer, Clarity’s CEO and founder, Raphael Certain, let me know he would be visiting LA for the second or third time. He mentioned not having seen much of LA since he had spent most of his previous time in meetings. I agreed to pick him up at LAX and take him on a hike in Temescal Canyon.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg?w=1024\" srcset=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg?w=1024 1024w, https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg?w=150 150w, https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg?w=300 300w, https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg?w=768 768w, https://bradbarrish.com/wp-content/uploads/2024/07/img_6988.jpeg 1280w\" /></figure>\n\n\n\n<p>We had a deep conversation about our visions for the future of healthcare and somewhere along the way, after crossing paths with two coral snakes, he asked me to join the company as his co-founder. While I was flattered, I was also just beginning the first break of my career and my initial reaction was to talk him out of it. Over the months that followed, he was unwavering and relentless. Late last year he brought me to Paris to meet the team and his investors and what had been a ‘no’ started feeling like a ‘maybe’ and I started spending more time with the team.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"768\" height=\"1024\" src=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_8914-2.jpeg?w=768\" srcset=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_8914-2.jpeg?w=768 768w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8914-2.jpeg?w=113 113w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8914-2.jpeg?w=225 225w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8914-2.jpeg 960w\" /></figure>\n\n\n\n<p>It’s been in the works for a few months and I could not be more excited to announce that as of June, I have officially joined Clarity as COO and co-founder. I’m the first U.S. employee even though we’re a U.S. company with a French subsidiary and like anyone working at an early-stage company in any capacity, I’ll be involved in pretty much everything, especially our IP strategy, SW product and business operations. Of course I’ll be working with Raph on fundraising and doing plenty of networking. Speaking of which, I’ll be in San Francisco with some of the team next week (July 22-25) and we’ll be hosting a small gathering with friends from health, neurotech, and longevity. Drop me a note if you’d like to attend or want to meet up to learn more about what we’re doing.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"768\" src=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg?w=1024\" srcset=\"https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg?w=1024 1024w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg?w=150 150w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg?w=300 300w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg?w=768 768w, https://bradbarrish.com/wp-content/uploads/2024/07/img_8912-1.jpeg 1280w\" /></figure>\n\n\n\n<p>It’s difficult to find the words to express how grateful I feel for the opportunity to impact the lives of those suffering from Alzheimer’s and those caring for them. My grandfather passed away from complications related to the disease and my mom has Parkinson’s and Lewy body dementia. Given that and the fact I carry a single APOE4 allele, I’m more at risk of developing Alzheimer’s. So, as you can imagine, I have deeply personal reasons for wanting to dedicate my working hours to addressing Alzheimer’s and other neurodegenerative diseases.</p>\n\n\n\n<p>Having such a supportive wife and kids made this an easier decision than it otherwise would have been. Big shout out to the countless people, many of them close personal friends, who supported me in various ways over the last year. It’s impossible to name all of you. Still, I want to recognize Shannon Connelly, Steve Kent, Sanford Spivey, Mike Lewis, Virginia Bauman, Greg Cohn, Amy Cohn, Bob Moz, Ian Rogers, Marc Sagal, DJ Barat, Ivan Entchevitch, Tramy Nguyen, Mike Wald, Alexis McDowel and Jessica English for being exceptionally generous with their time, perspective, motivation and inspiration along the way. Last but most definitely not least, a huge thank you to Raph for his trust and vision. I could not be more excited to help bring his ambitious vision to life!</p>\n\n\n\n<p>You can read <a href=\"https://clarity-technologies.com/newsroom/brad-barrish-joins-clarity\">the official release</a> on the Clarity website.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"a3062340af4b23910af6b7c26d22cea7437a3a0c2119b80ab9e82dd663d8fa33","category":"Sites"}