{"title":"Content vs. Content","link":"https://om.co/2024/11/11/content-vs-content/","date":1731359993000,"content":"<figure><img width=\"1024\" height=\"585\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-1024x585.jpeg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-1024x585.jpeg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-300x171.jpeg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-768x439.jpeg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-1536x878.jpeg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-192x110.jpeg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-1100x629.jpeg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent-560x320.jpeg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/ContentvsContent.jpeg 1792w\" /></figure>\n\n\n\n<blockquote>\n<p>Con·tent</p>\n\n\n\n<p>(<a target=\"_blank\" href=\"https://www.oed.com/dictionary/content_adj2?tab=factsheet#8435351\">as an adjective</a>) in a state of peaceful happiness.</p>\n\n\n\n<p>(<a target=\"_blank\" href=\"https://www.oed.com/dictionary/content_n1?tab=factsheet#8434006\">as a noun</a>) <strong>contents</strong> of a book, television <a target=\"_blank\" href=\"https://www.collinsdictionary.com/us/dictionary/english/program\">program</a>, or website, or even a container.</p>\n</blockquote>\n\n\n\n<p>Daylight saving time can play havoc on one’s mind. Even though I am up at my usual time, I look out the window and it’s pitch dark. In other words, thanks to my body clock, I am getting up an hour early. I am falling asleep earlier too. So instead of getting ready to go for a morning photo walk or a quick trip to the gym, I have started to read for 45 minutes every morning. It is good way to put an extra hour to good use. It’s my way of not getting caught up in the upswell of digital information. I usually don’t check my emails or text messages until after 7:30 a.m. every morning.</p>\n\n\n\n<p>I usually have a few books going at any given time. Today, I picked up a new book, “The Best American Food and Travel Writing.” I love reading these anthologies — mostly because they allow me to read the best magazine (and newspaper) writing on a specific topic. The editors usually do a good job of distilling the choices.</p>\n\n\n\n<p><a href=\"https://en.wikipedia.org/wiki/Padma_Lakshmi\">Padma Lakshmi</a>, a food writer and host of “Top Chef,” wrote the introduction for the new anthology. It’s a lovely, if somewhat meandering and slightly self-indulgent, bit of prose that perhaps could have used a light edit. That doesn’t take away from the fact that I enjoyed her wandering words. Lord knows, I meander more than a grass snake fleeing a farmer and his brood.</p>\n\n\n\n<p>Talking about her own emotions, life, and role of food and family, she reinforces something you (or my friends) have heard me talk about often — it is not what we have as children, but what we are deprived of as kids that defines us and our behaviors for rest of our lives.</p>\n\n\n\n<p>I was enjoying the words and my first cup of the most fragrant single-origin jasmine tea when I stopped, took out my pen and made a note in my commonplace journal.</p>\n\n\n\n<p>“An influencer, is always selling something, in the end, and the audience’s goal is not to discover but to replicate,” writes Padma Lakshmi, “What we eat, and where we go has become about reproducing an image, about rebroadcasting to our our friends, family and followers, that we too have access to that life.”</p>\n\n\n\n<p>She is talking about our modern present, our always-on content culture. <a target=\"_blank\" href=\"https://om.co/2019/06/16/the-problem-with-content/\">I hate the word “content”</a> and what it has become in the context of the internet, thanks to social media. There is nothing original! Nothing authentic! You are almost always asking the question: Is this real, or some kind of interpretive version of reality?</p>\n\n\n\n<p>“Content is inherently transactional; its goal is to drive toward some kind of conversion, some kind of exchange of value,” says Khoi Vinh, principal designer at Adobe. With content, we are always selling and always creating desire, anxiety and jealousy. These are a series of emotions that take us far away from being content with whatever we have.</p>\n\n\n\n<p>Content, the same word with two very distinct meanings.</p>\n\n\n\n<p><em>November 11, 2024. San Francisco</em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"a353575ce294fbc57dc1478ecefa20b1adc03afd8be11c8452d2556edecc2778","category":"Sites"}