{"title":"Low-Fi Computing","link":"https://www.usv.com/writing/2024/10/low-fi-computing/","date":1728559316000,"content":"<p>Our life is increasingly dominated by screens. Giant screens in public spaces; TVs everywhere in bars and restaurants; everyone standing around and walking around with their faces in their phones; watches, glasses and goggles with screens built-in, etc. “Screen time” is a thing.</p>\n<p>Screens are amazing: full of information and entertainment. But they are also exhausting and over-stimulating.</p>\n<p>It feels to me that, one way or another, we’re poised to experience some amount of cultural backlash against so many screens. I can already start to sense it, as I spend time with my teenage kids — while they are certainly on screens quite a bit, I can tell that they realize that it’s a lot, and they seem to actively seek out escapes from the screen (as much as they understand that the screen can be an attractive escape from the real world).</p>\n<p>In particular, I’m curious about digital interfaces that manage to capture the value &amp; utility of being connected, but strike a different tone in terms of experience. For example, I’ve been experimenting with the Meta Ray-Ban glasses for a while now, and while they aren’t perfect, the experience of taking a photo or video without sticking my face in my phone is refreshing. That said, smart glasses are also clearly a step towards a more immersive, rather than less immersive tech experience, which has other potential drawbacks.</p>\n<p>In terms of more visually interactive devices, the Kindle is probably the most successful example of this kind of “low-fi” computing. While it’s also not perfect, and I still personally prefer to read a paper book, it doesn’t scream “I AM A COMPUTER” quite the way other tablets do, and there’s just something about the posture of reading on a Kindle (compared to a phone, for sure) that just feels more healthy and nature.</p>\n<p>I am curious to see whether such an approach could work for other kinds of products that come closer to the experience of phones and tablets. I was surprised to learn recently that the ReMarkable tablet has sold over 1mm units (that’s a 2021 number, so it must be materially larger now). I tried an early version and didn’t have a great experience, but I’ve always liked the idea. I’ve been following the development of the Techless phone which is a Kindle-like “dumb phone” targeted at teens, but haven’t tried it yet, as well as the Daylight tablet , where I’m currently waiting on a pre-order. I’m somewhat more skeptical of the Techless approach which would seem to position the low-fi item as a “starter” phone, and am somewhat more drawn to the Daylight approach which positions low-fi as “premium”.</p>\n<p>I’m excited to see more experiments in low-fi computing, and am very curious to see which form factors and user experiences prove to be appealing to mass audiences.</p>\n<p>Photo: Stanley Kubrick. Life and Love on the New York City Subway. Passengers reading in a subway car. 1946. Museum of the City of New York. X2011.4.10292.30D ( link )</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/low-fi-computing/\">Low-Fi Computing</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"a3a04f0b856bac546a25bc9e743ed13019518c12dada8089c1c30a0ab80ef0c6","category":"Sites"}