{"title":"It’s been 17 years","link":"https://bradbarrish.com/2024/02/07/its-been-17-years/","date":1707373889000,"content":"<p>My dad died today in 2007 from pancreatic cancer. He miraculously lived with it much longer than most people. The tumor was discovered when he went to the ER for a kidney stone. They discovered it on a CT scan they did for the kidney stone. He lived for eighteen more months and was fortunate to be at home when he died. </p>\n\n\n\n<p>To this day I feel tremendous gratitude that I was able to be with him in the final weeks of his life and as he took his final breath. He was my best friend and such a wonderful human. He helped so many people as a psychologist. I had more than a few people tell me that he saved their life. And yet, he got cancer and died.</p>\n\n\n\n<p>I used to think a lot about how it wasn’t fair. ‘How could someone who helped people for a living, exercised almost daily, didn’t eat meat and was so admired and adored by so many people get cancer?’ I would think to myself. Grief makes you think all kinds of things, but you have to go through it. There’s no other way. He taught me that. Of course terrible things happen to great people and great things happen to awful people. That’s just how it goes sometimes.</p>\n\n\n\n<p>I was talking to someone else this week. They had recently lost their mom to pancreatic cancer. This person asked me if I had more of a YOLO approach to life given how unexpectedly he was diagnosed and so young. I explained that, yes, but probably not to the degree others might. More than anything, it has helped me think about my own mortality, though not in any morbid way. It’s made me a better parent in that I tend to try and focus on the truly important things or at least the things I believe are most important. I’m less comfortable with complacency. I’m more quick to make changes when circumstances aren’t serving me. You just never know when terminal illness or death will happen. </p>\n\n\n\n<p>The thing I continue to admire most about my dad are his principles and how he chose to live his life. He was a humanist, an activist and advocate. He always stood up for what was right and cared deeply about humanity. And he was a really great dad who was always there for me, even when I put him through some pretty terrible times.</p>\n\n\n\n<p>Over the last year I’ve been getting photos and documents scanned. When I was going through things at my childhood home last year I found a loose leaf journal of his that I had never seen before. It spanned 1967-1969 and was mostly short thoughts or quotes. I was blown away by his wisdom, compassion and clarity. Some of the things he wrote were so good, I searched around online to see if they were quotes from books or something and they weren’t. Below are a few pages.</p>\n\n\n\n<figure><img width=\"213\" height=\"356\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/dad-on-forgiveness-1.jpg?resize=213%2C356&amp;ssl=1\" /></figure>\n\n\n\n<figure><img width=\"214\" height=\"357\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/dad-on-war-1.jpg?resize=214%2C357&amp;ssl=1\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"214\" height=\"356\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/dad-on-foreign-policy-of-compassion-1.jpg?resize=214%2C356&amp;ssl=1\" /></figure>\n\n\n\n<p>Here’s a letter he wrote to The Kansas City Star in 1993 in response to school children writing letters to try and pressure MTV to drop Beavis and Butthead. </p>\n\n\n\n<figure><img loading=\"lazy\" width=\"611\" height=\"789\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/2023_06_03_18_30_26.jpg?resize=611%2C789&amp;ssl=1\" /></figure>\n\n\n\n<figure><img loading=\"lazy\" width=\"611\" height=\"789\" src=\"https://i0.wp.com/bradbarrish.com/wp-content/uploads/2024/02/2023_06_03_18_30_26-2.jpg?resize=611%2C789&amp;ssl=1\" /></figure>\n\n\n\n<p>I’ve since deleted the tweet, but I did share this with Mike Judge and <a href=\"https://x.com/MikeJudge/status/1320235790341910528\">he was appreciative and called my dad a badass</a>. </p>\n\n\n\n<p>Man, I miss him. Fuck cancer.</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"a3efad58bd9c6e08c3f99f583bb09e22bb1d3e722348df97cfcf57630a79daca","category":"default"}