{"title":"Home On The Internet","link":"https://www.usv.com/writing/2024/09/home-on-the-internet/","date":1727732859000,"content":"<p>Growing up I always had a home on the internet. It started at the end of middle school and high school with my AOL profile. Everyone would list their interests, favorite music, names of their best friends, sports teams, hobbies, and more. You’d update it regularly. It was a status symbol and something you tended to like a garden. It was a lo-fi textual representation of you on the internet. It was awesome.</p>\n<p>In college, that quickly turned to MySpace and Facebook. They had their differences, but they served the same purpose. It was our homepage on the internet. It was where people found us, judged us, learned about us, thought about who we were and what we might be like, and more. I liked the MySpace profile page more. It was just more fun, visual and interactive. Who your “top 4” or 8 or 12 were was everything.  Best friends, favorite bands and more went there. Had a breakup? They got the boot. These were the digital actions that defined my youth.</p>\n<p>MySpace faded as Facebook took over. Then things began to disaggregate. Some people flocked to tumblr as the digital expression of themselves. It was a beautiful place to hang out. We’d curate the internet according to our interests and how we wanted people to see us, and then share it on our tumblogs.</p>\n<p>Instagram also came around and gave people filters to edit their photos and paint a picture of a life of grandeur. What was once self-expression and fun moved quickly to vanity and audience building, turning fame into a game for everyone. But was it really our home? No.</p>\n<p>Our homes have shattered and been thrown across the internet. There is no one place any longer. For some, maybe a piece of it is their twitter profile or blog (mine is here on my blog), but for most, it’s spread across a vast sea of disconnected networks.</p>\n<p>There’s room for a new home on the internet, especially for younger generations who have mainly found it inside Instagram and TikTok and maybe LinkTree. They haven’t experienced the power of a full-fledged profile like we did. And now with AI powered tools creating new and weird media formats and experiences, perhaps the time has come for a new generational home to emerge online. One that reflects the expressive capabilities of a digitally native generation and embraces a new suite of creative tools and experiences. Maybe it starts off looking like an internet bedroom , or maybe it surprises us with something entirely unpredictable.</p>\n<p>People often are a reflection of the things they like. I want a new place to share these: books, music, artists, sports, hobbies, film and television, the list goes on and on. I want a taste of the nostalgia of my old profiles, but updated for the present.</p>\n<p>If the history of business is an endless cycle of bundling and unbundling, maybe the history and future of digital product experiences will rhyme. In that case, we have recently gone through a period of profile unbundling; perhaps it’s time to bring it all home again. I’d certainly like that.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/home-on-the-internet/\">Home On The Internet</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"a43fe5c5e1f38809939ec5fec1ea26de244f2f5b62070b2e0517c0c50c3cf2f3","category":"Sites"}