{"title":"Does Every Species Get a Billion Heartbeats Per Lifetime?","link":"https://kottke.org/24/12/does-every-species-get-a-billion-heartbeats-per-lifetime-1","date":1733241159000,"content":"\n        <p>There’s an assumption that because of the relationship between metabolic rates, volume, and surface area, animals get an average of one billion heartbeats out of their bodies before they expire. <a href=\"http://skeptics.stackexchange.com/questions/5701/does-every-species-get-around-a-billion-heartbeats-on-average\">Turns out there’s some truth to it</a>.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/one-billion-heartbeats.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/one-billion-heartbeats.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/one-billion-heartbeats.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"643\" alt=\"One Billion Heartbeats\" /></p>\n\n<blockquote><p>As animals get bigger, from tiny shrew to huge blue whale, pulse rates slow down and life spans stretch out longer, conspiring so that the number of heartbeats during an average stay on Earth tends to be roughly the same, around a billion.</p>\n\n<p>Mysteriously, these and a large variety of other phenomena change with body size according to a precise mathematical principle called “quarter-power scaling”.</p>\n\n<p>It might seem that because a cat is a hundred times more massive than a mouse, its metabolic rate, the intensity with which it burns energy, would be a hundred times greater. After all, the cat has a hundred times more cells to feed.</p>\n\n<p>But if this were so, the animal would quickly be consumed by a fit of spontaneous feline combustion, or at least a very bad fever. The reason: the surface area a creature uses to dissipate the heat of the metabolic fires does not grow as fast as its body mass.</p>\n\n<p>To see this, consider a mouse as an approximation of a small sphere. As the sphere grows larger, to cat size, the surface area increases along two dimensions but the volume increases along three dimensions. The size of the biological radiator cannot possibly keep up with the size of the metabolic engine.</p></blockquote>\n\n<p>Humans and chickens are both outliers in this respect…they both live more than twice as long as their heart rates would indicate. Small dogs live about half as long.</p>\n\n         <p><em>[This is a vintage post originally from Feb 2013.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/biology\">biology</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"a572d8059575d5ab8d467489917559883a05810c3004ea729db981e23a9e6429","category":"Sites"}