{"title":"Grace Against Gravity and the Physics of Vulnerability: How Birds Fly and Why They Flock in a V Formation","link":"https://www.themarginalian.org/2024/11/22/how-birds-fly/","date":1732284318000,"content":"<p><a href=\"https://www.amazon.com/Miraculous-Material-Understanding-Wonders-Nature/dp/0593701488/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"417\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?fit=320%2C417&amp;ssl=1\" alt=\"Grace Against Gravity and the Physics of Vulnerability: How Birds Fly and Why They Flock in a V Formation\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?w=1150&amp;ssl=1 1150w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?resize=320%2C417&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?resize=600%2C783&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?resize=240%2C313&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/lightman_miraculous.jpg?resize=768%2C1002&amp;ssl=1 768w\" /></a></p><p>“What we see from the air is so simple and beautiful,” Georgia O’Keeffe wrote after her first airplane flight, “I cannot help feeling that it would do something wonderful for the human race — rid it of much smallness and pettiness if more people flew.” </p>\n<p>I am writing this aboard an airplane. An earthbound ape in my airborne cage of metal and glass, I wonder who we would be, in the soul of the species, if we could fly — really fly, the way birds do; if we were born not just seeing “the world all simplified and beautiful and clear-cut in patterns,” as Georgia did out of that small round window, but feeling it. And yet you and I shall never know the open sky as a way of being — never know the touch of a thermal or the taste of a thundercloud, never see our naked shadow on a mountain or slice a cirrus with a wing. What cruel cosmic fate to live on this Pale Blue Dot without ever knowing its blueness. And yet we are recompensed by a consciousness capable of wonder — that edge state on the rim of understanding, where the mind touches mystery. </p>\n<p>It is wonder that led us to invent science — that quickening of curiosity driving every discovery — so that science may repay us with magnified wonder as it reveals the weft and warp of nature — the tapestry of forces and phenomena, of subtleties and complexities, woven on the enchanted loom of reality. To look at any single thread more closely, in all its hidden wonder, is to see more clearly how the entire tapestry holds together, to strengthen how we ourselves hold together across the arc of life. For, as Rachel Carson <a href=\"https://www.themarginalian.org/2013/12/23/rachel-carson-on-wonder/\">so memorably wrote</a>, the greatest gift you could give a child — or the eternal child in you — is “a sense of wonder so indestructible that it would last throughout life, as an unfailing antidote against the boredom and disenchantments… the sterile preoccupation with things that are artificial, the alienation from the sources of our strength.”</p>\n<figure><a href=\"https://www.themarginalian.org/2024/03/13/something-about-the-sky-carson-mcclure/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/somethingaboutthesky3.jpg\" /></a><figcaption>Art by Nikki McClure from <a href=\"https://www.themarginalian.org/2024/03/13/something-about-the-sky-carson-mcclure/\"><em>Something About the Sky</em></a> — Rachel Carson’s serenade to the wonder of the clouds</figcaption></figure>\n<p>Take the wonder of a bird — this living poem of feather and physics, of barometric wizardry and hollow bone, in whose profoundly other brain <a href=\"https://www.themarginalian.org/2024/07/02/birds-dream-rem/\">evolution invented dreams</a>. That so tiny a creature should defy the gravitational pull of an entire planet seems impossible, miraculous. And yet beneath this defiance is an active surrender to the same immutable laws that make the whole miracle of the universe possible. </p>\n<p>In one of the three dozen fascinating essays collected in <a href=\"https://www.amazon.com/Miraculous-Material-Understanding-Wonders-Nature/dp/0593701488/?tag=braipick-20\" target=\"_blank\"><strong><em>The Miraculous from the Material: Understanding the Wonders of Nature</em></strong></a> (<a href=\"https://search.worldcat.org/title/1423243347\" target=\"_blank\"><em>public library</em></a>), the poetic physicist and novelist <a href=\"https://www.themarginalian.org/tag/alan-lightman/\">Alan Lightman</a> illuminates the lawful wonder of avian flight, from evolution to aerodynamics, from molecules to mathematics, beginning with the fundamental wonderment of how a bird creates strong enough an upward force to counter gravity’s pull on its weight:</p>\n<blockquote><p>[The force] is created by a net upward air pressure, which in turn is created by the bird’s forward motion and the shape of its wings. The topside of an avian wing is curved, while the bottom side is rather flat. This difference in shape, together with the angle and some smaller adjustments of the wing, cause the air to flow over the top of the wing at higher speed than on the bottom. The higher speed on top reduces the air pressure above the wing compared to the air pressure below the wing. With more pressure pushing up from below than pressure pushing down from above, the wing gets an upward lift.</p></blockquote>\n<figure><a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=680%2C920&amp;ssl=1\" width=\"680\" height=\"920\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?w=733&amp;ssl=1 733w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=240%2C325&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=320%2C433&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=600%2C812&amp;ssl=1 600w\" /></a><figcaption>Anatomy of a bird by French artist <a href=\"https://www.themarginalian.org/2019/11/29/paul-sougy/\">Paul Sougy</a>. (Available <a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\">as a print</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>It may seem counterintuitive that a higher air speed above the wing would produce a lower pressure, but our creaturely intuitions have often been poor reflections of reality — it took us eons to discern that the flat surface beneath our feet is a sphere, that the sphere is not at the center of the universe, and that there is an invisible force acting on objects without touching them to make the universe cohere — a force which <a href=\"https://www.themarginalian.org/2020/04/06/newton-plague/\">a bored twenty-something sitting in his mother’s apple orchard</a> called gravity. </p>\n<p>Alan explains the reality of chemistry and physics that makes flight possible as air molecules strike against the underside of the wing to lift the bird up:</p>\n<blockquote><p>Air consists of little molecules that push against whatever they strike, causing pressure. Molecules of air are constantly whizzing about in all directions. If no energy is added, the total speed of the molecules must be constant, by the law of the conservation of energy. But that speed is composed of two parts: a horizontal speed, parallel to the wing, and a vertical speed, perpendicular to the wing. Increase the horizontal speed of air molecules above the wing, and the vertical speed of those molecules must decrease. Lower speed of molecules striking the wing from above means less pressure, or less push. The molecules on the bottom of the wing, moving slower in the horizontal direction but faster in the vertical direction (with greater upward pressure), lift the wing upward.</p>\n<p>The lift is greater the larger the wing area and the faster the speed of air past the wing. There’s a convenient trade-off here. The necessary lift force to counterbalance the bird’s weight can be had with less wing area if the animal increases its forward speed, and vice versa. Birds capitalize on this option according to their individual needs. <a href=\"https://www.themarginalian.org/2024/09/11/great-blue-heron/\">The great blue heron</a>, for example, has long, slender legs for wading and must fly slowly so as not to break them on landing. Consequently, herons have relatively large wingspan. Pheasants, on the other hand, maneuver in underbrush and would find large wings cumbersome. To remain airborne with their relatively short and stubby wings, pheasants must fly fast.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?w=900&amp;ssl=1 900w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/GreatBlueHeron_desire.jpg?resize=768%2C1189&amp;ssl=1 768w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-great-blue-heron-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-great-blue-heron-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>There are, however, limits to this factorial conversation between surface and speed. Alan considers why there are no birds the size of elephants:</p>\n<blockquote><p>As you scale up the size of a bird or any material thing, unless you drastically change its shape, its weight increases faster than its area. Weight is proportional to volume, or length times length times length, while area is proportional to length times length. Double the length, and the weight is eight times larger, while the area is only four times larger. For example, if you have a cube of 1 inch on a side, its volume is 1 cubic inch, while its total area is 6 (sides) × 1 square inch, or 6 square inches. If you double the side of the cube to 2 inches, its volume goes up to 8 cubic inches, or 800 percent (with a similar increase in weight), while its area goes up to 24 square inches, or 400 percent. Since the lift force is proportional to the wing area while the opposing weight force is proportional to the bird’s volume, as you continue scaling up, eventually you reach a point where the bird’s wing area is not enough to keep it aloft. Although birds have been experimenting with flight for 100 million years, the heaviest true flying bird, the great bustard, rarely exceeds 42 pounds. The larger gliding birds, such as vultures, are lifted by rising hot air columns and don’t carry their full weight.</p></blockquote>\n<p>But all this elaborate molecular and mathematical aerodynamics of upward motion is not enough to make flight possible — birds must also propel themselves forward without propellers. For a long time, how they do this was a mystery. (The mystery was even deeper for the singular flight of the hummingbird, <a href=\"https://www.themarginalian.org/2021/05/07/sy-montgomery-the-hummingbirds-gift/\">hovering between science and magic</a>.) It was the birth of modern aviation that finally shed light on it. In the early nineteenth century, watching how birds glide, the pioneering engineer and aerial investigator George Cayley became the first human being to discern the mechanics of flight, identifying the three forces acting on the weight of any flying body: lift, drag, and thrust. </p>\n<figure><a href=\"https://www.themarginalian.org/2024/06/07/swan-sky-tejima/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?resize=680%2C461&amp;ssl=1\" width=\"680\" height=\"461\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?resize=320%2C217&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?resize=600%2C407&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?resize=240%2C163&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/06/swansky_tejima9-1.jpg?resize=768%2C521&amp;ssl=1 768w\" /></a><figcaption>Art by Keizaburō Tejima from <a href=\"https://www.themarginalian.org/2024/06/07/swan-sky-tejima/\"><em>Swan Sky</em></a></figcaption></figure>\n<p>Alan details the physics of drag and thrust that allow birds to move forward:</p>\n<blockquote><p>Birds do in fact have propellers, in the form of specially designed feathers in the outer halves of their wings. These feathers, called primaries, change their shape and position during a wingbeat. Forward thrust is obtained by pushing air backward with each flap. In a similar manner, we are able to move forward in a swimming pool by vigorously moving our arms backward against the water.</p></blockquote>\n<p>All of this helps explain why larger birds often fly in a V formation — each bird benefits from the uplifting air pockets produced by the bird in front of it, conserving 20 to 30 percent of the calories needed for flight compared to flying solo. Because the lead bird takes most of the aerodynamic and caloric brunt shielding the rest from the wind, the flock takes turns in the frontmost position. </p>\n<p>This, too, is the physics of any healthy community, any healthy relationship — the physics of vulnerability and trust. Because life always exerts different pressures on each person at different times, internal or external, thriving together is not a matter of always pulling equal weight but of accommodating the ebb and flow of one another’s vulnerability, each trusting the other to shield them in times of depletion, then doing the shielding when replenished. One measure of love may be the willingness to be the lead bird shielding someone dear in their time of struggle, lifting up their wings with your stubborn presence.</p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=600%2C928&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/PassengerPigeon_love_hi-res.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-passenger-pigeon-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-passenger-pigeon-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>Couple this fragment of <a href=\"https://www.amazon.com/Miraculous-Material-Understanding-Wonders-Nature/dp/0593701488/?tag=braipick-20\" target=\"_blank\"><strong><em>The Miraculous from the Material</em></strong></a> — the rest of which explores the science behind wonders like fireflies and eclipses, hummingbirds and Saturn’s rings — with <a href=\"https://www.themarginalian.org/2024/05/09/baker-peregrine/\">the peregrine falcon as a way of seeing and a state of being</a>, the enchanting otherness of <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">what it’s like to be an owl</a>, and the science of <a href=\"https://www.themarginalian.org/2024/07/02/birds-dream-rem/\">what birds dream about</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"a5db0b584e0c3d1128dc038d97ea5d78dd95a3c02e6dd97695a525b86797df9a","category":"Sites"}