{"title":"Human Intervention as a Competitive Advantage","link":"https://sive.rs/hi","date":1363824000000,"content":"<h3>\nThe listening algorithm\n</h3>\n<p>\nA year after I started CD Baby, when it was still just me in my bedroom, the CEO and VP of a hugely-funded Silicon Valley online music company contacted me, saying they wanted to fly out to New York to meet me.\nI said OK, and we met a week later for dinner.\n</p><p>\nDinner was a lot of blah blah blah smalltalk, and I wondered what they really wanted.\nThen they finally got to the real point:\n</p><p>\n“The reason we flew out to meet you is because we’ve been looking at many music recommendation engines, and the one that’s powering cdbaby.com is one of the best we’ve found.\nCould you tell us a little something about the algorithms and data points you’re using?”\n</p><p>\nUh...\nI was confused, and asked what they meant.\n</p><p>\nThey said, “The music recommendations on your site don’t seem to be sales-driven like Amazon.\nThe music-matching algorithm comes up with incredible recommendations.\nWhat software are you using for that?”\n</p><p>\nAh! I get it.\nI smiled and pointed to my ear.\n</p><p>\n“No software.\n<strong>\nI just listen to everything that comes in, and recommend other good stuff like it.”\n</strong>\n</p><p>\nNow they looked confused.\n<strong>\n“But how will that scale?\n</strong>\nYou can’t just listen to every single album!\nWhat will you do when you start getting a hundred albums a day?”\n</p><p>\nI said, “Maybe hire someone just to listen.\nI don’t know.\nI’m not there yet.\nI’ll worry about it then.”\n</p><p>\nAnd that’s what I did.\nWhen we were getting a hundred albums a day, it became someone’s full-time job to listen to every new arrival and do the internal recommendations.\n</p>\n<h3>\nMinimizing or Maximizing?\n</h3>\n<p>\n<strong>\nWhen everyone else is trying to automate everything, using a little human intervention can be a competitive advantage.\n</strong>\n</p><p>\nThe problem is when business owners see it as a cost, instead of an opportunity.\n<strong>\nTrying to minimize costs, instead of maximize income, quality, loyalty, happiness, connection, and all those other wonderful things that come from real human attention.\n</strong>\n</p><p>\nYou can buy a fancy phone routing system, so people have to listen to 9 options, choose option 5, then listen to 6 more options...\n</p><p>\n... or ...\n</p><p>\nYou can hire a charming person to pick up the phone on the first ring, and make a great impression.\n</p><p>\n<strong>\nWhich one do you think will win you new fans?\n</strong>\n</p><p>\nYou can put rules into your online forms, so if someone puts a dash in their phone number, or writes “coming soon” as their URL, it tells them they’re wrong and makes them do it over again....\n</p><p>\n... or ...\n</p><p>\nYou can have new submissions be checked-over quickly by a real person.\nIt’s worth the 10 seconds of human effort, to <strong>keep the end-user experience easy</strong> but the internal data correct.\n</p><p>\nIt’s fun for techies to try to find the tech solution to everything, but don’t forget that even a tiny touch from a real person can be the best algorithm, and a massive business maximizer.\n</p>\n<h3>\nWho should do the work?\n</h3>\n<p>\nI understand the mindset.\nIt’s saying, “By having our software and our users do most of the work, we can keep our business efficient and scalable.”\n</p><p>\nBut if you want them to pay you, if you want to be more valuable, you have to <a href=\"http://www.paulgraham.com/schlep.html\">take on more of that work</a>.\n</p><p>\nI meet so many entrepreneurs who are convinced their thing will be as big as Facebook, so they can’t afford to have a personal touch for all those billions of users that are going to start flowing through their app.\n</p><p>\nBut by removing all human contact, they’re making their app less valuable.\nThey’ll never get big enough for the question of scale to matter.\n</p>\n<img src=\"/images/carrying_crate.png\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a69e9318ef344286a44b5009359d4bc6a423530b6feb162e277b9f8b6e879eee","category":"default"}