{"title":"Do We Live in an Infinite Nesting Doll of Black Hole Universes?","link":"https://kottke.org/24/05/infinite-black-hole-universes","date":1716476739000,"content":"\n        <p></p>\n\n<p>Kurzgesagt is back with another video about black holes; it has the innocuous-seeming title of The Easiest Way To Build a Black Hole. But the main topic of the video is the speculation that universes (like ours!) might exist within black holes.</p>\n\n<blockquote><p>Black holes might create infinite universes while destroying time and space. Everything in existence could be black holes, all the way down. We might live inside a black hole that is inside a black hole, that is inside a black hole. But let’s start at the beginning and build a black hole out of air.</p></blockquote>\n\n<p>This one is a bit of a brain-bender. From <a href=\"https://sites.google.com/view/sources-black-hole-universe/\">the show notes</a>:</p>\n\n<blockquote><p>The first part of the script is based on the empirical fact that, somewhat intriguingly, the observable universe seems to have the exact size and mass that would be required to make a black hole as big as the observable universe itself.</p>\n\n<p>The second, completely independent proposal we explore is the idea that our Universe could be born from the singularity of a black hole, and that in turn the universe that contains that black hole could be born from a black hole itself. If so, universes in later generations of this process could be better fitted to produce an abundance of black holes, in a sort of “natural selection” towards efficient black hole production.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/black%20holes\">black holes</a> · <a href=\"https://kottke.org/tag/Kurzgesagt\">Kurzgesagt</a> · <a href=\"https://kottke.org/tag/physics\">physics</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/infinite-black-hole-universes\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"a6b843fc1c57bf174c85396b5883379366113c5ad23125b6428ef4c03932cd4b","category":"default"}