{"title":"Twelve Days In Korea and Japan","link":"https://www.usv.com/writing/2024/10/twelve-days-in-korea-and-japan/","date":1728421242000,"content":"<p>When I woke up on Friday, September 27th, the first thing I did was put on an out-of-office notification on my email. That felt so damn good. It meant that for the next twelve days, I was dialing work down to the bare minimum and going away with The Gotham Gal to recharge and refresh.</p>\n<p>We spent five days/nights in Seoul and another five days/nights in Tokyo. It was the first time for us in Seoul and the third time in Tokyo (and more broadly Japan). We did no work meetings and largely spent time together just the two of us. We walked more than 150,000 steps, took dozens of subway rides, and saw lots of both cities. We shopped, ate, drank, and soaked up the people and the culture as much as we could.</p>\n<p>We are not “hire a driver/guide” tourists. I appreciate that approach to travel and have done it a few times with friends who prefer to travel that way. But when the Gotham Gal and I travel by ourselves, we do a ton of research and then get on our walking shoes and throw ourselves at the city. I particularly like taking the subway because that is where you see the people going about their daily routines. It gives you a sense of the people and the culture.</p>\n<p>We ate in the food markets, the lunch spots with people on their lunch break, and also in some of the best restaurants in Seoul and Tokyo. I had a full Japanese breakfast (see the photo above) every morning in Tokyo. There is nothing like a Japanese breakfast to start your day off right.</p>\n<p>We really like to shop in Korea and Japan. Many of our favorite designers are from there and they are creative without impacting the comfort and wearability of the clothes. So we did a ton of shopping and came back with lots of great stuff to wear this fall and winter.</p>\n<p>It’s a long flight there and back. The time difference from NYC is thirteen hours so the jet lag is no joke. But it is a great trip, the people are amazing, and the culture is quite different from what we have in the west and very compelling to us.</p>\n<p>We had a great time and hope to go back soon.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/twelve-days-in-korea-and-japan/\">Twelve Days In Korea and Japan</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"a702f253580116d8c571f8aaadc760452bfd14b267b01d60b77812cd47d0b7a9","category":"Sites"}