{"title":"List songs and life after the end of the world","link":"https://interconnected.org/home/2024/11/29/end","date":1732892700000,"content":"<div>\n<p>I am a sucker for the micro-genre of list songs with specific cultural references? They regularly capture a kind of modern malaise that I enjoy wallowing in, late at night.</p>\n<p>Hey I’m going to give you a bunch of YouTube links so make sure you’ve got your AirPods.</p>\n<h3>We Didn’t Start the Fire</h3>\n<p>The canonical list song is <a href=\"https://www.youtube.com/watch?v=eFTLKWw542g\">We Didn’t Start the Fire</a> by Billy Joel <em>(YouTube).</em></p>\n<p>Events are between 1949 (Joel’s birth) to 1989 (when the single was released).</p>\n<blockquote>\n<p>Buddy Holly, Ben Hur, space monkey, mafia<br />\nHula hoops, Castro, Edsel is a no-go<br />\nU2, Syngman Rhee, Payola and Kennedy<br />\nChubby Checker, Psycho, Belgians in the Congo</p>\n</blockquote>\n<p>Ages ago I got that whole list of cultural references, looked up their Wikipedia articles, and <a href=\"https://interconnected.org/home/2014/12/12/billy_joel\">ranked them according to page traffic</a> (2014). That’s the list if you’re interested.</p>\n<h3>American Pie</h3>\n<p>Does <em>American Pie</em> by Don MacLean count? I think it does. From 1971.</p>\n<blockquote>\n<p>Oh, and while the king was looking down<br />\nThe jester stole his thorny crown<br />\nThe courtroom was adjourned<br />\nNo verdict was returned</p>\n</blockquote>\n<p>Like, while some of the references are obscure, it narrates a particular vibe shift in America in the 1960s.</p>\n<p>I really enjoyed this <a href=\"https://www.youtube.com/watch?v=QmyGZ64J9yg\">video-narrated version of American Pie</a> <em>(YouTube)</em> which tells you what everything means.</p>\n<p>Although MacLean denies it and says the character is a composite coyete archetype, the jester seems to be Bob Dylan.</p>\n<p>And here’s <a href=\"https://interconnected.org/home/2024/07/23/change\">when I blogged about Dylan before</a> in particular <em>The Times They Are A-Changin’</em> (1963) and its ancient wisdom hard won and smuggled out from that very same vibe shift:</p>\n<blockquote>\n<p>Come mothers and fathers<br />\nThroughout the land<br />\nAnd don’t criticize<br />\nWhat you can’t understand<br />\nYour sons and your daughters<br />\nAre beyond your command<br /></p>\n</blockquote>\n<h3>The Boy in the Bubble</h3>\n<p>Another:</p>\n<p><a href=\"https://www.youtube.com/watch?v=Uy5T6s25XK4\">The Boy in the Bubble</a> by Paul Simon <em>(YouTube)</em> from his 1989 album <em>Graceland</em> (which has been a personal touchstone since it came out).</p>\n<p>Oh from back when music videos were good. Video collage.</p>\n<p>The boy in the bubble is a reference to an at-the-time famous medical case of a boy with an immune system disease.</p>\n<p>And while <em>The Boy in the Bubble</em> isn’t quite a list song, it is constructed from cultural references.</p>\n<blockquote>\n<p>These are the days of lasers in the jungle<br />\nLasers in the jungle somewhere<br />\nStaccato signals of constant information<br />\nA loose affiliation of millionaires and billionaires, and baby</p>\n</blockquote>\n<p>I’ve always heard those lines as the beginnings of telecommunications, and the global village, and the internet, and the weird sort of networked capitalism that seems to precipitate.</p>\n<p>Is this was Simon was getting at? Who knows.</p>\n<p>But you wouldn’t comment on telecommunications now, it’s too normalised, we can’t see it like fish can’t see water. And you couldn’t comment on it before it was commonplace, of course.</p>\n<p>So there’s this moment where something is growing in prominence when it’s possible to dowse the gestalt and say – <em>hey this is new, and this is what’s distinctive about it.</em></p>\n<p>Artists, in touch with the collective unconscious as they are, say these things whether they know why or not.</p>\n<p>And it’s worth going back and listening to people who made observations that were once fresh but now mundane, because the past has a perspective on the present that is no longer unavailable to us.</p>\n<h3>It’s The End Of The World As We Know It</h3>\n<p>To give it its full title: <a href=\"https://www.youtube.com/watch?v=Z0GFRcFm-aY\">It’s The End Of The World As We Know It (And I Feel Fine)</a>, REM, 1987 <em>(YouTube).</em></p>\n<p>Firstly: it is remarkable that this came out two years BEFORE <em>Graceland.</em></p>\n<p>Second, let me give you some idea of the context.</p>\n<p>Like, the Cold War? It started easing late 1989 at the Gorbachez/Bush Malta Summit. But before then… I was recently chatting with some millennials and saying that, yes, I did thoroughly believe that I’d be in some kind of nuclear wasteland by the time I’m the age I am now. It didn’t feel like a 100% certain outcome, not consciously, but a dream-like assumption deep in your bones.</p>\n<p>Then also it was the rise of awareness of climate change via the hole in the ozone layer and acid rain.</p>\n<p>So REM are bathing in this apocalyptic zeitgeist and the appropriate response is – well it all goes on as normal, you disassociate a bit I guess, party some. It’s an upbeat some.</p>\n<p>Fin de siecle and feeling fine.</p>\n<p>Fin de siecle meaning literally <em>end of century,</em> from 1890s France, so the end of the world and the end of time all at once. It becomes impossible to peer over the threshold and to imagine the future.</p>\n<p>Compare this to the late 1990s…</p>\n<p>When there was a genuine-but-fake fin de siecle feeling – the end of the millennium and all that.</p>\n<p>But I say it was fake because, although we were just <em>waiting,</em> paused for <em>years</em> it seemed, waiting for the clock to tick over from 1999, there wasn’t yet that genuine end of the world apocalyptic feeling underpinning the ennui and nihilistic hedonism.</p>\n<p>The late 90s was liberalism in the ascendant; the triumph of capitalism (not yet neoliberalism) but tempered still (we weren’t aware) by the post-war social contract; pre 9/11; no internet in mainstream culture.</p>\n<p>You could say we had our heads in the sand, and we did, enjoying the middle years of the long boom and the end of history and the benevolent shadow of the Pax Americana, meanwhile chucking missiles into Afghanistan and not really thinking about it.</p>\n<p>We didn’t have the end of the world again until quite recently.</p>\n<h3>That Funny Feeling</h3>\n<p><em>That Funny Feeling,</em> Bo Burnham. From 2021, a year into the pandemic. <a href=\"https://www.youtube.com/watch?v=ObOqq1knVxs\">Here’s a vid</a>, which is amazing, BUT:</p>\n<p>Watch this instead: <a href=\"https://www.youtube.com/watch?v=7pZ6tMtRsRA\">Phoebe Bridgers cover of That Funny Feeling, live</a> <em>(YouTube).</em></p>\n<p>One of the great list songs, truly.</p>\n<blockquote>\n<p>The surgeon general’s pop-up shop, Robert Iger’s face<br />\nDiscount Etsy agitprop, Bugles’ take on race<br />\nFemale Colonel Sanders, easy answers, civil war<br />\nThe whole world at your fingertips, the ocean at your door<br />\nThe live-action Lion King, the Pepsi Halftime Show<br />\nTwenty-thousand years of this, seven more to go<br /></p>\n</blockquote>\n<p>Gives me shivers.</p>\n<p>Bridgers slows it right down, makes it intimate. You can just about make out the crowd joining in – it’s a collective prayer, a litany of signs, witnessed collectively.</p>\n<p>And then at the end she picks it up, the refrain is swept upwards into joy, a marching band,</p>\n<blockquote>\n<p>Hey, what can you say? We were overdue<br />\nBut it’ll be over soon, you wait<br />\nBa-da-da, ba-da-da, ba-da</p>\n</blockquote>\n<p><em>\"(And I feel fine.)\"</em></p>\n<p>So Burnham has put his finger on this dual-faced feeling of the accumulation of signs of the rising eschaton and, well – this clear-eyed observational desperate quality paired with an intoxicating lightness of being. The heady weightless freedom of powerlessness in the face of [<a href=\"https://www.gyford.com/phil/writing/2020/03/22/weeknotes/#s6\">waves hands</a>] all this.</p>\n<hr />\n<p>My guilty secret is that when everyone else has gone to bed, I pour an extra glass of red wine and sit up late in the dark and sort of wallow in absurd melancholy; cosy maudlin impotent doom-spotting crossed with cheerily watching music videos about the end of the world on YouTube.</p>\n<p>Which I’ve always done a little bit I suppose?</p>\n<p>Between the ages of 15 and 19, I blu-tacked newspaper clippings to my bedroom wall in a giant collage of the bafflingly awful and po-faced absurd.</p>\n<p>Then from 2017 till earlier this year I collected words and phrases as they resonated for me. <a href=\"https://interconnected.org/home/2021/02/26/words\">Here’s a list of 557</a> (2021, updated today).</p>\n<p>I suppose in that act of collecting I’ve always been hoping to hear the word that is so novel at that point and over time becomes normalised to the point that we no longer hear it, turning myself into some sensitive scientific instrument, a human equivalent to that vast neutrino detector in Japan, the pitch black salt mine filled with water and cameras, the <a href=\"https://www-sk.icrr.u-tokyo.ac.jp/en/sk/experience/gallery/\">Super-Kamiokande detector</a> which can see rare supernova neutrinos as they experience drag in the heavy water and emit the faintest glimmer of blue light.</p>\n<p>It’s hard to winnow the mundane from the existential and so you put it all in your pockets; that’s why the list song works so well when you’re in the midst of an unravelling.</p>\n<hr />\n<p>AND YET, <em>A Funny Feeling</em> smacks different today versus 2021.</p>\n<p>In my late night, red wine fuelled antenna mode, something’s changed:</p>\n<p>Listening in 2024 it sounds a thousand vibe shifts ago.</p>\n<p>Fin de siecle happened! All those things it says, yes that all occurred. Ok well done, what now. What do you do on the <em>other side</em> of the end of time?</p>\n<p>We’re post-woke, lfgggg screw the NIMBYs and your feelings too, there’s a spirit of joyful vengeance in the air, and the rage and greed is simultaneous with an ebullient brimming over of possibility and building.</p>\n<p>And I’m not saying I agree - far, far, far from it, let’s be clear - but I’m  just trying to put my finger on a moment: the needle jumped. The other end of the <a href=\"https://interconnected.org/home/2022/03/11/saeculum\">vibe shift</a>.</p>\n<hr />\n<p>I recently learnt about <a href=\"https://en.wikipedia.org/wiki/Mono_no_aware\">mono no aware</a>, <em>\"a Japanese idiom for the awareness of impermanence.\"</em></p>\n<p>Here’s a poem:</p>\n<blockquote>\n<p>In Kyoto,<br />\nhearing the cuckoo,<br />\nI long for Kyoto.</p>\n</blockquote>\n<p><a href=\"https://www.poetryfoundation.org/poems/48708/in-kyoto-\">In Kyoto</a>, Matsuo Basho (1690).</p>\n\n\t<hr />\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/dowsing-the-collective-unconscious\">dowsing-the-collective-unconscious</a>\n\t(9), \n\t\n\t<a href=\"https://interconnected.org/home/tagged/eschatology\">eschatology</a>\n\t(8), \n\t\n\t<a href=\"https://interconnected.org/home/tagged/poetry\">poetry</a>\n\t(6).\n\t\n\t</small></p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"a75a669165c06bac61380e69fb8fa0c24ccf023f068b6b02500a8631fea3c5f1","category":"Sites"}