{"title":"FeedLand and WordPress","link":"http://scripting.com/2024/04/24/132025.html?title=feedlandAndWordpress","date":1713964825000,"content":"<p>There's a <a href=\"https://github.com/a8cteam51/feedland-blogroll\">new plugin</a> that adds a <a href=\"https://blogroll.social/\">blogroll</a> to a WordPress site. </p>\n<p>It would be helpful if people who are regular readers of Scripting News who use WordPress, set up a test site, give it a try and let us know how it goes. You can help us get to the next level with this stuff. </p>\n<p>So there are two sides, the FeedLand side and the WordPress side.</p>\n<ul>\n<li><b>The FeedLand side</b>. <a href=\"https://feedland.com/?signonscreen=true\">Sign on</a> to FeedLand, create an account if you don't have one, and subscribe to a bunch of feeds. These will be the feeds in your blogroll.  There are some tips on how to find feeds, in the <a href=\"http://scripting.com/2024/04/24/132025.html#a134443\">next section</a>.</li>\n<li><b>The WordPress side</b>. There's a <a href=\"https://github.com/a8cteam51/feedland-blogroll\">new plugin</a>, developed by the people at the Team51 group at Automattic. They have a <a href=\"https://github.com/a8cteam51/feedland-blogroll/blob/trunk/README.md\">checklist</a> for how to install the plugin in a WordPress site. </li>\n</ul>\n<p>You can get ideas for feeds for your blogroll from reading other people's feed lists. When you see a checkbox that isn't checked, you can subscribe to the feed simply by checking the box. </p>\n<p>Have a look at <a href=\"https://feedland.com/?username=davewiner\">my feed list</a> for ideas. Here's a list of <a href=\"https://feedland.com/?userslist\">recent users</a>, click on their names to see their feed lists. You don't have to finish this now, you can come back and tune this up anytime.</p>\n<p>Developers: Use <a href=\"https://github.com/scripting/feedlandBlogrollToolkit\">feedlandBlogrollToolkit</a> to add blogrolls to other platforms. </p>\n<p>If you have questions or comments, or need help getting it working, post a note in the <a href=\"https://github.com/a8cteam51/feedland-blogroll/discussions/15\">discussion group</a> here. </p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"a8342777f875d473dc658e554d6d3f410984ed6245818011276782114a3218bc","category":"default"}