{"title":"Everything is my fault","link":"https://sive.rs/my-fault","date":1355011200000,"content":"<p>\nI used to get mad at people.\nThey lied.\nThey betrayed me.\nThey disappeared.\n</p><p>\nDo you hear the pattern?\n“They this. They that.”\n</p><p>\nWhen someone upsets you, it’s human nature to feel it’s their fault.\nBut one day I tried thinking of everything as my fault.\n</p><p>\nI created the environment that made them feel they had to lie.\nI mistook their neutral behavior as betrayal.\nI made it more appealing for them to disappear than to communicate.\n</p><p>\nIt felt so good to think it was all my fault!\n</p><p>\nThis is way better than forgiving.\nWhen you forgive, you’re still assuming that they’re wrong and you’re the victim.\n</p><p>\nBut to decide it’s your fault feels amazing!\nNow you weren’t wronged.\nPeople were just playing their part in the situation you helped create.\n</p><p>\nWhat power!\n<strong>\nNow you’re the person who made things happen, made a mistake, and can learn from it.\n</strong>\nNow you’re in control and there’s nothing to complain about.\n</p><p>\nThis philosophy feels so good that I’ve playfully decided to apply this rule to the rest of my life.\nAs soon as I catch myself blaming anyone for anything, I decide it’s my fault.\n</p>\n<ul><li>\nThe guy who ran away with my investment?\nMy fault.\nI should have verified his claims.\n</li><li>\nThe love of my life who suddenly dumped me?\nMy fault.\nI let our relationship plateau.\n</li><li>\nDon’t like my government?\nMy fault.\nI could get involved and change it.\n</li></ul>\n<p>\nDoesn’t that feel more powerful?\nTry it.\nMaybe instead of “fault” you prefer the word “responsibility,” but the idea is the same.\nThink of every bad thing that happened to you, and imagine that you happened to it.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"a848d881320962a9d19901b058ecc33ed9353554111841ddee8ff0971006aeb1","category":"default"}