{"title":"What Are The Civilian Applications?","link":"https://interconnected.org/home/2024/10/24/soup","date":1729774080000,"content":"<div>\n<p>tl;dr tomato soup.</p>\n<p>Thanks to one of my <a href=\"https://interconnected.org/home/2020/09/24/unoffice_hours\">unoffice hours</a> (coming up on 400 booked calls) I recently learnt about <a href=\"https://twig.bio\">twig</a>, which is a biotech startup manufacturing industrial chemicals using custom bacteria.</p>\n<p>The two examples they cite: palm oil which is used in lipstick but displaces rainforests; isoprene which is used to make tyres but comes from fossil fuels.</p>\n<p>What if instead you could engineer a strain of bacteria to bulk produce these chemicals sustainably?</p>\n<p>The capabilities are present in the metabolic pathways. So that’s what twig does. At scale, is the promise.</p>\n<ol>\n<li>I hadn’t realised this kind of biotech had gotten to commercialisation! And in London too. Good stuff.</li>\n<li>What Are The Civilian Applications?</li>\n</ol>\n<hr />\n<p><em>What Are The Civilian Applications?</em> is of course a <a href=\"https://theculture.fandom.com/wiki/List_of_spacecraft\">Culture ship name</a>, a GSV (General Systems Vehicle) from <em>The Use of Weapons</em> by Iain M. Banks.</p>\n<p>It is also an oblique strategy we deployed regularly in design workshops back in the day at BERG, introduced (I think? Gang please correct me if I’m wrong) by long-time design leader and friend <a href=\"https://moleitau.work\">Matt Jones</a>. <em>That’s his project history. Go have a read.</em></p>\n<p>Let me unpack.</p>\n<p><a href=\"http://music.hyperreal.org/artists/brian_eno/osfaq2.html\">Oblique Strategies</a> <em>(a history)</em> by Brian Eno and Peter Schmidt, 1975: a deck of approx 100 cards, each of which is a prompt to bump you out of a creative hole. </p>\n<p>For example:</p>\n<p><em>\"Honor thy error as a hidden intention\"</em></p>\n<p>Or:</p>\n<p><em>\"Discard an axiom\"</em></p>\n<p>And so on.</p>\n<p>In product invention, which is kinda what we did at BERG and kinda what I do now, it’s handy to carry your own toolkit of prompts. So I adopted What Are The Civilian Applications? into my personal deck of oblique strategies.</p>\n<hr />\n<p><em>Therefore.</em></p>\n<p>What would do you with engineered bacteria that can make palm oil or whatever, if it were cheap enough to play with, if the future were sufficiently distributed, if we all had it at home?</p>\n<p>Like, it’s a good question to ask. What would civilians do with engineered bacteria?</p>\n<p>Tomato soup.</p>\n<p>Instead of buying tomato soup at the store, I’d have a little starter living in a jar. A bioreactor all of my own, and I’d fill it with intelligently designed bacteria that eat slop and excrete ersatz Heinz tomato soup.</p>\n<p>I’m not 100% sure what “slop” is in this context. The food I mean. Maybe the bacteria just get energy from sunlight, fix carbon from the air, and I drop in a handful of vitamin gummies or fish flakes every Monday?</p>\n<hr />\n<p>A second oblique strategy adopted into my personal deck over the years:</p>\n<p><em>\"A good science fiction story should be able to predict not the automobile but the traffic jam,\"</em> by Frederik Pohl. <a href=\"https://interconnected.org/home/2022/11/21/drones\">As previously discussed</a> re a national drone network.</p>\n<p>Let’s say I can go to the store and buy a can of <strong>Perpetual Heinz,</strong> or however they brand it. A can with a sunroof on the top and a tap on the side that I keep in the garden and I can juice it for soup once a week for a year, or until the bacterial population diverges enough that I’m at risk of brewing neurotoxins or psychedelics or strange and wonderful new flavours or something.</p>\n<p>Heinz is not going to like that, economically. They’ll require me to enrol in some kind of printer and printer ink business model where I have to subscribe to the special vitamin pills to keep (a) the soup colony alive and (b) their shareholders happy.</p>\n<p>Which will end up being pricey, like the monthly cash we all pay out to mutually incompatible streaming services. Demand will arise for black market FMCGs on the dark web. Jars of illegal Infinite Coca Cola that only requires the cheap generic slop and it tastes just the same.</p>\n<p>So I love to play with these strategies and imagine what the world might be like. Each step makes a sort of sense yet you end up somewhere fantastical – that’s the journey I want to take you on in text, too. Then the game, in product invention, is to take those second order possibilities and bring them back to today. (I’m giving away all my secrets now.)</p>\n<p>But I prefer cosier, more everyday futures:</p>\n<p>Grandma’s secret cake recipe, passed down generation to generation, could be literally passed down: a flat slab of beige ooze kept in a battered pan, DNA-spliced and perfected by guided evolution by her own deft and ancient hands, a roiling wet mass of engineered microbes that slowly scabs over with delicious sponge cake, a delectable crust to be sliced once a week and enjoyed still warm with cream and spoons of pirated jam.</p>\n<p>A small jar of precious, proprietary cake ooze handed down parent to child, parent to child, together with a rack filled with the other family starter recipes, a special coming of age moment, a ceremony.</p>\n\n  <hr />\n\n\n\n  <p><small>Auto-detected kinda similar posts:</small></p>\n  <ul>\n  \n  <li><small><a href=\"https://interconnected.org/home/2021/04/16/factories\">Salads, shipping containers, and subtle signs of a supply chain reset</a>\n  (16 Apr 2021)</small></li>\n  \n  </ul>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"a88de5c1dd2570a3bec98ac1d6ea289f5b17e28f78fb098d2355a017d84575d6","category":"Sites"}