{"title":"Let&#8217;s Build a Massive Meta McDonald&#8217;s in Times Square","link":"https://kottke.org/24/11/lets-build-a-massive-meta-mcdonalds-in-times-square-1","date":1731699636000,"content":"\n        <p>Writing for The Awl, Jeb Boniakowski <a href=\"https://web.archive.org/web/20130125002855/http://www.theawl.com/2013/01/giant-mcdonalds-times-square\">shares his vision for a massive McDonald’s complex in Times Square</a> that serves food from McDonald’s restaurants from around the world, offers <a href=\"http://en.wikipedia.org/wiki/List_of_McDonald's_products#Former_items\">discontinued food items</a> (McLean Deluxe anyone?), and contains a food lab not unlike <a href=\"http://www.latenightwithjimmyfallon.com/blogs/2011/02/late-night-eats-on-location-at-the-momofuku-test-lab/\">David Chang’s Momofuku test kitchen</a>.</p>\n\n<blockquote><p>The central attraction of the ground floor level is a huge mega-menu that lists every item from every McDonald’s in the world, because this McDonald’s serves ALL of them. There would probably have to be touch screen gadgets to help you navigate the menu. There would have to be whole screens just dedicated to the soda possibilities. A concierge would offer suggestions. Celebrities on the iPad menus would have their own “meals” combining favorites from home (“Manu Ginobili says ‘Try the medialunas!’”) with different stuff for a unique combination ONLY available at McWorld. You could get the India-specific Chicken Mexican Wrap (“A traditional Mexican soft flat bread that envelops crispy golden brown chicken encrusted with a Mexican Cajun coating, and a salad mix of iceberg lettuce, carrot, red cabbage and celery, served with eggless mayonnaise, tangy Mexican Salsa sauce and cheddar cheese.” Wherever possible, the menu items’ descriptions should reflect local English style). Maybe a bowl of Malaysian McDonald’s Chicken Porridge or The McArabia Grilled Kofta, available in Pakistan and parts of the Middle East. You should watch this McArabia ad for the Middle Eastern-flavored remix of the “I’m Lovin’ It” song if for nothing else.</p></blockquote>\n\n<p>And I loved his take on fast food as molecular gastronomy:</p>\n\n<blockquote><p>How much difference really is there between McDonald’s super-processed food and molecular gastronomy? I used to know this guy who was a great chef, like his restaurant was in the Relais &amp; Châteaux association and everything, and he’d always talk about how there were intense flavors in McDonald’s food that he didn’t know how to make. I’ve often thought that a lot of what makes crazy restaurant food taste crazy is the solemn appreciation you lend to it. If you put a Cheeto on a big white plate in a formal restaurant and serve it with chopsticks and say something like “It is a cornmeal quenelle, extruded at a high speed, and so the extrusion heats the cornmeal ‘polenta’ and flash-cooks it, trapping air and giving it a crispy texture with a striking lightness. It is then dusted with an ‘umami powder’ glutamate and evaporated-dairy-solids blend.” People would go just nuts for that. I mean even a Coca-Cola is a pretty crazy taste.</p></blockquote>\n\n<p>I love both mass-produced processed foods and the cooking of chefs like Grant Achatz &amp; Ferran Adrià. Why is the former so maligned while the latter gets accolades when they’re the same thing? (And simultaneously not the same thing at all, but you get my gist.) Cheetos are amazing. Oscar Meyer bologna is amazing. Hot Potato Cold Potato is amazing. Quarter Pounders with Cheese are amazing. Adrià’s olives are amazing. Coca-Cola is amazing. (<a href=\"http://kottke.org/10/10/andy-warhol-on-coca-cola\">Warhol</a>: ” A Coke is a Coke and no amount of money can get you a better Coke than the one the bum on the corner is drinking.”) WD50’s Everything Bagel is amazing. Cheerios are amazing. All have unique flavors that don’t exist in nature — you’ve got to take food apart and put it back together in a different way to find those new tastes.</p>\n\n<p>Some of these fancy chefs even have an appreciation of mass produced processed foods. Eric Ripert of the 4-star Le Berdardin <a href=\"http://www.gourmet.com/restaurants/2008/07/ripert_burger\">visited McDonald’s and Burger King</a> to research a new burger for one of his restaurants. (Ripert also <a href=\"http://www.thedailybeast.com/newsweek/2009/09/23/finally-a-highbrow-cooking-show.html\">uses processed Swiss cheese as a baseline flavor</a> at Le Bernardin.) David Chang <a href=\"http://video.pbs.org/video/2299820860\">loves instant ramen</a> and named his restaurants after its inventor. Ferran Adrià <a href=\"http://www.yankeefog.com/2005/07/innovacian_y_tr_1.html\">had his own flavor of Lay’s potato chips</a> in Spain. Thomas Keller <a href=\"http://www.esquire.com/blogs/food-for-men/thomas-keller-loves-in-n-out-7625313\">loves In-N-Out burgers</a>. Grant Achatz <a href=\"http://online.wsj.com/article/SB10001424052970203918304577241751742269214.html\">eats Little Caesars pizza</a>.</p>\n\n         <p><em>[This is a vintage post originally from Jan 2013.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/David%20Chang\">David Chang</a> · <a href=\"https://kottke.org/tag/Eric%20Ripert\">Eric Ripert</a> · <a href=\"https://kottke.org/tag/Ferran%20Adria\">Ferran Adria</a> · <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/Grant%20Achatz\">Grant Achatz</a> · <a href=\"https://kottke.org/tag/Jeb%20Boniakowski\">Jeb Boniakowski</a> · <a href=\"https://kottke.org/tag/McDonald%27s\">McDonald’s</a> · <a href=\"https://kottke.org/tag/NYC\">NYC</a> · <a href=\"https://kottke.org/tag/restaurants\">restaurants</a> · <a href=\"https://kottke.org/tag/Thomas%20Keller\">Thomas Keller</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a> · <a href=\"https://kottke.org/tag/Times%20Square\">Times Square</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"a93401731f94c1e228776e6c2c17ad7862fde46bc638c3a3902334942b1c39b7","category":"Sites"}