{"title":"Why Failure is the best teacher.","link":"https://om.co/2024/11/03/failure-and-perspective/","date":1730677149000,"content":"<p>For the sports fan in me, this has been a bit of a tough week. Two teams I normally like lost in a humiliating fashion. The New York Yankees lost to the L.A. Dodgers in the MLB World Series (4-1), and the Indian Cricket Team (ICT) was spanked by New Zealand, 3-0. The Indians have not been swept at home in 24 years.</p>\n\n\n\n<p>Both are very privileged teams—they have big budgets, lots of resources, and a lot of superstars. There is a certain arrogance, and it is not a surprise that they are loathed by anyone other than their fans.</p>\n\n\n\n<p>Once I had a chance to deal with my disappointments with the two teams, I reflected on their respective defeats. Their humiliation on the field was a reminder of what matters, both in sports and life.</p>\n\n\n\n<p>Let’s see: for starters, both teams didn’t do little things right.</p>\n\n\n\n<p>The Yankees made fielding errors, and their manager made questionable calls. The Indians also made mental errors, had terrible base running, and tweaked their hitting order. I could go on. There was a certain mental laziness to their tactics. ICT captain Rohit Sharma and the rest of the team looked out of sorts. They couldn’t play the slow spin pitching, something India used to do well. Now they go and play the Australians. Aussies on their home turf are no joke, and I won’t be surprised to see the Indians lose down under as well.</p>\n\n\n\n<p>India got the broom—“swept”—on their home turf by New Zealand, which has fewer people than my old neighborhood (okay, I exaggerate a little). Fewer kids play cricket there than in my old stomping grounds. Most of their players are not stars, but they are a very good team because they play like a team. They win because they do the little things right. They keep their emotions in check. And when they lose, they move on from their defeats.</p>\n\n\n\n<p>The Kiwis remind me of every startup that succeeds in its mission. They don’t have the resources of the biggest competitors, and yet, they somehow manage to scrape their way to the top. Indians remind me of companies like Google and Amazon Web Services, resting on their laurels and letting OpenAI, Perplexity, and Microsoft’s Azure to set the agenda of the future of search and cloud computing.</p>\n\n\n\n<p>For example, it wasn’t too long ago that the Kiwis lost to Sri Lanka badly. They showed up as underdogs to fight the number-one ranked team in the world, with the same positive attitude. Again, they maintained perspective and really capitalized on the shortcomings of the Indians. The Kiwis scouted their opponents well, as they did in the most recent series against India.</p>\n\n\n\n<p>When thinking about the Indians, I couldn’t help but also think about the shoddy effort of the New York Yankees.</p>\n\n\n\n<p>Game 5’s fifth inning is perhaps going to go down in baseball infamy. The Yankees performed in such an ugly fashion that it was really hard to watch. The interesting part was that <a href=\"https://nypost.com/2024/10/31/sports/yankees-world-series-failure-started-with-fundamental-issues/\">the Dodgers had scouted the Yankees</a> and knew that the team was terrible at the basics of base running and fielding. They were counting on the Yankees to self-immolate. (The Indians had their version of self-immolation throughout the series against New Zealand, especially in Mumbai.)</p>\n\n\n\n<p>It didn’t help that Yankees manager Aaron Boone was bumbling at times. His decision to give the ball to Nestor Cortes, a pitcher who had not pitched in six months, cost the Yankees Game 1 of the series. India’s captain decided to bat in overcast conditions at the Bangalore Test, playing right into the hands of the Kiwis, who thrive under dark skies. Sadly, no one on the Yankees or the Indian Cricket Team remembered that basic concept.</p>\n\n\n\n<p>I have always believed that the reason we love sports so much is because the games, in a way, offer us a condensed version of the drama of life itself. Happiness, sadness, elation, anticipation, disappointment, memories — a sports contest compresses all of that into a few hours (or a few days).</p>\n\n\n\n<p>When thinking over these games, I was reminded of the important lessons for life.</p>\n\n\n\n<ul>\n<li>Remember the basics, and do them well. </li>\n\n\n\n<li>It doesn’t matter how big or experienced you are, you gotta do your homework.</li>\n\n\n\n<li>And just when you think you know it all, you have to go back to the drawing board.</li>\n\n\n\n<li>You have to show up for the game (or any other situation in life) well-prepared. And by that, I mean you have to study hard.</li>\n\n\n\n<li>It doesn’t matter if you fail. At least you were well-prepared. In a way, that alone is a victory in itself.</li>\n</ul>\n\n\n\n<p>Why? Even if you fail, at least you know you are doing your best. You are giving yourself the highest odds to win. That is a good place to start.</p>\n\n\n\n<p><strong><em>November 3rd, 2024. San Francisco</em></strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"a9a40f422eb8a885a3aee2dfff8c8f529a9c4eed413e28dbb23de2c43e8106f3","category":"Sites"}