{"title":"Get personal.","link":"https://sive.rs/gpers","date":1518566400000,"content":"<p>\nBefore I got into the music industry, I had an idea of what it would look like:\nSome powerful manager or agent calling me into his office to discuss the business of my music.\n</p><p>\nThen I moved to New York City and became friends with cool people who also did things in music.\nSometimes these people were agents or managers, but that was secondary.\nMostly we were just friends.\n</p><p>\nSometimes I’d send them clients.\nSometimes they’d hook me up with opportunities.\nBut really we were just friends, talking about our love life or ideas, hanging out and having fun.\n</p><p>\nIt was a long time before I realized that I was already in the industry — that this is how things are done.\n<strong>\nPeople send business to people they like.\n</strong>\nIt’s all more personal than I had expected.\n</p><p>\nOne of my best friends in the world is also my lawyer.\nHe’s one of the top music lawyers in the world, but mostly he’s my friend.\nWe talk about cycling, his kids, and music.\nAnd sometimes we stop to discuss a recent contract.\n</p><p>\nThe initial contact usually happens for professional reasons.\nLike when I was looking for a lawyer, and someone introduced me to this guy.\n</p><p>\nWhen I hear music I love, I contact the musician, and say let’s meet.\nWithin minutes we’re talking about her dogs, microphones, Japan, and whatever.\nThen, when someone asks me to recommend some music, guess who comes to mind first?\n</p><p>\nPoint is:\nAs you’re out there in the music business, get personal.\n</p><p>\nDon’t always be selling yourself.\nThat keeps people at a distance from you, because it shows you’re not friends.\n</p><p>\n<strong>\nEven if it starts professional, get personal as soon as possible.\n</strong>\nBe a friend.\nThat’s how things are done.\n</p>\n<img src=\"/images/get-personal.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"aa393edf881c3fd65b3aaab56ac77a4caa7f3cfc78b5e552e48918a49193313b","category":"default"}