{"title":"A startup’s “tablet” gears up to take on Apple’s iPad","link":"https://om.co/2024/05/18/daylight-tablet/","date":1716046299000,"content":"<figure><img src=\"https://photos.smugmug.com/photos/i-4MK7RkX/0/K3m9JqGH3Rmf8rBjDtg3pzDKjw33TMZCTXBFhQT2/X4/i-4MK7RkX-X4.jpg\" /><figcaption>Anjan Katta, founder of Daylight Computer</figcaption></figure>\n\n\n\n<p>I am a tablet nerd. I have been since Steve Jobs introduced the iPad. </p>\n\n\n\n<p>Tablets, especially the iPad, <a href=\"https://om.co/gigaom/why-i-am-excited-about-the-ipad/\">connect with me emotionally</a>, much like my vintage fountain pen and notebook made out of Japanese paper. There is a reason why I use the iPad for most of my work, though lately, it has taken a backseat to a new device — the <a href=\"https://daylightcomputer.com\">Daylight Computer’s</a> Tablet.</p>\n\n\n\n<p>This is one of the most talked about devices in Silicon Valley. It was created by Daylight Computer, a company started by  Anjan Katta to solve his problem — he suffers from ADHD and wanted something that allowed him few distractions and allowed him to work with intent.  The reason I am excited about that new tablet is because it is optimized around reading, writing, and productivity. This is very different from the tablets we have had so far.  </p>\n\n\n\n<p>Arun Venkatesan, founder of Carrot Fertility and a design-centric engineer,<a href=\"https://arun.is/blog/daylight-tablet/\"> on his blog, writes</a>: </p>\n\n\n\n<blockquote>\n<p><a href=\"https://www.youtube.com/watch?v=6Fk1V5NqoD4\">At the original 2010 iPad launch</a>, the majority of demos were entertainment-focused, with only a brief nod to content creation. Today, t<a href=\"https://www.statista.com/chart/1482/activities-conducted-on-tablets/\">he data shows</a> that the majority of time spent on tablets is indeed for entertainment purposes, not productivity.</p>\n\n\n\n<p>Tablets, including the iPad, have largely become consumption-oriented entertainment devices, rather than the revolutionary productivity tools many had envisioned. Addressing this reality requires a more holistic rethinking of the tablet form factor and user experience – something the Daylight Tablet aims to change.</p>\n</blockquote>\n\n\n\n<p>What the company has created is a beautiful tablet — about the size of a normal iPad Air. It is just a “little less than white,” white, with a gorgeous screen. It is very simple, elegant, and lovely. It has an e-ink screen, and the matte monochrome paper-like display is optimized for reading, writing, and note-taking. This is much less stressful on the eye and easy to use even in direct sunlight. It has 8 GB memory, about 128 GB in-built storage, an 8-core chip, microphones, speakers, and a powerful battery.</p>\n\n\n\n<p>There is no camera — thank God!</p>\n\n\n\n<p>It has all the usual networking options – Bluetooth and Wifi. It has no cellular modem. I used it with my iPhone’s hotspot when sitting in the park. At home, I used my home wireless network.</p>\n\n\n\n<p>Reading on this device, thus far, has been a joy, especially when sitting in the park. I use it to peruse articles I have saved on my Reader app (from Readwise), lots of papers (PDFs), and, of course, an occasional note I write to myself.</p>\n\n\n\n<p>I used the browser and some of the specifically optimized apps such as Pocket. But it is mostly the browser. Much as I disdain Chrome on my desktop, it seems to be in perfect symbiosis with the device. I didn’t have much time with the device; I wish I had. The device I had in my hands was a prototype — and while it did have some other non-productivity apps, I didn’t care much about them. YouTube, for example.</p>\n\n\n\n<p>Daylight uses a version of Android (much like other devices, say Oculus) and allows you to tap into the Android app ecosystem — so you can use social networking apps, but that would be pretty pointless.</p>\n\n\n\n<p>For now, all I can say is that the team has done an amazing job so far, but a long journey awaits them, for we all know hardware is a hard game. This is an endeavor worth cheering for.</p>\n\n\n\n<p><em><strong>May 18, 2024. San Francisco. </strong></em></p>\n\n\n\n<h4>Related Reading: </h4>\n\n\n\n<p><a href=\"https://arun.is/blog/daylight-tablet/\">A Review of Daylight Computer’s Tablet</a>, by Arun Venkatesan. The article gives you a deeper understanding of the why and the how of the Daylight Tablet. </p>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/gigaom/why-i-am-excited-about-the-ipad/\">Why I Am Excited About the iPad</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"aa6daf92eda6ed4afc93bf0ac4cdbed461ae4430ea92f1576bb62b277c3d9153","category":"default"}