{"title":"Blixt","link":"https://www.usv.com/writing/2024/03/blixt/","date":1710949622000,"content":"<p>Existing electrical infrastructure is ill-suited to our current needs. It was developed for a world where we simply sent firm AC power from centralized power plants to end-customers. Today, however, electricity flows multi-directionally, as both AC and DC, and more intermittently. As we continue to use energy in increasingly complex ways, we will have to update the energy stack.</p>\n\n\n\n<p>Circuit breakers are a critical piece of the energy stack. They make it safe to send energy from the grid to the edge, and they uniquely touch every load. Despite their importance, circuit breaker design hasn’t fundamentally changed since 1923 when Hugo Stotz invented the resettable circuit breaker.</p>\n\n\n\n<p>Enter <a href=\"http://blixt.tech\">Blixt</a>, which has rebuilt the circuit breaker from the ground up. Their novel circuit breaker uses power electronics to replace mechanical switches with transistors. This approach allows the circuit breakers to function more like computers, making the energy passing through them <a href=\"https://www.usv.com/writing/2023/12/making-energy-programmable/\">programmable</a>. By manipulating current digitally, Blixt’s technology can respond to a fault 1000x faster than conventional circuit breakers and without the risk of generating arcs. </p>\n\n\n\n<p>Blixt’s circuit breakers’ programmability also unlocks new possibilities beyond core circuit breaker functionality, including real time monitoring of loads, predictive maintenance, remote and finer control, and DC compatibility. Blixt’s hardware makes electrical loads behave more like software – with greater ability to read data from them and write instructions to them. We believe this flexibility will prove especially useful as customers seek greater control of the energy they use.</p>\n\n\n<div>\n<figure><img src=\"https://lh7-us.googleusercontent.com/yuXiCiF7wazJskHKTEdoxu4jOvuEU_vjIVXUUaKFWKDKov79JsR6nN32B6dGMkR1jfhIFfrXjSm7XPSN_qgDxGduim-dpnK34CufAB2CGOK3ROg18zoSFQfQKKwZOX8mkNUb0eUE7miSfjBro51Vf2g\" /></figure></div>\n\n\n<p>Blixt’s strategy is well-aligned with <a href=\"https://www.usv.com/writing/2024/01/investing-at-the-edge-of-large-markets-under-transformative-pressure/\">our thesis</a>. Energy is a massive market under societal and technological pressures, and circuit breakers sit at the edge of the market. They’re cheap, simple to install, and live behind-the-meter. Despite their tremendous potential as the only piece of electrical infrastructure that touches each and every load, they’ve been largely ignored as technology. Blixt’s solid state circuit breakers have the potential to radically change how we use energy – and could do so without ever having to work through a utility.</p>\n\n\n\n<p>Blixt is already leveraging its technology and expertise to redefine more of the energy stack. Their <a href=\"https://blixt.tech/technology-power-converters/\">X-Verter</a> is a next-generation battery energy storage system that uses power electronics to achieve real-time cell-level control. The X-Verter obviates the need for an external inverter; instead, its cells can be made to generate AC sine waves themselves. This approach avoids the energy losses from external conversion and enables the system to bypass weak cells, improving the overall efficiency and extending the battery’s useful life. Beyond these core advantages, the X-Verter, like Blixt’s solid state circuit breaker, is built to be easily adapted by customers to their specific use-cases and to stay flexible as their needs evolve.</p>\n\n\n\n<p>We are excited to partner with Charlotta, Jens, Jan, Trued, and the rest of the team as they work to make energy programmable.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/03/blixt/\">Blixt</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Matt Mandel","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"aa83a46d18b186d90a2f19b7825be3d20c14585c06de5c528828d843ad49bde4","category":"default"}