{"title":"The Oldest World Map in the World","link":"https://kottke.org/24/08/the-oldest-world-map-in-the-world","date":1723157116000,"content":"\n        <p></p>\n\n<p>Irving Finkel, a curator at the British Museum and an expert in cuneiform, takes a look at <a href=\"https://www.britishmuseum.org/collection/object/W_1882-0714-509\">a 2900-year-old Mesopotamian tablet</a> that contains <a href=\"https://en.wikipedia.org/wiki/Babylonian_Map_of_the_World\">a map of the world</a> as it was known at the time.</p>\n\n<blockquote><p>The Babylonian map of the world is the oldest map of the world, in the world. Written and inscribed on clay in Mesopotamia around 2,900-years-ago, it is, like so many cuneiform tablets, incomplete. However, Irving Finkel and a particularly gifted student of his — Edith Horsley — managed to locate a missing piece of the map, slot it back into the cuneiform tablet, and from there set us all on journey through the somewhat mythical landscape of Mesopotamia to find the final resting place of the ark. And yes we mean that ark, as in Noah’s ark. Although in the earlier Mesopotamian version of the flood story, the ark is built by Ziusudra.</p></blockquote>\n\n<p>Finkel could not possibly look more like a British Museum curator than he does.</p>\n\n<p>Btw, I first heard about the earliest Mesopotamian version of the flood story in a mythology class I took in college. I’d spent a lot of my youth going to church but religion didn’t clicked for me and I was never a believer. Hearing that flood story clinched it for me — the Old Testament of the Christian bible is just as mythological as the Greek or Mesopotamian gods (everything is a remix) — and I’ve been solidly atheist ever since. (via <a href=\"https://www.openculture.com/2024/08/an-introduction-to-the-babylonian-map-of-the-world-the-oldest-known-map-of-the-world.html\">open culture</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Irving%20Finkel\">Irving Finkel</a> · <a href=\"https://kottke.org/tag/language\">language</a> · <a href=\"https://kottke.org/tag/maps\">maps</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/08/the-oldest-world-map-in-the-world\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"abd2f7c6c9138d5c1cc11c32d624cbd443adc2b7a958e2bb7c0a00255a08a8b0","category":"default"}