{"title":"Hello, Everyone, Let&#8217;s Have A Week","link":"https://kottke.org/24/03/hello-everyone-lets-have-a-week","date":1711325751000,"content":"\n        <p>I am excited to be back editing Kottke.org this week for the first time in one thousand years, and I am also scared because what if I don’t remember how to write on the internet? Everything has changed from how it used to be and also has it really? As long as they still make skateboarding videos, we’ll be OK I’m sure.</p>\n\n<p>As Jason mentioned, I own an ice cream shop called <a href=\"https://www.instagram.com/icecreamgracies/\">Gracie’s</a> and an ice cream shop that is also a bar called Earnest Drinks, and you should come to them. A few years ago, I put out a kids’ book called <a href=\"https://bookshop.org/p/books/the-salty-avocado-a-rotten-fruit-finds-redemption-after-an-accident-through-the-perseverance-of-friends-aaron-cohen/8114747\">Salty Avocado</a> with Chris, I’m hoping to put out another kids’ book this year, and like Jason said, I’m almost done with a novel I hope you get to read sometime. </p>\n\n<p>This week we’re gonna have some videos of people doing stuff and also other internet about food and animals, we’re gonna say mean things about Intuit, we’re gonna quote Eli Cash, and maybe we’ll do something about ice cream if y’all want to because it’s something about which I know a good amount. If you see any typos, no you didn’t. The last time I edited for a week, there were lots of websites still, and now it feels like there are hardly any, so if you see any good links, <a href=\"https://bsky.app/profile/unlikelywords.bsky.social\">please send them over on Blue Sky</a>. </p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Aaron%20Cohen\">Aaron Cohen</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/hello-everyone-lets-have-a-week\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"abdadfa04d0a5bf1bf2d4f2787f3da9fb45c049c5be64860b6db67c731a0c2a7","category":"default"}