{"title":"Stinge Watching Is the Opposite of Binge Watching","link":"https://kottke.org/24/02/stinge-watching","date":1707502879000,"content":"\n        <p><img src=\"/plus/misc/images/stinge-watching.jpg\" width=\"1000\" height=\"585\" alt=\"a screencap of the cast of Schitt's Creek walking with a pause symbol over it\" /></p>\n\n<p>Last weekend, my daughter and I watched all 8 episodes of Percy Jackson and the Olympians on Disney+. We binged it. That’s how people watch TV shows now: streaming services have entire shows available at the click of the “next episode” button. Many shows are uploaded a whole season at a time for maximum bingeability — no need to wait more than the time it takes to skip the credits to continue the story. It’s an all-you-can-eat media buffet. The mechanics and economics of streaming media have changed how we watch TV and movies — the binge watch reigns supreme.</p>\n\n<p>But recently, I’ve found myself watching some shows in a much different way. When I find a new show I really like or I’m digging into the newest season of a favorite series, instead of getting hooked and then blasting through all the available episodes, I’ll slow down or even stop watching so as to prolong the pleasure…or to delay the end. I feel like a squirrel, hoarding nuts for the winter. It’s stinge watching instead of binge watching.</p>\n\n<p>Schitt’s Creek was the first show I recall stinge watching. I just didn’t want to stop spending time with those people and so I went from watching 1-2 episodes per day to a few a week. The final season’s 14 episodes probably took me longer to watch than the first three seasons put together. I’ve also done this with The Great British Bake-off, The Expanse, and Silo. And it’s gotten worse — right now, I’m in the middle of <em>four different shows</em> that I am loving but cannot bring myself to actually watch: Reservation Dogs (love those shitasses), For All Mankind (haven’t watched the last episode of the most recent season), Star Trek: Strange New Worlds (stalled out on the second-to-last episode of s01), and The Great (I stopped <em>in the middle of an episode</em> where something Very Dramatic happens and I just can’t seem to continue).</p>\n\n<p>Wondering if anyone else has been stinge watching and curious about what their motivations might be, I asked about it on Instagram and found that dozens of others swim against the fierce current of binge watching…and even stinge read books.<sup><a href=\"#fn:1707423313\">1</a></sup> The Sopranos, Ted Lasso, The Wire, Firefly, Escape at Dannemora, Fleishman Is in Trouble, The Bear, Griselda, and Brooklyn 99 were all cited as shows too good to keep watching. One reader told me she still hasn’t watched the end of Schitt’s Creek “because those characters all grew so much and I knew the last episode would be really emotional and I wanted to avoid crying”.</p>\n\n<p>This was a common theme amongst the stinge watchers, particularly with series finales. Digital media producer <a href=\"https://www.instagram.com/heyyyella/\">Micaela Mielniczenko</a> didn’t want to finish Gilmore Girls “because I loved the characters so much and I didn’t want the story and world to end”. I felt the same way about The Expanse — I wanted to live in that world and with those characters forever, a testament to the world building and character development by the writers, directors, showrunners, and actors.</p>\n\n<p>My friend Adriana X. Jacobs, a professor of modern Hebrew literature, poet, <a href=\"https://ladymacabea.itch.io/i-put-my-doom-into-a-love-poem\">game designer</a>, and long-time stinge watcher, says she has trouble with denouements. She told me:</p>\n\n<blockquote><p>They put me in a melancholy mood. I prefer the build-up, that long stretch when a character is tunneling (literally or figuratively) their way into or out of a problem. But the story interests me a lot less once the issues start to resolve. This is why it took me YEARS to finish Oldboy (dir. Park Chan-wook), a movie I kept pausing and abandoning when the protagonist was still trapped in that unholy hotel room.</p>\n\n<p>I knew that the story would take him out of the room but I wanted to remain in the mess and confinement. It’s the same thing with Normal People. Even though I’ve read the book and know that the ending is (thank god) open-ended, by not finishing the series, I leave these chaotic characters even further suspended in that beautiful, very human state of uncertainty and possibility.</p></blockquote>\n\n<p>Wow, yes, exactly.</p>\n\n<p><a href=\"https://www.instagram.com/nonformality/\">Andreas</a>, who normally hoards shows to watch in the “dark days of winter” in Berlin, said that he had trouble finishing Wednesday on Netflix: “God I loved that so, so much, I could not bear the thought of it ending so soon.” He rewatched the entire first season immediately after finishing the show and even “did a whole keynote speech only with [Wednesday’s] quotes as slides”.<sup><a href=\"#fn:1707426515\">2</a></sup></p>\n\n<p>Courtney Walsh, who is holding off on finishing Brooklyn 99, told me:</p>\n\n<blockquote><p>Delaying the finale keeps the characters in stasis and delays me feeling sad when it’s over. By keeping it in the queue, I’ll be happy when I watch, not sad.</p></blockquote>\n\n<p>Several other people told me they hold off on watching certain shows until they need them. When I asked her when she was going to watch the rest of Brooklyn 99, Walsh said:</p>\n\n<blockquote><p>When I need a guaranteed, bittersweet day. When I’m thinking about the past and I know that these 8-10 episodes will fit the bill. Probably in the next year or two. Bittersweet is a hard emotion to plan for and keep for later. When I can, I do!</p></blockquote>\n\n<p>Ryan N said that he keeps a stash of Queer Eye episodes because they’re “like soothing medicine in dark times”. Mielniczenko keeps the last episode or two (or sometimes a whole season) of a show in her queue because she likes “the idea that I can finish these shows at any point”. I definitely held back on the final episodes of Schitt’s Creek until I was emotionally ready and on GBBO episodes until I needed a guaranteed pick-me-up on a particularly gloomy day.</p>\n\n<p><a href=\"https://www.instagram.com/joshpuetz/\">Josh Puetz</a> is portioning Firefly out in drips and drabs — he last watched an episode in Dec 2022 as a treat to himself for being sick — and I asked how he was going to decide when to finish the rest of it:</p>\n\n<blockquote><p>I think…when I’m ready to let go of the characters and story on my terms. So many endings and changes in life are out of our control, but this one little thing (ending a series, saying goodbye) happens when I need it.</p></blockquote>\n\n<p>Puetz said he’s not a binge watcher at all (one-in-a-row is the most he can muster), but I both binge and stinge. Several of the shows I mentioned above (like Reservation Dogs &amp; ST: Strange New Worlds), I binged several episodes at a stretch before slowing down when I realized, oh god, I’m going to run out! I loved Succession and could not wait to watch the series finale last May. The second season of the Gilded Age aired over two months last fall and I gobbled up each episode as it aired on Sunday nights.</p>\n\n<p>Mielniczenko said she doesn’t horde every book or show; her stinge watch candidates “usually have a world that is unique/exciting or comforting/wholesome”. Like I said above, for me it usually comes down to the characters and the world and whether they overcome my need to find out how the plot wraps up. When something is soapy or sensational, like The Gilded Age or The White Lotus, I have to watch to find out what happens. But if my desire for the company of beloved characters and the comfort of a familiar place outweighs my desire for plot closure, I slow down and bank those shows for later.<sup><a href=\"#fn:1707431016\">3</a></sup></p>\n\n<p>Streaming services are definitely geared towards binge watching, but the creators of particular shows have worked their magic so well, creating realities that feel unusually real, that some of us want to stay in them for as long as we can. My Brilliant Friend, one of my favorite shows of the last few years, is returning this year for a fourth and final season on HBO, and I am at once deliriously excited to meet those characters again but am also already bracing myself to have to say goodbye to them. At least I’ll have fellow stinge watchers to commiserate with.</p>\n\n<p><em>Are you a stinge watcher? Let us know which shows you’re stuck on and why in the comments.</em></p>\n\n<ol><p><li>I hoard books too, but it’s more difficult to do with audiobooks and ebooks. Sometimes I’ll get to the end of an audiobook without realizing it and the “Audible hopes you have enjoyed this program” trods on my spirit a bit.<a href=\"#fnref:1707423313\">↩</a></li></p>\n\n<p><li>I don’t know about you, but I would love to see that keynote deck! (This reminds me of the time I suggested to my daughter that she do a school project about the philosophy of The Good Place because she’s seen that show <em>seven times</em>. She did not take my advice.)<a href=\"#fnref:1707426515\">↩</a></li></p>\n\n<p><li>Several people said that they don’t hoard shows, they just rewatch them, sometimes just after they’ve finished. I do that too, but rewatching doesn’t feel the same. Knowing what happens is comforting in a different way, but the novelty is important to me in terms of spending time in worlds with characters.<a href=\"#fnref:1707431016\">↩</a></li></p></ol>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/movies\">movies</a> · <a href=\"https://kottke.org/tag/TV\">TV</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/stinge-watching\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"aca1e4a883ae309dff9866da76c92bfcf566dcafd4674e639add670bccaac1b4","category":"default"}