{"title":"Why both Vision Pro & Quest are Good & Great?","link":"https://om.co/2024/03/13/why-both-vision-pro-quest-are-good-great/","date":1710345593000,"content":"<p>If you have been a regular reader, then you know very well how I feel about Vision Pro, which is the best entertainment device I have ever owned (outside of my iPad.) And you also know that I think <a target=\"_blank\" href=\"https://om.co/2024/01/28/a-letter-from-om-issue-01-2024/\">it is a two-horse race between Meta and Apple</a>. (You can see <a target=\"_blank\" href=\"https://www.youtube.com/watch?v=ndeVLCz3P2Q\">my comments in this CNBC story</a>.)</p>\n\n\n\n<p>Hugo Barra, who was the Head of Oculus from 2017 to 2020 and a lifelong virtual reality enthusiast, makes the argument <a target=\"_blank\" href=\"https://hugo.blog/2024/03/11/vision-pro/\">in his essay about the Vision Pro</a> and how it compares with not only Meta’s Quest devices, but also with other headsets that are available on the market. </p>\n\n\n\n<p>“The Apple Vision Pro is the Northstar the VR industry needed, whether we admit it or not,” he writes. Barra, like many others, doesn’t think it is anywhere even close to being a finished product. Except:</p>\n\n\n\n<blockquote>\n<p>The Vision Pro launch has more or less done exactly what I had always hoped for, which is to build a huge wave of awareness and curiosity that elevates the spatial computing ecosystem and could ultimately lead to mass-market consumer demand and a lot more developer interest that VR/AR has ever had. Now it’s up to the industry to create enough user value and demonstrate whether this is in fact the future of computing.</p>\n</blockquote>\n\n\n\n<p>Hugo’s 11,500-word long analysis about the evolving VR market, Vision Pro, and the battle between Apple and Meta should be at the top of your reading list. Highly recommended. This could be the best piece you could read today. <a target=\"_blank\" href=\"https://hugo.blog/2024/03/11/vision-pro/\">Visit Hugo’s Blog</a>.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"acce9443b636d101834ce5d07c560622b71fe43a37d1050e764add28345de1e7","category":"default"}