{"title":"Here’s how to live: Make memories.","link":"https://sive.rs/htl07","date":1638835200000,"content":"<p>\nYou recently had a day, or even a month, that you can’t remember.\n<br />\nIf I asked what you did then, you couldn’t say.\n<br />\nThere was nothing unusual about it.\n</p><p>\nWhat if you have many more of those?\n<br />\nWhat if, when you’re older, you can’t recall entire years?\n<br />\nIf you can’t remember something, it’s like it never happened.\n<br />\nYou could have a long healthy life, but if you can’t remember it, it’s like you had a short life.\n<br />\nWhat a horrible way to live.\n</p><p>\nWhen you’re young, time goes slowly because everything is new.\n<br />\nWhen you get older, time flies by, forgotten, because you’re not having as many new experiences.\n</p><p>\nYou need to prevent this.\n<br />\nMonotony is the enemy.\n<br />\nNovelty is the solution.\n</p><p>\nGo make memories.\n<br />\nDo memorable things.\n<br />\nExperience the unusual.\n<br />\nPursue novelty.\n<br />\nReplace your routines.\n<br />\nLive in different places.\n<br />\nChange your career every few years.\n<br />\nThese unique events will become anchors for your memories.\n</p><p>\nRemember them all.\n<br />\nDocument everything, or you’ll eventually forget it.\n<br />\nNobody can erase your memories, but don’t lose them through neglect.\n</p><p>\nJournal every day.\n<br />\nWrite down your activities, thoughts, and feelings for future reference.\n</p><p>\nVideo everything.\n<br />\nCompile and edit them, so they’re appealing to watch.\n</p><p>\nTo enjoy your past is to live twice.\n<br />\nNostalgia links your past and present.\n<br />\nNostalgia protects against stress and boredom, and improves your mood.\n<br />\nNostalgia makes you more optimistic, more generous, more creative, and more empathetic.\n<br />\nNostalgia is memories minus the pain.\n<br />\nBeing nostalgic makes you less afraid to die.\n</p><p>\nTurn your experiences into stories.\n<br />\nA story is the remains of an experience.\n<br />\nMake your stories entertaining, so people like to hear them.\n<br />\nBy telling good stories, your memories can last longer, because people will echo them back to you occasionally, or ask you to tell them again.\n</p><p>\nMake a story for the things you want to remember.\n<br />\nNever make a story for the things you want to forget.\n<br />\nLet those disappear with time.\n</p><p>\nYour memories are a mix of fact and fiction.\n<br />\nYour story about an experience overwrites your memory of the actual experience.\n<br />\nSo use this in your favor.\n<br />\nRe-write your past.\n<br />\nEmbellish adventures.\n<br />\nDisempower trauma.\n<br />\nRe-write your stories into whatever works for you.\n<br />\nRemember only what you want to remember.\n<br />\nYou have the right to reframe.\n</p><p>\nSummarize a painful time into a tiny story — under a minute.\n<br />\nTell this belittled version a few times to make it stick.\n<br />\nThis is the version you’ll remember — stripped of pain and power.\n</p><p>\nHow you feel about anything is based on how you look back at it.\n<br />\nYour memory is influenced by how you feel now.\n<br />\nIn a bad mood, you might see only the dark side of events that are actually neutral.\n<br />\nIn a good mood, you might see the bright side of trauma.\n</p><p>\nThe more something means to you, the more you’ll remember it.\n<br />\nGive moments meaning to remember them.\n<br />\nTake away meaning to forget.\n</p><p>\nYou remember what’s important.\n<br />\nThe first time you were burned, you didn’t try to remember that fire is hot.\n<br />\nIt hurt, so your brain remembered it effortlessly.\n<br />\nWhen you make a big mistake and want to learn its lesson, deliberately amplify the pain, the deep regret, and the consequences.\n<br />\nKeep the bad feelings vivid and visceral.\n<br />\nMake the lesson memorable, so you won’t do it again.\n</p><p>\nWithout memories, you have no sense of self.\n<br />\nYou have to remember your past to see your trajectory.\n<br />\nYou use your past to make your future.\n</p><p>\nMaking memories is the most important thing you can do with your life.\n<br />\nThe more memories you create, the longer and richer your life feels.\n<br />\nMaking memories is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ad36a22671de4e9f5631e99ec8e7454bb8ae2fd426afc34df552c796d541770a","category":"default"}