{"title":"","link":"http://scripting.com/2024/10/27.html#a135512","date":1730037312000,"content":"<img src=\"https://imgs.scripting.com/2024/10/27/charlemagne2.png\" />Listened to <a href=\"https://en.wikipedia.org/wiki/Charlamagne_tha_God\">Charlemagne tha God</a> for the first time on the <a href=\"https://podcasts.apple.com/us/podcast/charlamagne-tha-god-has-some-advice-for-kamala-harris/id1050430296?i=1000674477737\">New Yorker podcast</a>. I have to say I agree with everything he said. Really glad that people with clear mind and purpose been able to use our medium to do the good we hoped for. Best part was where he quoted Obama agreeing that things don't change when you elect a new president. Change can't come that fast unless we bring a substantial majority of our other Americans with us. The vote isn't a way to make change, it isn't a way to express yourself, it's <i>your role in governing</i> our country. It's not the First Amendment or the Second Amendment, it's the whole Constitution. It's the most power every one of us gets. Even the president doesn't have the power of our votes. You don't get a specific result from your vote, that would be the fascism that we're trying to avoid. It's the consenus that build that makes the difference. And Obama is probably too modest to say that he did make a couple of big changes. First, everyone has a right to health insurance. That's no small deal, coming from someone who has depended on health insurance to live, a number of times. And second, we stirred the racial pot in this country in a positive way. Not to say we got peace and love as a result. Because there are a lot of white folks who don't want that pot stirred. But that was change nonetheless. The only way we get there, and I've said this many times, is by working together. Blame is powerless. Acceptance is powerful.","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"ae0ab644b89ac21c3b56a33bfb94a911e8f31e3fe94b058854be9b9daf463a1d","category":"Sites"}