{"title":"Should you learn programming? Yes.","link":"https://sive.rs/prog","date":1455408000000,"content":"<p>\nWhen I was 14 years old, my guitar teacher told me something important:\n</p><p><strong>\n“You need to learn to sing. Because if you don’t, you’re always going to be at the mercy of some asshole singer.”\n</strong></p><p>\nHis point was about self-reliance.\nIf you ever have any ideas, whether for songs or apps, you need to have some basic skills to turn those ideas into reality.\n</p><p>\nOne of the most common things I hear from aspiring entrepreneurs is, <strong>“I have this idea for an app or site. But I’m not technical, so I need to find someone who can make it for me.”</strong>\n</p><p>\nI point them to my advice about <a href=\"https://sive.rs/how2hire\">how to hire a programmer</a>, but most programmers are already busy and expensive.\n</p><p>\nImagine if someone said, “I have this idea for a song.  But I’m not musical, so I need to find someone who will write, perform, and record it for me.”\n</p><p>\nYou’d probably advise them to just learn enough guitar or piano so they can play their song.\n</p><p><strong>\nIt’s like learning to drive or make dinner.\nYou only need to learn enough so you’re not helpless.\n</strong></p><p>\nSo, yes, you should learn some programming.\nBasic HTML, CSS, and JavaScript are enough to start.\n</p><p><strong>\nI recommend <a href=\"http://shop.oreilly.com/product/9780596159924.do\">Head First HTML and CSS</a> first, then <a href=\"http://shop.oreilly.com/product/0636920010906.do\">Head First HTML5 Programming</a>.\n</strong>\nThose are very fun, visual books where you need to see the detailed illustrations, so get the paper book or PDF.\n</p><p>\nIf you prefer a course and community, use <a href=\"https://www.freecodecamp.org/\">Free Code Camp</a>.\nIdeally, do those books and this course at the same time, to really reinforce what you’re learning.\n</p><p>\nYou could go through those books or courses in a few weeks, and you’d already know as much as half of the people that call themselves web developers.\n</p><p>\nIt’s a really amazing feeling.\nThe mystery is lifted.\nYou’ll look at all websites in a new way.\nYou’ll understand what’s going on behind the scenes.\nYou’ll know how to do it yourself.\nIt’s really empowering.\n(It’s definitely been the most rewarding thing I’ve ever learned.)\n</p><p>\nFor an inspiring example <a href=\"http://blog.jenniferdewalt.com/post/56319597560/im-learning-to-code-by-building-180-websites-in\">see Jennifer Dewalt</a>, who learned to code by building <a href=\"http://blog.jenniferdewalt.com/post/62998082815/after-180-websites-im-ready-to-start-the-rest-of\">180 websites in 180 days</a>, with no previous experience.\n</p><p>\nNext, <a href=\"https://sive.rs/learn-js\">read my advice on learning JavaScript</a>.\n</p>\n<a href=\"http://www.flickr.com/photos/plarsen/35590387/\"><img src=\"/images/bicycle-repair.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ae0f7a91b076a193561e9c3a6f04df87216dcfc2946bdb66fc5ac471d453d76a","category":"Sites"}