{"title":"The Bullshit of Facebook","link":"https://blog.webb.page/2019-03-07-facebook-and-their-bullshit.txt","date":1551916800000,"content":"<p>Yesterday, Facebook founder and CEO Mark Zuckerberg published an essay<a href=\"https://www.facebook.com/notes/mark-zuckerberg/a-privacy-focused-vision-for-social-networking/10156700570096634\">1</a>\nwhere he promises a \"A Privacy-Focused Vision for Social Networking\". The\noptimist would say he's learned the error of his/Facebook's ways, the\npessimist would write the entire thing off, and the realist would assume this\nis reactionary posturing due to the fact that Facebook is experiencing \"an\nestimated 15 million fewer users in the United States compared to 2017\"\n(according to Edison Research<a href=\"https://www.marketplace.org/2019/03/06/tech/exclusive-look-numbers-showing-users-leaving-facebook-by-the-millions\">2</a>).</p>\n<p>I am in the latter two camps but I'm particularly incensed about how brazen\nthe Zuck continues to be in his lying. It IS a new era so maybe this is his\nnew normal. Let's dissect his several \"promises\" (bold text inside quotes\nrepresent emphasis I've added).</p>\n<h2>Reducing Permanence</h2>\n<blockquote>\n<p>People should be comfortable being themselves, and should not have to worry\nabout what they share coming back to hurt them later. So <em>we won't keep\nmessages or stories around for longer than necessary</em> to deliver the service\nor longer than people want them.</p>\n</blockquote>\n<p>How long is \"necessary\"? Facebook stores what you've typed in the post box but\nyou've \"have not sent\"<a href=\"https://www.washingtonpost.com/technology/2018/12/14/facebook-says-new-bug-allowed-apps-access-private-photos-up-million-users\">3</a> or \"you deleted\"<a href=\"https://slate.com/technology/2013/12/facebook-self-censorship-what-happens-to-the-posts-you-dont-publish.html\">4</a>. It is completely unnecessary to\nstore that information in the first place, let alone for an indeterminate\namount of time.</p>\n<h2>Encryption and Safety</h2>\n<blockquote>\n<p>People should expect that <em>we will do everything we can to keep them safe on\nour services</em> within the limits of what's possible in an encrypted service.</p>\n</blockquote>\n<p>People <em>did</em> expect this and some hope that Facebook tries harder. Making\nprivate information availble to third-parties in order to make money isn't how\nyou protect people. In Facebook's case, protecting users in this way comes\ninto direct conflict with their desire to make money. This is why they are so\nconflicted about it.</p>\n<blockquote>\n<p>At the same time, there are real safety concerns to address before we can\nimplement end-to-end encryption across all of our messaging services.\n<em>Encryption is a powerful tool for privacy, but that includes the privacy of\npeople doing bad things.</em> When billions of people use a service to connect,\nsome of them are going to misuse it for truly terrible things like child\nexploitation, terrorism, and extortion. We have a responsibility to work\nwith law enforcement and to help prevent these wherever we can. <em>We are\nworking to improve our ability to identify and stop bad actors across our\napps by detecting patterns of activity or through other means</em>, even when we\ncan't see the content of the messages, and we will continue to invest in\nthis work. But we face an inherent tradeoff because we will never find all\nof the potential harm we do today when our security systems can see the\nmessages themselves.</p>\n</blockquote>\n<p>There are a couple things to unpack here. Zuckerberg delivered the flawed\nargument of [insert tech here] should not be used because criminals exist.\nThis is a straw man argument. The mere EXISTENCE of a particular technology\nisn't going to make law enforcement's jobs impossible, just like it isn't\ngoing to enable criminals to be untouchable. Criminals and law enforcement are\nlocked in a perpetual arms race (sometimes literally) and will continue to be\nuntil the heat death of the Universe and then some.</p>\n<p>Sounds like Facebook is trying to figure out how to create a \"secure back\ndoor\" and we all know that doesn't exist. At which point we'll get an apology\nand a \"pledge to do better\" when the inevitable data hack and resulting leak\noccurs. 😴</p>\n<h2>Secure data storage</h2>\n<blockquote>\n<p>People should expect that <em>we won't store sensitive data in countries with\nweak records on human rights</em> like privacy and freedom of expression in\norder to protect data from being improperly accessed.</p>\n</blockquote>\n<p>Reeeeeeally. China? They exist. They also have nearly 1.5 BILLION people. No\nway Facebook is giving up the chance to get a slice of that pie.</p>\n<p>WeChat is what Facebook aspires to be, but like any company that wants to do\nbusiness in China, you've gotta have servers there because the Chinese\ngovernment demands it.</p>\n<p>Apple recently had to put servers in China JUST for their mainland customers.\nHowever, Apple has a proven track record in regards to privacy and end-to-end\nencryption so I am less worried about Chinese dissidents using iPhones than I\nam about them using Facebook for literally anything.</p>\n<p>Like Zuckerberg stated in his essay, encryption has saved countless dissidents\nfrom being murdered but I am not confident in Facebook's ability to protect\nthem.</p>\n<h2>Conclusion</h2>\n<p>Facebook's profits are up but positive public perception is <em>plummeting</em>. It's\ndifficult not to think of Zuckerberg's \"candidness\" as sweet talk to entice\nGen Z'ers and millennials back to the platform and to make your auntie feel\nsafe because \"the guy who made the site said so\".</p>\n<p>However, Mark Zuckerberg does a great job of stressing the importance of\nsocial networks:</p>\n<blockquote>\n<p>Public social networks will continue to be very important in people's lives\n-- for connecting with everyone you know, discovering new people, ideas and\ncontent, and giving people a voice more broadly. People find these valuable\nevery day, and there are still a lot of useful services to build on top of\nthem. But now, <em>with all the ways people also want to interact privately,\nthere's also an opportunity to build a simpler platform that's focused on\nprivacy first.</em></p>\n</blockquote>\n<p>Problem is, I don't think he believes his own words.</p>\n<p>Is Facebook being refactored? Are they really going back to the original\nvision, to make the world feel smaller and more personable? Or is he talking\nabout my social network in progress<a href=\"/2017-12-30-who-creates-social-networks.txt\">5</a>, Socii<a href=\"https://socii.network\">6</a>?</p>\n<p>Between my day job helping create a decentralized content platform<a href=\"https://lbry.tech\">7</a> and\ncreating Socii, I've got my hands full and I'm also super passionate about\nprotecting my family, friends, and cool folks on the Internet like yourself.</p>\n<p>Y'know, focused on privacy first. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"ae54fed62d600c4af6e897d105d8490a539cc2af1e59df458b95df93464813a9","category":"Sites"}