{"title":"How to Make a World: A Poem","link":"https://www.themarginalian.org/2024/01/28/how-to-make-a-world/","date":1706477638000,"content":"<p>Like mathematics, the truest metaphors are not invented but discovered. Or, they discover us. And when they do, they hardly feel like metaphors — they feel like equations equating something previously unseen with something familiar in order to see more deeply into the nature of reality.</p>\n<p>One morning out on a run while traveling for a poetry workshop, I stopped mid-stride at the sight of a tiny tree shooting up from the center of a trunk twice as wide as me — a regenerative growth known as coppicing. I must have walked past dozens, hundreds of such stubborn second lives over the years. But for some reason, this one — at that moment in my life, at that moment in the world — became a mirror, a portal, a miniature of a larger truth about what made us and what we have made of ourselves.</p>\n<p>By sundown, it had become a poem — read here to the sound of Zoë Keating’s “Optimist” from her breathtaking album <a href=\"https://zoekeating.bandcamp.com/album/into-the-trees\" target=\"_blank\"><em>Into the Trees</em></a>.</p>\n<p></p>\n<blockquote><p><strong>HOW TO MAKE A WORLD</strong><br />\n<em>by Maria Popova</em></p>\n<p>What are you, little tree<br />\nrising from the center<br />\nof the old slain stump?<br />\nYou are no requiem,<br />\nno prophet,<br />\nno metaphor for how<br />\nlife goes on asserting itself<br />\nover death.</p>\n<p>No — you seem to be<br />\njust a fractal branch<br />\nof the same dumb resilience<br />\nby which we rose from the oceans<br />\nto compose the <em>Benedictus</em><br />\nand to build the bomb.</p></blockquote>\n<p>Couple with <a href=\"https://www.themarginalian.org/2023/09/09/the-half-life-of-hope/\">another found metaphor in the shape of a poem</a> about the stubbornness of hope, then savor Pattiann Rogers’s stunning <a href=\"https://www.themarginalian.org/2023/11/02/pattiann-rogers-homo-sapiens/\">“<em>Homo Sapiens</em>: Creating Themselves.”</a></p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"ae8e429bfb597b23508bcb38c043f75582b73e6f8d2662ec56d5077414c1868f","category":"default"}