{"title":"Welcome to the video bloat era","link":"https://www.garbageday.email/p/welcome-video-bloat-era","date":1712168899000,"content":"<div><div><h2>It’s The Video Platforms Turn To Pivot Now</h2><p>By my count, we’re at the tail end of the third Pivot To Video of the 21st century. I say “tail end” because if you’ve been through enough of these you start to notice certain hallmarks of a collapsing digital video industry.</p><p>A Pivot To Video tends to arrive in stages, with each stage being more expensive and producing less interesting content as things progress. Usually it goes like this: The experimentation phase, the factory phase, and the bloat phase. A great editor I worked for during the second Pivot To Video, roughly 2013-2017, who, herself worked through the first, roughly 2003-2007, described it as a massive waste of resources that wastes more resources as it becomes clearer to everyone not directly involved how much of a waste of resources it is. I’m paraphrasing. </p><p>It’s a fundamental issue with video as a medium that online platforms haven’t fixed and, I suspect, never will because it makes user-generated content platforms feel more professional and consistent. Like TV. The cost to produce video content always balloons as you add more people, more tools, more structure to the workflow, pushing out smaller creators and teams. And even with the pandemic lowering the barrier of entry for making video online considerably, it’s still happening again. We’re in the bloat phase now.</p><blockquote><p></p><p>have we really gotten to the point where we’re reacting to AI generated pictures..</p><p></p><a href=\"https://twitter.com/aiexrudd/status/1774885839631176047?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\"><p> — alex (@aIexrudd) <br /> Apr 1, 2024 </p></a></blockquote><p><i>The Washington Post</i> put out a <a href=\"https://www.washingtonpost.com/technology/2024/03/30/video-editing-mrbeast-retention/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">great piece</a> last week addressing all of this, calling it the “beastification of YouTube,” which it describes as “hyper-engaging, fast-paced videos with frequent action on screen.” It’s also referred to as “retention editing” in thousands of tutorials you’ll find on YouTube. And this is, largely, a YouTube-driven trend. </p><p>The importance of YouTube as a cable TV replacement and Netflix competitor is why MrBeast, the platform’s biggest star, <a href=\"https://www.threads.net/@ociubotaru/post/C5NLEOEtFL5?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">is spending</a> between $3-$5 million per video right now, up from around $200,000 a video just a few years ago. To put that absolutely outrageous number in perspective, a MrBeast video is roughly the same cost per video as <a href=\"https://www.gq.com.au/culture/entertainment/house-of-the-dragon-budget/image-gallery/d6f9d9441ff5cbd94026b7018b8b3882?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">any episode</a> from the first five seasons of <i>Game Of Thrones</i>. </p><p>But it’s not just YouTube that is tweaked for retention editing. It’s happening on TikTok, as well. Guides last year <a href=\"https://www.thedrum.com/opinion/2023/03/29/tiktok-and-the-power-the-first-3-seconds?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">were saying</a> you had to capture viewers in the first three seconds. I’ve read a few guides from this year that are now saying hooking a TikTok user has to happen in the first 1.5 seconds. There’s an oft-quoted <a href=\"https://money.cnn.com/magazines/fortune/fortune_archive/1996/04/15/211503/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">“shoeshine boy” theory</a> of markets, usually attributed to Joe Kennedy in the late 1920s, who said that when the boy shining his shoes had stock tips, he knew the market was about to collapse. Well, here’s a similar rule for digital video: If you’re trying to optimize your video in microseconds, the video pivot is probably already over.</p><p>The question, as always, is what comes next? YouTube is laser-focused on capturing the world’s televisions. In fact, the platform’s CEO, Neal Mohan <a href=\"https://www.threads.net/@neal_mohan/post/C5PY-nNugme?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">announced</a> yesterday that the platform is adding even more features for YouTube’s TV app. And TikTok, if it’s not banned or whatever, is trying to use its massive inventory of short-form video content to prop up both a search engine and an e-commerce operation. And we haven’t even talked about Meta’s video products here. There is simply no incentive for these platforms to regress even though users seem to want them to. </p><p>If history tells us anything here, viewers will start gravitating towards less professional video content, not more. Scripted College Humor skits always seem to devolve into random Vines. I mean, just look at Reesa Teesa’s 50-TikTok-long story <a href=\"https://time.com/6696963/who-tf-did-i-marry-tiktok-series/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">from last month</a>. Tastes are clearly changing. <i>The Washington Post</i> article pointed to Sam Sulek, a giant muscleman on YouTube who posts 30-minute workout vlogs with barely any editing as a possible direction this is all headed in. I tried watching one of <a href=\"https://www.youtube.com/watch?v=Hkjz35B2UmI&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">his recent videos</a> and I’m not even sure it has any cuts in it? It’s possible that’s what’s coming next, but it’s less certain if platforms will, or rather can, allow it. Time to find out if they know how to pivot.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/586aab28-ee0f-48b8-87f9-ded43e1867c3/GarbageDay-April2024.jpg?t=1712150235\" /></div><h3><a href=\"https://meh.com/go/garbageday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\"><b>It’s ok for an amazing deal to be boring.</b></a></h3><p><a href=\"https://meh.com/go/garbageday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">Here’s the Meh deal</a>: We’re not going to hype you up on everything. <a href=\"https://meh.com/go/garbageday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">Today’s daily deal is on flatware.</a> It’s not going to blow your mind.</p><p>To be clear, it’s a great deal on flatware. It’s 18/10, aka “the good stuff,” it’s a set of 8 of everything you actually need, and it’s less than half the price of anything like that over at Amazon or pretty much anywhere.</p><p>But it’s flatware.</p><p>If you’re using hand-me-downs from your parents, leftovers from roommates, or the cheapest thing you could find at Target or IKEA, you should probably upgrade to this. If you only have flatware for 4 people and you sometimes have friends over, you should probably get this. You’ll feel dumb if you later need flatware and have to buy a crappier set or pay a lot more.</p><p>It’s pretty simple - If you <a href=\"https://meh.com/go/garbageday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">check out Meh every day</a>, sometimes you’ll find that thing you need, you can get it cheaper than ever, and you won’t be yelled at about what a craaaazy deal it is. If that sounds good to you, <a href=\"https://meh.com/go/garbageday?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">come on over</a>.</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\"><span> Upgrade </span></a></div><hr /></div><h2>Mountain Dew, Decarbonated</h2><blockquote><p></p><p>Day two of decarbonating this Mtn Dew. Gonna take a gravity reading later today, titrate with baking soda to reduce the pH (to neutralize the sodium benzoate and allow fermentation), add enough honey/sugar to hopefully get it into the 13-15% abv range, and add some wine yeast.</p><p></p><a href=\"https://twitter.com/HeDunkInMyDonut/status/1775205034227020284?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\"><p> — Shallah Gaykwon (@HeDunkInMyDonut) <br /> Apr 2, 2024 </p></a></blockquote><p>This is probably the least upsetting thing I’ve seen involving a jar on the internet in a long time!</p><hr /><h2>No, Amazon’s AI Checkout Was Not Secretly Just People In India</h2><p>A <a href=\"https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\"><i>Gizmodo</i></a><a href=\"https://gizmodo.com/amazon-reportedly-ditches-just-walk-out-grocery-stores-1851381116?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\"> story</a> went viral this week, claiming that Amazon’s “Just Walk Out” checkout system, which the company is sunsetting, “relied on more than 1,000 people in India watching and labeling videos to ensure accurate checkouts.” And went further, explaining that “the cashiers were simply moved off-site, and they watched you as you shopped.”</p><p>It’s become a huge meme because it’s, frankly, an outrageous claim. But it’s also not true and would have been functionally impossible. <i>The Information</i> <a href=\"https://www.theinformation.com/articles/how-amazons-big-bet-on-just-walk-out-stumbled?rc=kbb6dv&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">has covered</a> “Just Walk Out” pretty extensively and has a much clearer description of how this worked.</p><p>“Amazon had more than 1,000 people in India working on Just Walk Out as of mid-2022 whose jobs included manually reviewing transactions and labeling images from videos to train Just Walk Out’s machine learning model,” <i>The Information </i>reported, quoting an unnamed source who had worked on the tech that powered the service. “The reliance on backup humans explains in part why it can take hours for customers to receive receipts after walking out of a store.”</p><p>The word “train” is very important there. And if you remove it, as <i>Gizmodo</i> did, you end up describing something very different!!!</p><p>I know I harp on this a lot, but understanding how these AI models work — and how human workers interact with them — is extremely important right now. Because confusion and backlash to AI is just as useful to AI companies as evangelism is. Yes, a bulk of what tech companies are now calling AI is heavily supported by, if not completely masking, work being done for pennies a day in the Global South. But, no, entire supermarkets can not be run by 1,000 people in India watching security cameras.</p><hr /><h2>Discord’s April Fools Joke Went Hilariously Wrong</h2><p>For April Fools Day, Discord announced they were launching loot boxes. Kinda funny, sure. But what was really funny is that Discord’s team put the announcement video as an embed into the in-app notification about it. Which caused the video it be opened over and over again. <i>Dexerto</i> has a <a href=\"https://www.dexerto.com/tech/discord-accidentally-viewbots-youtube-video-to-500-million-views-2624002/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">good explanation</a> of how this happened.</p><p>As of right now, Discord’s video has been viewed 1.4 billion times or, as the top comment underneath it reads, “I can’t believe 17.5% of the entire global population is this excited for loot boxes.”</p><hr /><h2>What Is 2020s Culture?</h2><blockquote><p></p><p>Disconcerting that we're four years into the 2020s and yet there have been absolutely zero (0) cultural developments to separate us from the 2010s. Have decades ended?</p><p></p><a href=\"https://twitter.com/LegoRacers2/status/1775262462859940024?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\"><p> — Liam (@LegoRacers2) <br /> Apr 2, 2024 </p></a></blockquote><p>I came across this post on X recently and I thought it was worth picking at because I actually think there are a lot of folks — especially millennials — who feel this way. I also think it’s connected to the weird <a href=\"https://twitter.com/benkesslen/status/1774951451527176325?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">misconception</a> that Gen Z isn’t <a href=\"https://twitter.com/search?q=gen+z+sex+and+the+city+netflix&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">aware of anything</a> until it hits Netflix.</p><p>Part of the problem is we’re suffering from a media apocalypse, which means new, young writers and cultural critics aren’t really breaking through the same way they used to. They are, of course, talking about what pop culture means to them to huge audiences on social, but they aren’t having to go through the mortifying rite of passage that young writers in the past had to endure: Explaining their eager, and often silly, hot takes out loud in a newsroom or on Slack to their dead-eyed Brooklyn Cool Dad manager. But 2020s culture is here. Clothes are baggier and also much less tied to physical subcultures or scenes. Distinctions between analog and digital sounds have been completely erased in pop music. Alternative music is heavily-informed by shoegaze and math rock YouTube tutorials. And streaming services have created a new kind of movie and TV show, where sexual content and violence no longer adhere to FCC or MPAA regulations. Which, at least for me, someone raised in the beforetimes, can be tonally jarring in sometimes interesting ways. </p><p>And, in about six months, we’ll find out how politics responds to all this. My hunch is it will be with deep, profound and algorithmically-induced malaise. But we’ll see!</p><hr /><h2>Biden Joined The Fediverse (Through Threads)</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/15f046a5-6774-47d1-bac2-f1d4b89e8c42/Screenshot_2024-04-03_at_1.45.06_PM.png?t=1712166316\" /><div><span><p>(Threads/@potus)</p></span></div></div><p>You can now view President Biden’s Threads updates from a Mastodon client by using <a href=\"https://www.threads.net/@potus?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">@potus@threads.net</a>. Look, I rag on Threads fairly regularly and I stand by all my complaints about it. But if Threads becomes a user-friendly gateway to a more federated social landscape then it’s worth it, if you ask me.</p><p>We need <i>something</i> new. Today’s issue is a testament to the myriad of reasons why. I still have a lot of questions about how a federated internet would work, in a practical sense — my main one being is a social media platform(s) that feels like email actually what we want. But I’ve also decided that the only way to really answer those questions is to try it.</p><hr /><h2>There’s A Guy On TikTok That Won’t Stop Eating Cheese</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5c93adbc-2c77-445f-a565-e1cc74cb636e/Screenshot_2024-04-03_at_1.26.11_PM.png?t=1712165187\" /><div><span><p>(TikTok/@traceywinter1)</p></span></div></div><p>This guy was a bit of a <a href=\"https://www.thesun.co.uk/news/14652638/grandad-gorges-on-13lb-cheddar-a-week/amp/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">British tabloid fascination</a> back in 2021. His name is Mark King and he reportedly eats about 13 lbs. of cheese a week. His wife is not a fan, but, thankfully for us, she <a href=\"https://www.tiktok.com/@traceywinter1?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">documents</a> his cheese eating on TikTok.</p><hr /><h2>A Real Good Video</h2><blockquote><p></p><p>For the last month I have secretly been embedding, in order, the lyrics to the iCarly theme song into my tweets. </p><p>to my knowledge, i got away with it without anyone noticing. this is entirely real, happy april fools day :)</p><p></p><a href=\"https://twitter.com/nkizz11/status/1774864219806085548?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\"><p> — Marchintosh Mia (@nkizz11) <br /> Apr 1, 2024 </p></a></blockquote><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.nbcnews.com/tech/tech-news/spongebob-ai-generated-music-glorb-rcna145685?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">Glorb good</a></p></li><li><p><a href=\"https://www.bloomberg.com/opinion/articles/2024-04-02/a-hedge-fund-that-s-also-a-newspaper?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">“A Hedge Fund That’s Also a Newspaper”</a></p></li><li><p><a href=\"https://www.deezlinks.com/p/circus-behavior-and-everybody-is?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">“Circus behavior, and everybody is monkey, monkey, monkey, clown.”</a></p></li></ul><hr /><p><span>P.S. here’s a </span><span><a href=\"https://twitter.com/PseudoSerial/status/1775344549889544247?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=welcome-to-the-video-bloat-era\" target=\"_blank\">good post</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=3042c159-4022-46fb-a558-a7251f2904d4&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"aeb4b1ebed810e35ba3781ecbcd9af1e2bb5dc06997b50ce6c1e1d2742139d57","category":"default"}