{"title":"The \"Amen\" spam conquered Facebook","link":"https://www.garbageday.email/p/the-amen-spam-conquered-facebook","date":1702481991000,"content":"<div><div><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/f79d0002-fdeb-4de6-91b0-b690b59a6ab1/0e803892-4ffb-4be1-8d78-9d6c0456bd0a_2200x96.png?t=1705691562\" /></div><h2>A Random Catholic Blog Just Became The Most-Interacted With Site On Facebook</h2><p><i>—by Adam Bumas</i></p><p>We’ve been using Newswhip's real-time tracking data to analyze the top posts, links, and publishers on Facebook since April. It's usually a mix of known publishers, some viral videos, and the occasional Taylor Swift post. That is, until November, when all 10 of the most popular links on Facebook were from a blog called Catholic Fundamentalism.</p><p>Catholic Fundamentalism first <a href=\"https://www.garbageday.email/p/why-do-facebook-users-keep-commenting?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">came to our attention</a> in September, when the single most popular link on the platform for that month was “Do Catholics find ‘Life’ by being pleasing to God? The Psalms tell us! #17.” The page linking the post had 409,000 total interactions in September. For scale, the <i>Associated Pres</i>s <a href=\"https://apnews.com/article/obituary-jimmy-buffett-4295f355b39237f40663d485c4c6d557?utm_campaign=TrueAnthem&amp;utm_medium=AP&amp;utm_source=Facebook\" target=\"_blank\">obituary for Jimmy Buffet</a> had 356,000 interactions over the same time. It was unusual, sure, but random sites spike inside of Facebook all of the time. What we’ve never seen before, however, is a single website dominate the platform like this completely. We’ve reached out to Meta for comment.</p><p>The blog and its Facebook page aren’t run by some think tank or even the Catholic Church itself (though the two pages are nearly the same size). Instead, the website that’s more popular than the BBC right now seems to be entirely run by a retiree in Pennsylvania. </p><p>There’s some poetry here. Facebook was an extinction level event for blogging long before it ate the rest of the web. Also, the platform’s size and scale, you <a href=\"https://www.ft.com/content/35bc6a04-0450-359b-b6bd-ce5bd1cfe245?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">could argue</a>, rivals the Vatican. And now the social network that has defined culture, swung elections, and reshaped the way we communicate has degraded to such a state that it’s been conquered by one guy blogging about Catholicism who may or may not be aware he’s even done it.</p><p>Catholic Fundamentalism is run by a blogger named Bill Adams. He prefers being anonymous nowadays because, according to an FAQ on the site, \"an author who avoids payment and recognition\" is more likely to be \"worthy of your trust.\" (Not sure about that lol.) But he pops up <a href=\"https://www.facebook.com/catholicfundamentalism/videos/819990655047605?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">in videos</a> he's sharing to the page and interacts with readers using his personal account. We also found a lot of material on the Catholic Fundamentalism blog listed as previously published material from Old Drum Publishing. We've reached out to both Adams and Old Drum for comment.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/69857e01-e78e-4adc-8b1d-e22b923ed278/1e4b1c7f-ba27-43ad-b111-d067100178c1_2538x1284.png?t=1705691564\" /></div><p>For what we can glean from his posts, Adams is in his late 70s, lives north of Pittsburgh, and owned a manufacturing business until retiring a few years ago. But he's been publishing his thoughts on Catholicism in various places since at least 1993 and registered the catholicfundamentalism.com URL in 2002, where he's been blogging almost every day since late 2005. Monday was a milestone for him, since it marked his 6,000th daily post on the blog. </p><p>And since Adams started the Catholic Fundamentalism Facebook page in 2012, he’s done almost nothing with it aside from link to the blog (and experiment with a couple Reels). The actual posts aren’t anything particularly timely or even engagement bait. Nor does this look like a facade for a shady e-commerce scheme. Even so, they’re consistently among the most popular links on the whole platform.</p><p>According to <a href=\"https://twitter.com/FacebooksTop10?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">Facebook's Top 10</a>, a now-inactive Twitter bot by journalist Kevin Roose and internet studies professor Fabio Giglietto, Catholic Fundamentalism's page first started blowing up in September 2020, when it was performing slightly behind <i>The Hill</i>. But in 2022 and 2023, it started really doing numbers, regularly outperforming Ben Shapiro and <i>Rolling Stone</i>.</p><p>What makes all of this especially strange (well, aside from how strange this is just in general) is that no other big pages are sharing Adams' posts. For instance, in the case of the aforementioned Jimmy Buffet obit, its engagement was coming from all over Facebook, with hundreds of different pages sharing it. According to CrowdTangle, the Catholic Fundamentalism Facebook page is the only referral for Adams' posts.</p><p>The secret to Catholic Fundamentalism’s success may lie in an algorithm tweak earlier this year. <i>Gizmodo</i> <a href=\"https://gizmodo.com/facebook-traffic-down-algorithm-change-1850549012?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">reported in June</a> that throughout the first half of 2023, Facebook traffic for pretty much all news websites had massively declined. A local journalist <i>Gizmodo</i> interviewed also noted that “anything that’s controversial or related to substantive policy news gets suppressed, but if it’s news about something relatively simple and happy, the algorithm amplifies it.” </p><p>And, as you might expect, there are hundreds of Catholic Fundamentalism blog posts that would be deeply controversial in most religious circles (“<a href=\"https://catholicfundamentalism.com/what-is-a-protestant-what-is-a-christian/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">A protestant is a person who willfully disobeys Any Word of Christ</a>” is a doozy). But the way they’re shared on Facebook means that next to no one is actually clicking through to read them. In fact, according to the site’s own traffic counts, that anti-Protestant post only has 23 views, but its <a href=\"https://www.facebook.com/385022441542202/posts/3356882521022831?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">Facebook post</a> has over 7,000 reactions and a thousand comments. And it's those thousand comments that are the key here.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/9887e730-2b77-43a5-a3b4-7b37a9d49ed5/fdf86154-92d4-4eb0-a823-4ae38c3b0164_718x694.png?t=1705691564\" /></div><p>We said above that the posts weren’t “classic engagement bait”, but as we’ve researched post-Meta facebook, we’ve seen weird new forms of engagement evolve from the sludge. Back in June, one of the biggest Facebook posts was a <a href=\"https://www.facebook.com/RealAllYouCanEat/posts/pfbid0iwqT9BXowSEfvK7PZLaKE6kf5Kn17Qatd7XWyEVdEVWhRfQJgM1Xfw2KPtEXyXecl?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">repost</a> of a Tumblr post titled, “<a href=\"https://www.tumblr.com/beardedmrbean/698466599595868160?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">the potato of luck</a>”. All the replies on Facebook were treating the potato like a holy relic, commenting “Amen” even though there wasn’t anything specifically religious about it. Those comments seemed to be the main reason the post got so big.</p><p>And, of course, all of the posts on the Catholic Fundamentalism Facebook page are dripping with “Amen” comments, regardless of other kinds of engagement they get. The post shows up in other people’s feeds, people comment “Amen” because that’s what people do now, apparently, and the cycle continues. But these Amen chains aren't boosting Catholic Fundamentalism’s popularity, as much as they are insulating the page from Facebook’s current suppressive algorithm.  </p><p>We first thought that perhaps this new no bummers landscape inside of Facebook was amplifying Catholic Fundamentalism. This was the case with Thinkarete Lifestyle, the last random tiny page we saw <a href=\"https://www.garbageday.email/p/when-the-traffic-firehose-is-pointed?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">get this enormous on Facebook</a>. Thinkarete was blasted with traffic after stumbling on to an engagement hack the algorithm seemed to prioritize. But Catholic fundamentalism isn't really doing any better than it was a year ago. It's just that everyone else is doing much worse.</p><p>Which makes Catholic Fundamentalism a useful yard stick for measuring at least one section of Facebook that is clearly in decline — publishers and third-party links. As its creaky machinery begins reassemble itself into a TikTok competitor, other parts of the platform — like, you know, where people used to share news — have become bizarre content voids where confused users are just commenting “Amen” over and over, turning Facebook into the final form of all declining internet communication: A chain letter.</p><p><i>If you want to get access to the monthly reports that this research comes from, hit the green button below. They’re $150 a year and you get all the other Garbage Day subscriber benefits. If you already subscribe, you only pay the difference.</i></p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\"><span> Subscribe now </span></a></div><hr /><h2>AI News Anchors Are The Future Of Waiting Rooms Everywhere</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/2abfe95f-f5cf-406b-b5d6-e7986c90a577/b1f39922-1244-47da-95f9-09c8b990de83_1220x1266.png?t=1705691565\" /></div><p>A new AI startup, aptly titled Channel 1, is promising a new news network powered entirely by AI-generated hosts. You can <a href=\"https://twitter.com/channel1_ai/status/1734591810033373231?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">watch the demo</a> here.</p><p><i>Deadline</i> <a href=\"https://deadline.com/2023/11/ai-newscast-set-for-debut-1235599340/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">actually covered</a> Channel 1 last month. It’s going to run on X, its own website, and a couple of the lower-level streaming services like Crackle. The company behind it is closely connected to the weird digital media conglomerate that Chicken Soup For The Soul has morphed into over the last few years. </p><p>If you haven’t been following this, there is essentially a subspace dimension of streaming services watched by, from what I can tell, no one, where ads play in between TV shows and movies that don’t exist. Like the streaming video equivalent of two cameras pointing at each other. And that is where these AI-generated news programs will launch initially. </p><p>Not to go too off topic, but my personal theory is that this content netherworld will eventually swallow every streaming service that isn’t Netflix, Amazon Prime and maybe Apple TV and Disney+, if it hasn’t already.</p><p>If these shows work, and I use “work” here very liberally, I have absolutely zero issues believing that they’ll start filling up other spaces very quickly. Basically, take every public screen that’s currently playing top-down cooking videos, reruns of <i>Ridiculousness</i>, or videos from The Chive and <i>Refinery 29</i>, and replace it with an AI-generated news anchor.</p><hr /><h2>Netflix Finally Released Some Data</h2><p>The first edition of Netflix’s bi-annual (two times a year lol) What We Watched report is out and it is fascinating. You can check it out <a href=\"https://about.netflix.com/en/news/what-we-watched-a-netflix-engagement-report?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">here</a>. </p><p>The most watched show for 2023 was <i>The Night Agent</i> and non-English titles amount for about 30% of all Netflix viewing. Which sounds like a lot, but is actually much lower than I expected considering how global Netflix is.</p><p>Another thing that jumped out was how prevalent Korean properties, in particular, are. There were three in the top 20. Also, <i>Puck</i>’s Julia Alexander, who has been covering Netflix for a while now, <a href=\"https://twitter.com/loudmouthjulia/status/1734937120727318788?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">had a good point</a> about the amount of non-original licensed properties in Netflix’s list: “It’s easier for Netflix to license <i>Suits</i> than it is for NBCUniversal to make <i>Stranger Things</i>.”</p><hr /><h2>*Hipster Runoff Voice* What Killed The Altosphere? &amp; Was 2k23 A “Bad” Year For “The Scene”/MP3s?</h2><div></div><p>Bethany Cosentino, the frontwoman for seminal indie band Best Coast, recently caused a bunch of discourse after speaking candidly in a TikTok about how disappointed she was with the reception of her new solo record. I have to confess I saw headlines about “Bethany Cosentino” all week and had totally forgotten that was the Best Coast lady. Probably part of the problem there. Though, to be clear, I think what Cosentino is describing here is a real issue for non-TikTokable artists right now.</p><p>But Cosentino’s TikTok generated some interesting takes. Music critic and King Emo Ian Cohen <a href=\"https://twitter.com/en_cohen/status/1734612366279795198?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">wrote</a>, “My only thought on the Best Coast thing is that it’s part of a bigger story about musicians, writers, and other industry folks who experienced the Peak Indie era adjusting to a new reality.”</p><p>And writer Jaime Brooks went a bit further, <a href=\"https://twitter.com/elite_gz/status/1734651871900602657?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">asking</a>, “What if streaming wasn’t just the end of ‘peak indie’ but the end of ‘peak recorded music’ more broadly? What if the 1970s-2010s was a unique, finite boom period for the entire medium? What if it’s over now? Just a thought.” Brooks also compared the boom and slump of recorded music to a similar pattern that happened with sheet music after the advent of, you guessed it, recorded music.</p><p>I don’t think these are wrong ways to view this necessarily, but after I eventually remembered that Cosentino was the Best Coast lady, years of forgotten music blog discourse came flooding back for me, like the aging hipster equivalent of Aang in <i>Avatar: The Last Airbender </i><a href=\"https://www.youtube.com/watch?v=cH-HT9WCtiQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">opening his chakras</a>. And I suddenly remembered how cliquey, annoying, and, most importantly, artificial the indie blog era felt as it was happening. The much more populist (and cringy) Myspace scene era was crashing and burning and, in its place arrived an increasingly elitist network of genuinely insufferable bloggers promoting — or obsessively attacking — bands based entirely around a Big Muff pedal with names like SVRRF DOG and §§§. And as these bands were “blowing up” it was extremely obvious that they just were a bunch of 20-somethings who had figured out how to game a new emerging media pipeline, hopping from Hype Machine to whatever show in Williamsburg <i>VICE</i> and 1800 Tequila were sponsoring to, hopefully, the ear of the guy at Apple who picked the iPod commercial songs. At the very least they’d end up with a <i>Nylon</i> profile about what kind of drugs they liked to do.</p><p>I’m not saying these bands didn’t build real fanbases in the process, but they were playing the exact kind of game artists play now. The machinery was just different. More human, less automated, but just as hierarchal. And for any Gen Z musicians that happen to get this email forwarded to them by their parents or whatever, yes, someday, sooner than you think, you will sound just like me right now when you talk about TikTok.</p><hr /><h2>The Redditors In r/energydrinks Are Doing Some Very Important Work</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/c7abc48e-16cb-4375-959f-172f1461ec4f/b589a7a9-8df4-4711-bcb5-8b9479bd1ec5_2346x1642.png?t=1705691566\" /></div><p>A redditor in r/energydrinks <a href=\"https://www.reddit.com/r/energydrinks/comments/18dd1tm/does_making_energy_drinks_into_popsicles_lower/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">froze a bunch of Monster</a> and is trying to figure out if it would change the effectiveness of the caffeine. The general consensus from the commenters is, no, it wouldn’t.</p><p>Also, a quick aside here. I don’t spend a lot of time in this sub, but it seems like the comments are split pretty much down the middle between wholesome suggestions for how to make slushies with energy drinks and commenters suggesting the original poster “boof” it. I’m going to do you all a favor and not explain what that means, but you can look it up on Urban Dictionary if you so choose.</p><hr /><h2>How To Weigh An Octopus</h2><div></div><hr /><h2><b>The Jack Off Pants Are Real Unfortunately</b></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/35bc7e3f-59f6-497a-b572-19c89f32417f/b9eabc52-91bb-481e-b4e8-9123b804c257_1134x1716.png?t=1705691568\" /></div><p>I don’t know how to cushion this, so I’ll just come right out and say it. The jack off pants are real. </p><p>These pants <a href=\"https://twitter.com/RobDenBleyker/status/1734366723321536596?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">went viral</a> after Rob Denbleyker, the creator of the comic <i>Cyanide &amp; Happiness</i>, spotted them being advertised on X. And, uh, yeah, they’re a real product. They’re called JO Pants and they’re designed for exactly what you think they’re designed for. Also, the use of the word “covert” in the ad is EXTREMELY troubling.</p><p>Who needs Disney when you have advertisers like this?</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.theverge.com/c/23972308/twitter-x-death-tweets-history-elon-musk?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">Go read all </a><i><a href=\"https://www.theverge.com/c/23972308/twitter-x-death-tweets-history-elon-musk?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">The Verge</a></i><a href=\"https://www.theverge.com/c/23972308/twitter-x-death-tweets-history-elon-musk?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\"> Twitter stories</a></p></li><li><p><a href=\"https://variety.com/2023/streaming/news/dropout-subscribers-double-new-shows-sam-reich-1235829675/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">“Dropout CEO Talks Doubling CollegeHumor Successor’s Streaming Subs and Content Output, Price Increase Plans and First Profit Sharing”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://www.reddit.com/r/whatismycookiecutter/comments/18gdyir/im_at_a_loss_any_ideas/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-amen-spam-conquered-facebook\" target=\"_blank\">mysterious cookie cutter</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=e2dbca71-8e1c-49ac-b62a-9fd774beae74&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"aefd293e794861360051c36e4e72517375a8a022afa5a5ce991c34eb7aaacbc4","category":"default"}