{"title":"How I met my wife","link":"https://blog.webb.page/2017-10-29-how-i-met-my-wife.txt","date":1509235200000,"content":"<p>I was your typical (angsty) teenager. Like most people, I was trying to find\nmy voice, trying to find what made me unique, and how I could use that to\nbecome popular…needless to say I failed. Once, <em>for some reason</em>, I decided to\nask one of the most popular girls in school on a date, instead of <em>my actual\ncrush</em> (who was friends with her). That's a dumb story for another day.</p>\n<h2>Classface</h2>\n<p>In 2002, 14 was my age when a friend of mine called (remember when this\nhappened?) to pester me about joining an \"exciting\" new social network called,\n<em>Classface</em>. I'll paraphrase the conversation here:</p>\n<p>Cleo: OMG Paul, you need to join this site. It's hella dope.\nMe:   <em>Uh-huh</em>. What site?\nCleo: It's called Classface and--\nMe:   (mumbling) That sounds dumb.\nCleo: --you get to meet people from around the <em>world</em>!\nMe:   I don't even like people <em>near</em> me, why the hell would I like people\n      <em>far away</em>?\nCleo: JUST JOIN IT NIGGA.</p>\n<p>With a heavy sigh I typed <a href=\"http://www.classface.com%5B1%5D\">www.classface.com[1]</a> into Internet Explorer (yes,\nseriously) and was greeted with basic, sparse web design reminiscent of the\nera.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/how-i-met-my-wife-a.png\">In due time, I would love seeing this everyday</a></p>\n<p>Back then, no one thought about the need for private profiles. After all,\nwouldn't you <em>want</em> people to find you? I spent a couple minutes looking at\nrandom profiles until I saw a face that took me aback. Here was this girl from\nPhenix City, Alabama (what the hell is \"Phenix\", I thought at the time,\nshouldn't it be \"Phoenix\"?) and she had such a genuinely happy smile. \"Keisha\nPage\", I thought to myself, \"I like that name\". She was <em>fiiiiine</em> as hell\ntoo! I hovered over whatever button to get to the next random profile while\nhaving an internal discussion with myself.</p>\n<p>Lame Voice:   Wowee, who the hell is THAT?</p>\n<p>Cooler Voice: Your future girl bro!</p>\n<p>Lame Voice:   Nah, that'd never happen.</p>\n<p>Cooler Voice: Not with that attitude! Just say hi.</p>\n<p>Lame Voice:   Really? No way man, I'm nervous.</p>\n<p>Cooler Voice: You can't be a bitch <em>all</em> your life. You can't even tell\n              Shawna you like her, you can at least tell a girl who lives\n              THOUSANDS OF MILES AWAY that she looks cute. She realize you a\n              scrub? Delete your account!</p>\n<p>And so, that's what I did! I scoured her profile for an opener and saw that\nshe was a fan of Degrassi (the Drake era). I believe I wrote something along\nthe lines of:</p>\n<blockquote>\n<p>Hey, I just joined this site and I just happened to find your page. I wanted\nto let you know that you have a pretty smile anyhoo did you see what Skinner\ndid to Marco last week? What a bum, yeah, Jimmy should've said something to\nhim.</p>\n</blockquote>\n<p>(For those who don't know, Drake's character was named Jimmy on the show.)</p>\n<p>I anxiously awaited her reply and probably played Road Rash on a Shockwave\nsite to pass the time. To my delight, she thanked me and our friendship\nflourished thanks to our shared interests. I'd like to take a timeout to\npublicly thank Drake<a href=\"https://twitter.com/drake\">2</a>, Andrea Lewis<a href=\"https://twitter.com/missandrealewis\">3</a> (my favorite person on the show), and\neveryone else from Degrassi for making this possible.</p>\n<p>Classface eventually became a lame place to be and it was their fault. They\nhad the <em>terrible</em> idea to redesign the site but with no UX sense. No one knew\nwhere to go to do things you could do in the original version and I believe\nthey messed the site up <em>more</em> trying to fix it. So, everyone moved to\nMyspace.</p>\n<h2>Myspace</h2>\n<p>It was during this time that Keisha gave me her phone number (holla!) and I\nheard her Southern accent for the first time and we would talk for <em>hours</em>\nabout how wack our parents were, dreams for the future, and everything\nin-between.</p>\n<p>Years later, I would reminisce about those conversations and create music.\nHere's a sampling of those tracks:</p>\n<p><a href=\"https://bandcamp.com/EmbeddedPlayer/album=955213907/size=small/bgcol=010000/linkcol=c8af60/track=918133906/transparent=true\">4</a></p>\n<p><em>Dusty Stars</em> is from Music from the Love Lounge, Vol. 01<a href=\"https://thewibby.bandcamp.com/album/music-from-the-love-lounge-vol-01\">6</a> (this cuts off\nearly for some reason, probably data corruption) and <em>Remember When</em> is from\nVol. 02<a href=\"https://thewibby.bandcamp.com/album/music-from-the-love-lounge-vol-02\">7</a>. I sometimes find music a better conduit to express my thoughts\nthan simply talking.</p>\n<p>Keisha and I got busy with our own lives and communicated less but I would\ncheck her profile every couple months to see what was new. At some point, I\nsaw she was in a relationship with a guy I instantly disliked and partly\nbecause I was being a hater. From where I sat, thousands of miles away, it\nseemed like he wasn't treating her right and her journal posts confirmed my\nsuspicions. When she uploaded a picture of herself with a baby on a beach, my\nunspoken hopes were smashed.</p>\n<p>Welp.</p>\n<h2>Facebook</h2>\n<p>Like with Classface, Myspace became lame and so everyone jumped to Facebook.\nKeisha and I continued our random check-ins over the years but it wasn't until\nOctober 2011 that we reconnected. Her marriage to that <em>terrible</em> guy was over\nfor quite some time but I was just happy to converse as a friend.</p>\n<p>The following month, we became closer than I ever expected (or hoped) and I\nhad the bright idea to try and visit her for Thanksgiving. She thought it was\na fantastic idea so I begged my mom to buy me roundtrip tickets to\nJacksonville, FL…my mom is a bit paranoid. Catfishing, abduction, and other\ncrazy things happen all the time so she wasn't super keen about the idea at\nfirst. She made me promise to text her as soon as I landed (I forgot to do so\nuntil the next morning and got a rather disgruntled phone call, haha). Keisha\nand I were using Skype at this point and I was one <em>thousand</em> per cent sure\nshe was real. 😏</p>\n<h2>Florida</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/how-i-met-my-wife-b.jpg\">Me, after realizing what I got myself into</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/how-i-met-my-wife-c.jpg\">(Kinda) high-school sweethearts</a></p>\n<p>When Keisha greeted me at the airport, it was surreal. We both had goofy grins\non our faces and then hugged. Our immediate, simultaneous remarks were: \"OMG\nyou're so tall/short!\". LOL</p>\n<p>Luckily, her siblings and daughter liked me and we had a fun week full of\njokes (you gotta come prepared with some zingers 'round these folks), fun, and\nof course…Thanksgiving. 😉</p>\n<p>In fact, it was Thanksgiving Day that I asked/confirmed our relationship\nstatus. <em>Pro tip:</em> if you're forgetful of dates like I am, make sure\nanniversaries are on a date you <em>know</em> you won't forget. BWAHAHAHA!</p>\n<p>Y'know those movies where a main character departs for a flight and the other\nmain character is super sad with tears in their eyes but the first character\nwants to be strong for the second and tries really hard to keep it together?\nYeah, that was us when it was time for me to head back to Boston. As soon as I\nturned away from Keisha and entered the airport, I was\nboo-hoo-Academy-Award-winning-actor-Viola-Davis crying. My. Tears. Were.\n<em>Fugly</em>. I looked like my mom AND dad took turns beating my ass for stealing\ncookies and smudging a wall they just painted after mooning the elderly Polish\nwoman next door. It was bad man. My chest hurt.</p>\n<p>Some of my friends at the time thought I was crazy to date someone on the\nother side of the country, and for a couple years at that! Keisha and I would\nvisit each other at least twice a year for physical reminders of why we were\ntogether and spoke/texted nearly every day and that nourished our emotional\n<em>and</em> mental needs.</p>\n<h2>Massachusetts</h2>\n<p>With our generation, I've seen and continue to see posts on social media where\npeople are hella frustrated about relations̶h̶i̶p̶shits they get into. The ratio\nof disappointment appears to be balanced. I believe 90% of issues could be\nsolved with communication. Notice I didn't prefix the word \"more\". I don't\nthink people communicate at <em>all</em> anymore. Millenials would rather swipe\nleft/right and take pics or make statuses for likes that don't matter instead\nof communicating for love that <em>does</em> matter…ooh, that'd make a great post in\nof itself.</p>\n<p>Even though Keisha and I knew each other for 10 years, we still had to learn\n<em>how</em> to live together. I was a guy in a two-bedroom apartment with a\nlong-distance girlfriend and when she moved in, I suddenly had a\nthree-year-old stepdaughter and couldn't fucking swear all the time. And\nfurniture. Oh my <em>gawd</em>, Keisha had so much furniture. I had a desk…and a sad\nexcuse for a bed. During Keisha's first night living in Massachusetts, a\nspeeding driver knocked off the sideview mirror from her parked car (<em>pro\ntip:</em> don't live on Main Street, side streets are better).</p>\n<p>I found that (gasp) Keisha could irritate me sometimes! I irritated her <em>all</em>\nthe time! There was a period in the first year where everything could've gone\nup in smoke but we <em>communicated</em>. My default way of dealing with things at\nthe time was to shut down and stew, have mock debates in my head. Little did I\nknow, Keisha does that on a regular basis and always had an immediate response\nto everything I could possibly say. Hoo boy, I'm a pro now but that was not a\nfun time.</p>\n<p>Compromise was something else I had to learn. I was resistant at first but\nwhen faced with the prospect of losing her and an adorable little girl who now\nsaw me as \"daddy\" instead of \"Paul\", I quickly learned to adjust. I'm not a\nperfect guy today, but I am perfect for my family (or damn close to it).\nDon't hashtag, retweet, or share \"relationship goals\"…just learn how to\ncompromise, communicate, and ensure your partner is on the same page. Remember\nwhen your parents made you eat nasty things with dinner? I would mix the nasty\nthings with food I did like to get them out the way so I could enjoy the rest\nof my meal. The same thing applies to relationships; do the hard stuff now so\nyou can enjoy growing together later.</p>\n<h2>The Future</h2>\n<p>I proposed to Keisha on Easter, earlier this year. Remember my pro tip from\nearlier? BWAHAHAHA!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/how-i-met-my-wife-d.jpg\">Please ignore the fact that all of us are looking at ourselves and not the camera</a></p>\n<p>And now? We're married! As far as what's next…growth. Our focus is creating an\nenvironment where our kids are nurtured, growing, and happy. That means\nbecoming homeowners so we REALLY own our own space, and helping each other\nthrive in our fields.</p>\n<p>Keisha went from being a sailor in the Navy, waking up at the bootycrack of\ndawn to work out, have 24-hour shifts for some thing or other (idk, I'm a\ncivilian) to becoming a stay-at-home-mom because we don't trust anyone with\nour toddler until he learns how to speak. We've been spooked by online videos\nof \"caretakers\" smacking babies in the face and parents wondering why their\nchild has a fear of pillows. NOPE. 🖕🏾</p>\n<p>Since our son's been born, Keisha has garnered a reputation in mom groups as\nTHE go-to person when you want a custom designed shirt, poofy skirts, onesies,\nbooties, and so on. I've designed logos for her and provided my designer-y\nexpertise on how to deal with clients and she's flourishing!</p>\n<p>I'm a simple man, I just want world domination.</p>\n<p>It's amazing that two 14-year-old kids would connect on social media in 2002,\nonly to marry each other 15 years later. Paul Webb and Lakeisha Page met\nonline…Webb and Page met on a webpage. WebbPage. See? That's some\nhigh-quality movie shit. 🕸</p>\n<h2>Extra</h2>\n<p>This may sound completely fabricated to you, dear reader, but Keisha and I\nlived in the <em>same</em> city and our fathers were stationed at the <em>same</em> military\nbase at the <em>same</em> time. Clarksville, Tennessee was the city, Fort Campbell\nwas the military base, 1994-1997 was the time. Fort Campbell had \"family days\"\nand there would be lots of kids playing together. I don't remember any of the\nkids I saw/played with but it's quite possible that we've seen each other back\nthen.</p>\n<p>How weird is that?</p>\n<h2>P.S.</h2>\n<p>During one of Keisha's early visits to Massachusetts, I asked her to appear on\nthat year's release of Music from the Love Lounge. It's a fitting end to a\npost like this, check it out (beats by me)! 🕸</p>\n<p><a href=\"https://bandcamp.com/EmbeddedPlayer/album=4219807572/size=small/bgcol=010000/linkcol=c8af60/track=635396433/transparent=true\">8</a></p>\n<h2>P.P.S</h2>\n<p>Here's my wife's post<a href=\"http://sincerelyshantelle.com/blog/how-i-met-my-husband\">9</a> about how we met! Did you know that she found her\ndress at a thrift store and <em>completely</em> redesigned it? She's craftier than a\nmofo!</p>\n<h2>P.P.P.S</h2>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/how-i-met-my-wife-e.jpg\">I gotta say, we look DAYUM good</a></p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"af8bf305278fea8ed96441d73f0e160c7b878fec6d75ba2521ded2bff700a15f","category":"Sites"}