{"title":"The Merger Self, the Seeker Self, and the Lifelong Challenge of Balancing Intimacy and Independence","link":"https://www.themarginalian.org/2024/04/21/gail-sheehy-merger-seeker-passages/","date":1713736519000,"content":"<p><a href=\"https://www.amazon.com/Passages-Predictable-Crises-Adult-Life/dp/034547922X/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"462\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/passages_sheehy.jpg?fit=320%2C462&amp;ssl=1\" alt=\"The Merger Self, the Seeker Self, and the Lifelong Challenge of Balancing Intimacy and Independence\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/passages_sheehy.jpg?w=660&amp;ssl=1 660w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/passages_sheehy.jpg?resize=320%2C462&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/passages_sheehy.jpg?resize=600%2C865&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/passages_sheehy.jpg?resize=240%2C346&amp;ssl=1 240w\" /></a></p><p>Each time I see a sparrow inside an airport, I am seized with tenderness for the bird, for living so acutely and concretely a paradox that haunts our human lives in myriad guises — the difficulty of discerning comfort from entrapment, freedom from peril. It is a paradox rooted in the early development of the psyche and most poignantly manifested in our intimate relationships as we confront over and over the boundary between where we end and the other begins, the challenge of balancing intimacy and independence. </p>\n<p>Pulsating beneath the paradox are two opposing forces — one tugging us toward the comfort of the known, the safety of the terminal, the other beckoning us to fly into the open sky of the unknown, with all its sunlit freedoms and its storming dangers. In her 1976 book <a href=\"https://www.amazon.com/Passages-Predictable-Crises-Adult-Life/dp/034547922X/?tag=braipick-20\" target=\"_blank\"><strong><em>Passages: Predictable Crises of Adult Life</em></strong></a> (<a href=\"https://search.worldcat.org/title/3045710\" target=\"_blank\"><em>public library</em></a>), <strong>Gail Sheehy</strong> (November 27, 1936–August 24, 2020) explores these “two sets of forces always at loggerheads inside us over the questions of how far and how fast we shall grow,” terming them the <em>Merger Self</em> and the <em>Seeker Self</em>. </p>\n<figure><a href=\"https://society6.com/product/praise-song-for-dawn-proceeds-benefiting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=680%2C851&amp;ssl=1\" width=\"680\" height=\"851\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?w=1535&amp;ssl=1 1535w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=320%2C401&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=600%2C751&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=240%2C301&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=768%2C962&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?resize=1227%2C1536&amp;ssl=1 1227w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/04/PraiseSongForDawn_by_MariaPopova.jpg?w=1360&amp;ssl=1 1360w\" /></a><figcaption>Available <a href=\"https://society6.com/product/praise-song-for-dawn-proceeds-benefiting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">as a print</a>, benefitting The Nature Conservancy</figcaption></figure>\n<p>She writes:</p>\n<blockquote><p>Our Merger Self… is the universal wish to be attached to another, to restore somehow the beatific closeness with mother, for in that fusion would lie perfect harmony, absolute safety, and endless time. The Merger Self is born of the frustration with our early discovery that we are indeed separate and distinct from our caregiver. It triggers a desire to totally incorporate the other, any “other” who becomes the source of love and pleasure… The Merger Self then, in its constant effort to restore closeness, desires always a safe, tight fit.</p>\n<p>The Seeker Self is driven by the opposite wish: to be separate, independent, to explore our capacities and become master of our own destiny. This impulse is fueled in early childhood by our delight in awakening capabilities.</p></blockquote>\n<p>But for all its problematic clinginess, the Merger Self is also crucial for the “temporary fusions” upon which empathy is founded — the ability “to reach out and empathize with others, to feel as they might feel without letting our own reality intrude” — and upon which all love rests; for all its seeming strength and self-reliance, the Seeker Self can thrust us into selfishness and solipsism. Only by balancing the two can we achieve what Carl Jung called individuation, Abraham Maslow called self-actualization, and Sheehy calls simply authenticity — “the arrival at that felicitous state of inner expansion in which we know of all our potentialities and possess the ego strength to direct their full reach.” She considers the necessary calibration at the heart of the balance:</p>\n<blockquote><p>If the Merger Self is indulged too early, it can lead us into a no-risk, no-growth position. But once we are beyond the suspicion, or the fear, of letting our distinctiveness be lost in attachments to others, it is our merger side that enables us to love intimately, share unselfishly, express tenderness, and experience empathy. </p>\n<p>If the Seeker Self is left unbridled, it will lead us to a self-centered existence in which genuine commitments can have no place, and in which efforts to achieve individual distinction are so strenuous that they leave us emotionally impoverished. </p>\n<p>It is only by getting the two sides to work in concert that eventually one becomes capable of both individuality and mutuality.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2012/12/05/an-abz-of-love/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2012/12/abzlove19.jpg\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2012/12/05/an-abz-of-love/\"><em>An ABZ of Love</em></a></figcaption></figure>\n<p>In the remainder of <a href=\"https://www.amazon.com/Passages-Predictable-Crises-Adult-Life/dp/034547922X/?tag=braipick-20\" target=\"_blank\"><strong><em>Passages</em></strong></a> (which I discovered through a sidewise mention in <a href=\"https://www.themarginalian.org/2024/03/03/the-middle-passage-john-hollis/\"><em>The Middle Passage</em></a>), Sheehy goes on to explore how the balance of these two aspects of the psyche affects everything from romantic relationships to professional actualization across the various stages of life as we dismantle our projections and complexes, relinquish our compulsions and conditioning, and recover our authenticity. Observing that “the major task of midlife is to give up all our imagined safety providers and stand naked in the world, as the rehearsal for assuming full authority over ourselves,” she considers the ultimate payoff of this painful, redemptive process:</p>\n<blockquote><p>One of the great rewards of moving through the disassembling period to renewal is coming to approve of oneself ethically and morally and quite independent of other people’s standards and agenda. By giving up the wish that one’s parents were different and by navigating through various lifestyles to that point of dignity worth defending, one can achieve… arrival at that final stage of adult development, in which one can give a blessing to one’s own life.</p></blockquote>\n<p>Complement with Kahlil Gibran on <a href=\"https://www.themarginalian.org/2016/09/27/kahlil-gibran-the-prophet-love-marriage/\">the challenge of balancing intimacy and independence</a>, the key to which Schopenhauer so poignantly captured in his <a href=\"https://www.themarginalian.org/2023/08/03/porcupine-dilemma/\">parable of the porcupine dilemma</a>, then revisit Rilke on <a href=\"https://www.themarginalian.org/2018/09/03/rilke-love-marriage/\">the difficult art of giving space in love</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"afecbb89f6191e4dd7d2dd8d7f1d5ff7ba5f03bbeb45a1b990fc683f501e011c","category":"default"}