{"title":"The Internet is (not) broken","link":"https://blog.webb.page/2021-01-15-the-internet-is-broken.txt","date":1610668800000,"content":"<p>You will find no shortage of \"tweet storms\" or articles decrying the current\nstate of the Internet using adjectives like \"doomed\", \"broken\", \"ruined\", &amp;c.\nWhile I tend to agree with many of the points shared in such posts, I stop\nshort of feeling defeated. Maybe it is because I am an optimist and I recognize\nmy own power to create what I wish to see. Maybe it is my decade-plus\nexperience and work within the tech industry and absorbing stories of those\nolder than I who saw success/failure in the dotcom boom. Whatever it is, a few\nthings are made clear to me:</p>\n<ol>\n<li>People are not going down without a fight. The work happening in the\ndecentralization and cryptocurrency fields are proof of this. Will these\navenues catch on? Certainly not immediately, maybe even ever. However, the\nexercise of creating/discovering solutions is worthwhile regardless,\nIMHO (failures lead to advancement of new, potentially better ideas).</li>\n<li>These big evil tech companies? They did not start out that way.\n\"Mo' money mo' problems,\" shout-out to Biggie Smalls. If money really is the\nroot of all/most evil, maybe every company should have an in-house ethics\ncommittee that is actually empowered to DO THEIR JOB (Dr Timnit Gebru and\ncountless other people of color in the ethics space know this all too well).</li>\n<li>Baseline technical IQ is rising — this means our bumbling politicians who\nhave immense difficulty deciphering non-answers from facetious tech CEOs\nwearing shit-eating grins will finally see what we see and shut that shit\ndown. Well, AOC does not seem to have a problem grasping technical\nconcepts…she is also not 70+ years old so there is that.</li>\n</ol>\n<p>Before continuing, it would be useful to recap what ails the Internet as seen\nby enthusiasts of this wonderous platform. Rather than enumerate, I will share\na list off the top of my head:</p>\n<ul>\n<li>Too much of today's Internet is dependent upon a handful of tech companies.<ul>\n<li>Most of \"FAANG\": Facebook, Apple, Amazon, Netflix, Google</li>\n</ul>\n</li>\n<li>All these companies are based in the United States, and various law\nenforcement agencies routinely subpoena (order) said companies to hand over\ndata in the interest of \"national security.\" Half-truths are technically the\ntruth, right?</li>\n<li>The data brokerage economy, which is a fancy way to say your personal data is\nsold and traded around the world for cheap, was enabled by Facebook, Google,\nand a LOT of smaller companies you have never heard the name of\n(but the investors you follow on Twitter? Oh, <em>they</em> know).<ul>\n<li>In all fairness you <em>did</em> agree to the terms and conditions of these\nservices you use so they can <em>legally</em> do whatever they want with the data\nyou give them…but does that make it right? Ethics apparently has no place\nin law.</li>\n</ul>\n</li>\n</ul>\n<p>For fans of capitalism (like myself), this seems like not-that-big-a-deal in\nthe grand scheme of things. The best companies became successful and just\npivoted to what makes the most money. Maximizing profits while keeping margins\nlow? That's Business 101, babeee! Pull yourself up by the bootstraps! No pain\nno gain! Working hard or hardly working? ARE YA WINNIN' SON?!</p>\n<p>But I digress.</p>\n<p>Any time a major service like Google Analytics, YouTube, or\nAmazon Web Services (AWS) is down, a couple technical people get on Twitter and\nsay \"SEEEEE?! We shouldn't rely on them!\" but the fact of the matter is,\nsoftware is created by humans, humans are fallible, and shit happens. And,\nservers falling over? Nobody wants to deal with that, it's annoying! For those\nof us who aren't technical enough to perform DevOps, the idea of managing a\nserver (let alone setting one <em>up</em>) is intimidating at best. So…the alternative\nis to quit using/paying for one service in favor of a less \"evil\" or\nproblematic one. For example, the people who leave their grandparents behind\non Facebook in favor of Twitter. It is alarming that Twitter only <em>started</em> to\nreign in the President's fear-/hate-mongering and lies in the weeks leading up\nto the election…not one time prior to 2020. 10 days left of the presidency\nhe's managed to hold onto and that's when Twitter FINALLY finds the guts to\nboot him off their platform. Anyhoo…</p>\n<p>Where do we go from here?</p>\n<p>The pessimists of the tech crowd will say there's no point in\ncreating alternatives.</p>\n<ul>\n<li>\"No one will sign up for your service, what makes it better\nthan ?\"</li>\n<li>\" has existed for years, you're not just gonna eat\ntheir lunch.\"</li>\n<li>\"Normies want free, they won't pay for your dumb idea\"</li>\n<li>\"How are you gonna handle moderation, if  can't do it?\"</li>\n</ul>\n<p>I'm old enough to remember what is commonly referred to as the \"Wild West\" of\nthe Internet. Internet access speeds were excruciatingly slow by today's\nstandards and web browsers were not capable of what we take for granted now.\nDevelopers favored XML over HTML! Because the Internet was still fairly new,\nthere were no established norms nor preconceptions. \"Data harvesting\" sounded\nmore like a malicious act some corporation in a cyberpunk novel would engage\nin. But, when people wish the Internet was back to how it used to be, I\nbelieve they are (usually) talking about the <em>feeling</em> of it, rather than the\nlimited functionality (interestingly, Gopher has seen a resurgence lately\nalong with Gemini).</p>\n<p>When I was in middle school in the year 2000 I got an account on homestead.com\nand was able to play around with the free website space they gave me. I\ndownloaded a website theme from some place and learned CSS and HTML by\ntweaking parameters in Notepad and re-uploading the changed files. As archaic\nas that process was, it blew my mind that I could create a Megaman Battle\nNetwork fan-site and have it reachable by a URL to show my friends at school\nin the computer lab. As I got older I wanted a site without ads and more\nstorage space so I moved onto mediatemple and continued my web development\nexplorations there.</p>\n<p>This level of access seems to be gone these days. Services are still free, of\ncourse, but mostly services where you can be siloed in. This is how brand\nrecognition/loyalty occurs. Apple, Microsoft, and Google are not giving\nschools free laptops and tablets out of (just) kindness, it is a long-term\nplay that usually pans out. Bah, I feel pessimism settling in so onto\nsolutions, as I see them.</p>\n<p>YOU CANNOT PUT THE GENIE BACK IN THE BOTTLE</p>\n<p>Tech companies have tasted the delicious nectar of wealth that is user data\nand it is the gift that keeps on giving. Well, maybe it should not be called a\ngift. The companies are spending investor dollars to pay their employees to\nbuild features that will get you to sign up and use their product in exchange\nfor your usage habits and keywords within your memes and online rants.\nYou…well, <em>they</em> get what they pay for. You get a nice park to play in and\ngarden to eat from while the wolves watch from behind that tree over there. To\nreduce our reliance on said companies, we need new ones with our best\ninterests at heart to tackle:</p>\n<ul>\n<li>analytics</li>\n<li>blogs and free websites</li>\n<li>collaborative documents</li>\n<li>DNS and domains</li>\n<li>email</li>\n<li>search</li>\n<li>social</li>\n</ul>\n<p>The easiest way to handle free services is to offer a more capable paid\nservice alongside it. Google currently has a monopoly over most of this list\nand best believe, they want <em>more</em>. Poor Facebook just cannot stop being\ncreepy long enough for people to foolishly trust them again and that is\ncrushing their dreams of becoming American WeChat.</p>\n<p>As for me? Well, I am just one guy on the Internet with a voice and a plan for\nevery item on this list. I am also not afraid of not knowing what I do not\nknow so 2021 should be an informative year for me (us, if you want to follow\nalong). Watch this space. 🕸</p>\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"b00456b94540ce46496f731e55953266d3a320bbcb1a52a86fa2bb31042f357f","category":"Sites"}