{"title":"How to Survive Our Authoritarian Post-Truth Era","link":"https://kottke.org/24/11/how-to-survive-our-authoritarian-post-truth-era","date":1732035516000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/do-not-obey.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/do-not-obey.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/do-not-obey.jpg 1200w\" loading=\"lazy\" width=\"1000\" height=\"746\" alt=\"Do Not Obey In Advance\" /></p>\n\n<p>For The Observer, Carole Cadwalladr published <a href=\"https://www.theguardian.com/commentisfree/2024/nov/17/how-to-survive-the-broligarchy-20-lessons-for-the-post-truth-world-donald-trump\">a list of pointers on how to survive in Trumpist America</a>, inspired by Timothy Snyder’s <a href=\"https://kottke.org/16/11/fighting-authoritarianism-20-lessons-from-the-20th-century\">Fighting Authoritarianism: 20 Lessons from the 20th Century</a> that was published in the wake of the 2016 election. Some of these are excellent:</p>\n\n<blockquote><p>1 When someone tells you who they are, believe them. Last week Donald Trump appointed a director of intelligence who spouts Russian propaganda, a Christian nationalist crusader as secretary of defence, and a secretary of health who is a vaccine sceptic. If Trump was seeking to destroy American democracy, the American state and American values, this is how he’d do it.</p>\n\n<p>2 Journalists are first, but everyone else is next. Trump has announced multibillion-dollar lawsuits against “the enemy camp”: newspapers and publishers. His proposed FBI director is on record as wanting to prosecute certain journalists. Journalists, publishers, writers, academics are always in the first wave. Doctors, teachers, accountants will be next. Authoritarianism is as predictable as a Swiss train. It’s already later than you think.</p>\n\n<p>5 You have more power than you think. We’re supposed to feel powerless. That’s the strategy. But we’re not. If you’re a US institution or organisation, form an emergency committee. Bring in experts. Learn from people who have lived under authoritarianism. Ask advice.</p>\n\n<p>15 Remember. Writer Rebecca Solnit, an essential US liberal voice, emails: “If they try to normalize, let us try to denormalize. Let us hold on to facts, truths, values, norms, arrangements that are going to be under siege. Let us not forget what happened and why.”</p></blockquote>\n\n<p>This is a good time to revisit Snyder’s <a href=\"https://kottke.org/16/11/fighting-authoritarianism-20-lessons-from-the-20th-century\">original list</a> as well. Like Cadwalladr, I think about this one <em>all the time</em>:</p>\n\n<blockquote><p>1. Do not obey in advance. Much of the power of authoritarianism is freely given. In times like these, individuals think ahead about what a more repressive government will want, and then start to do it without being asked. You’ve already done this, haven’t you? Stop. Anticipatory obedience teaches authorities what is possible and accelerates unfreedom.</p></blockquote>\n\n<p><strong>Note:</strong> Illustration by the awesome <a href=\"http://chrispiascik.com/\">Chris Piascik</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Carole%20Cadwalladr\">Carole Cadwalladr</a> · <a href=\"https://kottke.org/tag/lists\">lists</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Timothy%20Snyder\">Timothy Snyder</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"b06fc89d0e6960307365e50c434c7cced56663ed5bf3bba803d4117bcc057581","category":"Sites"}