{"title":"The appeal of the Swiss and Swedish work life","link":"https://blog.webb.page/2017-01-25-the-swedish-life.txt","date":1485302400000,"content":"<p>I recently read an article<a href=\"https://www.independent.co.uk/news/business/news/sweden-six-hour-working-day-too-expensive-scrapped-experiment-cothenburg-pilot-scheme-a7508581.html\">1</a> about Sweden's six-hour work day and was\nfascinated by it because here in the States, it's more about the <em>quantity</em> of\nhours you put in, it's not about the <em>quality</em> of the work you put in (FWIW,\nthat seems to be changing in start-up land). Henry Ford famously tested the\neight-hour work day with his factory employees, but it's 2017 now. Do we\n<em>really</em> need to continue the trend?</p>\n<p>To quote<a href=\"https://brath.com/why-we-started-with-6-hour-work-days\">2</a> Magnus Bråth of Brath, a tech company in Sweden (emphasis mine):</p>\n<blockquote>\n<p>We also believe that once you've gotten used to having time for the family,\npicking up the kids at day care, spending time training for a race or simply\njust cooking good food at home, you don't want to lose that again. We believe\nthat this is a good reason to stay with us and not only because of the actual\nimpact longer hours would make in your life but for the reason behind our\nshorter days. That we have shorter days is not the main reason people stay with\nus, they are the symptom of the reason. The reason is that we actually care\nabout our employees, <em>we care enough to prioritize their time with the family,\ncooking or doing something else they love doing</em>.</p>\n</blockquote>\n<blockquote>\n<p>A third huge reason for shorter days is that we all feel more rested.\nObviously we too have to stay late at times, obviously we too are stressed at\ntimes but it's from a better base line. Working late at our two offices often\nmean staying for 8 hours, or 7. <em>Think about it, when mom comes home late, she\ncomes home at 5.</em></p>\n</blockquote>\n<p>In the linked article at the top of this post, the six-hour work day experiment\nended because it was too expensive for the nursing home it was tested in.\nNurses were more alert and as a result, <em>care and happiness amongst those being\ncared for increased</em> drastically. <em>However</em>, more nurses were hired to provide\noverlap for shifts. As countries become more wealthy, I think the benefits will\noutweigh the costs.</p>\n<p>I look forward to implementing a similar system when I am able to hire people\nfor Ideas Never Cease<a href=\"https://the-inc.co\">3</a>. Better maternity / paternity / grief leave as well!\nA previous employer didn't seem to give a damn while I was grieving over my\nmiscarried daughter Zoe Elise and that added to the hurt, immensely. I don't\n<em>ever</em> want to make someone else feel the way I felt, it sucked. My grief was\ngetting in the way of your <em>false deadline</em> on a project for your\n<em>still breathing</em> family member? Whoops, <em>my bad</em>. 🙄 But I digress.</p>\n<p>Chantal Panozzo wrote a great article for Vox<a href=\"https://www.vox.com/2015/7/21/8974435/switzerland-work-life-balance\">4</a> detailing her life in\nSwitzerland and the amazing adjustment from American work life. Here are a few\nchoice quotes:</p>\n<blockquote>\n<p>In Switzerland, you don't arrive to a meeting late, but you also don't leave\nfor your lunch break a second past noon. If it's summer, jumping into the lake\nto swim with the swans is an acceptable way to spend your lunch hour. If you\neat a sandwich at your desk, people will scold you.</p>\n</blockquote>\n<blockquote>\n<p>Lunchtime is sacred time in Switzerland. When I was on maternity leave, my\nhusband came home for lunch to help me care for our daughter. This strengthened\nour marriage. Many families still reunite during weekdays over the lunch hour.</p>\n</blockquote>\n<blockquote>\n<p>Swiss law mandates a 14-week maternity leave at a minimum of 80 percent pay.</p>\n</blockquote>\n<blockquote>\n<p>People in Europe took vacation seriously. Once, when I only took 10 days for\na trip to Spain, my colleagues chastised me for taking so little time off. I\nlearned to take vacation chunks in two-week intervals. Well rested, I noticed\nthat I felt more productive and creative when I returned to work. Recent\nAmerican research<a href=\"https://www.nytimes.com/2013/02/10/opinion/sunday/relax-youll-be-more-productive.html?pagewanted=all&amp;_r=1&amp;&amp;gwh=AC034D10F64239B961A6E1CDE12C9332&amp;gwt=pay&amp;assetType=opinion\">5</a> confirms what I was feeling: Relaxing can make you more\nproductive<a href=\"http://www.vox.com/2014/7/22/5912369/creativity-vacation-work-office\">6</a>.</p>\n</blockquote>\n<p>I could continue, but you get the gist.</p>\n<p>With self-imposed deadlines, I find that I am more creative in my\nproblem-solving and often find better solutions than if I was working on\nproblems without a time-sensitive goal attached. I believe the same thing would\nbe applied to a shorter work day. A six-hour work day would also discourage\nlong meetings without focus (well, long meetings <em>period</em>). I don't see big\nAmerican companies making these quote drastic changes but startups? Hell yeah,\ndefinitely. Instead of focusing on \"perks\" like beer on tap, foosball tables,\nand game systems, &amp;c, why not focus on improving the lives of your employees\nso they can make dope shit?</p>\n<p>Happy employees will reward you with their absolute best work. Simple. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"b0b90ccdd09d65e5c0356a507b50a97af07d1190409dd035dfd6571105d199ff","category":"Sites"}