{"title":"Don’t Die of Heart Disease, Part II","link":"https://www.usv.com/writing/2024/11/dont-die-of-heart-disease-part-ii-2/","date":1732707292000,"content":"<p>In 2023 I took a 12-month hiatus to recharge after building startups nonstop since graduating college. During that period of time, I had a rule that I would only commit to something if its gravitational force was completely inescapable. The opportunity to join USV was that thing for me, but along the way I explored a variety of different startup ideas.</p>\n<p>One of those ideas was around helping people not die of heart disease. I published some of my early learnings on this blog last October, and it was one of the most-read articles I’ve written. I came very close to incorporating a company and creating a service that would help people understand their risk factors and get screened for heart disease, and then create personalized plans for them so they wouldn’t succumb to the world’s leading cause of death.</p>\n<p>Every time I told someone about the idea and what I had learned, they soaked it all up. But when I asked if they ever got the tests I recommended, they usually didn’t. So I wrote up a very long treatise on how to avoid dying of heart disease , and I was going to post it on a domain I bought, myticker.com , but I never got around to it because I had moved on from pursuing the idea. But I put a lot of work into the document that synthesized a lot of my learnings and experience. Over the past year, it has made its way around my circle of friends, and I finally decided I’d try to make it legible and publish it for anyone interested. You can read it here .</p>\n<p>I still think this is a problem that needs to be solved and that someone should build a company that is consumer-first and exclusively focused on helping people not die of heart disease. If you’re interested in doing this, please reach out to me (jared@usv.com ) because I’d love to help you and share all the work I did. Someone needs to put the myticker.com domain name to work.</p>\n<p>I also want to thank a lot of people who helped me along my heart health journey: Harvey Hecht, James Min, Thomas Dayspring, Arthur Agatstan, Andrea Klemes, Louis Malinow, Jeffrey Wessler, Neil Parikh, Steve Martocci, Alan Tisch, David Kopp and Carrie Weprin.</p>\n<p>If you have a heart, I hope you find this helpful. And if you care about someone else’s heart, I hope you share it with them this Holiday season.</p>\n<p>Happy Thanksgiving, and don’t die of heart disease!</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/dont-die-of-heart-disease-part-ii-2/\">Don’t Die of Heart Disease, Part II</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"b0d2f2f550641d7c7fa4a1d31e2a2cc072dc39d80859deae3f49ccad873e1cbb","category":"Sites"}