{"title":"Fixed mindset vs Growth mindset","link":"https://sive.rs/mindset","date":1411257600000,"content":"<p>\nOne of the most important concepts I’ve learned is the difference between the “fixed” mindset and the “growth” mindset.\n</p><p>\nIt’s a little bit like “nature vs nurture”:\n</p><p>\nPeople in a <strong>fixed</strong> mindset believe you either are or aren’t good at something, based on your inherent nature, because it’s just who you are.\n</p><p>\nPeople in a <strong>growth</strong> mindset believe anyone can be good at anything, because your abilities are entirely due to your actions.\n</p><p>\nThis sounds simple, but it’s surprisingly deep.\n<strong>The fixed mindset is the most common and the most harmful</strong>, so it’s worth understanding and considering how it’s affecting you.\n</p><p>\nFor example:\n</p><p>\nIn a fixed mindset, you believe “She’s a natural born singer” or “I’m just no good at dancing.”\n</p><p>\nIn a growth mindset, you believe “Anyone can be good at anything. Skill comes only from practice.”\n</p><p>\n<strong>\nThe fixed mindset believes trouble is devastating.\n</strong>\nIf you believe, “You’re either naturally great or will never be great,” then when you have any trouble, your mind thinks, “See? You’ll never be great at this. Give up now.”\n</p><p>\nThe growth mindset believes trouble is just important feedback in the learning process.\n</p><p>\nCan you see how this subtle difference in mindset can change everything?\n</p>\n<p><strong>\nMore examples:\n</strong></p>\n<p>\nIn a <strong>fixed</strong> mindset, you want to hide your flaws so you’re not judged or labeled a failure.\n</p><p>\nIn a <strong>growth</strong> mindset, your flaws are just a TO-DO list of things to improve.\n</p><p>\nIn a <strong>fixed</strong> mindset, you stick with what you know to keep up your confidence.\n</p><p>\nIn a <strong>growth</strong> mindset, you keep up your confidence by always pushing into the unfamiliar, to make sure you’re always learning.\n</p><p>\nIn a <strong>fixed</strong> mindset, you look inside yourself to find your true passion and purpose, as if this is a hidden inherent thing.\n</p><p>\nIn a <strong>growth</strong> mindset, you commit to mastering valuable skills regardless of mood, knowing passion and purpose come from doing great work, which comes from expertise and experience.\n</p><p>\nIn a <strong>fixed</strong> mindset, failures define you.\n</p><p>\nIn a <strong>growth</strong> mindset, failures are temporary setbacks.\n</p><p>\nIn a <strong>fixed</strong> mindset, you believe if you’re romantically compatible with someone, you should share all of each other’s views, and everything should just come naturally.\n</p><p>\nIn a <strong>growth</strong> mindset, you believe a lasting relationship comes from effort and working through inevitable differences.\n</p><p>\nIn a <strong>fixed</strong> mindset, it’s all about the outcome. If you fail, you think all effort was wasted.\n</p><p>\nIn a <strong>growth</strong> mindset, it’s all about the process, so the outcome hardly matters.\n</p>\n<hr />\n<p>\nAnd yes, the mindset itself is not fixed.\nYou can change your mindset just by thinking it through.\n</p><p>\nI’ve talked about this in <a href=\"https://sive.rs/ml\">my “Meaning of Life” talk</a>, and <a href=\"https://sive.rs/failure\">my “Why You Need to Fail” talk</a>, if you’re interested in checking those out, too.\n</p><p>\nBut I get no credit for these insights.\nThis is all from <a href=\"https://sive.rs/book/Mindset\">Carol Dweck’s book, “Mindset”</a>, and <a href=\"https://sive.rs/book/ArtOfLearning\">Josh Waitzkin’s book, “The Art of Learning”</a>, both of which I highly recommend.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b0deb445948f07914a7e53e5762e54584770e32a31b2b4fc43cd5f1a206f7b20","category":"default"}