{"title":"Here’s how to live: Prepare for the worst.","link":"https://sive.rs/htl18","date":1639785600000,"content":"<p>\nThings are going to get harder.\n<br />\nThe future will test your strength.\n</p><p>\nSo far, you’ve lived in a time of prosperity.\n<br />\nYou haven’t experienced massive devastation, but you probably will.\n<br />\nIt’ll be harder to make money.\n<br />\nIt’ll be harder to be happy.\n<br />\nMuch of what you love now will be gone.\n<br />\nYou’ll look back at this year as one of the easiest you ever had.\n</p><p>\nYou’ll get injured or sick, losing some of your ability to see, hear, move, or think.\n<br />\nYou’ll wish for the health you have now.\n</p><p>\nHow can you thrive in an unknowable future?\n<br />\nPrepare for the worst.\n<br />\nTrain your mind to be ready for whatever may come.\n<br />\nThis is how to live.\n</p><p>\nThe future is unpredictable and uncontrollable.\n<br />\nPicture all the things that could go wrong.\n<br />\nPrepare for each, so they won’t surprise or hurt you.\n</p><p>\nNever worry.\n<br />\nThis isn’t emotional.\n<br />\nJust anticipate and prepare.\n</p><p>\nRemember the fable of the ant and the grasshopper?\n<br />\nThe grasshopper was just enjoying the summer, teasing the ant for working instead of relaxing.\n<br />\nThen winter came, and the grasshopper starved, but the ant was ready.\n</p><p>\nDisasters come suddenly, without warning.\n<br />\nTragedy hurts the most when it’s unexpected.\n<br />\nBut if you expect it, you take away its power.\n</p><p>\nDo you know what’s behind each mountain of a challenge?\n<br />\nMore mountains.\n</p><p>\nExpecting life to be wonderful is disappointing.\n<br />\nExpecting life to be disappointing is wonderful.\n<br />\nIf you expect to be disappointed, you won’t be.\n</p><p>\nVividly imagine the worst scenarios until they feel real.\n<br />\nAccepting them is the ultimate happiness and security.\n<br />\nRealize that the worst is not that bad.\n</p><p>\nPeople talk about pessimism and optimism by saying, “Glass half-empty or glass half-full?”\n<br />\nBut a caveman would say, “Oh my god! A glass! What a great invention! I can see what I’m about to drink! This is amazing! A blanket! A chair! A bed! Food, ready and waiting? This is heaven!”\n<br />\nYou don’t have to be a caveman to look around you and appreciate your comforts by imagining life without them.\n<br />\nThen imagine the relief of finding shelter, the joy of controlled fire on command, and the satisfaction of hot water.\n</p><p>\nTo appreciate something fully, picture losing it.\n<br />\nImagine losing your freedom, reputation, money, and home.\n<br />\nImagine losing your ability to see, hear, walk, or talk.\n<br />\nImagine the people you love dying tomorrow.\n<br />\nNever take them for granted.\n</p><p>\nLuxury is the enemy of happiness because you adapt to its comforts.\n<br />\nLuxury makes you soft, weak, and harder to satisfy.\n<br />\n(Pity people who can’t enjoy anything less than the best.)\n<br />\nNever accept luxury, or you’ll find it hard to do without because it will feel like loss.\n</p><p>\nComfort reduces your future happiness.\n<br />\nYou get upset that your meal doesn’t come as ordered, or angry at your phone for having an imperfect connection.\n<br />\nYou lose appreciation.\n<br />\nYou forget the perspective of how bad things could be.\n</p><p>\nPractice being uncomfortable, even in small ways.\n<br />\nTake the stairs instead of the elevator.\n<br />\nSkip eating for a day, or sugar for a month.\n<br />\nGo light-weight camping for a week.\n<br />\nBefriend discomfort so that you’ll never fear it.\n</p><p>\nYour biggest enemy is insatiability.\n<br />\nRecognize your desire to be entertained by life, and break the habit.\n<br />\nPractice being happy with what you have.\n</p><p>\nOwn as little as possible.\n<br />\nWhen you realize you’re dependent on something, get rid of it to prove you don’t need it.\n<br />\nThe less you have, the less you have to lose.\n</p><p>\nWant nothing, and nothing will disappoint you.\n<br />\nWant nothing, and nothing is outside your control.\n<br />\nWant nothing, and fate can’t hurt you.\n</p><p>\nDistinguish between what’s in your control and what isn’t.\n<br />\nIf it’s not in your control, put it out of your head.\n<br />\nTrying to control outcomes makes you disappointed and resentful.\n<br />\nFocus only on your thoughts and actions.\n</p><p>\nYour circumstances in life don’t actually change your happiness.\n<br />\nPeople who become paralyzed or win the lottery go back to being as happy as they were before.\n<br />\nSo don’t depend on circumstances.\n<br />\nEverything that happens is neutral.\n<br />\nYour beliefs label it as good or bad.\n<br />\nThe only way to change your happiness is to change your beliefs.\n</p><p>\nDid someone make you angry?\n<br />\nDid a situation make you sad?\n<br />\nNo.\n<br />\nIt’s all you.\n<br />\nNothing is good or bad.\n<br />\nYou just reacted as if it was.\n<br />\nWhen something bad happens, ask, “What’s great about this?”\n<br />\nInstead of changing the world, just change your reactions.\n</p><p>\nWhen something happens, don’t interpret.\n<br />\nNo story, no “should have”, no judgment, not even an opinion.\n<br />\nThis is seeing clearly.\n</p><p>\nYour goal is grateful indifference.\n<br />\nWin the lottery?\n<br />\nGo to jail?\n<br />\nGet famous?\n<br />\nGo blind in an accident?\n<br />\nIt doesn’t matter because you’re fine either way.\n<br />\nDetach from the outcome and be OK no matter what happens.\n</p>\n<hr />\n<p>\nMy neighbor has a dog that attacks strangers and has even bitten a child.\n<br />\nWhen people complain, my neighbor says he can’t help it.\n<br />\n“Dogs will be dogs.”\n<br />\nWrong!\n<br />\nDogs can be tamed.\n<br />\nHe just never trained his dog.\n<br />\nInstead he acts like the situation is hopeless, and makes it everyone else’s problem.\n</p><p>\nThis is how most people are about their emotions.\n<br />\nThey say, “I can’t help the way I feel.”\n<br />\nWrong!\n<br />\nEmotions can be tamed.\n<br />\nYou are in control.\n<br />\nThe problem comes from going easy on yourself.\n<br />\nInstead, train your emotions like you would a dog.\n</p>\n<hr />\n<p>\nShallow happy is having a donut.\n<br />\nDeep happy is having a fit body.\n</p><p>\nShallow happy is what you want now.\n<br />\nDeep happy is what you want most.\n</p><p>\nShallow happy serves the present.\n<br />\nDeep happy serves the future.\n</p><p>\nShallow happy is trying to conquer the world.\n<br />\nDeep happy is conquering yourself.\n</p><p>\nShallow happy is pursuing pleasure.\n<br />\nDeep happy is pursuing fulfillment.\n</p><p>\nFulfillment is more fun than fun.\n</p><p>\nVisit your favorite places.\n<br />\nListen to your favorite music.\n<br />\nTaste your favorite food.\n<br />\nTouch your favorite people.\n<br />\nThis might be the last time you do all these things, so appreciate each moment fully.\n</p><p>\nAll of this appreciation is practice for death.\n<br />\nWhen death comes, you’ll treat it with the same indifference as everything else.\n<br />\nYou’ve been preparing for it all along.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b0e56c4b7581ea8b4368c47ab860afb09a8578eda1bd092fd94f699af50fcdd8","category":"default"}