{"title":"Erik Erikson’s Stages of Human Development: The 8 Basic Conflicts That Shape Who We Are","link":"https://www.themarginalian.org/2024/09/25/erikson-stages-of-development/","date":1727309424000,"content":"<p><a href=\"https://www.amazon.com/Childhood-Society-Erik-H-Erikson/dp/039331068X/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"479\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?fit=320%2C479&amp;ssl=1\" alt=\"Erik Erikson’s Stages of Human Development: The 8 Basic Conflicts That Shape Who We Are\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?w=802&amp;ssl=1 802w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?resize=320%2C479&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?resize=600%2C898&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?resize=240%2C359&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/erikson_childhoodsociety.jpg?resize=768%2C1149&amp;ssl=1 768w\" /></a></p><p>It never ceases to stagger that some stroke of chance in the early history of the universe set into motion the Rube Goldberg machine of events that <a href=\"https://www.themarginalian.org/2024/09/19/ruth-stone-strings-david-byrne/\">turned atoms born in the first stars into you</a> — into this temporary clump of borrowed stardust that, for the brief interlude between not having existed and no longer existing, gets to have ideas and ice cream and orgasms, gets to yearn and to suffer and to love. </p>\n<p>Perhaps the most hopeful thing about being alive is that we are never finished and complete. Perhaps the most exasperating is that we are never entirely new, that we are nested with every self we have ever been, each stage of our development shaped by the singular needs and tensions of each preceding stage, our character shaped by how those needs and tensions were met and resolved. </p>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/OfraAmit_5DarkMatter.jpg\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a></figcaption></figure>\n<p>The influential psychoanalyst <strong>Erik Erikson</strong> (June 15, 1902–May 12, 1994), who coined the term <em>identity crisis</em> and readily recognized that “an individual life is the accidental coincidence of but one life cycle with but one segment of history,” took up this tessellated question of our incremental becoming in his 1950 book <a href=\"https://www.amazon.com/Childhood-Society-Erik-H-Erikson/dp/039331068X/?tag=braipick-20\" target=\"_blank\"><strong><em>Childhood and Society</em></strong></a> (<a href=\"https://search.worldcat.org/title/28148086\" target=\"_blank\"><em>public library</em></a>) — an investigation of “the growth and the crises of the human person as a series of alternative basic attitudes.” </p>\n<p>Erikson identifies eight sequential stages of human development, each marked by a particular battery of opposite psychic charges — one a positive developmental achievement that strengthens one’s self-trust, world-trust, and creative potency, the other a danger that fosters antagonism, isolation, and despair. He writes:</p>\n<blockquote><p>The strength acquired at any stage is tested by the necessity to transcend it in such a way that the individual can take chances in the next stage with what was most vulnerably precious in the previous one.</p>\n<p>[…]</p>\n<p>There is in every child at every stage a new miracle of vigorous unfolding, which constitutes a new hope and a new responsibility for all.</p>\n<p>[…]</p>\n<p>In view of the dangerous potentials of <a href=\"https://www.themarginalian.org/2014/10/17/ursula-k-le-guin-gender/\">man’s</a> long childhood, it is well to look back at the blueprint of the life-stages and to the possibilities of guiding the young of the race while they are young.</p></blockquote>\n<h5>1. BASIC TRUST VS. BASIC MISTRUST (0-18 MONTHS)</h5>\n<figure><a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/atthedropofacat6.jpg\" /></a><figcaption>Art by Violeta Lópiz for <a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><em>At the Drop of a Cat</em></a></figcaption></figure>\n<p>The first intense experience of life is separation — infant and mother are no longer one, and the infant must learn to trust that the mother is still there even when she vanishes from view. Erikson writes:</p>\n<blockquote><p>The infant’s first social achievement, then, is his willingness to let the mother out of sight without undue anxiety or rage, because she has become an inner certainty as well as an outer predictability. Such consistency, continuity, and sameness of experience provide a rudimentary sense of ego identity.</p>\n<p>[…]</p>\n<p>This forms the basis in the child for a sense of identity which will later combine a sense of being “all right,” of being oneself.</p></blockquote>\n<p>This kind of trust is the foundation of confidence, for it is also training ground for the self-trust necessary to withstand separation, to have faith in one’s inherent okayness. The absence of such maternal consistency and continuity, Erikson observes, may be one of the most difficult cards to be dealt in life, predisposing people to habitual “depressive states” in later stages. </p>\n<p>This is also the stage in which we learn <a href=\"https://www.themarginalian.org/figuring/\">to discern where we end and the rest of the world begins</a> — the vital distinction that enables us to differentiate between the rewards of interdependence and the dangers of codependence, to navigate the myriad traps that strew the meeting ground between self and other. Erikson writes:</p>\n<blockquote><p>The early process of differentiation between inside and outside [is] the origin of projection and introjection which remain some of our deepest and most dangerous defense mechanisms. In introjection we feel and act as if an outer goodness had become an inner certainty. In projection, we experience an inner harm as an outer one: we endow significant people with the evil which actually is in us… These mechanisms are, more or less normally, reinstated in acute crises of love, trust, and faith in adulthood and can characterize irrational attitudes toward adversaries and enemies in masses of “mature” individuals.</p></blockquote>\n<h5>2. AUTONOMY VS. SHAME AND DOUBT (18 MONTHS-3 YEARS)</h5>\n<figure><a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/12/beforeigrewup1.jpg\" /></a><figcaption>Art by Giuliano Cucco from <a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><em>Before I Grew Up</em></a></figcaption></figure>\n<p>The hallmark of the second stage is a physiological development that becomes an analogue for one of the most important psychological skills in life — to hold on and to let go, central to such fundamental capacities as intimacy, compassion, tenacity, and forgiveness. Erikson writes:</p>\n<blockquote><p>Muscular maturation sets the stage for experimentation with two simultaneous sets of social modalities: holding on and letting go. As is the case with all of these modalities, their basic conflicts can lead in the end to either hostile or benign expectations and attitudes. Thus, to hold can become a destructive and cruel retaining or restraining, and it can become a pattern of care: to have and to hold. To let go, too, can turn into an inimical letting loose of destructive forces, or it can become a relaxed “to let pass” and “to let be.”</p></blockquote>\n<p>This is the stage at which the experience of shame first emerges and we must learn to have our “basic faith in existence” not jeopardized by the embarrassments of getting things wrong. (“Shame is an experience that affects and is affected by the whole self,” the pioneering sociologist and philosopher Helen Merrell Lynd would write a few years later in her insightful take on <a href=\"https://www.themarginalian.org/2024/04/17/shame-lynd/\">shame and the search for identity</a>.) For the infant at this stage, Erikson observes, shame springs from the emergence of a new developmental phenomenon: the “sudden violent wish to have a choice, to appropriate demandingly, and to eliminate stubbornly.” He writes:</p>\n<blockquote><p>Shame supposes that one is completely exposed and conscious of being looked at: in one word, self-conscious. One is visible and not ready to be visible… Shame is… essentially rage turned against the self.</p></blockquote>\n<p>With an eye to the development of these crucial capacities for holding on, letting go, and withstanding shame, he adds:</p>\n<blockquote><p>This stage, therefore, becomes decisive for the ratio of love and hate, cooperation and willfulness, freedom of self-expression and its suppression, From a sense of self-control without loss of self-esteem comes a lasting sense of good will and pride; from a sense of loss of self-control and of foreign overcontrol comes a lasting propensity for doubt and shame.</p></blockquote>\n<h5>3. INITIATIVE VS. GUILT (AGES 3-5)</h5>\n<figure><a href=\"https://www.themarginalian.org/2016/01/08/kennys-window-maurice-sendak/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2016/01/mauricesendak_kennyswindow1.jpg\" /></a><figcaption>Illustration by Maurice Sendak from <a href=\"https://www.themarginalian.org/2016/01/08/kennys-window-maurice-sendak/\"><em>Kenny’s Window</em></a> — his little-known philosophical first children’s book.</figcaption></figure>\n<p>As we begin to take initiative in completing tasks, we develop what Erikson calls “anticipatory rivalry” — which may be another word for envy — toward those who complete the same tasks better. Here, we learn that what the world asks of us often requires the repression and inhibition of our own hopes and desires. </p>\n<p>The danger of this, if we successfully cede desire to demand, is a sense of self-righteousness — “often the principal reward of goodness,” Erikson astutely observes a decade before Joan Didion admonished against <a href=\"https://www.themarginalian.org/2016/12/05/joan-didion-on-morality/\">mistaking self-righteousness for morality</a>, a tendency painfully pronounced in our own time of virtue signaling. </p>\n<h5>4. INDUSTRY VS. INFERIORITY (AGES 6-11)</h5>\n<figure><a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/12/beforeigrewup2-scaled.jpg\" /></a><figcaption>Art by Giuliano Cucco from <a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><em>Before I Grew Up</em></a></figcaption></figure>\n<p>This is the stage at which our natural creativity and capacity for play begin being sublimated to our civilizational cult of productivity. School starts, forcing the child to part with earlier hopes and wishes as their “exuberant imagination is tamed and harnessed… to be a worker.” </p>\n<p>The danger in this overidentification with accomplishment, building upon the earlier development of envy, is “a sense of inadequacy and inferiority,” which may lead the child to believe themselves “doomed to mediocrity or inadequacy.” (This, of course, is the perennial danger of all self-comparison, acute even for adults in today’s broadcast selfhood of social media.)</p>\n<h5>5. IDENTITY VS. ROLE CONFUSION (AGES 12-18)</h5>\n<figure><a href=\"https://society6.com/product/a-velocity-of-being-mouni-feddag_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?resize=680%2C944&amp;ssl=1\" width=\"680\" height=\"944\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?resize=240%2C333&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?resize=320%2C444&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?resize=768%2C1066&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/12/MouniFeddag.jpg?resize=600%2C833&amp;ssl=1 600w\" /></a><figcaption>Art by Mouni Feddag for a letter by Alain de Botton from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>. (Available as a <a href=\"https://society6.com/product/a-velocity-of-being-mouni-feddag_print?curator=brainpicker\" target=\"_blank\">print</a>.)</figcaption></figure>\n<p>Here begins our concern with what we appear to be to others versus what we feel we are — an integration that marks the emergence of our ego identity. Erikson considers the many guises in which the great danger of this stage — role confusion — can appear:</p>\n<blockquote><p>To keep themselves together [adolescents] temporarily overidentify, to the point of apparent complete loss of identity, with the heroes of cliques and crowds. This initiates the stage of “falling in love,” which is by no means entirely, or even primarily, a sexual matter — except where the mores demand it. To a considerable extent adolescent love is an attempt to arrive at a definition of one’s identity by projecting one’s diffused ego image on another and by seeing it thus reflected and gradually clarified. This is why so much of young love is conversation.</p></blockquote>\n<p>In a passage of far-reaching insight and extraordinary empathy for the vulnerabilities of the psyche, which most people would rather fault than fathom, he adds:</p>\n<blockquote><p>Young people can also be remarkably clannish, and cruel in their exclusion of all those who are “different,” in skin color or cultural background, in tastes and gifts, and often in such petty aspects of dress and gesture as have been temporarily selected as the signs of an in-grouper or out-grouper. It is important to understand (which does not mean condone or participate in) such intolerance as a defense against a sense of identity confusion. For adolescents not only help one another temporarily through much discomfort by forming cliques and by stereotyping themselves, their ideals, and their enemies; they also perversely test each other’s capacity to pledge fidelity. The readiness for such testing also explains the appeal which simple and cruel totalitarian doctrines have on the minds of the youth.</p></blockquote>\n<h5>6. INTIMACY VS. ISOLATION (AGES 18-40)</h5>\n<figure><a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=680%2C811&amp;ssl=1\" width=\"680\" height=\"811\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?w=1161&amp;ssl=1 1161w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=320%2C382&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=600%2C716&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=240%2C286&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto_FallinginLove.jpg?resize=768%2C916&amp;ssl=1 768w\" /></a><figcaption>Art by Sophie Blackall from <a href=\"https://www.themarginalian.org/2022/05/12/sophie-blackall-things-to-look-forward-to/\"><em>Things to Look Forward to</em></a></figcaption></figure>\n<p>This is the stage at which emotional integrity develops — we learn the particular form of self-trust and self-respect that come from making commitments and keeping them, even when it is difficult to do so. The self-permission to break promises and cancel plans stems from a failure at the developmental achievement of this stage and the price we pay for it, quite apart from disappointing and hurting others, is always an erosion of self-trust and self-respect. Erikson writes:</p>\n<blockquote><p>The young adult, emerging from the search for and the insistence on identity… is ready for intimacy, that is, the capacity to commit himself to concrete affiliations and partnerships and to develop the ethical strength to abide by such commitments, even though they may call for significant sacrifices and compromises.</p></blockquote>\n<p>Observing that this is when we first face the “fear of ego loss” in situations that may require compromise and sacrifice, he adds:</p>\n<blockquote><p>The avoidance of such experiences because of a fear of ego loss may lead to a deep sense of isolation and consequent self-absorption.</p></blockquote>\n<p>The great challenge of this stage is that “intimate, competitive, and combative relations are experienced with and against the selfsame people.” It is necessary to learn to tolerate and resolve such tensions, or otherwise we face the great danger of this stage — isolation, which Erikson defines as “the avoidance of contacts which commit to intimacy.”</p>\n<h5>7. GENERATIVITY VS. STAGNATION (AGES 40-65)</h5>\n<figure><a href=\"https://www.themarginalian.org/2022/01/16/what-is-love-carson-ellis-mac-barnett/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/whatislove_ellis_barnett15.jpg\" /></a><figcaption>Art by Carson Ellis from <a href=\"https://www.themarginalian.org/2022/01/16/what-is-love-carson-ellis-mac-barnett/\"><em>What Is Love?</em></a> by Mac Barnett</figcaption></figure>\n<p>Erikson counters our culture’s hyperfocus on children’s dependence on parents with the insistence that the older generation is also dependent on the younger, for elders “need to be needed.” (A generation before him, Jane Ellen Harrison addressed this with great geniality and great percipience in her meditation on <a href=\"https://www.themarginalian.org/2022/09/10/jane-ellen-harrison-crabbed-age-and-youth-alpha-and-omega/\">Old Age and Youth</a>.) </p>\n<p>Erikson terms the animating achievement of this life-stage <em>generativity</em>, which he defines as “the concern in establishing and guiding the next generation,” noting that it is “meant to include such more popular synonyms as productivity and creativity, which, however, cannot replace it.” </p>\n<p>Whether generativity manifests as physically producing the next generation through procreation or contributing to the world through acts of creation, a failure to attain it results in “a pervading sense of stagnation and personal impoverishment.”</p>\n<h5>8. EGO INTEGRITY VS. DESPAIR (AGE 65-DEATH)</h5>\n<figure><a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-15738132073_framed-print?curator=brainpicker\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=680%2C1039&amp;ssl=1\" width=\"680\" height=\"1039\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=320%2C489&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=600%2C917&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=240%2C367&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=768%2C1174&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda19.jpg?resize=1005%2C1536&amp;ssl=1 1005w\" /></a><figcaption>Art by the 16th-century Portuguese artist <a href=\"https://www.themarginalian.org/2023/03/08/francisco-de-holanda/\">Francisco de Holanda</a>. (Available as <a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-15738132073_framed-print?curator=brainpicker\">a print</a> and as <a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-15738132073_cards?curator=brainpicker\">stationery cards</a>.)</figcaption></figure>\n<p>“One’s life has value so long as one attributes value to the life of others, by means of love, friendship, indignation, compassion,” Simone de Beauvoir wrote in her sixties as she reflected on <a href=\"https://www.themarginalian.org/2022/07/31/simone-de-beauvoir-coming-of-age/\">the art of growing older</a>. That we must die is precisely what impels us to render our lives valuable. We can only do so, Erikson argues, by moving through the prior seven stages toward this final fruition of what he calls <em>ego integrity</em> — “the ego’s accrued assurance of its proclivity for order and meaning,” built of our adaptation “to the triumphs and disappointments adherent to being.” </p>\n<p>In a passage evocative of Loren Eiseley’s exquisite late-life meditation on <a href=\"https://www.themarginalian.org/2024/08/11/loren-eiseley-love/\">the first and final truth of life</a>, Erikson writes:</p>\n<blockquote><p>[Ego integrity] is a post-narcissistic love of the human ego—not of the self — as an experience which conveys some world order and spiritual sense, no matter how dearly paid for. It is the acceptance of one’s one and only life cycle as something that had to be and that, by necessity, permitted of no substitutions.</p></blockquote>\n<p>One consequence of this acceptance is “a new, a different love of one’s parents.” Another is that “death loses its sting,” for the fear of death stems from the lack of a sense of cohesion and consonance with universal life — a lack that takes shape as despair. (This may be why D.H. Lawrence called death <a href=\"https://www.themarginalian.org/2023/05/09/d-h-lawrence-death/\">“the last wonder”</a> and wrote: “If you want to live in peace on the face of the earth / Then build your ship of death, in readiness / For the longest journey.”)</p>\n<p>Erikson ends with one of the most potent formulae in the science of the psyche:</p>\n<blockquote><p>Healthy children will not fear life if their elders have integrity enough not to fear death.</p></blockquote>\n<p>Couple with Erikson’s contemporary Ernest Becker on <a href=\"https://www.themarginalian.org/2023/04/25/ernest-becker-heroism/\">the relationship between our fear of death and our search for meaning</a>, then revisit this <a href=\"https://www.themarginalian.org/2024/03/03/the-middle-passage-john-hollis/\">Jungian field guide to navigating the particularly treacherous middle stages of life</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"b17a8fc1213a4a47ae78f0e70f3a8e6b09031c37f194018ebbd366c646afdb35","category":"Sites"}