{"title":"Draft: Data Privacy Legislation  – Deep Dive","link":"https://ghuneim.com/2024/04/08/draft-data-privacy-legislation-deep-dive/","date":1712577492000,"content":"<p>House Committee on Energy and Commerce Chair Cathy McMorris Rodgers (R-WA) and Senate Committee on Commerce, Science, and Transportation Chair Maria Cantwell (D-WA) unveiled the American Privacy Rights Act.</p>\n<p><strong>Here is a full breakdown with first a top-level framing and then actual language for a deeper look.</strong></p>\n<p>Elated to see bipartisan legislation starting to find inertia but cautious as always knowing the devil is in the details or data if you will…  these were my red flags after my first reading :</p>\n<blockquote>\n<ul>\n<li><strong>We need to ensure that there are not narrowly defined terms for personal and sensitive data</strong>, which may exclude certain data types from protection.</li>\n<li><strong>The mechanisms for obtaining consent</strong>, particularly around “affirmative express consent,” may leave room for interpretation, providing maneuvering room, not ideal.</li>\n<li><strong>Exemptions for small businesses or specific data processing activities</strong>, if too broad or vaguely defined, can serve as unintended backdoors for lesser privacy protections. Carve a proper lane between need and burden here.</li>\n<li><strong>The act’s stipulations on data minimization, retention, and the responsibilities of third parties and service providers are crucial</strong>; loopholes in these areas could lead to more extensive data collection, retention, and sharing practices than intended.</li>\n<li><strong>The requirements for entities to implement technical and organizational security measures</strong> need to be explicit and stringent to avoid varied interpretations that could weaken data security practices.</li>\n<li><strong>International data transfer provisions</strong> need to set clear and high standards to prevent data protection from being undercut by transfers to jurisdictions with lesser privacy safeguards.</li>\n<li><strong>Make sure the rights of individuals to sue or if prohibitions on arbitration clauses are strong</strong>, ensuring individuals’ avenues for redress and enforcement of their privacy rights.</li>\n</ul>\n<p> </p>\n<h1><strong><br />\nThe Act Establishes Foundational Uniform National Data Privacy Rights for Americans:</strong></h1>\n<p> </p></blockquote>\n<ul>\n<li><strong>Control of Personal Data:</strong> The Act places individuals in control of their personal data, offering rights to access, correct, delete, and export their data, as outlined in Section 5 (Individual Control Over Covered Data).<br />\n<strong><br />\nSEC. 5. INDIVIDUAL CONTROL OVER COVERED DATA.</strong></li>\n</ul>\n<p>(a) <strong>Access to, and Correction, Deletion, and Portability of, Covered Data</strong>.—Subject to subsections (b), (d), and (e), after receiving a verified request from an individual, a covered entity shall provide the individual with the right to:</p>\n<ul>\n<li><strong>Access</strong>—\n<ul>\n<li>(A) in a format that can be naturally read by a human, the covered data of the individual (or an accurate representation of the covered data of the individual if the covered data is no longer in the possession of the covered entity or a service provider acting on behalf of the covered entity) that is collected, processed, or retained by the covered entity or any service provider of the covered entity;</li>\n<li>(B) the name of any third party or service provider to whom the covered entity has transferred the covered data of the individual, as well as the categories of sources from which the covered data was collected; and</li>\n<li>(C) a description of the purpose for which the covered entity transferred the covered data of the individual to a third party or service provider.</li>\n</ul>\n</li>\n<li><strong>Correct</strong> any inaccuracy or incomplete information with respect to the covered data of the individual that is collected, processed, or retained by the covered entity and, for covered data that has been transferred, notify any third party or service provider to which the covered entity transferred such covered data of the corrected information;</li>\n<li><strong>Delete</strong> covered data of the individual that is collected, processed, or retained by the covered entity and, for covered data that has been transferred, request that the covered entity notify any third party or service provider to which the covered entity transferred such covered data of the individual’s deletion request; and</li>\n<li><strong>Export</strong> covered data (except for derived data if the export of such derived data would result in the release of trade secrets or other proprietary or confidential data) of the individual that is collected, processed, or retained by the covered entity without licensing restrictions that limit such transfers, in:\n<ul>\n<li>(A) a format that can be naturally read by a human; and</li>\n<li>(B) a portable, structured, interoperable, and machine-readable format.</li>\n</ul>\n</li>\n</ul>\n<p>(b) <strong>Frequency and Cost</strong>.—A covered entity:</p>\n<ul>\n<li>shall provide an individual with the opportunity to exercise each of the rights described in subsection (a); and</li>\n<li>with respect to:\n<ul>\n<li>(A) the first 3 times that an individual exercises any right described in subsection (a) during any 12-month period, shall allow the individual to exercise such right free of charge; and</li>\n<li>(B) any time beyond the initial 3 times described in subparagraph (A), may charge a reasonable fee for each additional request to exercise any such right during such 12-month period.</li>\n</ul>\n</li>\n</ul>\n<p><strong>National Privacy Standard:</strong> It aims to unify the patchwork of state laws by setting a robust national privacy standard, as stated in the overall structure and enforcement sections, including Sections 17 to 19 (Enforcement by the FTC, States, and Individuals).</p>\n<p><strong>SEC. 17. ENFORCEMENT BY THE FEDERAL TRADE COMMISSION.</strong></p>\n<p>(a) <strong>Unfair or Deceptive Acts or Practices</strong>.—A violation of a regulation promulgated under this Act shall be treated as a violation of a rule defining an unfair or deceptive act or practice prescribed under section 18(a)(1)(B) of the Federal Trade Commission Act (15 U.S.C. 57a(a)(1)(B)).</p>\n<p>(b) <strong>Powers of Commission</strong>.—</p>\n<ul>\n<li>The Commission shall enforce this Act in the same manner, by the same means, and with the same jurisdiction, powers, and duties as though all applicable terms and provisions of the Federal Trade Commission Act (15 U.S.C. 41 et seq.) were incorporated into and made a part of this Act.</li>\n<li>Any entity that violates a regulation promulgated under this Act shall be subject to the penalties and entitled to the privileges and immunities provided in the Federal Trade Commission Act.</li>\n</ul>\n<p><strong>SEC. 19. ENFORCEMENT BY INDIVIDUALS.</strong></p>\n<p>(a) <strong>Civil Actions</strong>.—</p>\n<ul>\n<li>Any individual who suffers material or non-material, physical or non-physical harm as a result of a violation of this Act may institute a civil action to recover damages.</li>\n<li>In actions brought under this subsection, the courts are authorized to award relief, including actual damages, statutory damages, punitive damages, injunctive relief, and reasonable attorney’s fees and costs.</li>\n</ul>\n<p><strong>Data Minimization:</strong> The legislation mandates that companies minimize the data they collect, retain, and use, focusing only on what is necessary for providing products and services, detailed in Section 3 (Data Minimization).</p>\n<p><strong>SEC. 3. DATA MINIMIZATION.</strong></p>\n<p>(a) <strong>In General</strong>.—Subject to subsections (b) and (c), a covered entity, or a service provider acting on behalf of a covered entity, shall not collect, process, retain, or transfer covered data:</p>\n<ul>\n<li>beyond what is necessary, proportionate, and limited to provide or maintain:\n<ul>\n<li>(A) a specific product or service requested by the individual to whom the data pertains, including any associated routine administrative, operational, or account-servicing activity such as billing, shipping, delivery, storage, or accounting; or</li>\n<li>(B) a communication by the covered entity to the individual reasonably anticipated within the context of the relationship; or</li>\n</ul>\n</li>\n<li>for a purpose other than those expressly permitted under subsection (d).</li>\n</ul>\n<p>(b) <strong>Sensitive Covered Data</strong>.—</p>\n<ul>\n<li><strong>In General</strong>.—Except as expressly provided under subsection (d), a covered entity, or a service provider acting on behalf of a covered entity, shall not transfer sensitive covered data to a third party without the affirmative express consent of the individual to whom such data pertains.</li>\n<li><strong>Withdrawal of Affirmative Express Consent</strong>.—\n<ul>\n<li>(A) <strong>In General</strong>.—A covered entity shall provide an individual with a means to withdraw affirmative express consent previously provided by the individual with respect to the transfer of the sensitive covered data of the individual.</li>\n<li>(B) <strong>Requirements</strong>.—The means to withdraw affirmative express consent described in subparagraph (A) shall be clear and conspicuous; and as easy for a reasonable individual to use as the mechanism by which the individual provided affirmative express consent.</li>\n</ul>\n</li>\n</ul>\n<p>(c) <strong>Additional Protections for Biometric Information and Genetic Information</strong>.—</p>\n<ul>\n<li><strong>In General</strong>.—A covered entity, or a service provider acting on behalf of a covered entity, shall not collect, process, or retain biometric information or genetic information without the affirmative express consent of the individual to whom such information pertains, unless such collection, processing, or retention is essential for a purpose expressly permitted under paragraphs (1) through (4) or paragraphs (9) through (13) of subsection (d).</li>\n<li><strong>Retention</strong>.—A covered entity, or service provider acting on behalf of a covered entity, shall not retain biometric or genetic information beyond the point for which a purpose that an individual provided affirmative express consent under paragraph (1) has been satisfied or within 3 years of the individual’s last interaction with the covered entity or service provider, whichever occurs first, unless such retention is essential for a purpose expressly permitted under paragraphs (1) through (4) or paragraphs (9) through (13) of subsection (d).</li>\n<li><strong>Transfer</strong>.—A covered entity, or service provider acting on behalf of a covered entity, shall not transfer biometric information or genetic information to a third party without the affirmative express consent of the individual to whom such information pertains, unless such transfer is essential for a purpose expressly permitted under paragraphs (2), (3), (4), (8), (9), (11), or (12) of subsection (d).</li>\n</ul>\n<p>(d) <strong>Permitted Purposes</strong>.—A covered entity, or service provider acting on behalf of a covered entity, may collect, process, retain, or transfer covered data for the following purposes, provided</p>\n<p>that the covered entity or service provider can demonstrate that the collection, processing, retention, or transferring is necessary, proportionate, and limited to such purpose: [List of permitted purposes including security, compliance with legal obligations, investigations, and others].</p>\n<p><strong>Control Over Personal Information:</strong> It provides individuals with the ability to restrict the transfer or selling of their data and to opt out of data processing upon changes in privacy policy, emphasized in Sections 6 (Opt-out Rights and Centralized Mechanism) and Section 5 (Individual Control Over Covered Data).</p>\n<p><strong>SEC. 6. OPT-OUT RIGHTS AND CENTRALIZED MECHANISM.</strong></p>\n<p>(a) <strong>In General:</strong> Covered entities must provide individuals with clear and conspicuous means to opt out of the transfer of their covered data and from the processing of their data for targeted advertising, with the ability to exercise these opt-out rights through a centralized mechanism.</p>\n<p>(b) <strong>Centralized Consent and Opt-out Mechanism:</strong> The Federal Trade Commission (FTC), in consultation with the Secretary of Commerce, is tasked with establishing a privacy-protective, centralized mechanism for individuals to exercise their opt-out rights. This mechanism should be user-friendly, require minimal additional information from the individual, and apply neutrally across entities. The design of this mechanism must ensure that opt-out preferences are clearly represented, accessible in all languages in which the covered entity provides products or services, and usable by individuals with disabilities.</p>\n<p>The centralized mechanism aims to simplify the process for individuals to manage their privacy preferences across different platforms and services by providing a single interface for expressing their opt-out decisions. This approach is intended to enhance user autonomy and control over personal data while streamlining compliance for covered entities.</p>\n<p><strong>Protections for Sensitive Data:</strong> The Act requires affirmative express consent for transferring sensitive data to third parties, as highlighted in Section 3(b) (Sensitive Covered Data).</p>\n<p><strong>SEC. 3. DATA MINIMIZATION.</strong></p>\n<p>(b) <strong>Sensitive Covered Data.</strong></p>\n<ul>\n<li><strong>In General:</strong> Except as expressly provided under subsection (d), a covered entity, or a service provider acting on behalf of a covered entity, shall not transfer sensitive covered data to a third party without the affirmative express consent of the individual to whom such data pertains.</li>\n<li><strong>Withdrawal of Affirmative Express Consent.</strong>\n<ul>\n<li>(A) <strong>In General:</strong> A covered entity shall provide an individual with a means to withdraw affirmative express consent previously provided by the individual with respect to the transfer of the sensitive covered data of the individual.</li>\n<li>(B) <strong>Requirements:</strong> The means to withdraw affirmative express consent described in subparagraph (A) shall be clear and conspicuous; and as easy for a reasonable individual to use as the mechanism by which the individual provided affirmative express consent.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Gives Americans the Ability to Enforce Their Data Privacy Rights:</strong></p>\n<ul>\n<li><strong>Right to Sue:</strong> Individuals are granted the right to initiate legal action against entities that violate their privacy rights, allowing for the recovery of damages, as specified in Section 19 (Enforcement by Individuals).</li>\n<li><strong>Arbitration Clause Prohibition:</strong> It disallows mandatory arbitration in cases of substantial privacy harm, enhancing legal recourse options for individuals, found within the broader framework of Section 19.</li>\n</ul>\n<p><strong>SEC. 19. ENFORCEMENT BY INDIVIDUALS.</strong></p>\n<p>(a) <strong>Civil Actions</strong>.</p>\n<ul>\n<li>Any individual who suffers material or non-material, physical or non-physical harm as a result of a violation of this Act may institute a civil action to recover damages.</li>\n<li>In actions brought under this subsection, the courts are authorized to award relief, including actual damages, statutory damages, punitive damages, injunctive relief, and reasonable attorney’s fees and costs.</li>\n</ul>\n<p><strong>Protects Americans’ Civil Rights:</strong></p>\n<ul>\n<li><strong>Discrimination Prohibition:</strong> The legislation prevents discriminatory practices based on personal information, securing civil rights protections, outlined in Section 13 (Civil Rights and Algorithms).</li>\n</ul>\n<p><strong>Section 13 (Civil Rights and Algorithms) of the American Privacy Rights Act of 2024</strong> (a) <strong>Civil Rights Protections</strong></p>\n<ul>\n<li><strong>General Prohibition:</strong> Discriminatory practices in handling covered data that impede equal enjoyment of goods or services based on protected characteristics are prohibited.</li>\n<li><strong>Exceptions:</strong> Certain activities, such as self-testing for discrimination prevention, diversification efforts, and targeted economic opportunity advertising for underrepresented or protected groups, are exempt from these prohibitions. (b) <strong>FTC Enforcement Assistance</strong></li>\n<li>The Federal Trade Commission (FTC) is tasked with aiding enforcement against violations of subsection (a) by transmitting relevant information to appropriate executive agencies and providing a summary report to Congress on these transmissions and their relation to federal civil rights laws. The FTC may also offer technical assistance to these agencies. (c) <strong>Covered Algorithm Impact and Evaluation</strong></li>\n<li><strong>Impact Assessment Requirements:</strong> Large data holders using algorithms with a significant risk of harm must conduct annual impact assessments. These assessments should detail the algorithm’s design, purpose, data inputs, outputs, necessity, proportionality, and steps taken to mitigate potential harms, especially those related to discrimination or adverse impacts on protected classes.</li>\n<li><strong>Algorithm Design Evaluation:</strong> Before deploying covered algorithms, covered entities or service providers must evaluate these algorithms to minimize risks of harm, focusing on design, structure, and inputs.</li>\n<li><strong>Focus and Availability:</strong> Assessments and evaluations should prioritize algorithms posing the greatest risk of harm. Summaries of these assessments may be made publicly available, with provisions to protect trade secrets.</li>\n<li><strong>Limitation on Enforcement:</strong> Information disclosed to the FTC for compliance with this section cannot be used for enforcement purposes other than those specified in this Act, with certain exceptions.</li>\n<li><strong>Guidance and Rulemaking:</strong> The FTC, in consultation with the Secretary of Commerce, will publish guidance on compliance and may establish processes for submitting impact assessments and exemptions for low-risk algorithms.</li>\n<li><strong>Study and Report:</strong> The FTC is to conduct a study reviewing submitted assessments and evaluations, reporting to Congress on best practices and methods to reduce algorithm-related harms.</li>\n</ul>\n<p><strong>Opt-Out of Algorithmic Decisions:</strong> Individuals can opt out of decisions made by algorithms in critical areas, with Section 14 (Consequential Decision Opt Out) detailing these provisions.</p>\n<p><strong>Section 14 (Consequential Decision Opt Out) of the American Privacy Rights Act of 2024</strong> stipulates that entities employing covered algorithms for making or facilitating consequential decisions must adhere to the following requirements: (a) <strong>General Provisions</strong></p>\n<ul>\n<li>Entities must notify individuals subjected to the use of a covered algorithm and provide them an opportunity to opt out of such usage.</li>\n<li>Entities are obligated to respect any opt-out decision made by an individual. (b) <strong>Notice Requirements</strong></li>\n<li>The notice provided to individuals must be:\n<ul>\n<li>Clear, conspicuous, and not misleading.</li>\n<li>Informative about how the covered algorithm facilitates consequential decisions, including the range of potential outcomes.</li>\n<li>Available in all languages in which the entity provides its products or services or conducts related activities.</li>\n<li>Accessible and usable by individuals with disabilities. (c) <strong>Guidance for Compliance</strong></li>\n</ul>\n</li>\n<li>The Federal Trade Commission (FTC), in consultation with the Secretary of Commerce, is tasked with publishing guidance on compliance with this section within two years from the enactment of the Act. (d) <strong>Definition of a Consequential Decision</strong></li>\n<li>A consequential decision is defined as any determination or offer, including through advertisements, that uses covered data and relates to:\n<ul>\n<li>An individual’s or a class of individuals’ access to or equal enjoyment of housing, employment, education enrollment or opportunity, healthcare, insurance, or credit opportunities.</li>\n<li>Access to, or restrictions on the use of, any place of public accommodation.</li>\n</ul>\n</li>\n</ul>\n<p><strong>Algorithmic Accountability:</strong> Requires annual algorithmic reviews to prevent harm or discrimination, particularly focusing on protecting youth and other vulnerable populations, as mentioned in Section 13.</p>\n<p><strong>Holds Companies Accountable and Establishes Strong Data Security Obligations:</strong></p>\n<ul>\n<li><strong>Data Security Standards:</strong> It mandates robust data security measures to prevent unauthorized access or data breaches, thus reducing identity theft risks, outlined in Section 9 (Data Security and Protection of Covered Data).</li>\n</ul>\n<p><strong>Section 9 (Data Security and Protection of Covered Data) of the American Privacy Rights Act of 2024</strong> mandates that covered entities and service providers establish, implement, and maintain reasonable data security practices. These practices are aimed at safeguarding the confidentiality, integrity, and accessibility of covered data, as well as protecting such data from unauthorized access. Here’s a breakdown of the specific requirements and considerations outlined in this section:</p>\n<p>(a) <strong>Establishment of Data Security Practices</strong></p>\n<ul>\n<li><strong>General Requirement:</strong> Covered entities and service providers are required to have data security practices in place that are suitable to their size, complexity, the nature and scope of their operations, the volume and sensitivity of the covered data they handle, and current technological capabilities. (b) <strong>Specific Requirements</strong></li>\n<li><strong>Vulnerability Assessments:</strong> Regular identification and assessment of risks and vulnerabilities within systems that handle covered data are required, including plans to address unsolicited vulnerability reports.</li>\n<li><strong>Preventative and Corrective Action:</strong> Entities must take actions to mitigate identified risks or vulnerabilities, adjusting these actions as necessary based on changes in technology or the operational landscape.</li>\n<li><strong>Information Retention and Disposal:</strong> Covered data that is no longer necessary or legally required to be kept must be disposed of in a way that makes it permanently unreadable or indecipherable.</li>\n<li><strong>Retention Schedule:</strong> A schedule for the disposal of covered data must be developed and adhered to, ensuring data is not kept longer than necessary.</li>\n<li><strong>Employee Training:</strong> Training for employees on safeguarding covered data is required, with updates as necessary to reflect new threats or best practices.</li>\n<li><strong>Incident Response:</strong> Procedures for detecting, responding to, and recovering from data security incidents must be implemented. (c) <strong>Regulations</strong></li>\n<li>The Federal Trade Commission (FTC), in consultation with the Secretary of Commerce, is authorized to promulgate additional regulations to enforce this section, ensuring that the guidelines remain technology-neutral and process-based.</li>\n<li><strong>Executive Responsibility:</strong> Company executives are required to ensure compliance with the Act’s data protection mandates, reinforcing corporate accountability, suggested within the general enforcement and compliance guidelines of the Act.</li>\n</ul>\n<p><strong>Transparency in Data Transfers:</strong> Ensures individuals are informed about data transfers to foreign adversaries, enhancing transparency, as seen in Section 4 (Transparency).</p>\n<p><strong>Section 4 (Transparency) of the American Privacy Rights Act of 2024</strong> mandates covered entities and service providers to maintain a publicly accessible privacy policy that transparently outlines their data handling practices. Here’s a summary of the key requirements and stipulations:</p>\n<p>(a) <strong>General Requirement for Privacy Policies</strong></p>\n<ul>\n<li>Covered entities and service providers must ensure their privacy policy is public, clear, not misleading, easy to read, and readily accessible, detailing their data collection, processing, retention, and transfer activities. (b) <strong>Privacy Policy Content</strong></li>\n<li>The privacy policy must include:\n<ul>\n<li>The identity and contact information of the entity and any affiliates to which data may be transferred.</li>\n<li>The types of covered data collected, processed, or retained, along with the purposes for processing each data category.</li>\n<li>Information on data transfers, including categories of recipients and the purposes of such transfers.</li>\n<li>The retention period for each data category or the criteria used to determine it.</li>\n<li>Descriptions of how individuals can exercise their rights under sections 5 and 6.</li>\n<li>A general overview of the entity’s data security practices.</li>\n<li>The effective date of the privacy policy.</li>\n<li>Disclosures regarding data transfers to or accessibility by foreign adversaries. (c) <strong>Language Requirements</strong></li>\n</ul>\n</li>\n<li>The privacy policy must be available in all languages in which the entity provides products or services or carries out related activities. (d) <strong>Accessibility</strong></li>\n<li>Disclosures must be accessible and usable by individuals with disabilities. (e) <strong>Material Changes</strong></li>\n<li>Entities must notify affected individuals of any material changes to the privacy policy, providing a clear means to opt out of new data processing or transfer practices.</li>\n<li>Direct notification of policy changes should be made where possible, in all languages the policy is available. (f) <strong>Additional Requirements for Large Data Holders</strong></li>\n<li><strong>Retention and Publication of Privacy Policies:</strong> Large data holders must retain and publish past versions of their privacy policy for at least 10 years, along with a log of material changes.</li>\n<li><strong>Short-form Notice:</strong> A concise, clear notice summarizing data practices must be provided, with guidance and templates to be issued by the FTC.</li>\n</ul>\n<p><strong>Focuses on the Business of Data, Not Mainstreet Business:</strong></p>\n<ul>\n<li><strong>Exemptions for Small Businesses:</strong> Small businesses not engaged in selling customers’ personal information are exempt, minimizing the regulatory burden on small-scale operations,<br />\nindicated by the definitions and exemptions laid out in the initial sections, including Section 2 (Definitions).</li>\n</ul>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"b1cf674b38c24816716469199d4127b141bb71dec8c8f2403c8ef4688ce7c0d4","category":"default"}