{"title":"The Mainstream Press Has Failed to Meet This Political Moment","link":"https://kottke.org/24/09/the-mainstream-press-has-failed-to-meet-this-political-moment","date":1725986292000,"content":"\n        <p>Rebecca Solnit writes about <a href=\"https://www.theguardian.com/commentisfree/article/2024/sep/06/trump-clinton-harris-election\">how the mainstream political press is failing the American public they claim to serve</a>.</p>\n\n<blockquote><p>These critics are responding to how the behemoths of the industry seem intent on bending the facts to fit their frameworks and agendas. In pursuit of clickbait content centered on conflicts and personalities, they follow each other into informational stampedes and confirmation bubbles.</p>\n\n<p>They pursue the appearance of fairness and balance by treating the true and the false, the normal and the outrageous, as equally valid and by normalizing Republicans, especially Donald Trump, whose gibberish gets translated into English and whose past crimes and present-day lies and threats get glossed over. They neglect, again and again, important stories with real consequences. This is not entirely new — in a scathing analysis of 2016 election coverage, the Columbia Journalism Review noted that “in just six days, The New York Times ran as many cover stories about Hillary Clinton’s emails as they did about all policy issues combined in the 69 days leading up to the election” — but it’s gotten worse, and a lot of insiders have gotten sick of it.</p></blockquote>\n\n<p>It’s really disheartening and maddening to witness how the press has failed to meet this important moment in history.</p>\n\n<p>See also <a href=\"https://www.nytimes.com/2024/09/10/opinion/trump-speech-debate-rally.html?unlocked_article_code=1.Jk4.hcHg.1xAmU71CsafM\">Jamelle Bouie’s NY Times piece</a> this morning, straining against the normalizing currents at his own publication to actually call out Trump’s “incoherence” and “gibberish” and parse out what he’s actually trying to tell us about his plans for a second term:</p>\n\n<blockquote><p>Trump, in his usual, deranged way, is elaborating on one of the key promises of his campaign: retribution against his political enemies. Elect Trump in November, and he will try to use the power of the federal government to threaten, harass and even arrest his opponents. If his promise to deport more than 20 million people from the United State is his policy for rooting out supposedly “foreign” enemies in the body politic, then this promise to prosecute his opponents is his corresponding plan to handle the nation’s domestic foes, as he sees them. Or, as he said last year in New Hampshire, “We pledge to you that we will root out the communists, Marxists, fascists and the radical left thugs that live like vermin within the confines of our country.”</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/Jamelle%20Bouie\">Jamelle Bouie</a> · <a href=\"https://kottke.org/tag/journalism\">journalism</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Rebecca%20Solnit\">Rebecca Solnit</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"b3939f29f3232399d63dfda427c4c605890553f04b60eeb3e0487dd4f00409f4","category":"Sites"}