{"title":"Why I don’t want stuff","link":"https://sive.rs/gifts","date":1455580800000,"content":"<p>\nAbout once a month, someone asks for my mailing address because they want to send me something.\nThey liked something I wrote, and want to send me a gift in return.\nI’m very thankful, but have to say no.\nHere’s why.\n</p><p>\nI live in a little pre-furnished apartment with no stuff, and I love it this way.\nI have no books, knicknacks, decorations, and really no personal items at all.\nJust some minimal clothing, my laptop, headphones, and not much else.\nAll the kitchenware and furniture just came with the place, and will stay here when I leave.\n</p><p>\nI just moved into this place a few weeks ago.\nI’ve moved every year or two since I was 17.\nI do it because I can, and living this way makes me happy.\n</p><p>\nEvery year, I erase my computer’s hard drive and re-install my operating system from scratch.\nEvery week, I erase my phone’s log of texts and calls.\nI just love that uncluttered feeling.\n</p><p>\nSo when I receive something in the mail, no matter how thoughtful it is, it kinda sucks because <strong>now I have to figure out how to get rid of it.</strong>\nI feel really wasteful if I just throw it in the trash, so I have to figure out who to give it to.\n</p><p>\nThen I feel bad for whoever spent a bunch of money and time to get and send me something.\n<strong>I appreciate the thought</strong>, but really a nice compliment by email is actually much more appreciated than some thing that shows up in the mail.\n</p><p>\nMy family and friends know this about me, so I haven’t received anything for Christmas or my birthday in almost 20 years.\nI’ve been living this way a long time.\nIt makes me really happy when another Christmas or birthday has passed and I didn’t receive anything.\nIt makes me feel understood.\n</p><p>\nI’m not saying anyone else should be this way.\nBack when I was a full-time musician, I had a whole recording studio full of stuff.\nBut these days, everything I want to do is on my laptop.\nIf I had a different hobby, I’d have a different situation.\nI’m in awe of my friends with a steady home and huge collections that make them happy.\n</p><p>\nIt’s not even a problem.\nI’m not complaining or bragging.\nI’m incredibly grateful that I even have to write this.\nBut because it comes up often, I thought I should explain it here.\n</p>\n<img src=\"/images/transparentchurch.jpg\" />\n<div>“<a href=\"http://www.design.spotcoolstuff.com/cool-archiecture/transparent-church-belgium\">Reading Between the Lines</a>” transparent church in Belgium. It’s worth a trip if you’re near. Photo by <a href=\"https://www.flickr.com/photos/88100135@N02/24634580891/\">Tom Davidson</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b39f22c380f4ff3113f8534835857e8b91d9e05165347dd259a1fd3bb072593e","category":"Sites"}