{"title":"the process is the way","link":"https://keningzhu.com/journal/the-process-is-the-way","date":1720783430000,"content":"  \n  \n  \n\n\n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/botanical-studies-of-internet-magic/id1731169431?i=1000662016090\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/botanical-studies-of-internet-magic/id1731169431?i=1000662016090\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>this episode is all about my guiding principle 101: my devotion to process. I’ll unpack why I believe that process is the magic key to anything you want to create— in art, business, money, and the self. in this episode, we’ll explore:</p><ul><li><p>how our product / outcome / results obsessed culture disempowers and suffocates the self</p></li><li><p>art, business, money, and the self — from the perspective of process vs. product-based thinking </p></li><li><p>how embracing your process is the shortcut to anything </p></li><li><p>process as the practice of utmost authenticity and power </p></li></ul>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/bf038129-0c72-46a0-9f51-3b3425243684/the+process+is+the+way.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr /><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening and I'll be your guide.</p><p>So I'm back after a couple of months of unintended podcast break. As much as I wanted to be consistent, I started to travel and traveling always throws me off completely and over-saturates my system. And I spent two months in China and in the US visiting family and just having too much stimulation in general, but I've returned back home now and I'm ready to begin a new series unpacking the philosophies, principles and ethos that guide my work and my vision for what's possible as creatives on the internet.</p>\n <h2>process is the magic portal</h2><p>So today I'm going to start the series by talking about a crucial ingredient, a magic key, the portal to everything that I do.</p><p>And that is my obsession with process.</p><p>I believe that process is all there is and process is the way to everything that you desire and everywhere you want to go.</p><p>And to really reframe our entire lives in terms of process is counter what this society conditions us to think.</p>\n <h2>a product obsessed culture disempowers us</h2><p>We live in a culture, this capitalist culture which is so product obsessed.</p><p>Product obsessed as in everything's all about <em>getting</em> something.</p><p>What do we get?</p><p>What is the end result?</p><p>Will this solve my problem?</p><p>Will this guarantee a sense of safety, security, success, money, will this thing work?</p><p>We see good products as products that work to solve a problem that we have.</p><p>But I think in being so embedded into this product way thinking, it's actually deeply disempowering because products are not individualized.</p><p>And when I say the word <em>product</em>, I don't just mean an item that we buy off of the shelf, I mean <em>the product way of thinking</em>, the way of thinking that sees an end result as the end all be all desired thing and sort of sweeping away the bigger picture process that is behind it.</p><p>It's an outsourcing of power because it trains us to think, \"Okay, if I can just find a magic pill, \"if I can follow this person or that person \"and do their 10 step plan to success, \"I will have the result that I'm looking for.\"</p><p>Whether that's validation or security or money or any brand of success that you're looking for.</p><p>What I wanna say is that the notion of a product or an outcome is actually more accurately described as a byproduct of process.</p><p>It's one side effect of a larger process and our culture places way too much emphasis on that one byproduct and way insufficient value on the process behind it.</p><p>And this applies to everything.</p><p>And in this episode, I'm going to start unpacking the product / results way of thinking versus the process way of thinking and share how radically transformative to think in terms of process actually can be and how it is the more energetically efficient way to guide you to all that which you desire to create in this life.</p>\n <h2>art as product</h2><p>Let's talk about the way the product oriented way of looking at art.</p><p>And clearly there's a capitalist filter and an artist's worth is defined by who acknowledges them.</p><p>Who gives them that recognition of, oh, you are a worthy artist or writer or musician.</p><p>How many listeners or followers or readers I have?</p><p>How many books they sell?</p><p>Which galleries they're featured in?</p><p>What museums?</p><p>What magazines are on the cover of?</p><p>Who gives them money?</p><p>How many followers they have on social media or YouTube or wherever?</p><p>A product way of thinking about art and artists is to define the value of an artist and their art in context of others, in context of what the society values, in context of other people buying or giving attention to them.</p><p>If the collective believes that you are a worthy artist by way of bestowing that recognition upon you, then your art is worth being seen in the world.</p><p>And I think this is incredibly disempowering.</p><p>I don't know how many people who share with me this fear and paralysis around making art and constantly being burdened by this feeling of comparison as if art is something that someone else has to give you permission to do.</p><p>Because if product thinking is about inputting A in order to get B, making art doesn't necessarily have a clear output of what B is.</p><p>Are you going to make money off of this?</p><p>Are you going to gain, become famous off of this and to be obsessed with the outcome is to suffocate the truth of the creative process and suffocate the spirit of the artist to put them in the shackles of a capitalist and a socially conditioned way of thinking about art, which is so mysterious and individual and resists these kinds of human shackles.</p>\n <h2>business as product</h2><p>And if we think about business from the lens of a product, then we think about all the ways in which it is easy to follow someone else's plan or template or process and think that that will guarantee us any kind of business success.</p><p>As if a good business, a working business is something that we can buy, whether we buy that in the form of a coach or a course.</p><p>And yes, a business is a system that works, a system that makes money, that exchanges value, but money is only one point in a circle.</p><p>Money and business are both expressions of our energy and how we share our energy with the world.</p><p>But a product or results way of thinking only cares about the balance sheet, only cares about how much money comes in without thinking how does this money feel?</p><p>How does this business system or offering feel in my body?</p>\n <h2>the self as a product</h2><p>As a result, I think it's so easy to allow ourselves the self to become a product of our culture, of our conditioning, of our family, to go through life wanting to jump through these hoops and believing that if we collect these hoops, then we will be worthy.</p><p>I know for me personally, it took me a really long time to deprogram and decondition what I thought success was and what it means.</p><p>And even to this day, I still struggle with being from a Chinese immigrant cultural upbringing of having something to prove, having something to show in order to prove my wordiness.</p><p>At the end of the day, being so results focused in my experience in making art and building a business and making money in evolving into myself, being so results focused is the thing that chokes the process and chokes the outcome.</p><p>Outcomes are something that are visible to the external eye, whereas process is so deeply internal, it's something that our society doesn't value because it is not measurable.</p><p>And I wanna propose that it is through deeply embodying process that we will have an infinite outpouring of byproducts or results or desired outcome and to do it in a way that is truly unique and individuated to ourselves.</p>\n <h2>process is truth</h2><p>Process is a personal embodied truth.</p><p>It is so deeply internal.</p><p>I can share my process, but more than anything, I hope to inspire you to find your own.</p><p>Process is irreplicable because it requires you to take responsibility for how you create, how you run a business, how you want to be in the world.</p><p>And I wanna say bigger than that, that process is life.</p><p>Process is the truth because what is process other than change and the only constant is change.</p><p>To ground in process is to ground in the ongoingness of everything.</p><p>And when we're able to be one with this ongoingness, it allows us to view life with an attitude of experimentation and play, to make art not being attached to the end results of A, what it looks like exactly, but B, who receives it or who sees it.</p><p>To be so embedded with process requires an act of great presence, requires us to see ourselves and our energies as connected to everything that we do.</p><p>Not just if I input A, then I get B.</p>\n <h2>art as process</h2><p>To make art from the perspective of process is to see art itself as digesting of inhaling and exhaling life.</p><p>Art is about breathing in what we see, what we feel inspired by, what we feel, and then letting our spirit or creative energy or skill or thoughts intermingle with that which we digest and to express it outwards as a creation.</p><p>And to create art unselfconsciously, to be in full flow in the pleasure of creating without being tied to how will my fans react?</p><p>How will my readers react?</p><p>How will other people react to this?</p><p>We don't care about other people when we're deep in our process.</p><p>And yet to be so deep in process is to touch the universal.</p><p>So what we create paradoxically will speak at a deeper resonance to those who see our art.</p>\n <h2>business as process</h2><p>To see business from the perspective of process is to give up the sort of A for B linear way of thinking and instead to see any business relationship as an invitation to go on a journey, to go on a path, to take a hike in the woods together and be changed by that experience.</p><p>And yes, without money, it's not a business.</p><p>And yet the way to the money is to not focus on the money but focus on the process that is the most energetically nourishing exchange, energetically reciprocal exchange.</p><p>I think to think about business from the vantage point of process is deeply freeing.</p><p>It alleviates pressure because we're allowed to sort of experiment and try and see how we feel in different containers.</p><p>And the more years I've been doing business, the more I see how each experience, each client interaction is such an opportunity to do inner work because business is about how we share our energy in an efficient systematic way in the world.</p><p>And how do we allow ourselves to receive energy or money for that in return?</p><p>To focus on the process of business, it really allows me to bring my full self into business, my full self into whatever it is that I do instead of thinking, oh, I need to play a game in order to get whatever end result that is the product.</p><p>And really the game is I need to embrace and find a process that will allow me to be authentically myself.</p>\n <h2>money as process</h2><p>Money starts not from rendering a service or collecting money in your bank.</p><p>Money starts way, way, way, way before as an energy, as an intention, as a desire to offer a gift, a service, a thing that we create.</p><p>Money is interconnected with our own sense of worthiness, with our beliefs, with our thoughts, with our actions.</p>\n <h2>the self as process</h2><p>To see myself as a process instead of a product of my culture is to truly investigate what it means to be authentically me, unprogrammed by what society has told me to desire or want or need.</p><p>And this is such an ongoing work.</p><p>I'm working on this every day.</p><p>And for me, the systems that have really helped me in this process, not only is the creative practice and spirituality, but specifically human design and astrology, both of those systems have really unlocked and it gave me more permission to go deeper into my own process.</p><p>And that is to go deeper into myself.</p>\n <h2>why process is the way</h2><p>Living in the process gives you an unshakable, inimitable authenticity and loyalty to your true essence.</p><p>Then you can be sure that no one else could ever replicate what you do.</p><p>And time and time again, I've found that if I'm able to take out the pressure of needing to get an outcome and just to be in the process, it does yield ultimately the outcome I desire.</p><p>Maybe not in the way I think it'll come, but in a way that is more aligned with my energy.</p><p>Owning your process is the shortcut, even if it feels like the long way.</p><p>And I'm not saying that it's easy.</p><p>It requires so much listening and surrendering and being attentive.</p><p>The active discovering and then embodying your process, it takes time and patience.</p><p>And yet once you have it, you're able to be more of your true self in everything that you do.</p><p>And I think that's the whole point.</p><p>Otherwise, why are we here?</p>\n <h2>artists and material power</h2><p>And as artists, I'll just say one last thing, which is I believe that artists can and are meant to make money, that I'm all about building wealth as artists.</p><p>But money is not the purpose we're doing this, of course.</p><p>Money is just a byproduct of finding our own process.</p><p>And through that process, our own power.</p><p>No one can buy us.</p>\n <h2>embodying your own process</h2><p>The question I'll leave you with for this episode is to think about in whatever area of your life, whether that's art or health or business or money or your relationships, what processes feel nourishing, aligned and true?</p><p>How can you be more present in that process?</p><p>How can you experiment with your process and deepen your process?</p><p>If you were to be truly devoted to your process, what would your life or your day or your practice look like?</p><p>How would it feel?</p><p>Thank you, creative friends, for being here and for listening.</p><p>You can find more of my work and writings on my website world, keningzhu.com.</p><p>I also send a weekly newsletter on Creative Alchemy, which I've paused for the last couple of months, but I'm resuming very soon, called Guide Notes.</p><p>I'll look forward to speaking to you soon.</p>\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"b3ccc6736e300780bda533d405db204c0cc4c4855833d31610c673da26239e09","category":"Sites"}