{"title":"Roadmap for the campaign","link":"http://scripting.com/2024/08/06/141312.html?title=roadmapForTheCampaign","date":1722953592000,"content":"<p>A roadmap for the campaign is coming into view.</p>\n<ul>\n<li>Harris has her knee on Trump's neck, and she won't let up. </li>\n<li>There won't be time for anyone to get tired of her. </li>\n<li>The campaign rallies should get bigger and bigger, and more rambunctuous. The rally on the Sunday before Election Day should take place in stadiums all over America, with the cast of Democratic leadership spread out too, and the best musicians and comedians, again spread out over all the venues. Streaming on YouTube, with online participation <a href=\"https://en.wikipedia.org/wiki/Get_out_the_vote\">GOTV</a> coordination on the new democrat.social community site.   </li>\n<li>Trump is a comedian, a cross between <a href=\"https://en.wikipedia.org/wiki/Don_Rickles\">Don Rickles</a> and <a href=\"https://en.wikipedia.org/wiki/Joan_Rivers\">Joan Rivers</a> with a bit of <a href=\"https://en.wikipedia.org/wiki/Sam_Kinison\">Sam Kinison</a>. He had a good schtick for a long run if you find fascist slapstick entertaining, as millions of Americans do or did. </li>\n<li>Last night Maddow tried to get us excited about how the Repubs have planted people on voting boards in swing states with the purpose of stopping the counts, and thus preventing a vote in the Electoral College. But they're doing it too late. The administrators will feel the tide turning too. </li>\n<li>This campaign will take place in the popular culture of 2024, which thankfully is not centered on cable news or the NYT. But Mark Zuckerberg and Elon Musk are in control. In my <a href=\"http://scripting.com/2017/01/14/whatIfTwtrIsBoughtByARepub.html\">2017 piece</a> I thought Zuck would run for president, given his new style makeover I wouldn't discount that, but these two will certainly have a large influence over how the election goes. Both Facebook and Twitter have algorithms that are opaque and controlled by them. Same deal as with the owners of cable media. </li>\n<li>The Repub voters that elected Trump were appealed to based on their resentment in being left behind (not that all of them were, he just convinced them they were). But that was eight years ago and a lot has happened. Harris saying basically \"there you go again\" is an echo of Reagan, btw. It worked for Reagan, you just have to get the derision right. And Harris can do that, she laughs and we laugh, because we want to say it too. Trump cringes and gets nauseous.</li>\n<li>The Harris candidacy happened almost as if the whole thing was staged. The campaign was set to hit the ground running, it feels like there was a lot of advance work. Or they picked bloggers who were up and running and gave them the keys and said go. Either approach is fine, breaking through where previous Demo campaigns didn't have the nerve. Whatever it is, there's a sign of competence and urgency in the Democrats that is grounded in the challenge not in some almost religious sense that she's The One, which was understandable with Obama, we all were walking around in a stupor not believing such a thing could have happened but ecstatic that it had. </li>\n<li>Now we're grounded. We've seen the outline of our future. Our eyes were fully opened on Jan 6, and we haven't forgotten. A few weeks ago the lead Republican thinker behind Project 2025 said in an interview, it was up to the liberals to avoid a bloodbath, as they took over. You don't hear that anymore. Those people must now be thinking more seriously about jail for what they're doing. And the Supreme Court will go to jail too if they try to support what Maddow was talking about. We must not let them overthrow the government. And that's why Maddow's concern is okay but overstated, imho.</li>\n<li>I had my doubts whether Biden would stop it, and I don't know if Harris will, but given how purposefully the campaign in running, I suspect (hope, pray) she will. Our job is to give her the support she needs to feel like we've got her back. </li>\n<li>PS: FDR threatened to pack the court and the court backed down in 1938.</li>\n<li>PPS: If you haven't listened to Sunday's podcast, please do. A lot of what you read here will assume that you have listened to it. It's just 12 minutes. </li>\n</ul>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"b47afd89b4d98aeebfb4c0306e15ebfeb35926d58f57d4460bfa12bd14e0f8f7","category":"default"}