{"title":"Esperanto, Toki Pona, Swahili, Indonesian","link":"https://sive.rs/esperanto","date":1708905600000,"content":"<p>\nThis is a lukewarm little story with a few connected bits, but it might be interesting or even helpful.\nFollow the links in it, for full effect.\n</p>\n<h2>\nEsperanto start\n</h2>\n<p>\nFor decades, I’ve wanted the experience of carrying on a conversation in another language.\n</p><p>\nMy language-teaching polyglot friend <a href=\"https://bennylewis.com/\">Benny Lewis</a> said that if you’ve never really spoken another language, then the best strategy is to start with the easiest possible language to learn, which is <a href=\"https://en.wikipedia.org/wiki/Esperanto\">Esperanto</a>.\nHis advice is to spend just a few weeks learning and having conversations in Esperanto, so that you can feel the experience of detaching from your mother tongue.\nThen you’ll be better-prepared to go learn the language you really want to learn.\n</p><p>\nA few years ago, during Christmas holidays, when the world expects less of us, and I actually had spare time, I procrastinated something by thinking, “I should look into Esperanto.”\nI sat down mid-afternoon and checked out <a href=\"https://lernu.net/\">lernu.net</a>, which seemed to be the most popular Esperanto-learning site.\nAnd oh my god!\nIt’s fascinating!\nThe language is so well designed!\nEverything made sense and with each new thing I learned, I thought “That’s brilliant!”, and wanted to learn more.\nI was so riveted that I didn’t realize it had gotten dark, and by the time I got out of that chair it was 10pm.\n</p><p>\nSo I decided to learn Esperanto to a conversational level.\nIt was December, and there was an annual Esperanto conference in Seoul Korea in July, so I signed up to attend the conference and made that my deadline for fluency.\nI found an <a href=\"https://www.frenchfluency.net/\">Esperanto teacher</a>, signed up for live conversation practice, and started learning for one to three hours a day.\nI was a keen and diligent student, and had Esperanto books shipped from overseas, which I read slowly, learning new vocabulary.\nI watched <a href=\"https://www.youtube.com/@Evildea\">videos in Esperanto</a> made by a funny Australian dude.\nI used <a href=\"https://apps.ankiweb.net/\">Anki</a> flashcards, and wrote my own command-line dictionary for quick reference of every word I’d learned.\nI was so into it that my friend <a href=\"https://www.storyo.co.nz/about\">Elina</a> got annoyed and asked if I could please stop talking about it so much.\n</p><p>\nAfter six months of study, I was able to have conversations in Esperanto.\nI was able to say almost anything I wanted to say, and understand almost anything someone said.\n</p>\n<h2>\nToki Pona\n</h2>\n<p>\nI was on my way to Seoul Korea for that Esperanto conference, but stopped for a few days in Singapore.\nThere’s an <a href=\"https://en.wikipedia.org/wiki/Amikumu\">app</a> (made by the funny Australian dude) that helps you find other Esperanto speakers in your area that are willing to meet up and talk in Esperanto.\nSo I turned it on in Singapore.\nIt said that just a mile away from me was an Esperanto speaker named Sonja Lang.\nWait a minute…\nI know that name…\nOh my god it’s her!\n</p><p>\nYou’ve heard of the <a href=\"https://en.wikipedia.org/wiki/Linguistic_relativity\">Sapir-Whorf hypothesis</a>?\nIt suggests that the structure of the language you speak affects the <a href=\"https://en.wikipedia.org/wiki/Arrival_(film)\">way you think</a>.\n</p><p>\nSonja Lang, a brilliant linguist and translator, was inspired by Taoist philosophy, and found she felt best when she simplfied her thoughts and concentrated on basic things.\nSo she decided to apply the Sapir-Whorf hypothesis and created a new language that has only 137 words.\nWith so few words to communicate everything, you have to simplify your thoughts and concentrate on the basic essence.\nShe called it <a href=\"https://en.wikipedia.org/wiki/Toki_Pona\">Toki Pona</a>.\nI had heard of it for years, found the idea fascinating, and even read a little book about it.\n</p><p>\nSo I texted Sonja Lang through the Esperanto app, and asked if she would meet up with me.\nShe said yes, but only if we speak only Esperanto.\nWe met up the next day at a restaurant in Singapore.\nShe’s like a rock star to me, so I was nervous and excited, and I’d sometimes break into English to tell her something.\nBut she patiently responded in Esperanto, and spoke only Esperanto for two hours with me that evening.\n</p><p>\nI wanted to stay friends with her, but we only connected through that app, and only that one time.\nStill, I was starstruck, and count it in my top ten celebrity encounters.\n</p>\n<h2>\nEsperanto conference\n</h2>\n<p>\nI’d always wanted to go to Korea, and this was my first time.\nSo excited to be there, and excited for this Esperanto conference.\n</p><p>\nOK so this is why I said this story is “lukewarm”: because I have mixed feelings about what I’m going to say next, and I’m going to trash something (maybe myself) in a way I usually don’t.\n</p><p>\nI went into the conference, and was immediately disappointed.\nThe average age of the attendees around me was probably 55.\nThey were disheveled and unkempt.\nThey had signs saying we could have world peace if everyone spoke Esperanto.\nThey were singing sappy songs with acoustic guitars and hand-drums about Zamenhof, the linguist who invented Esperanto in 1888.\nI cringed.\nIt’s hippie Klingon.\n</p><p>\nI talked with <a href=\"https://www.youtube.com/@Evildea\">the funny Australian</a> (in Esperanto, of course), after watching so many hours of his videos, that was cool to meet him.\nBut everyone else?\nEh.\nI realized I had no desire to talk with these people.\nAnd then I felt bad for my lack of interest.\nI’ve attended many conferences about the Ruby programming language, and really loved nerding out on those conversations with fellow enthusiasts.\nBut I just didn’t like these Esperanto people.\nI felt like a bad person for not being more interested in them.\nSo I forced myself to have a few more Esperanto conversations with strangers, but I still didn’t like it.\nAnd so I left and never spoke Esperanto again.\n</p><p>\nI feel bad saying that I liked the language but not its speakers.\nI feel like it’s my fault.\nThey’re all probably really interesting people, and the problem is me, which makes me feel worse.\n</p>\n<h2>\nEsperanto conclusion?\n</h2>\n<p>\nI realize that I lost the plot and didn’t do what Benny had suggested.\nI was supposed to spend just a few weeks on Esperanto, have a few conversations in it, then move on.\nBut I was just so intrigued with the language itself that I dove all the way in.\nSo I’m left with a feeling of regret.\n</p><p>\nEsperanto is interesting but almost useless.\nAlmost nobody speaks it, and they all speak English and other languages too.\nSo I can’t ever feel the joy of using it to communicate with someone who I couldn’t otherwise.\n</p><p>\nI spent over 400 hours practicing Esperanto, and I wish I had spent that time learning a more useful language.\nFor an English speaker like me, Spanish, French or Portuguese would have been almost as easy.\nA year later, I moved to Portugal, and deeply felt that regret.\n</p><p>\nSo now it’s just something I nerded-out on for six months, and have a lingering admiration for how well it’s designed.\n</p>\n<h2>\nIndonesian and Swahili\n</h2>\n<p>\nLinguist <a href=\"https://en.wikipedia.org/wiki/John_McWhorter\">John McWhorter</a> has a <a href=\"https://conversationswithtyler.com/episodes/john-mcwhorter/\">lot to say about language</a>.\nI’ve spent probably 50 hours listening to his <a href=\"https://www.thegreatcourses.com/professors/john-mcwhorter/\">great courses</a> and <a href=\"https://slate.com/podcasts/lexicon-valley\">podcast</a> about languages.\n</p><p>\nHe said that if he could have chosen a language, instead of English, to be the world’s shared second language, then it would be Swahili or colloquial Indonesian.\nHe said both of these languages have been learned by millions of people as their second language, so all the weird edge-cases have worn away, and they are as smooth and beautiful as a river stone.\nNo weird grammar.\nNo weird tones.\nNo exceptions.\nIn all of his studies of hundreds of languages, he said Indonesian is the closest thing to an ideal language he has ever encountered.\n</p><p>\nI still want to learn to speak another language to a conversational level.\nI’m very tempted to learn Indonesian or Swahili, to experience what he loves about them.\nLike learning to play a song that an expert says is the most beautiful song ever written.\nAnd each one could connect me to millions of native speakers that don’t speak English.\n</p><p>\nI daydream about what it would have been like if, instead of Esperanto, I learned Swahili and went to <a href=\"https://en.wikipedia.org/wiki/Zanzibar\">Zanzibar</a> (birth place of the language) to speak nothing but Swahili for a week.\nOr learned this ideal language of colloquial Indonesian, and instead of going to a hippie nerd conference I would have talked with people around the Indonesian islands.\nThese scenarios are much more inspiring to bridge the communication gap.\n</p><p>\nBut for me, still, the language with the greatest unlocking power is clearly Mandarin Chinese.\nOver one billion speakers that don’t speak English, from a rich and admirable culture with its own thing going on.\n</p><p>\nSome day.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b47dc7dfa3c9e3b14f571ce76308e537c7196d834b597191480653ac46c1d63d","category":"Sites"}