{"title":"We Deserve a Better Work Life","link":"https://kottke.org/24/06/we-deserve-a-better-work-life","date":1718978876000,"content":"\n        <p>After four years, <a href=\"https://www.nytimes.com/2024/06/15/business/work-friend-roxane-gay-goodbye.html?unlocked_article_code=1.1U0.voHw.XuimtiYjrxxc\">Roxane Gay signs off from her Work Friend column</a>.</p>\n\n<blockquote><p>I am not an idealist or much of an optimist, but being your Work Friend pushed me in that direction. I want, too. I want a world where we can all live our best professional lives. I want everyone to make a living wage and have excellent health care and the means to retire at a reasonable age. I want all of us to want this very simple thing for one another.</p>\n\n<p>And, frankly, a fulfilling and equitable professional life should not be the stuff of utopia. This should be our reality. It is astonishing to see how many people are so deeply unhappy at work, so trapped by circumstances beyond their control, so vulnerable to toxic workplaces and toxic cultural expectations around work. As I read your letters I mostly thought: “It shouldn’t be this way. It shouldn’t be this hard.”</p>\n\n<p>We shouldn’t have to suffer or work several jobs or tolerate intolerable conditions just to eke out a living, but a great many of us do just that. We feel trapped and helpless and sometimes desperate. We tolerate the intolerable because there is no choice. We ask questions for which we already know the answers because change is terrifying and we can’t really afford to risk the loss of income when rent is due and health insurance is tied to employment and someday we will have to stop working and will still have financial obligations.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Roxane%20Gay\">Roxane Gay</a> · <a href=\"https://kottke.org/tag/working\">working</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/06/we-deserve-a-better-work-life\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"b48d733c41af0ec928c9d927ea873970dee54d5824f4841f7fba0a0fa7b847f8","category":"default"}