{"title":"Roadmap for BeachfrontDigital","link":"https://blog.webb.page/2017-02-08-roadmap-for-beachfront-digital.txt","date":1486512000000,"content":"<p>BeachfrontDigital<a href=\"https://beachfront.digital\">1</a> is a domain portfolio management tool I built and launched\nlate last year. To quote the \"About\" page:</p>\n<blockquote>\n<p>BeachfrontDigital is me scratching my own itch and taking cues from The 7 Day\nStartup. I buy domains on a regular basis and often from more than one\nregistrar. As a result, I tend to forget I have some domains! <em>True story</em>, I\nran a WHOIS search <em>on a domain I own</em>, a couple months ago. Terrible. 😩</p>\n</blockquote>\n<p>The name is a result of a conversation I had with co-workers about how domain\nnames are like the premium waterfront properties of the 80s. Of course, the\ndomain <code>beachfront.digital</code> was available so I snagged it ASAP.</p>\n<p>Since launching BD in October, I've made updates here and there and it seemed\nlike I was going to get valuable feedback from early beta testers who assured\nme they would sign up at $6/year <em>instead of</em> the regular $11/year\nprice…turns out, <em>nobody</em> wanted to beta test and my messages were ignored.\nWas it because of the upfront cost? Was it because I didn't have a bunch of\nfeatures fleshed out? I'll never know. However, of the friends I reached out to\nfor feedback Wojtek Witkowski<a href=\"https://twitter.com/dubstrike\">2</a> was the only one who got back to me. Through\nhim and a prospective customer/commenter on Hacker News, I learned a few\nthings:</p>\n<ul>\n<li>I wasn't offering anything that a spreadsheet couldn't handle.</li>\n<li>$6/year was still too much to charge for someone who has &lt;10 domains.</li>\n<li>To make charging for my service palatable, I'd need to create a sync system\nfor registrars.<ul>\n<li>Not all registrars have public APIs (see: Hover).</li>\n<li>There are <em>so</em> many registrars. It's not cost-effective to maintain syncing\nfor each.</li>\n<li>Creating a sync system based on undocumented APIs like some people have\ndone with Hover is a <em>terrible</em> idea. Undocumented APIs means they can\nbreak at <em>any</em> moment.</li>\n</ul>\n</li>\n</ul>\n<p>For these reasons and more, <em>I have decided to make BeachfrontDigital free</em>\nwhen V2 goes live. I'm currently working on a stock photography site for people\nof color so upgrades and changes to BD will occur in March (when I'm not\nplaying my Nintendo Switch, hehe). I also plan to update the site with a visual\nstyle reminiscent of the 80s. Here's how the site used to look:</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/roadmap-for-beachfront-digital-a.png\">First version of BeachfrontDigital</a></p>\n<p>Here's how it looks now:</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/roadmap-for-beachfront-digital-b.png\">Second version of BeachfrontDigital</a></p>\n<p>As you can see, the styling went from pretty cool (the logo was levitating and\nthe background grid moved as well) to extremely sterile. Nothing's <em>wrong</em> with\na sterile look, that's what this blog looks like, haha! But for something with\nthe URL <code>beachfront.digital</code>, it could stand to look a <em>bit</em> more impressive.</p>\n<p>A key missing feature is the ability to import your domains. If you've already\ngot a method to organize your domains and you want to use BeachfrontDigital,\nyou sure wouldn't want to type everything again right? <em>Hell no</em>, who has time\nfor <em>that</em>?! I intend to make the wishlist feature more robust, as well as the\npersonal analytics. For example, I'm paying $2027 for 75 domains per year 😅.\nAnyhoo, watch this space and @BeachfrontD<a href=\"https://twitter.com/@BeachfrontD\">3</a> on Twitter for updates. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"b4f5398b4c2ad70feb3b57aa47dbfd418a9d67c54494893666d854a6a5fc574a","category":"Sites"}