{"title":"The Art of Work in the Age of AI Production","link":"https://kottke.org/24/05/the-art-of-work-in-the-age-of-ai-production","date":1714747321000,"content":"\n        <p>I enjoyed <a href=\"https://www.nytimes.com/2024/04/05/podcasts/transcript-ezra-klein-interviews-nilay-patel.html?unlocked_article_code=1.o00.be0a.wVEEjdyByEyX\">Ezra Klein’s podcast conversation with Nilay Patel</a>, the editor of The Verge. They talked about media and AI mostly.</p>\n\n<p>(First of all, anyone who says they’re trying to <a href=\"https://www.theverge.com/24087834/hank-green-decoder-podcast-google-youtube-web-media-platforms-distribution-future\">“revolutionize the media through blog posts”</a> is a-ok in my book.)</p>\n\n<p>Anyway, here’s Patel on the limitations of AI and where humans shine:</p>\n\n<blockquote><p>But these models in their most reductive essence are just statistical representations of the past. They are not great at new ideas.</p>\n\n<p>And I think that the power of human beings sort of having new ideas all the time, that’s the thing that the platforms won’t be able to find. That’s why the platforms feel old. Social platforms like enter a decay state where everyone’s making the same thing all the time. It’s because we’ve optimized for the distribution, and people get bored and that boredom actually drives much more of the culture than anyone will give that credit to, especially an A.I. developer who can only look backwards.</p></blockquote>\n\n<p>Later he talks more specifically about why curation will grow more important in a world inundated with aggressively mid AI content:</p>\n\n<blockquote><p>And the idea is, in my mind at least, that those people who curate the internet, who have a point of view, who have a beginning and middle, and an end to the story they’re trying to tell all the time about the culture we’re in or the politics we’re in or whatever. They will actually become the centers of attention and you cannot replace that with A.I. You cannot replace that curatorial function or that guiding function that we’ve always looked to other individuals to do.</p>\n\n<p>And those are real relationships. I think those people can stand in for institutions and brands. I think the New York Times, you’re Ezra Klein, a New York Times journalist means something. It appends some value to your name, but the institution has to protect that value. I think that stuff is still really powerful, and I think as the flood of A.I. comes to our distribution networks, the value of having a powerful individual who curates things for people, combined with a powerful institution who protects their integrity actually will go up. I don’t think that’s going to go down.</p></blockquote>\n\n<p>Yeah, exactly. Individuals and groups of like-minded people making things for other people — that stuff is only going to grow more valuable as time goes on. The breadth and volume offered by contemporary AI cannot provide this necessary function right now (and IMO, for the foreseeable future).</p>\n\n<p>And finally, I wanted to share this exchange:</p>\n\n<blockquote><p>EZRA KLEIN: You said something on your show that I thought was one of the wisest, single things I’ve heard on the whole last decade and a half of media, which is that places were building traffic thinking they were building an audience. And the traffic, at least in that era, was easy, but an audience is really hard. Talk a bit about that.</p>\n\n<p>NILAY PATEL: Yeah first of all, I need to give credit to Casey Newton for that line. That is something — at The Verge, we used to say that to ourselves all the time just to keep ourselves from the temptations of getting cheap traffic. I think most media companies built relationships with the platforms, not with the people that were consuming their content.</p></blockquote>\n\n<p>I never focused on traffic all that much, mainly because for a small site like kottke.org, there wasn’t a whole lot I could do, vis-à-vis Google or Facebook, to move the needle that much. But as I’ve written many times, <a href=\"https://kottke.org/16/11/kottkeorg-memberships\">switching to a reader-supported model in 2016</a> with <a href=\"https://kottke.org/members/\">the membership program</a> has just worked so well for the site because it allows me to focus on making something for those readers — that’s you! — and not for platforms or algorithms or advertisers. I don’t have to “pivot to video”; instead I can do stuff like <a href=\"https://kottke.org/24/04/a-little-comments-check-in\">comments</a> and [new thing coming “soon”] that directly benefit and engage readers, which has been really rewarding.</p>\n\n<p>See also Kyle Chayka’s recent piece for the New Yorker: <a href=\"https://www.newyorker.com/culture/infinite-scroll/the-revenge-of-the-home-page\">The Revenge of the Home Page</a>.</p>\n\n<blockquote><p>Perhaps the platform era caused us to lose track of what a Web site was for. The good ones are places you might turn to several times per day or per week for a select batch of content that pointedly is not everything. Going there regularly is a signal of intention and loyalty: instead of passively waiting for social feeds to serve you what to read, you can seek out reading materials-or videos or audio-from sources you trust. If Twitter was once a sprawling Home Depot of content, going to specific sites is more like shopping from a series of specialized boutiques.</p></blockquote>\n\n<p>I’m going to get slightly petty here for a sec and say that these “back to the blog / back to the web” pieces almost always ignore the sites that never gave up the faith in favor of “media” folks inspired by the former. It’s nice to see the piece end with a mention of <a href=\"https://www.aldaily.com/\">Arts &amp; Letters Daily</a>, still bloggily chugging along since 1998. /salty</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/artificial%20intelligence\">artificial intelligence</a> · <a href=\"https://kottke.org/tag/Ezra%20Klein\">Ezra Klein</a> · <a href=\"https://kottke.org/tag/interviews\">interviews</a> · <a href=\"https://kottke.org/tag/Nilay%20Patel\">Nilay Patel</a> · <a href=\"https://kottke.org/tag/podcasts\">podcasts</a> · <a href=\"https://kottke.org/tag/weblogs\">weblogs</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/the-art-of-work-in-the-age-of-ai-production\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"b537150cd9e69ca110823ff1f4c9993c15848e7002db320627370a756d46852a","category":"default"}