{"title":"Shortest date, and ketchup","link":"https://sive.rs/ketchup","date":1662940800000,"content":"<p>\nHere’s a story about my shortest date, and ketchup.\n</p><p>\nI was dating in New York City, and matched with someone named Kelly.\nWe agreed to meet, so I called her to decide where.\nShe had a miserable voice, creaky and weary, but I tried not to judge.\n</p><p>\nI suggested we meet at a bar at 35th Street and 8th Avenue.\nAlthough she’s from New York, she didn’t know where that is.\n</p><p>\nI said, “You really don’t know where 35th Street and 8th Avenue is?”\n</p><p>\nShe said, “No.”\n</p><p>\nI said, “Well, just ask anyone. Everyone else knows.”\n</p><p>\nOK, now I’m judging.\nMiserable voice.\nDoesn’t know the basic layout of the city she lives in.\nTwo red flags.\n</p><p>\nI started to add her to my phone, so I said, “I have two friends named Kelly. Can you tell me your last name?”\n</p><p>\nShe said, in her weary voice, “I’m not going to tell you my last name. You could be a serial killer.”\n</p><p>\nWhat the …?\nOK.\nFine.\nThree red flags.\n</p><p>\nSo a couple days later we met at the bar at 35th Street and 8th Avenue.\nShe looked good.\nWe said hello.\nI asked if she’d like a beer.\nShe said yes.\nI brought two beers back to the table.\n</p><p>\nOn the table is a bottle of ketchup.\nHuh.\n“Ketchup.”\nI never really noticed that word before.\nWhere is it from?\nIt doesn’t look Latin, French, or Germanic.\n</p><p>\nSo the first thing I say is, “Where do you think the word ketchup is from?”\n</p><p>\nShe looked at me with disgust, and said, just sneering the whole time, “What? What kind of question is that? Who cares? Why would anyone care about that?”\n</p><p>\nI looked at her and thought for a second.\nMiserable voice.\nDoesn’t know her city.\nAssumes I’m a murderer.\nAnd now doesn’t have the slightest bit of curiosity about anything — no willingness to engage in the tiniest bit of wonder.\n</p><p>\nI decided I didn’t want to know her.\nI got up and said, “I’m gonna go now.”\n</p><p>\nShe said, “But you haven’t even had a sip of your beer!”\n</p><p>\nI said, “Take care,” and left.\nShortest date ever.\n</p><p>\nYears later, I’m living in Singapore, which is next to Indonesia, so I’m reading a book about Indonesian history.\nIt says there is <strong>only one word in English that comes from the Indonesian language</strong>.\nKetchup.\n</p><p>\nI was amazed.\nI laughed.\nQuestion answered.\n</p><p>\nMy instinct was right to walk out on that date.\nLittle interesting things are all around us.\nBut the uncurious will never know.\n</p>\n<img src=\"/images/ketchup.jpg\" alt=\"bottle of ketchup\" title=\"ketchup photo by Betsssssy\" />\n<div>ketchup photo by <a href=\"https://www.flickr.com/photos/betsssssy/6995478191/\">Betsssssy</a></div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b615a1e60bd66f0a838313d6ccb6dbe82475a8680705ae5aeb81a686ede63431","category":"Sites"}