{"title":"The Managed Heart: Emotional Labor and the Psychological Cost of Ambivalence","link":"https://www.themarginalian.org/2024/11/14/emotional-labor-managed-heart/","date":1731598192000,"content":"<p><a href=\"https://www.amazon.com/Managed-Heart-Commercialization-Human-Feeling/dp/0520272943/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"511\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/themanagedheart.jpg?fit=320%2C511&amp;ssl=1\" alt=\"The Managed Heart: Emotional Labor and the Psychological Cost of Ambivalence\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/themanagedheart.jpg?w=626&amp;ssl=1 626w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/themanagedheart.jpg?resize=320%2C511&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/themanagedheart.jpg?resize=600%2C958&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/themanagedheart.jpg?resize=240%2C383&amp;ssl=1 240w\" /></a></p><p>What are you unwilling to feel? This is one of the most brutal, most clarifying questions in life, answering which requires great courage and great vulnerability. Out of that unwillingness arises the greatest inner tension of the heart: that between what we wish we felt and what we are actually feeling. </p>\n<p>There are two ways of keeping that tension from breaking the heart — a surrender to the truth, or a falsification of feeling. When we don’t feel strong enough or safe enough to face our emotional reality, we manipulate it. It may be an outward act, masking for others what we fear would be unwelcome or judged, or it may be an inner one, lying to ourselves about what we are actually feeling to dull the discomfort and ambivalence of feeling it. The stab of loneliness at the party, the relief at the funeral, the love that requires nothing less than changing your life — whether internally sundering or socially inappropriate, we render these emotions impermissible and suppress them. That falsification, whether conscious or not, maps the fault line between the person and the personality — that costume the soul wears to perform and protect itself. </p>\n<p>But there is a high psychological cost to putting on the performance, the costume, the mask — a cost sociologist Arlie Russell Hochschild terms <em>emotional labor</em>.</p>\n<p>In her revelatory 1983 book <a href=\"https://www.amazon.com/Managed-Heart-Commercialization-Human-Feeling/dp/0520272943/?tag=braipick-20\" target=\"_blank\"><strong><em>The Managed Heart</em></strong></a> (<a href=\"https://search.worldcat.org/title/9280843\" target=\"_blank\"><em>public library</em></a>), she draws on a wealth of case studies and interviews to explore emotional labor as “a distinctly patterned yet invisible emotional system” governing our private and public exchanges through individual acts of “emotion work” and social “feeling rules” that shape what we allow ourselves to show and what we allow ourselves to feel. Much of our emotional labor is invisible even to us, but we become aware of it when we experience what Hochschild calls “the pinch” between a real but unwelcome feeling and a preferred, idealized one. </p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=680%2C458&amp;ssl=1\" width=\"680\" height=\"458\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?w=2099&amp;ssl=1 2099w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=320%2C216&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=600%2C404&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=240%2C162&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=768%2C517&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=1536%2C1035&amp;ssl=1 1536w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?resize=2048%2C1380&amp;ssl=1 2048w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/06/renemagritte_thefalsemirror.jpg?w=1360&amp;ssl=1 1360w\" /><figcaption>René Magritte. <em>The False Mirror</em>. 1929. (Museum of Modern Art.)</figcaption></figure>\n<p>Two decades ahead of philosopher Martha Nussbaum’s case for <a href=\"https://www.themarginalian.org/2015/11/23/martha-nussbaum-upheavals-of-thought-neediness/\">the intelligence of our emotions</a> and half a century ahead of neuroscientist Antonio Damasio’s case for <a href=\"https://www.themarginalian.org/2021/12/24/feeling-knowing-damasio/\">feeling as the crucible of consciousness</a>, Hochschild writes:</p>\n<blockquote><p>Emotion functions as a messenger from the self, an agent that gives us an instant report on the connection between what we are seeing and what we had expected to see, and tells us what we feel ready to do about it… Emotions signal the secret hopes, fears, and expectations with which we actively greet any news, any occurrence.</p>\n<p>[…]</p>\n<p>Emotional labor… requires one to induce or suppress feeling in order to sustain the outward countenance that produces the proper state of mind in others… This kind of labor calls for a coordination of mind and feeling, and it sometimes draws on a source of self that we honor as deep and integral to our individuality.</p></blockquote>\n<p>There is emotional labor involved each time we put someone else’s needs before our own, each time we force a binary conclusion to resolve our ambivalence about a nuanced matter of the heart. This “subterranean work of placing an acceptable inner face on ambivalence” is painfully exhausting because it makes us less ourselves. Hochschild draws an analogy:</p>\n<blockquote><p>Beneath the difference between physical and emotional labor there lies a similarity in the possible cost of doing the work: the worker can become estranged or alienated from an aspect of self — either the body or the margins of the soul — that is used to do the work. The factory boy’s arm functioned like a piece of machinery used to produce wallpaper. His employer, regarding that arm as an instrument, claimed control over its speed and motions. In this situation, what was the relation between the boy’s arm and his mind? Was his arm in any meaningful sense his own?</p></blockquote>\n<p>Owning what we feel — which involves both allowing it and expressing it — is fundamentally a way of claiming ourselves. But because permission and expression are so intricately entwined, the very act of suppressing what we express changes what we feel, alters the very self. Hochschild writes:</p>\n<blockquote><p>If we conceive of feeling not as a periodic abdication to biology but as something we do by attending to inner sensation in a given way, by defining situations in a given way, by managing in given ways, then it becomes plainer just how plastic and susceptible to reshaping techniques a feeling can be. The very act of managing emotion can be seen as part of what the emotion becomes.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/09/bigwolflittlewolf8.jpg\" /></a><figcaption>Art by Olivier Tallec from <a href=\"https://www.themarginalian.org/2017/10/12/big-wolf-little-wolf/\"><em>Big Wolf &amp; Little Wolf</em></a></figcaption></figure>\n<p>This matters because attention is the lens that renders reality and <a href=\"https://www.themarginalian.org/2023/05/10/iain-mcgilchrist-the-matter-with-things/\">attention is a function of feeling</a> — by changing our feelings, we change our lens, ultimately changing what we experience as reality:</p>\n<blockquote><p>Feeling… filters out evidence about the self-relevance of what we see, recall, or fantasize… Every emotion does signal the “me” I put into seeing “you.” It signals the often unconscious perspective we apply when we go about seeing. Feeling signals that inner perspective.</p></blockquote>\n<p>In this sense, feeling is an orienteering tool, a clue about where we stand in relation to something or someone. And yet it is prey to one great complication: the interpretation of the clue. Often unconscious, our interpretation of feeling is regularly garbled by what was and by what we think should be — the ghosts of the past and the fantasies of the future haunting the present, warping the present, warping reality itself, effecting what George Eliot called a “double consciousness.” Because to know what is real is the measure of self-trust, confusion and ambivalence about our feelings erode our self-trust.</p>\n<p>Unable to bear the internal dissonance, or entirely unaware of it, we cope by feigning to feel something other than what we are actually feeling. Whether performed for others or for the audience of our own confused conscience, this is acting work. Hochschild, who grew up as the child of diplomats, classifies two key varieties — <em>surface acting</em> and <em>deep acting</em>. She writes:</p>\n<blockquote><p>Feelings do not erupt spontaneously or automatically in either deep acting or surface acting. In both cases the actor has learned to intervene — either in creating the inner shape of a feeling or in shaping the outward appearance of one.</p>\n<p>[…]</p>\n<p>In surface acting we deceive others about what we really feel, but we do not deceive ourselves. Diplomats and actors do this best, and very small children do it worst (it is part of their charm). In deep acting we make feigning easy by making it unnecessary.</p></blockquote>\n<p>We make it unnecessary by replacing our actual feeling with the feeling we wish to project, wish to feel, so that in a sense we no longer need to feign it — we have induced ourselves to feel it. Hochschild, whose study of emotional labor began with hundreds of flight attendants in training, offers an illustrative example:</p>\n<blockquote><p>Can a flight attendant suppress her anger at a passenger who insults her?… She may have lost for awhile the sense of what she would have felt had she not been trying so hard to feel something else. By taking over the levers of feeling production, by pretending deeply, she alters herself.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/09/26/the-day-i-became-a-bird/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2016/09/thedayibecameabird6.jpg\" /></a><figcaption>Art by Guridi from <a href=\"https://www.themarginalian.org/2016/09/26/the-day-i-became-a-bird/\"><em>The Day I Became a Bird</em></a> — an illustrated allegory about falling in love and learning to unmask the true self</figcaption></figure>\n<p>This alteration of the real self requires tremendous emotional labor, which comes at a great psychological cost — we lose sense of who we are and where we stand. (Those of us who have had to take care of a parent’s emotional needs and feelings from a young age at the expense of feeling our own, at the expense of knowing our own, are particularly vulnerable to such self-abandonment in adult life.) </p>\n<p>This notion of deep acting originates in Russian theater pioneer Konstantin Stanislavski’s influential century-old system for training actors in what he called “the art of experiencing” — a practice of tapping into the actor’s conscious thought, will, and memory in order to trigger the unconscious into experiencing, rather than just representing, the emotion the actor must perform in their part. </p>\n<p>In one of the many case studies substantiating the book, Hochschild gives the example of a man trying to stop feeling deep love for a woman with whom he is no longer able to have a reciprocal relationship. Applying Stanislavski’s method, the man would draw on his emotional memory to make a list of all the times the woman disappointed him or hurt him, prompting himself to feel the pain and disappointment as an antidote to his love. “He would not, then, fall naturally out of love,” she writes. “He would actively conduct himself out of love through deep acting.”</p>\n<p>We are conducting ourselves into and out of feeling all the time as we play the parts of the lives we think we ought to live. Most of the time, we are not even aware we are doing this. We do it especially deftly in love. “I was afraid of being hurt, so I attempted to change my feelings,” an exceptionally self-aware woman tells Hochschild in one of the interviews, naming plainly the commonest contortion of the heart we perform in the pit of fear — after all, falling in love is <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\">always and invariably a surrender to the fear of loss</a>. In love, Hochschild observes, one always “wavers between belief and doubt” — and it is precisely when afflicted with ambivalence, when unable to tolereate doubt and reconcile conflicting feelings, that we exert the most toilsome emotional labor.</p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-yellow-crowned-night-heron-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-yellow-crowned-night-heron-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>One of Hochschild’s interview subjects is a woman riven by a common ambivalence — a marriage she has outgrown, yet one in which she continues to stay out of a misplaced feeling of responsibility for her child’s future, forgetting somehow that the greatest gift a parent can give a child is to model the courage of living one’s truth. She tells Hochschild:</p>\n<blockquote><p>I am desperately trying to change my feelings of being trapped [in marriage] into feelings of wanting to remain with my husband voluntarily. Sometimes I think I’m succeeding — sometimes I know I haven’t. It means I have to lie to myself and know I am lying. It means I don’t like myself very much. It also makes me wonder whether or not I’m a bit of a masochist.</p></blockquote>\n<p>Lying to ourselves, Hochschild admonishes, erodes our trust in knowing what is real, what is true. In acting, the actor is aware of the illusion; in life, deluding ourselves is a form of bad faith and self-betrayal, the price of which — paid upon the reluctant but inevitable admission of our inner truth — is a loss of self-respect. She writes:</p>\n<blockquote><p>It is far more unsettling to discover that we have fooled ourselves than to discover that we have been fooling others… When in private life we recognize an illusion we have held, we form a different relation to what we have thought of as our self. We come to distrust our sense of what is true, as we know it through feeling. And if our feelings have lied to us, they cannot be part of our good, trustworthy, “true” self… We may recognize that we distort reality, that we deny or suppress truths, but we rely on an observing ego to comment on these unconscious processes in us and to try to find out what is going on despite them.</p></blockquote>\n<p>Hochschild offers a single, merciless antidote to this all too human tendency toward self-delusion: “constant attention, continual questioning and testing” of what we believe about ourselves, what we trust in ourselves. Then and only then can we begin to treat our hearts not as something to be managed but as something to be met, discovering in that meeting the truth of who we are. </p>\n<p>Couple <a href=\"https://www.amazon.com/Managed-Heart-Commercialization-Human-Feeling/dp/0520272943/?tag=braipick-20\" target=\"_blank\"><strong><em>The Managed Heart</em></strong></a> with Javier Marías on <a href=\"https://www.themarginalian.org/2023/06/16/javier-marias-your-face-tomorrow/\">the courage to heed your intuitions</a>, then revisit the fascinating science of <a href=\"https://www.themarginalian.org/2024/02/23/how-emotions-are-made/\">how emotions are made</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"b62ef0b8051be554889cf5b7dba38a083263f80665b2773de4a5f4bfd303af1a","category":"Sites"}