{"title":"Here’s how to live: Balance everything.","link":"https://sive.rs/htl27","date":1640563200000,"content":"<p>\nAll bad things in life come from extremes.\n<br />\nToo much of this.\n<br />\nToo little of that.\n</p><p>\nWhen we lack balance, we’re upset.\n<br />\nOver-worked, under-loved, over-eating, under-sleeping.\n<br />\nFocused on wealth, but ignoring health.\n<br />\nFocused on the present, but ignoring the future.\n</p><p>\nEven positive traits, when taken too far, become negative.\n<br />\nLike when someone is generous to a fault, or amusing to a fault.\n<br />\nToo much of a specific strength is a weakness.\n<br />\nIf you rise to great heights in only one area, you’re a one-legged giant: easily toppled.\n</p><p>\nNotice the similarities in the physical and emotional definitions.\n<br />\nPhysical upset: to knock something over.\n<br />\nEmotional upset: to be disturbed.\n<br />\nPhysically unstable: likely to fall.\n<br />\nEmotionally unstable: prone to dangerous, impulsive behavior.\n<br />\nAll related to a lack of balance.\n</p><p>\nWhen you’re balanced, you’re unlikely to get stressed.\n<br />\nYou’ve got a stronger foundation and a resilient structure.\n<br />\nYou can handle surprises, and make time for what’s needed.\n</p><p>\nVirtue is in the balance between extremes.\n<br />\nBetween the insecure and the egomaniac: confidence.\n<br />\nBetween the uptight and the clown: grace.\n<br />\nBetween the coward and the daredevil: courage.\n<br />\nBetween selfishness and sacrifice: generosity.\n</p><p>\nSo, the way to live is to balance everything.\n</p><p>\nImagine the different aspects of your life as the spokes in a wheel: health, wealth, intellectual, emotional, spiritual, or however you divide it.\n<br />\nIf any of these are lacking, it makes a lopsided, wobbly wheel, causing you to crash.\n<br />\nBut if you keep the parts of your life balanced, your wheel is round, and you can roll easily.\n</p><p>\nYou have different sides to your personality, with conflicting needs.\n<br />\nInstead of ignoring one, make sure you balance them.\n<br />\nBalance time with others and time alone.\n<br />\nBalance your need for stability with your need for surprise.\n<br />\nBalance input and output, consumption and creation, stability and adventure, body and spirit.\n<br />\nYour opposing needs become each other’s remedy.\n</p><p>\nWork more on your weaknesses.\n<br />\nSomeone who’s rich but fat has different needs than someone who’s fit but broke.\n<br />\nRemember the spokes of the wheel.\n</p><p>\nThe best tool for a balanced life is the clock.\n<br />\nLike a hunter’s dog, the clock will be your best ally.\n<br />\nIt will guard you, keep your impulses in check, and protect what’s important to you.\n</p><p>\nSchedule everything to ensure balance of your time and effort.\n<br />\nScheduling prevents procrastination, distraction, and obsession.\n<br />\nA schedule makes you act according to the goals of your highest self, not your passing mood.\n</p><p>\nSchedule quality time with dear friends.\n<br />\nSchedule preventative health checkups.\n<br />\nSchedule focused time to learn.\n<br />\nSchedule each aspect of your life, ignoring none.\n<br />\nList what makes you happy and fulfilled, then schedule those things into your year.\n</p><p>\nThe balanced schedule protects you from hurting yourself, from getting overwhelmed and ignoring important needs.\n<br />\nYou won’t over-work, over-play, or over-indulge.\n</p><p>\nEven creative work needs scheduling.\n<br />\nThe greatest writers and artists didn’t wait for inspiration.\n<br />\nThey kept a strict daily schedule for creating their art.\n<br />\nA routine triggers inspiration because your mind and body learn that ideas emerge at that time.\n<br />\nThe world’s greatest achievements were squeezed into existence by deadlines.\n</p><p>\nSet an alarm to start and stop on time.\n<br />\nObey your schedule, no matter how you feel.\n<br />\nSchedule every hour of your day.\n<br />\nDistraction steals what’s not locked down.\n</p><p>\nOnce you’re living a balanced life, find new layers.\n<br />\nThe wheel has infinite spokes.\n</p><p>\nBalance your needs versus the needs of others.\n</p><p>\nBalance your knowledge.\n<br />\nRead books on core subjects you know nothing about.\n</p><p>\nBalance your political opinion.\n<br />\nTalk with smart people in the opposite camp until you’re not opposite anymore.\n</p><p>\nBalance the abilities of your body.\n<br />\nImprove your flexibility, strength, coordination, and ability to perform different types of movements.\n</p><p>\nBalance two languages.\n<br />\nA second language is one of the best things for your brain, and can add a new type of balance, like living half the year in another culture, speaking only your other language.\n</p><p>\nBalance your response to situations.\n<br />\nDo you tend to change yourself, change the environment, or change nothing and leave?\n<br />\nFind which you do too much and which you don’t do enough, then rebalance.\n</p><p>\nFinally, balance the world.\n<br />\nHelp lift up those who have been pushed down.\n<br />\nCounterbalance sexism, racism, and religious discrimination.\n<br />\nFeed the hungry.\n<br />\nBalance justice.\n<br />\nBalance human nature.\n</p><p>\nBy balancing everything in your life, you postpone nothing.\n<br />\nYou won’t postpone happiness, dreams, love, or expression.\n<br />\nYou could die happy at any time.\n</p><p>\nBalancing everything is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b635ae1f5a3ade32cd94ad23b3bad7ba3a1eb2c03f97dce2b79a9de822ec1bf6","category":"Sites"}