{"title":"Mastery school","link":"https://sive.rs/masch","date":1571875200000,"content":"<p>\nHere’s an idea:\nCreate a little school somewhere remote.\nSchool of what?\nSchool of mastery.\n</p><p>\nA place for anyone who wants go focus on a skill of their choice, surrounded by other people doing the same, and a few coaches — experts on the craft of mastery — to offer help and guidance.\n</p><p>\nThis uses <a href=\"https://www.ted.com/talks/salman_khan_let_s_use_video_to_reinvent_education\">Salman Khan’s proposal</a> to “flip the classroom” so that the <strong>core of learning is done in independent study, using online materials</strong>.\n</p><p>\nSince the teachers are all online, the local coaches just help guide each student’s path to mastery.\nThere are many great books on this subject, like…\n</p><ul>\n<li><a href=\"https://sive.rs/book/TalentCode\">Talent Code</a></li>\n<li><a href=\"https://sive.rs/book/Mastery\">Mastery</a></li>\n<li><a href=\"https://sive.rs/book/AtomicHabits\">Atomic Habits</a></li>\n<li><a href=\"https://sive.rs/book/ArtOfLearning\">Art of Learning</a></li>\n<li><a href=\"https://sive.rs/book/PeakPerformance\">Peak Performance</a></li>\n<li><a href=\"https://sive.rs/book/TalentIsOverrated\">Talent is Overrated</a></li>\n<li><a href=\"https://sive.rs/book/Overachievement\">Overachivement</a></li>\n<li>and <a href=\"https://sive.rs/book/Peak\">Peak</a>.</li>\n</ul><p>\nSo you can see how the general skill of guiding and coaching talent, in any field, could be the best focus of the on-site staff.\n</p><p>\nThe school should be located somewhere that fits with the story we tell ourselves about going away to focus.\nSomewhere that’s a desirable location, yet still somewhere with income inequality, where a school bringing a little business and fast fiber internet to a remote location would be appreciated.\nAll the staff except the coaches could come from the local community.\n</p><p>\nSome shared resources like a good camera and microphone, a few computers, a video library to save bandwidth, and a chef making meals for everyone.\n</p><p>\nI imagine this could be as small and simple as a big house in the country, or a few cabins nearby.\n</p>\n<h3>Why attend?</h3>\n<ol><li>\nTo get away somewhere you can focus without distraction — a show of dedication and focus\n</li><li>\nTo be around other serious focused learners, inspiring eachother\n</li><li>\nTo have the help of coaches that are great at helping anyone learn anything.\nThey are experts in the skill of practice, learning, and mastery.\n</li></ol><p>\nSo, you go there to work on your thing, whatever it is.\n</p><ul><li>\nYou learn from online materials, books, and whatever it takes.\n</li><li>\nYou practice and create as much as possible.\n</li><li>\nYou're surrounded by kindreds and assistance.\n</li></ul>\n<img src=\"/images/masch.jpg\" alt=\"school\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"b77e5f3bec13f8481ccdf8ed294da753fdc0816470bcbcd8e0608a2819a8f486","category":"Sites"}