{"title":"TikTok Is For Millennials, It Turns Out","link":"https://www.garbageday.email/p/tiktok-millennials-turns","date":1708976002000,"content":"<div><div><h2>TikTok Is Aging More Than You Think</h2><p>My researcher Adam and I have been digging into some extremely interesting <a href=\"https://www.pewresearch.org/internet/2024/01/31/americans-social-media-use/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">TikTok data</a> that was <a href=\"https://www.pewresearch.org/internet/2024/02/22/how-u-s-adults-use-tiktok/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">published </a>recently by <i>Pew Research Center</i>. It gives us the clearest look yet at how Americans are using TikTok and what they’re seeing on it. And perhaps the biggest revelation is that the app isn’t quite the teen homepage we assume it is.</p><p>According to <i>Pew</i>’s survey, which was conducted in September of last year, there was a 14% increase in users aged 18-30 on TikTok since 2021, which was the last time <i>Pew</i> pulled numbers for the app. Some of this is natural — a user makes an account as a teenager and ages alongside the platform. But if you compare TikTok to other once-buzzy youth-oriented apps, however, you start to realize that TikTok is aging quite a bit.</p><p>To get a better sense of where TikTok stands in the past and present of social media we dug through all of <i>Pew</i>’s previous surveys about social media usage. They date all the way back to 2005, when they still called it “social networking” and were asking about sites like <a href=\"https://www.youtube.com/watch?v=7mFJdOsjJ0k&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">Friendster</a>. There aren’t exhaustive, mind you, but they provide some much needed context here. The closest analogue we found, in terms of demographics, is Instagram around 2014.</p><p>We made a chart. </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/49aea494-f1e1-4c44-abf7-1ff3cb85c5d4/TVI_chart.jpg?t=1708963133\" /></div><p>Between 2013 and 2014, <i>Pew</i> recorded a 16% increase in users aged 18-29 on Instagram. It’s actually the biggest demographic jump of a social network they’ve ever recorded. So if you’re still looking for the year Instagram stopped being cool, it turns out it was about a year after the photo app was purchased by Facebook.</p><p>Instagram’s 16% jump in one year is a bit more extreme than TikTok’s 14% jump from 2021-2023, but they’re pretty close. And it makes sense that these two platforms would be aging somewhat similarly. Both are walled gardens of visual content that only really work on mobile. They’re both also owned by enormous conglomerates that have spent years defending themselves to both the press and the US government. Though, it took Instagram four years to lose its cool, while TikTok has held on to its status as the Hot New App for almost a decade. But that’s clearly changing.</p><p>According to <i>Pew</i>, there are actually less young people on TikTok right now than there were on Instagram in 2014. Almost 40% of TikTok users are in their 30s and 40s. In 2014, that same age group (which we are trying not to refer to as middle-aged) accounted for only about 20% of Instagram users. Even crazier, according to <i>Pew</i>'s survey, people aged 35-49 are more likely to actually upload videos than people aged 18-34. And, perhaps most damning of all, TikTok’s 30-49 demographic is actually growing faster than the 18-34 cohort.</p><p>This would also likely explain why TikTok is suddenly trying to pivot to, well, everything under the sun. It’s promoting long-form content, horizontal videos, e-commerce, and even a proper search engine. Because half of TikTok users don’t even post anything, according to <i>Pew</i>. This is the same kind of enshittification that Instagram began leaning into when its users started aging. Instagram added a Stories feature in 2016 to compete with Snapchat and, in 2020, it, of course, launched Reels to compete with TikTok. Because as your users get older, the game becomes more about keeping the ones you have rather than attracting new ones.</p><p>We’ve been fretting over the lives of young people since the concept of a teenager <a href=\"https://time.com/3639041/the-invention-of-teenagers-life-and-the-triumph-of-youth-culture/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">was first invented</a> almost a century ago. But with advent of social media this has become a full-on obsession, thanks in large part to brands and marketers desperately trying to mine them as a resource of ineffable coolness. </p><p>Millennials, in particular, were so over-scrutinized that entire global market movements were being blamed on their affinity for <a href=\"https://knowyourmeme.com/memes/avocado-toast?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">avocado toast</a>. And as they aged, this popular notion of the annoying young millennial hasn’t gone away. It’s a common <a href=\"https://twitter.com/stillnotmixxed/status/1737341510381666728?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">complaint</a> that even though most estimates put the oldest millennials at in their early 40s right now, they’re still getting blamed for everything young people are doing. But there’s a surprising amount of evidence that most Gen Z culture is actually just millennial culture. Almost half of TikTok users are over 30. The average Shein customer is <a href=\"https://www.businessinsider.com/shein-shoppers-say-they-are-environmentally-conscious-2023-12?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">35 years old</a>. More than half of Taylor Swift’s fans <a href=\"https://www.abc.net.au/news/2024-02-18/why-are-so-many-taylor-swift-fans-middle-aged/103457252?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">are over 35</a>. And one of Temu’s biggest demographics <a href=\"https://www.dwell.com/article/temu-victims-moms-super-bowl-ads-93e0418e?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">is moms</a>. In the ultimate act of millennial narcissism, they are now just writing trend pieces about themselves and projecting it onto young people.</p><p>The way trends and subcultures work now is clearly different, but we’re still learning how to express that. Chances are we won’t really get a good sense of what Gen Z is like until they, themselves, are in their mid-30s, beginning to shape society around them. But in the meantime, it’s probably smart to not assume that the kids are the ones responsible for whatever new weird thing is on your FYP. Those videos are probably being made by weird adults.</p><p><i>Adam Bumas contributed to the research and reporting for this essay.</i></p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/cc43ed00-ac3f-4795-b17a-bd5c534904ae/TPF_Logo_Black.png?t=1708950661\" /></div><p>Content is a garbage word, but your company's content doesn't have to stink.</p><p><a href=\"https://www.threepointfourmedia.com/?utm_source=GarbageDay&amp;utm_medium=email&amp;utm_id=1023\" target=\"_blank\">Three Point Four Media</a> is your solution. We work with organizations large and small to hone their story, envision and write thought leadership, develop and produce podcasts, create and design case studies and white papers, strategize and film video series, make magazines and annual reports, and more. You'll work directly with our co-founders and our skilled roster of project-appropriate freelance talent, solving all your content needs. </p><p><a href=\"mailto:info@threepointfourmedia.com\" target=\"_blank\">Let's chat</a>.</p><hr /><h2>The Current Speed Of A Meme</h2><p>Nowadays, there aren’t a lot of good ways to understand what’s happening online, aside from just being online all of the time. Which I try to do, but, you know, I have to eat and sleep and, occasionally, see my friends and family. So I miss stuff. And so, a few weeks ago, I logged on and suddenly saw a lot of memes about coconut trees.</p><p>Instead of trying immediately to figure out what the deal was, I wanted to measure the speed that it would take for the context to reach me naturally. I do this from time to time as a way to take the pulse of the information landscape. If memes get explained away too quickly, they die. If they never get explained, well, no one knows what’s going on. Which is also bad.</p><p>And it took over two weeks for me to find out what the coconut tree meme was referencing.</p><blockquote><p></p><p>\"Now, I would like to talk about your existence, Tucker.\"</p><p>\"Of course. You mean beginning from when I fell out of a coconut tree?\"</p><p>\"No, we will begin with the context, of all in which you live and what came before you.\"</p><p></p><a href=\"https://twitter.com/PritzkerForPrez/status/1756436034206810246?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\"><p> — Socialists For Pritzker (@PritzkerForPrez) <br /> Feb 10, 2024 </p></a></blockquote><p>I know that it started going around a few weeks ago because the Tucker Carlson/Vladimir Putin interview had <a href=\"https://www.politico.eu/article/9-takeaway-vladimir-putin-interview-tucker-carlson/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">just dropped</a> and people were making memes about Putin talking about coconut trees. It seemed too specific for people to just make up — and I certainly wasn’t about to watch that entire awful interview — so I figured it had something to do with Putin’s long, boring history lesson.</p><p>It wasn’t until this weekend, when I happened across a <i>Daily Dot</i> article on Threads that I learned <a href=\"https://www.dailydot.com/debug/kamala-harris-coconut-tree-memes/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">it’s a reference</a> to something Vice President Kamala Harris said??? It comes from an address Harris made last May and it went viral on X a second time in early February. Which is something happening more and more often now that X is pushing evergreen content.</p><p><i>The Daily Dot</i>, in its piece, argued that the coconut tree trend was “the Biden admin’s most iconic meme,” which may be true. But the fact that I, someone who literally browses the internet for a living, didn’t even know it came from someone in the Biden administration, means this sort of content is not making the cultural connections it used to. My assumption is that we now don’t have a layer of digital media publishers aggregating this stuff anymore, so memes just come and go without anyone really documenting them properly. This is bad, I think. Or, at the very least, if that layer of media is never coming back, will require a fundamental rethinking of what memes even are.</p><hr /><h2>Taylor Lorenz Vs. Libs Of TikTok</h2><p>There is a lot of hand-wringing these days about how to interview far-right pundits. This debate usually pops up after someone like Chaya Raichik, the woman behind the Libs Of TikTok account, goes on cable news, says a few prepared lines, gets very little pushback, and goes along her merry way.</p><p>Time and time again, you’ll see mainstream reporters, oftentimes very exasperatedly, demand to know exactly how it should be handled. “How can we responsibly platform these people,” etc. Well, here’s how:</p><p><i>The Washington Post</i>’s Taylor Lorenz interviewed Raichik and it’s perfect. It’s an hour-long unedited conversation with one of the most important — and dangerous — voices in American politics. Lorenz gave Raichik plenty of rope, not just to hang herself, but also to provide a really important look at who Raichik is, as a person. Which, I would argue, is something every good interview should try and do and something that cable news, in particular, cannot, as a medium, actually accomplish.</p><p>As one commenter underneath Lorenz’s video wrote, Raichik is a deeply “unremarkable person” who lived an extremely sheltered life before COVID. During lockdown, she was exposed to the most basic, entry-level content from queer creators on TikTok and has, simply, never psychologically recovered. She is American isolation, loneliness, and paranoia personified and she has no coherent politics beyond an instinctual disgust of what she doesn’t understand — which is most things.</p><p>Great interview!</p><hr /><h2>The Live Action <i>Avatar </i>Was Basically Shot In 9:16</h2><p>I will not share my feelings about Netflix’s live action <i>Avatar</i> remake because I am a 34-year-old man and my opinions about a children’s cartoon simply do not matter. But I will, however, point out something about the live action remake that I think is an important link back to today’s top essay about over-indexing of TikTok as a platform for young people.</p><p>About a third of the way through watching the live action <i>Avatar</i> I started to noticing that it felt weird. At first, I thought it was the CGI backdrops, which vary in quality. Then I thought it was the costumes, which range from fine to cosplay-quality. And, finally, I thought it was a combination of the young, inexperienced actors and hyperactive pacing. And while all of those things are issues, there was actually something much stranger going on. See if you notice it in the trailer below.</p><p>I’d estimate about 80% of the show, and close to 100% of the final episodes, takes place in the direct center of the frame. And if there is any movement happening on screen, it’s happening within a 9:16 aspect ratio. Which is the aspect ratio for TikToks, Reels, and Shorts.</p><p>It’s way too prevalent to be an accident and I have to imagine its to make clips easier to share. Though, I’m not clear where in the production stack this decision is being made. Netflix blocks screen recordings and makes their own assets for social, so they don’t really need it. But perhaps the show’s production team did it this way with the hopes that young people would bootleg clips and make it go viral? Either way, it’s genuinely headache-inducing. </p><p>Plus, seeing as we now know the majority of TikTok content is being shared by millennials, it’s probably not as smart of a strategy for capturing Gen Z (and younger) viewers as you might think. If you really want to make your show a big hit with young people, you should just stream it inside of Roblox or organize all of the shots by color and them into a YouTube playlist to hypnotize babies or something.</p><hr /><h2>r/Wallstreetbets Users Want To Short Reddit’s IPO</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/3841433b-b0ba-4dc2-9dee-34b980a94820/Screenshot_2024-02-26_at_3.46.50_PM.png?t=1708973224\" /><div><span><p>(r/wallstreetbets)</p></span></div></div><p>This is a fun one. r/wallstreetbets really wants to short the Reddit stock when it goes public. <i>The Verge</i> <a href=\"https://www.theverge.com/2024/2/24/24081441/reddit-shares-redditor-ipo-user-risk?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">has a great piece</a> rounding up some of the chatter on the board right now. So you don’t actually have to go over there and read it in its natural habitat.</p><p>While we’re talking about Reddit’s death spiral btw, the new desktop redesign has made the site unusable. Excited to see what new horrors await us as we get closer to Reddit hitting the stock market next month.</p><hr /><h2>An Interesting Letterboxd List</h2><blockquote><p></p><p></p><p></p><a href=\"https://twitter.com/letterboxdauras/status/1761423877303922725?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\"><p> — letterboxd reviews with threatening auras (@letterboxdauras) <br /> Feb 24, 2024 </p></a></blockquote><hr /><div><h2><span><b>Think About Supporting Garbage Day!</b></span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\"><span> Upgrade </span></a></div><hr /></div><h2><b>Some Stray Links</b></h2><ul><li><p><a href=\"https://www.newstatesman.com/culture/2024/02/disney-adult-superfan-industrial-complex?utm_source=pocket_saves\" target=\"_blank\">“The ‘Disney adult’ industrial complex”</a></p></li><li><p><a href=\"https://www.vanityfair.com/news/amie-parnes-jimmy-finkelstein-the-messenger?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">“How Jimmy Finkelstein Wooed Me to </a><a href=\"https://www.vanityfair.com/news/amie-parnes-jimmy-finkelstein-the-messenger?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\"><i>The Messenger</i></a><a href=\"https://www.vanityfair.com/news/amie-parnes-jimmy-finkelstein-the-messenger?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">—And Left Me High and Dry”</a></p></li></ul><hr /><p><span>P.S. here are </span><span><a href=\"https://www.tiktok.com/@wisdm8/video/7339289254163402030?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">some </a></span><span><i><a href=\"https://www.tiktok.com/@wisdm8/video/7339289254163402030?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\">Avatar: The Last Airbender</a></i></span><span><a href=\"https://www.tiktok.com/@wisdm8/video/7339289254163402030?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=tiktok-is-for-millennials-it-turns-out\" target=\"_blank\"> outfits that go hard as hell</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=b390599a-b558-477f-9f55-1841fcd9839b&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"b8a0ef85708cdafaddefd630c6c165a8b67d56b781396535e746d7890506d8d3","category":"default"}