{"title":"The Consolations of Chronodiversity: Geologist Turned Psychologist Ruth Allen on the 12 Kinds of Time and How to Be More Fully Alive","link":"https://www.themarginalian.org/2024/09/18/chronodiversity/","date":1726683701000,"content":"<p><a href=\"https://www.amazon.com/Weathering-Ruth-Allen/dp/1529902630/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"490\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?fit=320%2C490&amp;ssl=1\" alt=\"The Consolations of Chronodiversity: Geologist Turned Psychologist Ruth Allen on the 12 Kinds of Time and How to Be More Fully Alive\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?w=980&amp;ssl=1 980w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=320%2C490&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=600%2C918&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=240%2C367&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=768%2C1176&amp;ssl=1 768w\" /></a></p><p>“I prefer the time of insects to the time of stars,” Nobel laureate Wisława Szymborska wrote in her lovely poem <a href=\"https://www.themarginalian.org/2015/03/18/amanda-palmer-wislawa-szymborska-possibilities-poem-reading/\">“Possibilities.”</a> Our preferences, of course, hardly matter to time — we live here suspended between the time of insects and the time of stars, our transient lives bookended by not yet and never again. Time baffles us with its elasticity, the way it <a href=\"https://www.themarginalian.org/2013/07/15/time-warped-claudia-hammond/\">slows down when we’re afraid and speeds up as we age</a>. It harrows us with its stagnancy, the way <a href=\"https://www.themarginalian.org/2024/08/27/adam-phillips-better-waiting/\">waiting twists the psyche</a>. It haunts us with its <a href=\"https://www.themarginalian.org/2024/01/30/time-and-the-soul-needleman/\">demand for meaning</a>. Time is the breath in the lungs of life, the marrow in the skeleton of space, <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">the substance we are made of</a>: “Time is a river which sweeps me along,” Borges bellows down the hallway of eternity, “but I am the river; it is a tiger which destroys me, but I am the tiger; it is a fire which consumes me, but I am the fire.”</p>\n<p>But while we have no control over time itself, we do have a choice in how we orient to it, how we inhabit the moment, how we own the past and open to the future — a choice that shapes our entire experience of life, that ossuary of time. And just as it bears remembering that <a href=\"https://www.themarginalian.org/2018/11/01/figuring/\">there are infinitely many kinds of beautiful lives</a>, it bears remembering that there are infinitely many ways of being in time. </p>\n<p>In her altogether wonderful book <a href=\"https://www.amazon.com/Weathering-Ruth-Allen/dp/1529902630/?tag=braipick-20\" target=\"_blank\"><strong><em>Weathering</em></strong></a> (<a href=\"https://search.worldcat.org/title/1436928502\" target=\"_blank\"><em>public library</em></a>), geologist turned psychotherapist Ruth Allen explores some of them as different ways of anchoring into our own existence. </p>\n<figure><a href=\"https://www.themarginalian.org/2016/10/20/time-is-when-gleick/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/10/timeiswhen_gleick2.jpg\" /></a><figcaption>Art by Harvey Weiss from <a href=\"https://www.themarginalian.org/2016/10/20/time-is-when-gleick/\"><em>Time Is When</em></a> by Beth Youman Gleick</figcaption></figure>\n<p>A generation after Paul Goodman taxonomized <a href=\"https://www.themarginalian.org/2015/01/13/paul-goodman-silence/\">the nine kinds of silence</a>, Allen taxonomizes the kinds of time in a celebration of what she calls <em>chronodiversity</em>:</p>\n<blockquote><p>Time is so diverse, and experienced so differently between subjects in the present, that any prolonged effort to constrain what time is falls apart. There is the time of insects who live no more than a day, and the time of tortoises that outstrip our own. There is the time that for me is saved, but for you wasted. There is the time that can never be equal in an unequal world, where you can relax and I have to work or vice versa. There is the time we experience in chronological order (or <em>chronos</em>) but there is also the qualitative experience of “everything in its own time” time in the moment (or <em>kairos</em>). There is time as it is experienced at altitude, which is different from time at sea level, and there is the time that shifts and bends with longitude. There is the slow time of youth when ideas and experiences are rushing clear and fast like spring water, creating an endless and expansive present, and Christmases that never come, and the fast time of elderhood when a lack of novelty speeds life up, racing forward like an arrow to a target without hesitation or deviation. There is the time of our psychological experience, the relative time of Einstein, and now also an entropic time rooted in what physicist Carlo Rovelli calls our “quantum ignorance.” “When we have found all the aspects of time that can be spoken of, then we have found time,” Rovelli declares. For now, then, we do not know time.</p></blockquote>\n<figure><a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=680%2C728&amp;ssl=1\" width=\"680\" height=\"728\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=320%2C342&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=600%2C642&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=240%2C257&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=768%2C822&amp;ssl=1 768w\" /></a><figcaption><em>Discus chronologicus</em> — a German depiction of time from the early 1720s. (Available as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_wall-clock?curator=brainpicker\" target=\"_blank\">a wall clock</a>.)</figcaption></figure>\n<p>Drawing on the work of Marcia Bjornerud — another <a href=\"https://www.themarginalian.org/2024/08/17/turning-to-stone-marcia-bjornerud/\">uncommonly insightful geologist</a> — and her concept of <em>timefulness</em>, Allen considers how living into and between these different kinds of time can help us be more fully alive and more meaningfully connected (which is, in the end, the only thing that redeems our mortality). She adds:</p>\n<blockquote><p>Time is not a resource we have for cashing in. True <em>timefulness</em>… is to live in awareness of the dynamic and unpredictable array of times that co-exist within one life, as well as the intersubjective nature of time between all individuals. To live it well, we may need to break the temporal norms altogether and finally come to terms with time as entirely relational and contingent upon each other in specific and localised ways. In this way, time becomes unique among individuals who co-create its meanings and who give it vibrancy and liveness through their interaction with each other.</p></blockquote>\n<p>Dive deeper — into the subject and into the body of time itself — with <a href=\"https://www.themarginalian.org/2022/12/13/time/\">200 years of reflections on time</a> from some of humanity’s greatest minds, from Kierkegaard to Nina Simone, then savor the lovely vintage children’s book <a href=\"https://www.themarginalian.org/2016/10/20/time-is-when-gleick/\"><em>Time Is When</em></a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"b93718c10a68d3ec4b5931bac62e5a2eaad9e12f4b7b8bbbebe3eeac032d8115","category":"Sites"}