{"title":"Things Become Other Things: A Walking Memoir","link":"https://kottke.org/24/08/things-become-other-things-a-walking-memoir","date":1724787468000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mod-tbot-cover.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/mod-tbot-cover.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mod-tbot-cover.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"1950\" alt=\"the cover for Things Become Other Things: A Walking Memoir by Craig Mod\" /></p>\n\n<p>My pal Craig Mod has a book coming out in May 2025 called <a href=\"https://www.amazon.com/exec/obidos/ASIN/0593732545/ref=nosim/0sil8\">Things Become Other Things: A Walking Memoir</a>. Here’s part of the synopsis:</p>\n\n<blockquote><p>Photographer and essayist Craig Mod is a veteran of long solo walks. But in 2021, during the pandemic shutdown of Japan’s borders, one particular walk around the Kumano Kodo routes — the ancient pilgrimage paths of Japan’s southern Kii Peninsula — took on an unexpectedly personal new significance. While passing the peninsula’s shrinking villages, Mod found himself reflecting on his own childhood in a post-industrial American town, his experiences as an adoptee, his unlikely relocation to Japan as a student at age nineteen, and his relationship with one lost friend, whose life was tragically cut short after their paths diverged. As the days passed, he considered why he has walked so rigorously and religiously during his twenty-five years as an immigrant in Japan, contemplating the power of walking itself. For Mod, solo walks are a tool to change the very structure of his mind, to better himself, and to bear witness to a quiet grace visible only when “you’re bored out of your skull and the miles left are long.”</p></blockquote>\n\n<p>The way Craig has gone about writing and publishing this book is unique. In November 2023, he published <a href=\"https://shop.specialprojects.jp/products/things-become-other-things-1st-ed/\">an exquisitely designed fine art edition</a> with color photography, limited to 2500 copies (of which ~900 remain), and priced at $100. The mass market version, published by Random House, is an expanded version of the fine art edition retailing for $31 ($15 on Kindle). <a href=\"https://craigmod.com/books/things_become_other_things/\">Craig explains</a>:</p>\n\n<blockquote><p>Wait? Didn’t you already publish this book in November 2023? Yes! Yes we did! (Where we = me, Craig.) That was the fine art edition. Limited in quantity. Printed and bound in Japan, in full color on Heidelberg presses with a silk screened and foil stamped cover. Retailing for $100. This Random House edition is a significant expansion of that fine art edition — more than double the length in text with a dozen additional photographs. There is so much more context about me and my relationship to Japan, and more Japanese historical context as well. The Random House edition is printed and bound as a standard trade hardcover (and retails for $31 USD), with images printed in black and white. I’m tempted — almost! — to call them different books that emerged from the same source material.</p></blockquote>\n\n<p>It’ll be fascinating to see how this plays out.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Craig%20Mod\">Craig Mod</a> · <a href=\"https://kottke.org/tag/Things%20Become%20Other%20Things\">Things Become Other Things</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/08/things-become-other-things-a-walking-memoir\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"bb05e0b8df5a166ec38aa6d0f6af75e8b108e4c7464d31780a7cbe6a0d6b624b","category":"default"}