{"title":"The Trailer for Francis Ford Coppola&#8217;s Megalopolis","link":"https://kottke.org/24/05/the-trailer-for-francis-ford-coppolas-megalopolis","date":1715793089000,"content":"\n        <p></p>\n\n<p>Francis Ford Coppola has been making Megalopolis since 1983 and <a href=\"https://www.hollywoodreporter.com/movies/movie-news/megalopolis-trailer-francis-ford-coppola-1235898367/\">has self funded it</a> “in part by the sale of a significant portion of the director’s wine empire”. But the trailer is finally here and it premieres at Cannes in two days’ time. Here’s a synopsis shared by Coppola himself:</p>\n\n<blockquote><p>A man balances precariously on a ledge high above a once-grand city in the opening scene of Francis Ford Coppola’s MEGALOPOLIS, and the movie that follows is — at least in part — about an entire civilization teetering on a similarly precarious ledge, devouring itself in a whirl of unchecked greed, self-absorption, and political propaganda, while a few bold dreamers push against the tide, striving to usher in a new dawn. The man is called Caesar (Adam Driver), like the Roman general who gave rise to the Roman Empire, Cesar the labor leader who organized California’s farm workers in the 1960s, and a few other notably great men of history. But he is also clearly an avatar of Coppola himself — a grand visionary witnessing a once-great thing (call it cinema if you must) withering before his very eyes and determined to revivify it. And, after decades of planning, MEGALOPOLIS the movie is the powerful elixir he has produced: a sweeping, big-canvas movie of provocative ideas and relentless cinematic invention that belies its maker’s 84 years of age.</p>\n\n<p>Coppola seems to have been born-again by a strike of filmic lightning, and the movie — no, the experience (complete with in-theater “live cinema”) — that has emerged feels at once the work of a film-school wunderkind unbowed by notions of convention, but also the work of a wizened master who knows much about life and the ways of the world. To paraphrase Coppola himself speaking decades ago about his APOCALYPSE NOW, MEGALOPOLIS isn’t a movie about the end of the world as we know it, it is the end of the world as we know it. Only, where APOCALYPSE left us in a napalm-bombed fever-dream haze, MEGALOPOLIS, surprisingly and movingly, bestows on us a final image glowing with hope for the future.</p></blockquote>\n\n<p>You should also watch this clip of the film shared by Coppola, which reveals another aspect of the story:</p>\n\n<p></p>\n\n<p>This is either going to be amazing or a beautiful disaster, but either way I’m excited to see it…if they can find someone <a href=\"https://www.hollywoodreporter.com/movies/movie-news/megalopolis-francis-ford-coppola-challenges-distribution-1235867556/\">to distribute the film</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Francis%20Ford%20Coppola\">Francis Ford Coppola</a> · <a href=\"https://kottke.org/tag/Megalopolis\">Megalopolis</a> · <a href=\"https://kottke.org/tag/movies\">movies</a> · <a href=\"https://kottke.org/tag/trailers\">trailers</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/the-trailer-for-francis-ford-coppolas-megalopolis\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"bc24aed5378d31b37dea4f9828bde566065c3bb5132a141e28d94e63ffdcc460","category":"default"}