{"title":"Honing Life on the Edges of the Possible: Geologist Turned Psychoanalyst Ruth Allen on Boundaries and Limits as Frontiers of Transformation and Growth","link":"https://www.themarginalian.org/2024/08/22/weathering-ruth-allen/","date":1724368891000,"content":"<h3>“At almost every conceivable level of our imagining, it is impossible to create a change without a discontinuity, without a moment of not knowing who we are, or what we are going to become. Rupture precedes revolution.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Weathering-Ruth-Allen/dp/1529902630/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"490\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?fit=320%2C490&amp;ssl=1\" alt=\"Honing Life on the Edges of the Possible: Geologist Turned Psychoanalyst Ruth Allen on Boundaries and Limits as Frontiers of Transformation and Growth\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?w=980&amp;ssl=1 980w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=320%2C490&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=600%2C918&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=240%2C367&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/Weathering_RuthAllen.jpg?resize=768%2C1176&amp;ssl=1 768w\" /></a></p><p>It takes a great sobriety of spirit to know our depths and our limits, to know where we end and the rest of the world begins. And it is often at the edges, those boundary regions between one state of being and another, that we fathom ourselves, that we grow most alive — after all, life itself began in Earth’s tide pools, that fertile boundary between the depths of the ocean and the limits of the land. </p>\n<p>The vital interplay between boundaries and growth, the catalytic function of limits, the way we hone our lives on the edges of the possible, is what geologist turned psychotherapist Ruth Allen explores in her uncommonly wonderful book <a href=\"https://www.amazon.com/Weathering-Ruth-Allen/dp/1529902630/?tag=braipick-20\" target=\"_blank\"><strong><em>Weathering</em></strong></a> (<a href=\"https://search.worldcat.org/title/1436928502\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>Looking back to her unusual pivot of purpose, Allen finds in the realities of the physical world a poignant metaphor for the life of the psyche:</p>\n<blockquote><p>Mountains can only be maintained because they are also places of vast removal. Through a process called isostacy, uplands and mountains accumulate material, making them heavier, and then weather and erode to become lighter again, causing crust to rebound as the earth maintains its balance, which it must do. Upland areas that are still uplifting, such as the Peak District, are doing so precisely because of the erosion that is constantly unburdening the land of their material. In short, stuff must be lost for everything to keep rising. This tells me two fundamental truths: one, that in order to evolve and grow, we must be prepared to face the erosive aspects of life. Two, it’s the weathering that creates the finest landscape of our lives, shaping us and defining us over time.</p>\n<p>[…]</p>\n<p>Instead of understanding the erosion rates of rock, I became more enthralled by what weathers a person, and what if anything can be done about that. What happens when the earth is shaken under our feet, undermining the foundations of everything we have known? How do we live with (or even close) the fault lines that open through trauma? How do we negotiate erosive and accumulative periods over time? What would it really mean to weather well?</p></blockquote>\n<figure><a href=\"https://society6.com/product/chart-from-geographical-portfolio-by-levi-walter-yaggy-1887_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=680%2C458&amp;ssl=1\" width=\"680\" height=\"458\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=320%2C216&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=600%2C405&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=240%2C162&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/06/yaggi_geological_sm.jpg?resize=768%2C518&amp;ssl=1 768w\" /></a><figcaption>Geological strata from <em>Geographical Portfolio</em> by Levi Walter Yaggy, 1887. (Available <a href=\"https://society6.com/product/chart-from-geographical-portfolio-by-levi-walter-yaggy-1887_framed-print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>It is often at the fault lines where we rupture that we repair ourselves into a new and stronger way of being. In a sentiment that touches on <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">the fundamental paradox of personal change</a>, Allen writes:</p>\n<blockquote><p>At almost every conceivable level of our imagining, it is impossible to create a change without a discontinuity, without a moment of not knowing who we are, or what we are going to become. Rupture precedes revolution.</p></blockquote>\n<p>Rupture redefines our limits, remaps the boundaries of our self-knowledge, redraws the edge of the possible. And yet we recoil at the very notion of it, wired as we are for the safety of stasis. Allen considers our cognitive dissonance about these transformative regions of being:</p>\n<blockquote><p>As humans, we have a confused relationship with edges, boundaries and limitations, which can be seen as one and the same thing, unified paradoxically by their dividing potential… We seek them even when, as a psychological or relational construct, we recoil from their necessity, and will often find ourselves drawn to and entranced by the water’s edge: the shifting line between sand and sea, the horror of the cliff’s edge. Our pull towards edges is magnetic, our playfulness around them notable. We are compelled to edges, boundaries and limits, like an intrusive thought that we don’t want but can’t resist going towards… Edges are, in some ways, an embodiment of the core dilemma about how to live, and how to live under the spectre of death. Boundaries say <em>here is OK, but beyond is the insistent abyss, and I am curious about that</em>. Limits give us a place to challenge ourselves and triumph over. They provide an opportunity for growth, where going beyond a limit can test our courage, expand our hitherto unknown ability, and consolidate our resilience for yet another new horizon that appears as we pass through what’s now behind us. In short, edges are frontiers where we find ourselves.</p></blockquote>\n<p>They are also often where we find each other — the most transformative relationships create a Venn diagram of boundaries, take place at the edge between who we thought we were and who we can be, shifting that edge. Sam Shepard knew this when he <a href=\"https://www.themarginalian.org/2017/08/03/sam-shepard-on-love/\">reflected on love</a>: “There can be a real meeting between two people at the point where they always felt marooned. Right at the edge.” Allen agrees:</p>\n<blockquote><p>In the overlap between people’s boundaries there is potential for interesting meetings and the potential for collapses.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/OfraAmit_5DarkMatter.jpg\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a> book</figcaption></figure>\n<p>That dual potential has to do with the nature of boundaries as the edge between the known and the unknown, between safety and risk. Defining a boundary as “a change point — a moment in space and time when what was no longer is, and a new state is emerging,” Allen writes:</p>\n<blockquote><p>Being alive in any meaningful sense is a balance of feeling and staying safe, and taking and overcoming risks. In safety, we have a vital place to rest, be comfortable and build the foundations of a life, and through risk we are expanded and grown… It is through taking risks that we expand our safety – widening the boundaries and limitations of our existence into ever-broadening and rich terrains… In therapy… pushing our psychological and emotional limits in creative ways. Real and effective trauma work is about carefully restoring the inner grounds of self-trust and trust-in-world, increasing our capacity for risk, not striving to make the world safe.</p></blockquote>\n<p>And yet at the heart of self-trust is knowing and honoring our limits — those safety valves between self and world. (This is why some of the most unsafe people to be in relationship with are people not aware of their own limits.) Allen writes:</p>\n<blockquote><p>Limits may slow us down long enough to breathe in what we already have, but they do not reduce meaning. In some cases, they may generate more. We’re not designed to be at capacity all the time, endlessly stimulated by activities, saturated in tasks to tick off… To remind ourselves of our limits is a kindness.</p></blockquote>\n<p>The great payoff of knowing the boundaries of our being is the wise discrimination of knowing when and whether to push them in order to grow. In another poignant geological analogy, Allen writes:</p>\n<blockquote><p>Reaching our boundaries is not the same as limiting our growth. Sometimes we find our edges and an amazing thing happens; capacity is rebuilt, old wounds are healed and we grow further and more beautifully than before. The process is analogous to mineral growth in rock. Without a surface and a set of containing edges, minerals that we prize for their beauty, function and even healing properties do not have the right conditions to develop. Crystals do not grow in the open, where space is boundless. Where crystals become their most vivid and multi-faceted is where there is containment that gives shape and definition to what is alchemically coming together on the inside. </p>\n<p>We all need a container to hold and ferment the rich potential of our energy and talents — this is the crucible of newness from which all creativity and life flows. </p></blockquote>\n<p>In the remainder of the altogether magnificent <a href=\"https://www.amazon.com/Weathering-Ruth-Allen/dp/1529902630/?tag=braipick-20\" target=\"_blank\"><strong><em>Weathering</em></strong></a>, Allen goes on to explore geology as a lens on grief (“the most raw and frantic way of experiencing the words <em>I love</em>“), ecosomatics (“an emergent nature-based discipline at the intersection between ecology, the environment, and the lived experience of the body”), and other facets of what it means to live in a physical world as a physical being limited by time and flesh, set free by the unlimited potential of the psyche. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"bc7bce6f39e225844d6f5c048da9f16156ed372386fa9192f56ed319efbe593d","category":"Sites"}