{"title":"The Unphotographable: Richard Adams on the Singular Magic of Autumn","link":"https://www.themarginalian.org/2024/10/13/watership-down-autumn/","date":1728828037000,"content":"<p><a href=\"https://www.amazon.com/Watership-Scribner-Classics-Richard-Adams/dp/068483605X/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"486\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?fit=320%2C486&amp;ssl=1\" alt=\"The Unphotographable: Richard Adams on the Singular Magic of Autumn\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?w=988&amp;ssl=1 988w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?resize=320%2C486&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?resize=600%2C911&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?resize=240%2C364&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/watershipdown.jpg?resize=768%2C1166&amp;ssl=1 768w\" /></a></p><p>There is a lovely liminality to autumn — this threshold time between the centripetal exuberance of summer and the season for tending to the inner garden, as Rilke <a href=\"https://www.themarginalian.org/2015/01/12/rilke-letters-to-a-young-woman-winter/\">wrote of winter</a>. Autumn is a living metaphor for the <a href=\"https://www.themarginalian.org/2023/11/21/necessary-losses/\">necessary losses</a> that shape our human lives: What falls away reveals the imperative beneath the superfluous, making what remains all the more precious — the fleeting colors, the fading light, the embering warmth. </p>\n<p>Hardly anyone has captured the singular, <a href=\"https://www.themarginalian.org/tag/unphotographable/\">unphotographable</a> magic of autumn more vividly than <strong>Richard Adams</strong> (May 10, 1920–December 24, 2016) in this passage from his 1973 classic <a href=\"https://www.amazon.com/Watership-Scribner-Classics-Richard-Adams/dp/068483605X/?tag=braipick-20\" target=\"_blank\"><strong><em>Watership Down</em></strong></a> (<a href=\"https://search.worldcat.org/title/879398157\" target=\"_blank\"><em>public library</em></a>), painting “a fine, clear evening in mid-October”:</p>\n<blockquote><p>Although leaves remained on the beeches and the sunshine was warm, there was a sense of growing emptiness over the wide space of the down. The flowers were sparser. Here and there a yellow tormentil showed in the grass, a late harebell or a few shreds of purple bloom on a brown, crisping tuft of self-heal. But most of the plants still to be seen were in seed. Along the edge of the wood a sheet of wild clematis showed like a patch of smoke, all its sweet-smelling flowers turned to old man’s beard. The songs of the insects were fewer and intermittent. Great stretches of the long grass, once the teeming jungle of summer, were almost deserted, with only a hurrying beetle or a torpid spider left out of all the myriads of August. The gnats still danced in the bright air, but the swifts that had swooped for them were gone and instead of their screaming cries in the sky, the twittering of a robin sounded from the top of a spindle tree. The fields below the hill were all cleared. One had already been plowed and the polished edges of the furrows caught the light with a dull glint, conspicuous from the ridge above. The sky, too, was void, with a thin clarity like that of water. In July the still blue, thick as cream, had seemed close above the green trees, but now the blue was high and rare, the sun slipped sooner to the west and, once there, foretold a touch of frost, sinking slow and big and drowsy, crimson as the rose hips that covered the briar. As the wind freshened from the south, the red and yellow beech leaves rasped together with a brittle sound, harsher than the fluid rustle of earlier days. It was a time of quiet departures, of the sifting away of all that was not staunch against winter.</p></blockquote>\n<p>Complement with the poetic ornithologist and wildlife ecologist J. Drew Lanham on <a href=\"https://www.themarginalian.org/2021/09/20/j-drew-lanham-home-place-autumn/\">autumn and the sensual urgency of aliveness</a> and Colette on <a href=\"https://www.themarginalian.org/2016/09/22/colette-autumn/\">the autumn of life as a beginning rather than a decline</a>, then revisit Richard Adams on <a href=\"https://www.themarginalian.org/2024/08/17/penguin/\">moonlight and the magic of the unnecessary</a> and <a href=\"https://www.themarginalian.org/2024/08/17/penguin/\">the penguin as a teacher in patience and faith</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"bcad5cf068dee3ca46cf9a5564cb374626e8d100970d86b14b82a5e37bf0eb59","category":"Sites"}