{"title":"Doors and windows and what’s real","link":"https://sive.rs/dw","date":1561939200000,"content":"<p>\nLike everyone, I live in a little house with many doors and windows.\n</p><p>\nOne door goes out to my neighborhood.\nThe local kids come to play with my dog.\nThe elderly neighbors take so long to tell me their stories.\nI slow down my inner clock to listen.\n</p><p>\nOne window looks out at the nature around me.\nI’m getting to know this one tree really well.\nI toss a little dog food out there each day, and watch the local birds and rodents come by to eat it.\n</p><p>\nOne door is just for my son.\nThis door goes somewhere new every time he opens it.\nI pause what I’m doing and follow him on an adventure.\nMy inner clock stops working through that door.\n</p><p>\nOne door goes to my connections — the people around the world with mutual interests.\nA dozen people a day knock on this door and say hello.\nSometimes more.\n</p><p>\nOne hidden door is for my dearest friends.\nThat one comes all the way inside, anytime.\n</p><p>\nOne skylight looks far into the future.\nI daydream there a lot.\n</p><p>\nOne little locket looks at the past.\nI daydream there, too.\n</p><p>\nBut one door is really no fun to open.\nWhenever I do, I’m horrified at all the shouting.\nIt’s an infinite dark room filled with psychologically tortured people, trying to get attention.\nStrangers screaming at strangers, starting fights.\nBusinesses put windows there, showing bad things said and done today, because they make money when people get mad.\n</p><p>\nThey say I’m supposed to open that door, because that’s the real world.\n</p><p>\nBut it seems a lot less real than what’s in the other doors and windows in my life.\n</p>\n<a href=\"https://www.flickr.com/photos/jocelyn777/47543418731/\"><img src=\"/images/doorswindows.jpg\" alt=\"doors and windows\" /></a>\n<div>“Watching the World Go By” <a href=\"https://www.flickr.com/photos/jocelyn777/47543418731/\">photo by Jocelyn Erskine-Kellie</a></div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"bcefe93a466fdac3729955ea92cb49bd003c4a19a7777e8774fe9d4bf50a51fa","category":"Sites"}