{"title":"The Future of the Operating System&#58; Revisited, Part 1","link":"https://blog.webb.page/2019-06-09-future-of-the-operating-system-revisited-i.txt","date":1560038400000,"content":"<p>Back in 2013<a href=\"https://2016.dsgn.io/thoughts/post/the-future-of-the-operating-system\">1</a> I penned an essay titled, \"The Future of the Operating\nSystem.\" In it, I attempted to predict where the operating system paradigm was\nheaded based on what was obvious to me at the time: cloud services were taking\noff and mobile devices were seeing greater usage than personal computers.\nLogically (to me), this meant the concept of a responsive OS was upon us. Some\nof the cited examples were Firefox OS<a href=\"https://en.m.wikipedia.org/wiki/Firefox_OS\">2</a> and Ubuntu Edge<a href=\"https://en.m.wikipedia.org/wiki/Ubuntu_Edge\">3</a>, products that\nwere both designed to be highly mobile primary computing devices that would\ndock to an apparatus on one's desk to become a full-fledged workstation. The\nessay was also an opportunity to plug my OS in-progress (now dormant),\nhikari<a href=\"https://hikar.io\">4</a>, built around the responsive OS concept.</p>\n<p>For now, a rectangular slab of glass and metal that more or less fits in the\npalm of an adult hand appears to be the preferred format for a mobile\ncomputing device. Specific details and component internals can and will change\nbut the external <em>probably</em> won't change much so no time will be spent talking\nabout that. Instead, I'll go over my favorite UI concepts that inventive minds\nhave created in the half-decade since my inital opus.</p>\n<h2>eDEX-UI<a href=\"https://github.com/GitSquared/edex-ui\">5</a></h2>\n<blockquote>\n<p>eDEX-UI is a fullscreen, cross-platform terminal emulator and system monitor\nthat looks and feels like a sci-fi computer interface.</p>\n<p>Heavily inspired from the TRON Legacy movie effects<a href=\"https://web.archive.org/web/20170511000410/http://jtnimoy.com/blogs/projects/14881671\">6</a> (especially the Board\nRoom sequence<a href=\"https://gmunk.com/TRON-Board-Room\">7</a>), the eDEX-UI project was originally meant to be\n\"DEX-UI<a href=\"https://github.com/seenaburns/dex-ui\">8</a> with less « art » and more « distributable software »\". While\nkeeping a futuristic look and feel, it strives to maintain a certain level\nof functionality and to be usable in real-life scenarios, with the larger\ngoal of bringing science-fiction UXs to the mainstream.</p>\n<p>It might or might not be a joke taken too seriously.</p>\n</blockquote>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-a.png\">eDEX-UI screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-b.png\">eDEX-UI screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-c.png\">eDEX-UI screenshot</a></p>\n<p>The on-screen keyboard suggests the use of this UI on a large touchscreen\ntable (like Microsoft's PixelSense<a href=\"https://en.m.wikipedia.org/wiki/Microsoft_PixelSense\">9</a> or Oblivion's Light Table<a href=\"https://duckduckgo.com/?q=oblivion+table&amp;iax=images&amp;ia=images\">10</a>) or at\nleast the 12\" iPad Pro. Despite what some would consider \"visual noise\", this\nUI has almost everything one would need for text entry and multitasking.</p>\n<p>I personally don't see myself using a UI like this because of limited color\npalette. It looks wonderful for focus though.</p>\n<p>If nothing else, it is fun to look at and pretend you're in a future where\nhoverboards are actually real and not 🤬 batteries on wheels.</p>\n<h2>Desktop Neo<a href=\"https://desktopneo.com\">11</a></h2>\n<blockquote>\n<p>Neo is a conceptual desktop operating system interface that is built for\ntodays people, needs and technologies.</p>\n</blockquote>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-d.png\">Desktop Neo screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-e.png\">Desktop Neo screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-f.png\">Desktop Neo screenshot</a></p>\n<p>This UI is all about fullscreen EVERYTHING. Window manager lovers would be\nso into this (looking at you, /r/unixporn<a href=\"https://www.reddit.com/r/unixporn\">12</a> community). Heck, <em>I</em> am into\nthis! All day every day I am CONSTANTLY resizing/swiping/moving windows\naround.</p>\n<p>The panel concept of this UI is nice and the search functionality sounds like\nsomething I <em>need</em>. I am currently on the beta for macOS Catalina and it\n<em>almost</em> has the concept down but you can only split two windows, max.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-g.png\">macOS Catalina, splitscreen</a></p>\n<p>I do like how productive it makes me feel so maybe I'll become a heavy user of\nit (and hope Apple expands on the feature). Of the UI concepts showcased here,\nDesktop Neo is my favorite.</p>\n<h2>Mercury<a href=\"https://www.mercuryos.com\">13</a></h2>\n<blockquote>\n<p>Mercury is a speculative reimagining of the operating system as a fluid\nexperience driven by human intent.</p>\n</blockquote>\n<blockquote>\n<p>No Apps or Folders. Mercury fluidly assembles content and actions based on\nyour intentions. So you can focus on the destination, not the many ways to\nget there.</p>\n</blockquote>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-h.png\">Mercury screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-i.png\">Mercury screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-j.png\">Mercury screenshot</a>\n📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/future-of-the-os-k.png\">Mercury screenshot</a></p>\n<p>This is interesting because it completely strips away the desktop paradigm and\ncreates something that aims to intuit what you'll do based on previous\ninteractions. Basically, local machine learning to help you be more\nproductive.</p>\n<p>Mercury makes <em>heavy</em> use of shortcuts and search to get around, so this isn't\nthe UI for the faint of heart.</p>\n<p>The mockups show email messages and some neat things around that but nothing\nelse. It'd be interesting to see how a web browser would look. How do I see\nall my apps? The creator of Mercury says there aren't any apps but come on,\nOF COURSE there are.</p>\n<p>I'm excited to see where Mercury heads but for now, it just looks like a nice\nemail app.</p>\n<h2>Thoughts</h2>\n<p>A key issue I have with every UI concept mentioned here (and nearly every one\non the Internet) is the lack of real work being done within them. Outside of\nan email or text prompt, you rarely see how a coder would use it. Or an\nanalyst. Or a designer. Or anyone being productive, period.</p>\n<p>A common thread that brings these concepts together is, <em>focus</em>. Another is\nchange (obviously). After all, the desktop metaphor<a href=\"https://en.m.wikipedia.org/wiki/Desktop_metaphor\">14</a> as we know it was\ncreated in 1970. <em>Nineteen seventy</em>. What you are reading right now was\nwritten in 2019, nearly 50 YEARS later and…not much has changed.</p>\n<p>As I am wont to do, I think about lapsed projects of mine and wonder what\nwould warrant further development. In hikari's case, it doesn't make sense to\nsimply recreate the tried-and-true desktop metaphor. If my aim is to solve\nproblems inherent to a dated paradigm, keeping with the status quo is NOT the\nway to go.</p>\n<p>One of the reasons Apple's iOS is massively popular is because users don't\nhave to think about files and folders, a chief tenant of the desktop paradigm.</p>\n<p>So…where do we go from here?</p>\n<p>I don't pretend to have the answer but I think we're <em>slowly</em> going in the\nright direction. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"bdb77e24cacbb02c1e060aaa989fd59fa34e737e65a7dff830dfa36b5c3c0619","category":"Sites"}