{"title":"What Are the Odds?","link":"https://kottke.org/24/04/what-are-the-odds","date":1712853000000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mouser-eclipse-2024.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/mouser-eclipse-2024.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/mouser-eclipse-2024.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"868\" alt=\"photograph of a total eclipse, showing the solar prominences around the edge\" /></p>\n\n<p>Ok, one last post about the total solar eclipse and then I’m done talking about it. (Maybe.)</p>\n\n<p>There are so many mind-blowing things about eclipses but the one I can’t stop thinking about is the nearly impossible coincidence that the sun and the moon are the same relative size in the sky. If the moon were a little bit smaller or farther away, we wouldn’t have total eclipses where you can look directly at the sun, see the corona, the sky goes dark, you see a sunset effect all around the horizon, etc. That is some spooky magical shit. <a href=\"https://www.threads.net/@tedunderwoodillinois/post/C5gbtaxOdBq\">Ted Underwood put it this way</a>:</p>\n\n<blockquote><p>Random accident that the moon and sun are the same apparent size here. If we had interstellar tourism, this is the One Thing that everyone would know about the Earth, and when they visited they wouldn’t want to see anything else. “We also have museums?” we’d say.</p></blockquote>\n\n<p>The moon is slowly drifting away from the Earth and total eclipses will gradually get rarer and rarer until, hundreds of millions of years from now, they will stop completely.<sup><a href=\"#fn:1712846065\">1</a></sup> That we’re all here right now, getting to experience this magical thing? Like, what?! If a science fiction writer made this up for a story, we’d say it’s too much.</p>\n\n<p>And yet, for me at least, the coincidences don’t stop there.</p>\n\n<p>When I saw <a href=\"https://kottke.org/17/08/my-2017-total-solar-eclipse-trip\">my first total eclipse in 2017</a>, we had to drive for 3.5 hours through three different rainstorms to find some clear skies. When we finally stopped, 40 minutes before totality, it was in a town so small that it’s not even called a town anymore: <a href=\"https://en.wikipedia.org/wiki/Rayville,_Missouri\">Rayville, Missouri</a>. Yep, we found the sun in Rayville. What are the odds?</p>\n\n<p>And then this year, on April 8th, the path of totality went right over my house in Vermont. In the past 70 years in Vermont prior to 2024, it’s been <a href=\"https://www.mynbc5.com/article/cloud-cover-history-in-burlington-on-eclipse-day/46873479\">overcast about 50% of the time</a> and only mostly sunny in 13 of those years. This year? Not a cloud in the sky when I woke up Monday morning.</p>\n\n<p>I watched with a group of people in a big field in Colchester, including my friend Caroline and her dog, Stella (<a href=\"https://en.wikipedia.org/wiki/Stella_(given_name)\">a name derived from the Latin word for star</a>). There were a bunch of other groups watching in the field too and after totality had thrilled us all, they trickled back to their cars and homes. Our group stayed and I watched the last little bit of the moon slip past the sun through my telescope — it was officially over.</p>\n\n<p>A large nearby group of folks with a couple of dogs left shortly after that. One of the dogs came over for a sniff and one of our party asked the guy what the dog’s name was. “Luna.”</p>\n\n<p>And then Luna departed.</p>\n\n<p>Seriously, what are the odds?</p>\n\n<p>Eclipse photo above <a href=\"https://www.flickr.com/photos/mouser-nerdbot/53643828976/\">taken by my friend Mouser</a>, with whom I witnessed the 2017 eclipse. It’s <a href=\"https://www.flickr.com/photos/mouser-nerdbot/53643828976/sizes/5k/\">worth looking at large</a>.</p>\n\n<ol><p><li>I am sure, hundreds of millions of years ago, when the moon was closer to the Earth, total eclipses were a whole other level of whoaaaaa — lasting for 10-20 minutes at a time, completely blocking out any light from the sun, total darkness all around, etc.<a href=\"#fnref:1712846065\">↩</a></li></p></ol>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/2024%20solar%20eclipse\">2024 solar eclipse</a> · <a href=\"https://kottke.org/tag/astronomy\">astronomy</a> · <a href=\"https://kottke.org/tag/science\">science</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/what-are-the-odds\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"bdc483857e60abaa9243f4b1113a1b696f696bc8374d63b05350c6d3fa7fcc10","category":"default"}