{"title":"Billions in profits, millions in fines!","link":"https://om.co/2024/05/04/billion-in-profits-million-in-fines-why-bigcos-dont-care-about-our-data-privacy/","date":1714847826000,"content":"<p>The <a target=\"_blank\" href=\"https://www.fcc.gov/document/fcc-fines-largest-wireless-carriers-sharing-location-data\">FCC has fined</a> four major US wireless companies for illegally selling customer location data, violating the law and consumers’ privacy. The fines total $200 million —$91.6 million for T-Mobile, $57.3 million for AT&amp;T, $36 million for Verizon, and $12.25 million for Sprint (now part of T-Mobile). </p>\n\n\n\n<p>Dozens of third parties ultimately gained access to track the movements of AT&amp;T, Verizon, T-Mobile, and Sprint customers. And the carriers dragged their feet in stopping this practice even after being notified it was likely illegal. The data was originally intended to be used only for emergency services like 911, but it was given to numerous aggregators and third-party location-based service providers. </p>\n\n\n\n<p>While any penalty is good news, the relatively small penalty amounts compared to the carriers’ revenues mean it’s nothing more than a slap on the wrist. This is another example where large telcos and larger companies do not give two hoots. Big companies (especially telcos) have been playing fast and loose with sensitive customer data, prioritizing profits over people. And the reason they keep getting away with is simple — they make billions but have to pay millions — a pittance — as fine. It is a good enough trade. That T-Mobile is top of the list of the companies fined doesn’t really surprise me. </p>\n\n\n\n<p>If we had better constitutional rights that extended to our new digital reality, the companies would perhaps be more careful with data, security, and privacy. I keep writing about this mostly out of frustration. Nothing will change, because there is just too much money at play. I wish the fines exceeded more than the profits of these companies— and maybe just then they will take things a bit more seriously. </p>\n\n\n\n<p>May 4, 2024. San Francisco</p>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/03/31/why-corporations-fail-to-protect-our-data/\">Why Corporations Fail to Protect Our Data</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/04/25/ftc-settles-with-ring/\">You are worth $47. </a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"be32f3f04737b887a9b502a45d9c62d1b858177924be0438fd3233a5ce38899c","category":"default"}