{"title":"LLM’s From Skill to Proficiency","link":"https://ghuneim.com/2024/04/27/llms-from-skill-to-proficiency/","date":1714219123000,"content":"<p><span>Early on, LLMs had a reputation for laziness, often stopping short of a complete answer or list. But that final 10% is crucial – it’s the difference between ‘just okay’ and truly effective, between a rough idea and a tool you can actually use</span></p>\n<p><b>Skill</b><span>: A developed ability to do something well.<br />\n</span><b>Knowledge: </b><span>Theoretical or practical understanding of a subject.<br />\n</span><b>Aptitude: </b><span>A natural ability or talent for acquiring skills and knowledge within a domain.<br />\n</span><b>Mastery: </b><span>Comprehensive or in-depth skill and knowledge in a particular area, indicating a high level of proficiency.<br />\n</span><b>Proficiency: </b><span>The level of competence in a skill or area of knowledge.</span></p>\n<p><span>We have good performance in complex language understanding tasks, language translation, customer support automation and dare I say LLM’s excel at creative content generation.  That said, I am still finding it hard to say we have<strong> continuous proficiency </strong></span></p>\n<p><span>Highlighting what’s missing in an “almost” answer, LLM’s call it a feature and it can help us learn or prompt us to think about something in new ways, this applies well to creative applications but not so much for the other proficiencies listed above. </span></p>\n<p><span>The unspoken truth right now is that LLMs cannot provide 100% proficiency at any task consistently.  </span><span>It is very hard to guarantee complete accuracy or reliability.  LLM’s are probabilistic not authoritative.  </span><span>Factual accuracy, nuanced context and originality in reasoning are  all less then ideal as they are remixes and representing existing information. </span></p>\n<p><span>I believe that LLM’s will remain tools to annotate and augment human domain expertise but never replace it.  There will be improvements through fine tuning and continuous learning and the eventual combining of reasoning tools to better achieve factual accuracy. </span></p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"bea577d19d322624c63edb0a704841239b1e0af57d46d5336465be11d6b6fe34","category":"default"}