{"title":"Get specific!","link":"https://sive.rs/get-specific","date":1519516800000,"content":"<p>\nThis is one of the most useful lessons I’ve learned in life.\n</p><p>\nWhen you don’t know your next step…\n<br />\nWhen you’re feeling unmotivated…\n<br />\nWhen asking someone to help you…\n<br />\nWhen you’re ready to make a dream come true…\n<br />\n<strong>\nGet more specific about what’s needed.\n</strong>\n</p><p>\nThere are two ways to do it:\n</p><p>\n<strong>\n#1: Write down every detail you know.\n</strong>\n</p><p>\nInside your head, there is more than you’ve said.\nTake the time to write it all down.\n</p><p>\nWhen you have a vague or distant goal — like “be a great singer” or “make a million from my music” — break it down into specific ingredients.\nDescribe concrete milestones, and exactly how to reach them.\nThen break those down into actions that you can start doing today.\n</p><p>\nWhen you’re feeling stuck or unmotivated, figure out your next step.\nEven something as simple as finishing a song is easier when you realize exactly what’s wrong.\n</p><p>\nWhen you hire someone to help you, write down absolutely everything you need them to do.\nInclude every detail of every step, and your philosophy too.\n</p><p>\n<strong>\n#2: Research what you don’t know.\n</strong>\n</p><p>\nMost people know what they want, but don’t know how to get it.\nWhen you don’t know the next step, you procrastinate or feel lost.\nBut a little research can turn a vague desire into specific actions.\n</p><p>\nFor example:\nWhen musicians say, “I need a booking agent”, I ask, “Which one? What’s their name?”\n</p><p>\n<strong>\nYou can’t act on a vague desire.\n</strong>\nBut with an hour of research you could find the names of ten booking agents that work with ten artists you admire.\nThen you’ve got a list of the next ten people you need to contact.\n</p><p>\nA life coach told me that most of his job is just helping people get specific.\nOnce they turn a vague goal into a list of specific steps, it’s easy to take action.\n</p><p>\n<strong>\nIt also makes you realize if something was a bad idea.\n</strong>\nMany things only sound nice in theory.\n</p><p>\nSo do this for yourself.\nTake the time to get specific. \nIt helps you and others to take action, and beats procrastination.\n</p>\n<img src=\"/images/footsteps.jpg\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"bed8f8c0b5e290b6a4e85b5946625e21e12ba876c6505515aafff418839580fe","category":"default"}