{"title":"Carl Sagan on Books","link":"https://om.co/2024/11/18/carl-sagan-on-books/","date":1731973028000,"content":"<figure><img width=\"1024\" height=\"768\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-1024x768.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-1024x768.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-300x225.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-768x576.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-1536x1152.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-2048x1536.jpg 2048w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-2000x1500.jpg 2000w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-192x144.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-1100x825.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-560x420.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/do01020415-1-1800x1350.jpg 1800w\" /></figure>\n\n\n\n<p>There seems to be an open season on books. It is such a shame that even the so-called educated people don’t see the bigger picture. Books, in a way, are a means to build on collective human history. Our new-fangled “AI” is the sum of all books, though even its purveyors are not able to grok this reality.</p>\n\n\n\n<p>If not for books, I wouldn’t be where I am. I wouldn’t be who I am. Books teach me about things I don’t know anything about. I can go into the mind of an AI researcher, or I can enjoy the adventures of Hercule Poirot. I can go to Japan, or flip a page and find myself in Patagona. Books are the ultimate time machine. Carl Sagan says it best: </p>\n\n\n\n<blockquote>\n<p>What an astonishing thing a book is. one glance at it and you’re inside the mind of another person maybe somebody dead for thousands of years across the millennia, an author is speaking clearly and silently inside your head, directly to you.</p>\n\n\n\n<p>Writing is perhaps the greatest of human inventions binding together people who never knew each other citizens of distant epochs books break the shackles of time. A book is a proof that humans are capable of working magic.</p>\n\n\n\n<p>If information were passed on merely by word of mouth, how little we should know of our own past, how slow would be our progress. Everything would depend on what we had been told on how accurate the account. Ancient learning might be revered, but in successive retellings it would become muddled and then lost. Books permit us to voyage through time to tap the wisdom of our ancestors.</p>\n\n\n\n<p>A library connects us with the insights and knowledge of the greatest minds and the best teachers drawn from the whole planet and from all our history to instruct us without tiring and to inspire us to make our own contributions to the collective knowledge of the human species.For the price of a modest meal, you get the history of Rome.</p>\n\n\n\n<p>Books are like seeds.They can lie dormant for centuries, but they may also produce flowers in the most unpromising soil. These books are the repositories of the knowledge of our species and of our long evolutionary journey from genes to brains to books.</p>\n\n\n\n<p>Libraries in ancient Egypt bore these words on their walls, nourishment for the soul, and that’s still a pretty fair assessment of what libraries provide. </p>\n</blockquote>\n\n\n\n<p>via <a href=\"https://www.swiss-miss.com/2024/11/carl-sagan-on-books.html\">SwissMiss</a></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"bef39b670557e7a1465224a276199e0fe3ecb44c9d70152e33fe85a8d1aa2998","category":"Sites"}