{"title":"&#8220;Substack Is At It Again&#8221;","link":"https://kottke.org/24/12/substack-is-at-it-again","date":1734546144000,"content":"\n        <p><a href=\"https://www.thehandbasket.co/p/substack-announcement-bari-weiss-free-press\">Marisa Kabas correctly asserts</a> that Substack’s latest announcement reaffirms their status as a publication (and not a platform) and as a place that will publish disinformation and hate under the guise of “free speech”.</p>\n\n<blockquote><p>As we wrote in the Substackers Against Nazis letter, “there’s a difference between a hands-off approach and putting your thumb on the scale.” And by championing Bari Weiss and her worldview, Substack is once again putting its thumb on the scale.</p></blockquote>\n\n<p>But this is the bit that really caught my eye (italics mine…and imagine me pumping my fist as well):</p>\n\n<blockquote><p>Substack has managed to convince some that there is no life for a newsletter beyond them. This is simply untrue.</p>\n\n<p>Since I left Substack for beehiiv in January, I went from making a little bit of money to actually making a living as an independent journalist with my own publication. I didn’t need Substack’s Twitter-esque Notes feature or its recommendation network to grow; I used social networks — mostly Bluesky — to successfully promote my work. <em>That personal engagement created, I believe, deeper relationships with my readers than passive subscriptions via an algorithm.</em> Most importantly, I’ve remained committed to producing work that I’m proud of, and publishing it via a platform that doesn’t force me to compromise my values.</p></blockquote>\n\n<p>Leaving aside all of the arguments about publication vs platform and whether <a href=\"https://www.techdirt.com/2023/04/14/substack-ceo-chris-best-doesnt-realize-hes-just-become-the-nazi-bar/\">Substack is a Nazi bar</a> or not, the unfortunate truth for publications on Substack is that in order to amass the money necessary to recoup the investment pumped into the company by the likes of Andreessen Horowitz (<a href=\"https://www.bloomberg.com/news/articles/2024-10-16/silicon-valley-s-andreessen-horowitz-give-millions-to-trump-pac\">Trump supporting</a> billionaire oligarch wannabes who would ruin anything and everything to make one more dollar), they will continue to wedge themselves in between publications and their readers. And at some point, what you thought of as your publication turns out to merely be a tiny fraction of theirs. As Kabas says:</p>\n\n<blockquote><p>There is no such thing as a perfect place on the internet. But it’s possible to avoid the ones that aren’t even pretending to try to be better. The best time to leave Substack was a long time ago. The second best time is now.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/journalism\">journalism</a> · <a href=\"https://kottke.org/tag/Marisa%20Kabas\">Marisa Kabas</a> · <a href=\"https://kottke.org/tag/Substack\">Substack</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"bf6cef34fbcedbfa42e734152ba1fc6cc75027a1f8555fa9aee9a2e480f85f44","category":"Sites"}