{"title":"John Gardner on the Key to Self-Renewal Across Life and the Art of Making Rather Than Finding Meaning","link":"https://www.themarginalian.org/2024/05/15/gardner-self-renewal-meaning/","date":1715815366000,"content":"<h3>“The potentialities you develop to the full come as the result of an interplay between you and life’s challenges.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Living-Leading-American-Dream-Gardner/dp/0787966789/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?fit=320%2C480&amp;ssl=1\" alt=\"John Gardner on the Key to Self-Renewal Across Life and the Art of Making Rather Than Finding Meaning\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?w=907&amp;ssl=1 907w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?resize=240%2C360&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/gardner_living.jpg?resize=768%2C1152&amp;ssl=1 768w\" /></a></p><p>A person is not a potted plant of predetermined personality but a garden abloom with the consequences of chance and choice that have made them who they are, resting upon an immense seed vault of dormant potentialities. At any given moment, any seed can sprout — whether by conscious cultivation or the tectonic tilling of some great upheaval or the composting of old habits and patterns of behavior that fertilize a new way of being. Nothing saves us from the tragedy of ossifying more surely than a devotion to regularly turning over the soil of personhood so that new expressions of the soul can come abloom. </p>\n<p>In the final years of his long life, former U.S. Secretary of Heath, Education, and Welfare <strong>John Gardner</strong> (October 8, 1912–February 16, 2002) expanded upon <a href=\"https://www.themarginalian.org/2014/07/14/self-renewal-gardner/\">his masterwork on self-renewal</a> in the posthumously published <a href=\"https://www.amazon.com/Living-Leading-American-Dream-Gardner/dp/0787966789/?tag=braipick-20\" target=\"_blank\"><strong><em>Living, Leading, and the American Dream</em></strong></a> (<a href=\"https://search.worldcat.org/title/51854642\" target=\"_blank\"><em>public library</em></a>), examining the deepest questions and commitments of how we become — and go on becoming — ourselves as our lives unfold, transient and tender with longing for meaning. </p>\n<figure><a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=680%2C794&amp;ssl=1\" width=\"680\" height=\"794\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=320%2C374&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=600%2C701&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=240%2C280&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/gosse_metamorphosis_small.jpg?resize=768%2C897&amp;ssl=1 768w\" /></a><figcaption>Butterfly metamorphosis by <a href=\"https://www.themarginalian.org/2021/10/12/gosse-devonshire-coast/\">Philip Henry Gosse</a> from <em>Entomologia terrae novae</em>, 1833. (Available as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/butterfly-metamorphosis-by-philip-henry-gosse-1833_cards\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>With an eye to the mystery of why some people and not others manage to live with vitality until the end, and to the fact that life metes out its cruelties and its mercies with an uneven hand, Gardner writes:</p>\n<blockquote><p>One must be compassionate in assessing the reasons. Perhaps life just presented them with tougher problems than they could solve. It happens. Perhaps they were pulled down by the hidden resentments and grievances that grow in adult life, sometimes so luxuriantly that, like tangled vines, they immobilize the victim. Perhaps something inflicted a major wound on their confidence or their self-esteem. You’ve known such people — feeling secretly defeated, maybe somewhat sour and cynical, or perhaps just vaguely dispirited. Or perhaps they grew so comfortable that adventures no longer beckoned.</p></blockquote>\n<p>Recognizing that the challenges we face are both personal and structural, that we are products of our conditions and conditioning but also entirely responsible for ourselves, he adds:</p>\n<blockquote><p>We build our own prisons and serve as our own jailkeepers… but clearly our parents and the society at large have a hand in building our prisons. They create roles for us — and self-images — that hold us captive for a long time. The individual intent on self-renewal will have to deal with ghosts of the past — the memory of earlier failures, the remnants of childhood dramas and rebellions, the accumulated grievances and resentments that have long outlived their cause. Sometimes people cling to the ghosts with something almost approaching pleasure — but the hampering effect on growth is inescapable.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/12/beforeigrewup10-scaled.jpg\" /></a><figcaption>Art by Giuliano Cucco from <a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><em>Before I Grew Up</em></a> by John Miller</figcaption></figure>\n<p>Of the lessons we learn along the vector of living — things difficult to grasp early in life — he considers the hardest yet most liberating:</p>\n<blockquote><p>You come to understand that most people are neither for you nor against you, they are thinking about themselves. You learn that no matter how hard you try to please, some people in this world are not going to love you, a lesson that is at first troubling and then really quite relaxing.</p></blockquote>\n<p>But no learning is harder, or more countercultural amid this cult of achievement and actualization we live in, than the realization that there is no final and permanent triumph to life. A generation after the poet Robert Penn Warren <a href=\"https://www.themarginalian.org/2017/06/07/robert-penn-warren-democracy-poetry-finding-yourself/\">admonished against the notion of finding yourself</a> and a generation before the psychologist Daniel Gilbert observed that <a href=\"https://www.themarginalian.org/2014/06/18/daniel-gilbert-happiness-future-self/\">“human beings are works in progress that mistakenly think they’re finished,”</a> Gardner writes:</p>\n<blockquote><p>Life is an endless unfolding, and if we wish it to be, an endless process of self-discovery, an endless and unpredictable dialogue between our own potentialities and the life situations in which we find ourselves. The purpose is to grow and develop in the dimensions that distinguish humankind at its best.</p></blockquote>\n<p>In a sentiment that mirrors the driving principle of nature itself, responsible for the evolution and survival of every living thing on Earth, he considers the key to that growth:</p>\n<blockquote><p>The potentialities you develop to the full come as the result of an interplay between you and life’s challenges — and the challenges keep coming, and they keep changing. Emergencies sometimes lead people to perform remarkable and heroic tasks that they wouldn’t have guessed they were capable of. Life pulls things out of you. At least occasionally, expose yourself to unaccustomed challenges.</p></blockquote>\n<p>The supreme reward of putting yourself in novel situations that draw out dormant potentialities is the exhilaration of feeling new to yourself, which transforms life from something tending toward an end into something cascading forward in a succession of beginnings — for, as the poet and philosopher John O’Donohue observed in <a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\">his magnificent spell against stagnation</a>, “our very life here depends directly on continuous acts of beginning.” This in turn transforms the notion of meaning — life’s ultimate aim — from a product to be acquired into a process to be honored.</p>\n<figure><a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/01/thelittleprince_morgan10.jpg?w=680&amp;ssl=1\" /></a><figcaption>One of Antoine de Saint-Exupéry’s <a href=\"https://www.themarginalian.org/2014/02/03/exupery-little-prince-morgan-drawings/\">original watercolors for <em>The Little Prince</em></a></figcaption></figure>\n<p>Gardner recounts hearing from a man whose twenty-year-old daughter was killed in a car crash. In her wallet, the grief-stricken father had discovered a printed passage from a commencement address Gardner had delivered shortly before her death — a fragment evocative of Nietzsche’s insistence that <a href=\"https://www.themarginalian.org/2015/09/30/nietzsche-find-yourself-schopenhauer-as-educator/\">“no one can build you the bridge on which you, and only you, must cross the river of life.”</a> It read:</p>\n<blockquote><p>Meaning is not something you stumble across, like the answer to a riddle or the prize in a treasure hunt. Meaning is something you build into your life. You build it out of your own past, out of your affections and loyalties, out of the experience of humankind as it is passed on to you, out of your own talent and understanding, out of the things you believe in, out of the things and people you love, out of the values for which you are willing to sacrifice something. The ingredients are there. You are the only one who can put them together into that unique pattern that will be your life.</p></blockquote>\n<p>Complement with the pioneering education reformer and publisher Elizabeth Peabody on <a href=\"https://www.themarginalian.org/2019/07/05/elizabeth-peabody-figuring/\">middle age and the art of self-renewal</a>, the great nonagenarian cellist Pablo Casals on <a href=\"https://www.themarginalian.org/2014/12/03/pablo-casals-work-age/\">the secret to creative vitality throughout life</a>, and this <a href=\"https://www.themarginalian.org/2024/03/03/the-middle-passage-john-hollis/\">Jungian field guide to transformation in midlife</a>, then revisit Nick Cave on <a href=\"https://www.themarginalian.org/2023/02/07/nick-cave-growing-older/\">blooming into the fulness of your potentialities</a> and Simone de Beauvoir on <a href=\"https://www.themarginalian.org/2022/07/31/simone-de-beauvoir-coming-of-age/\">the art of growing older</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"bff75fb02f52e4490dcab3a982f38b0c7802c3fa0a84ebd947231bd95ee00d2c","category":"default"}