{"title":"Touching Grass","link":"https://www.usv.com/writing/2024/09/touching-grass/","date":1726234588000,"content":"<p>I love being outdoors in nature. Whether with friends or entirely by myself, it’s where I’m happiest.</p>\n<p>This summer I got to spend a lot of time outdoors. We stay in the Catskills and there is something very special about being surrounded by green and trees and animals and dirt roads. It’s calming and helps to slow things down and put things in perspective.</p>\n<p>As the summer was coming to an end and we were preparing to move back to the city I went on one of my favorite bike rides upstate. In Minnewaska State Park, you can bike to a place called Lake Awosting which is only accessible by a 3 mile hike or bike and it’s gorgeous. Oftentimes I go there and I have the entire lake to myself and I can sit and read and swim and think.</p>\n<p>Then I can go bike a big loop around the park and stop at overlooks like this.</p>\n<p>During one of these breaks, I started to think about internet applications, as one is wont to do when in the depths of the great outdoors. I realized that some of my favorite apps, the ones I find most useful and enjoy the most, are ones that emphasize getting outdoors. These include AllTrails , Strava , TrailForks , and Backcountry (for shopping for outdoor gear). One of the neat things about AllTrails and Strava is that networks have popped up around them. A lot of these are owned by private equity, which is a bummer.</p>\n<p>I’d love to see more people building things to help the world experience nature more frequently. There is a huge market for people that are passionate about being outdoors, and it’s a noble mission to help people experience these things. And as an added benefit, the market for the “outdoors” is huge. We need more entrepreneurs focused on getting more people to touch grass.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/touching-grass/\">Touching Grass</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"c00e21ccdaacdb249527f6f7a954525a5bb2c86e8643f3c78a2724551fe99ea7","category":"Sites"}