{"title":"An update on socii","link":"https://blog.webb.page/2021-02-15-an-update-on-socii.txt","date":1613347200000,"content":"<p>Social network fatigue is at an all-time high. Last year leading into the first\ncouple weeks of this year resulted in me \"doomscrolling\" more than I'd like and\npresumably like you, I've lacked motivation after spending hours doing that.\nDespite the tone of this intro, socii is not dead. Quite the contrary,\ndevelopment on 2.0 has been underway for a while and unlike last year I'm\nseeing 2021 with 20/20 vision. Let me explain.</p>\n<p>It is my belief that Big Social lacks the resolve and moral tack to do what is\nobjectively correct…even in the face of <strong>overwhelming evidence</strong> that refusing\nto take action could result in catastrophic events.</p>\n<p>Corporations are not people and must move slowly by the very nature of massive\ncompanies. A raft turns a lot faster than a sailboat or freight-liner after\nall, right? Well, Big Social has shown time and time again their ability to\nmove swiftly when it serves financial interest to do so. I don't buy the\noft-given example I started this paragraph with, it's clearly a\nload of excrement.</p>\n<p>Here is how socii is shaping up:</p>\n<ol>\n<li>It is a paid service with a decent free tier.</li>\n<li>There is a strict anti-harassment policy that WILL be exercised.</li>\n<li>Communities are private by default and come with extensive moderation tools.</li>\n<li>Remember customization? You are unique, your profile will act like it\n(if you want).</li>\n</ol>\n<p>Per points 2 and 3, freedom of speech does NOT mean freedom of <em>reach</em>. This\nnuance is clearly lost on a subset of the American populace so here it is,\nupfront. Radicalization and violence stemming from disinformation has no place\non socii. Or anywhere else, it seems. Anyhoo…</p>\n<p>You may have noticed that \"socii\" lost its capitalization. It occurred to me\nthat too often, services try to get ahead of themselves and attempt becoming\nbrand-like before their service takes off. Startup wisdom says to\n\"become a tribe\" and your fans will buy anything you sell. But, how is your\nservice more important than the people you are serving? How are you an\n\"ecosystem\" when your only claim to fame is the Product Hunt hype machine? Too\nmany services with that mindset are mere tools that will be acqui-hired into a\nbigger company and be shut down internally (or just shut down).</p>\n<p>You wouldn't capitalize \"hammer\" or \"scissors\" (unless you started a sentence\nwith them). In the same vein, socii is a tool. socii is not meant to be the\nforefront of your mind, your life. Just…a place to connect with a community\n(or communities!) that you care about and that cares about you.</p>\n<p>Until sometime last year I'd been coding socii in the open because I bought\ninto the MVP (minimal viable product) hoopla the tech community spouts. As a\nresult, no one used it because it lacked features people expected or wanted.\nTurns out, if something is too <em>minimal</em> it ends up not being <em>viable</em> and\nwell, no one will use your <em>product</em>.</p>\n<p>New year, new moves.</p>\n<p>1.0 of socii is closed to new signups as work continues on 2.0. I may\noccasionally share updates on my Twitter @NetopWibby<a href=\"https://twitter.com/NetOpWibby\">1</a> so follow me there if\nyou don't mind sporadic updates. For those of you on this mailing list that\nalready had an account on socii, y'all are grandfathered in. Something special\nmay be waiting in your account once 2.0 is ready (please remind me).</p>\n<p>Stay tuned. 🕸</p>\n<p>P.S. If you were subscribed to the feed before this point, please delete and\nre-add it! I've added Markdown support to the feed so that you get formatting.</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"c06de4c9750191a781f6d8eaf982628a0bb014acf10134a03b67d106779eb119","category":"Sites"}