{"title":"Democratic superstars of 2024","link":"http://scripting.com/2024/07/07/200033.html?title=democraticSuperstarsOf2024","date":1720382433000,"content":"<p>On Mastodon, <a href=\"https://mastodon.social/@sarajw@front-end.social/112746718207413752\">Sara Joy writes</a>: \"Let Biden run. Let Kamala and lots of other younger Dems take on lots of events. Support him from underneath. If and when he falters, the party is there to prop him up, take up the slack, or step in.\"</p>\n<p>I had a similar idea.</p>\n<p>Make this the campaign of the cabinet, governors and congress.</p>\n<p>Let all the great next generation democrats shine. </p>\n<p>Big stadium events where a lot of them share the stage.</p>\n<p>Joe Biden dials in via satellite.</p>\n<p>\"Listen, I'm an old dude, so I need my rest but look at all these bright young people who help me do the business of the American people. Aren't they wonderful!\"</p>\n<p>He puts on his robe, sits in a rocking chair with a dog at his feet and his grandchildren playing checkers...</p>\n<p>And one of the juniors is hanging out with him, making sure he doesn't spill his beer, so you know they have his back.</p>\n<p>Baseball cards are handed out at the events with each of the stars of the Democratic Party.</p>\n<p>Collect them all!</p>\n<p>You get 5 free cards with a $25 contribution.</p>\n<p>Some would be very rare.</p>\n<p>Also there would be Old Timers Day, where Bernie, Hillary, Barack, Michelle and Bill would have a concert. </p>\n<p>Hosted by Mayor Pete!</p>\n<p>Joe is at the top of the ticket, but we got him covered.</p>\n<p>Out comes VP Kamala and she sings the anthem along with Taylor Swift wearing a red white and blue sequined outfit. </p>\n<p>And Santa Claus, Uncle Sam, Betsy Ross, and the Founding Fathers. </p>\n<p>Fredrick Douglass, Martin Luther King, Rosa Parks and the freedom fighters. </p>\n<p>All the heroes of America, standing up for America. </p>\n<p>The Greatest Generation and Repubs like Ike, even Reagan and of course Lynne Cheney.</p>\n<p>We don't need no freaking monarch, they all sing.</p>\n<p>On the tape, the Dead sing \"I'm Uncle Sam, that's who I am, been hiding out, in a rock and roll band!\"</p>\n<p>No we don't! shouts the people. </p>\n<p>We all march together to victory.</p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"c0955faeeed66c42d7bc4e3c758a0d5cdfcb5c16efd2f48ac8d86b69c22ffd77","category":"default"}