{"title":"The History of Tetris World Records","link":"https://kottke.org/24/05/the-history-of-tetris-world-records","date":1715965757000,"content":"\n        <p></p>\n\n<p>I know a lot of you probably aren’t going to take me up on this, but I recommend watching Summoning Salt’s <em>feature-length</em> documentary on the history of Tetris world records. I started watching in the other night and once I got going, I couldn’t stop. Some of plot points were familiar — <a href=\"https://kottke.org/18/11/why-are-humans-suddenly-getting-better-at-tetris\">Why Are Humans Suddenly Getting Better at Tetris?</a>, <a href=\"https://kottke.org/21/05/new-nes-tetris-technique\">A Revolutionary NES Tetris Technique Gaining Steam</a>, <a href=\"https://kottke.org/23/05/the-greatest-classic-tetris-game-of-all-time\">The Greatest Classic Tetris Game of All Time</a>, <a href=\"https://kottke.org/24/01/13-year-old-becomes-first-to-beat-nes-tetris\">13-Year-Old Becomes First to Beat NES Tetris</a>, <a href=\"https://kottke.org/24/02/another-tetris-world-record-completely-demolished-what-is-going-on\">Another Tetris World Record Completely Demolished! What Is Going On?!</a> — but seeing it all put together in one engaging &amp; informative narrative was really compelling.</p>\n\n<p>Watching these videos about Tetris (and also Super Mario Bros), what strikes me most is how clearly you can see, over and over again, <a href=\"https://kottke.org/21/05/new-nes-tetris-technique\">how innovation works</a>:</p>\n\n<blockquote><p>This is a great illustration of innovation in action. There’s a clearly new invention, based on prior effort (standing on the shoulders of giants), that allows for greater capabilities and, though it’s still too early to tell in this case, seems likely to shift power to people who utilize it. And it all takes place inside a small and contained world where we can easily observe the effects.</p></blockquote>\n\n<p>And it’s a credit to Summoning Salt and other video producers that this process <a href=\"https://kottke.org/18/05/a-world-record-super-mario-bros-speedrun-explained\">is so clear to the viewer</a>:</p>\n\n<blockquote><p>In the video analysis of this speedrun, if you forget the video game part of it and all the negative connotations you might have about that, you get to see the collective effort of thousands of people over more than three decades who have studied a thing right down to the bare metal so that one person, standing on the shoulders of giants in a near-perfect performance, can do something no one has ever done before. Progress and understanding by groups of people happens exactly like this in manufacturing, art, science, engineering, design, social science, literature, and every other collective human endeavor…it’s what humans do. But since playing sports and video games is such a universal experience and you get to see it all happening right on the screen in front of you, it’s perhaps easier to grok SMB speedrun innovations more quickly than, say, how assembly line manufacturing has improved since 2000, recent innovations in art, how we got from the flip phone to iPhone X in only 10 years, or how CRISPR happened.</p></blockquote>\n\n<p>I was talking to my son about this video yesterday and of course he’d already seen it — “I love Summoning Salt’s videos” — and I loved his take on the way in which the NES version of Tetris was unwittingly challenging these players beyond what the game’s makers had ever envisioned. Where the designers may have just kept increasing the speed of the game as the levels got higher (boring!), the game glitches and throws all these interesting challenges at players: tile colors you can barely see, game-ending kill screens that you can pick your way around, a level with 810 lines, and the game resetting after hundreds of levels. So instead of players just having to get faster (which they have definitely done), they’ve had to navigate all of these other obstacles as well. (thx, <a href=\"https://cottonbureau.com/\">nathan</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Tetris\">Tetris</a> · <a href=\"https://kottke.org/tag/video\">video</a> · <a href=\"https://kottke.org/tag/video%20games\">video games</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/the-history-of-tetris-world-records\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"c0a4bcba9535b001baf8055de051ab0ad4a5791a205450769cf599eea4f91175","category":"default"}