{"title":"What does Vision Pro & T1 connection have in common?","link":"https://om.co/2024/02/01/what-does-vision-pro-t1-connection-have-in-common/","date":1706830542000,"content":"<p>A review unit of Apple’s Vision Pro showed up yesterday. I’ve spent the majority of the past 24 hours setting it up. The setup was much simpler than I thought it would be. Given my previous experiences with the device at Apple Park, I have a slight advantage. So, your mileage might vary. Still, I didn’t see any obvious stumbling blocks — unless you count Siri’s difficult relationship with my accent.</p>\n\n\n\n<span></span>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>It has been a long time since I stayed up most of the night — I went to sleep at 3:45 and woke up again at 5 am — to start playing around with the Vision Pro. Yes, I checked out the mail, messages, and notes. But mostly, after calibrating the device, I eased into my Eames chair, rested my head on the chair, and leaned back to start reading all the articles on the Reader’s website. The Safari window was extra large, set quite further away, at a slight upward angle to accommodate my head position.</p>\n\n\n\n<p>Instead of hunching over a small screen, I was leaning back and slowly making my way through an amazing story about an Indian Prince and some scam on the AirMail website. And another, and another, and another. It was well into the night before I was done with the day’s reading. It was glorious.</p>\n\n\n\n<p>I got up, stretched a bit, got myself a drink of water, and plugged a 3-meter USB-C cable into the Vision Pro’s battery pack. I put the Vision Pro back on and started watching videos. The immersive videos from Apple TV+, some old films I’ve bought when they were sold on the iTunes store. The immersive videos give you a “holy shit” feeling. Watching the plain old movies on Vision Pro felt like watching them on a cinema screen. I have yet to watch a full-length Vision Pro-ready film — I will do so hopefully tonight.</p>\n\n\n\n<p>More importantly, I used Safari to watch Netflix and YouTube. Almost instantly, despite a very high-speed (WiFi6) connection and pushing both Netflix and YouTube to give me full resolution, I could see that there were artifacts. They weren’t as good as what I had seen otherwise. Big companies have their reasons to do (or not do) what they do (or not do.) However, as someone who pays for premium YouTube, I felt a bit cheated.</p>\n\n\n\n<p>This morning — as a comparison, I tried to watch YouTube on my iPad and read articles on my MacBook Pro and iPhone. They all looked a little less alluring than they did a day ago. Maybe it was me being excited by a new shiny toy. Nothing had changed. And yet something had indeed changed. </p>\n\n\n\n<p>I had experienced something similar back in the mid-1990s.</p>\n\n\n\n<figure><div>\n\n</div></figure>\n\n\n\n<p>When I look back at my Internet journey — it started with a 1200 baud modem. In the mid-1990s, I started working for the digital arm of Forbes. The best part of the job was a T1 connection — which had a theoretical peak speed of 1.544 megabits per second (Mbps). That was the best money could buy at that time — about $2000 per month, and that is if you could get a connection.</p>\n\n\n\n<p>At home, I had a 14.4 kbps modem. I eventually upgraded to a state-of-the-art 56kbps modem from a company called US Robotics. Each squeak and screech of the modem made me wish I was at work. Every time I logged on to the Internet at home, I realized how much better an always-on, high-speed T1 connection was.</p>\n\n\n\n<p>So, I started staying late at work — finding any excuse to hang around. Late nights meant I could call my sources in California late into the New York evening, write up the drafts for the next day’s stories, and when that was done — surf the internet. There were, of course, Age of Empires LAN parties. And much after midnight, I got to enjoy the New York nights. Thankfully, I had a boss who was a worse bandwidth addict than me — he expensed the dinner for all of us who stayed late for “work.”</p>\n\n\n\n<p>Today I have a 1-gigabit per second connection in my apartment — that is about 648 T1 lines — and I pay $60 a month. That’s three percent of what I paid almost 27 years ago. T1 showed me that there was a better way to the Internet. And we all eventually got there — heck, we get better network performance on our phones in even the remotest parts of the world.</p>\n\n\n\n<p>The reason I bring up the T1 as an analogy is because sometimes little things have a big impact in the long term. Vision Pro, the display, and the technology behind it are pointing to a future that will look very different from today. I have tried many AR/VR displays — Google Glass, HoloLens, Snap Glasses, Oculus/Quest, and quite a few others. Improvement is the only constant among these devices. Vision Pro is the most recent and by means technologically more advanced.</p>\n\n\n\n<p>Looking further ahead, I wonder what awaits us. We have always interacted with information on flat, two-dimensional screens. We have also seen videos and photos come to us on those two-dimensional screens. What happens to creativity in these immersive spaces? What happens to information when it becomes dimensional? I don’t know the answer, but I sure know — it won’t be the same as what it has been.</p>\n\n\n\n<p>Or as James Cameron and Jon Favreau <a target=\"_blank\" href=\"https://www.vanityfair.com/news/tim-cook-apple-vision-pro\">told Vanity Fair’s Nick Bilton</a>: </p>\n\n\n\n<blockquote>\n<p><strong>“I would say</strong> my experience was religious,” the director James Cameron told me when I asked him about his first encounter with the Apple Vision Pro. “I was skeptical at first. I don’t bow down before the great god of Apple, but I was really, really blown away.” Another prominent filmmaker, Jon Favreau, offered a similar sentiment, telling me he was “blown away” by the technology and what it will do to storytelling. “I’m excited by what kind of story I can tell now that I couldn’t tell before now,” he said.</p>\n</blockquote>\n\n\n\n<p><strong>February 1, 2024. San Francisco</strong></p>\n\n\n\n<p><em>PS: My full review will follow at some point in the future. I tend to treat my reviews as a journey. Why? Because I’m not a professional reviewer, I can afford to take my own sweet time to form an opinion about something — a device, software, or a service. Most professional reviewers are on such short deadlines — and their turnaround has to be quite quick. For now, I’m going to share my occasional insights and experiences.</em></p>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"c0a49cb292f62e894f11850f438a867749083985ee162248eb6b939180d082bc","category":"default"}