{"title":"New dinner party simulation app dropped","link":"https://www.garbageday.email/p/new-dinner-party-simulation-app-dropped","date":1713379470000,"content":"<div><div><p></p><div><div><span></span></div></div><p><i>You can find audio versions of Garbage Day on every major podcasting app (search “Garbage Day” and look for the trash can). If it’s not there, </i><i><a href=\"https://anchor.fm/s/f499c1b4/podcast/rss?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">here’s an RSS feed</a></i><i>.</i></p><hr /><h2>Those Who Do Not Learn From Clubhouse Are Doomed To Repeat Clubhouse</h2><p>Earlier this week I got access to Airchat, which is apparently still invite-only. <i>WIRED</i> is <a href=\"https://www.wired.com/story/airchat-app-social-audio/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">already calling</a> the app “Silicon Valley’s latest obsession” and <i>Business Insider</i> <a href=\"https://www.businessinsider.com/airchat-new-social-audio-text-app-threads-twitter-threat-2024-4?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">says</a> it’s getting “tons of buzz with tech industry, creators”. It’s actually awful and a hilarious example of how thoroughly cooked Web 2.0 is, but we’ll get to that in a sec.</p><p>Airchat is another “audio-first social network,” similar to Clubhouse. Unlike Clubhouse, though, its interface is genuinely impressive. When you open it up, it looks a lot like Threads or any other algorithmically-sorted Twitter clone. But the posts are transcripts of audio and video recordings. There’s also a play button you can hit that will just auto-play your feed. I let it just go for a while this morning and it was an interesting experience.</p><p>Airchat, ironically enough, doesn’t really make sense if you just listen to it. It’s a lot of short conversations and without the app’s visual interface, those fragments just sound like random voices. As for the content on there, it’s exactly what you would expect from an invite-only app that has “tons of buzz” in Silicon Valley. Just the worst, most basic college freshman dorm room-tier icebreakers from wear-a-leather-jacket-in-the-office millennials chasing the high of their first Foursquare check-in. </p><p>Airchat was built by Naval Ravikant, a tech entrepreneur and regular guest on <i>Joe Rogan</i>, and Brian Norgard, Tinder’s head of product. According to <a href=\"https://www.bloomberg.com/opinion/articles/2024-04-17/with-airchat-the-buzzy-new-social-app-beware-the-small-print?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\"><i>Bloomberg</i></a>, by using the app, you grant it “a non-exclusive, worldwide, royalty-free, perpetual, irrevocable, fully sublicensable license to use, reproduce, archive, edit, translate, create derivative works of, make available, distribute, sell, display, perform, transmit, broadcast and in any other way exploit those User Submissions.” </p><p>The app is already using an AI to clean up users’ voices and Ravikant, in a conversation on the app, said they don’t plan to train AI models with user content, but they might train a model to make better audio enhancements. Uh huh. Oh, also, <i>Bloomberg</i> notes that OpenAI’s Sam Altman was an early Airchat investor. Though, I doubt Airchat users will care about that, seeing as how one of the largest communities on the app is for the <a href=\"https://twitter.com/search?q=airchat+e%2Facc&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">e/acc “movement,”</a> or “effective accelerationism,” the AI-evangelist splinter group that wants to use AI to blow up society.</p><p>On Monday, I <a href=\"https://www.garbageday.email/p/ai-flight-attendants-facebook?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">described</a> Facebook as a “data holding pen for advertisers to harvest,” but it’s not just Facebook and it’s not just advertisers. Every social network — Reddit, Tumblr, X/Twitter, TikTok — is now primarily an AI training pool. Though, I’ve reached the point where I don’t even really care about that anymore. The real issue with Airchat is that it’s boring as hell. </p><p>Clubhouse, the clear inspiration for Airchat, “blew up” (debatable) during the pandemic thanks to a couple key factors: People with email jobs couldn’t go outside — or, at least, couldn’t post about being outside. The crypto market was on a bull run so everyone was rich with fake money. And perhaps most crucially and most often overlooked, a lot of people decided to reinvent their lives and a big chunk of those people decided they were tech founders now. These people LARP as CEOs on TikTok podcasts and <a href=\"https://twitter.com/dvassallo/status/1779785621760069810?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">whine</a> on X all day about tech reviewers like Marques Brownlee not <a href=\"https://twitter.com/samsheffer/status/1779854070372561184?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">respecting</a> the “builder’s mindset”. And Clubhouse, and now Airchat, smartly realized that if you dangle the promise of talking to Andreessen Horowitz employees in front of them these rubes will use their dinner party simulation apps long enough to harvest their voices to train their AI models. It’s so bleak!</p><p>I’ve seen people on Airchat already talking about flying out to San Fransisco to meet all their new Airchat friends. Do not do this! You are you in an MLM for people who know what Github is, but don’t know how to use it. Get help!</p><p>But the real reason I think Airchat is the ultimate sign of the end of Web 2.0 is that every new app now (that isn’t run <a href=\"https://9to5mac.com/2024/04/17/tiktok-notes/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">by Bytedance</a>) launches by dropping these same weirdos into a new enclosure. It’s the same 250 <i>cool </i>product managers and white nationalist crypto backpack zoomers jumping from one friendship casino to another. These are emo night cruises for people who remember Klout. Look, I don’t know what the future will bring, but we are clearly done with whatever this is. There is — there has to be — something new coming. For the love of god, people. We can’t keep doing this.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/7f55935b-e9ca-49f0-b7d0-1909f11050ec/whitemug1600_2.jpg?t=1713360595\" /></div><p>You probably already know it’s easy to make coffee at home that rivals any coffee bar—if you start with the right beans.</p><p>And the best way to score great beans is buying fresh and direct from quality-obsessed microroasters like us. We started YES PLZ to take the guessing games out of landing the good stuff and would love to audition to be your preferred drug dealer.</p><p>Test drive an easy, no-obligation subscription (weekly, fortnightly, every third week, monthly—whatever) and we’ll take <i><b>$5 off</b></i> your first bag. This week’s <i>“Bicycle Day”</i> release is stunning.</p><p>Hit us up at <a href=\"https://www.yesplz.coffee/product/beans?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">YESPLZ.coffee</a> for your next fix and drop in promo code <i><b>GARBAGE</b></i>! </p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\"><span> Upgrade </span></a></div><hr /></div><h2><span>Some Good Ol’ Fashioned Trump Content</span></h2><blockquote><p></p><p>Had to make the Ken Burns edit to stop the intrusive thoughts</p><p></p><a href=\"https://twitter.com/schneedad/status/1779948508964929634?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\"><p> — Dad (@SchneeDad) <br /> Apr 15, 2024 </p></a></blockquote><p>Also, here’s a good spot to <a href=\"https://www.rollingstone.com/politics/politics-news/trump-trial-new-york-memes-prospective-jurors-1235005658/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">drop this link</a> about Trump having to sit through a bunch of mean memes read out loud to him. It was part of the juror selection process for <a href=\"https://www.washingtonpost.com/politics/2024/04/16/trump-new-york-criminal-trial-hush-money/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">his current criminal trial</a> in New York.</p><hr /><h2>OK, Fediverse, I’m Beginning To See The Vision</h2><p>I’ve come across three projects/essays over the last few weeks that have started to make me very excited about the fediverse. They haven’t assuaged me of my fears that it’s too complicated for the average user to really care about, but I’m beginning to see the possibilities here.</p><p>First, I can’t recommend this essay on the “<a href=\"https://shkspr.mobi/blog/2024/04/the-fediverse-of-things/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">The Fediverse Of Things</a>” by Terence Eden highly enough. The broad strokes are that, by using ActivityPub, you could built a network of “social” accounts for things like municipal services or even all the lightbulbs in your house. </p><p>“It seems feasible that every civic object could have a Fediverse account,” Eden writes. “From the individual streetlights to the municipal sewerage system. Perhaps people won't send love letters to overflowing drains — but a social-dashboard of your civic environment could be both practical and delightful.”</p><p>The next project was <a href=\"https://www.augment.ink/threads-on-mastodon/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">Anuj Ahooja’s essay</a> about trying to connect his Threads account to Mastodon. Which, I think, does a very good job of explaining how ActivityPub could be used to build a TweetDeck-like interface for, well, anything that runs on the protocol. Which is very cool.</p><p>And, finally, this morning I found a podcast tool built on ActivityPub called <a href=\"https://podcastap.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">Podcast AP</a>, created by Tim Chambers. It uses a bridge to connect podcast RSS feeds, another open protocol, to the fediverse.</p><p>The reason I find all of these exciting is because they offer a vision of a very different kind of internet experience, one where the web isn’t condensed into privately-owned social networks, but one where the social network experience is freed from the network. Internet content, of any shape or format, can be tracked, interacted with, and shared in real time. It’ll be a real uphill battle to get the average person to care about this stuff, but if the process of using these tools can be made simpler, it might be possible.</p><hr /><h2>AI Wearables Should Actually Just Be Smart Home Devices</h2><p><i>Bloomberg</i> host Ed Ludlow <a href=\"https://twitter.com/edludlow/status/1780381100227109352?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">posed</a> an interesting thought about AI wearables this week. “What’s very interesting about Humane AI pin is whether you’re talking the at home vs on the go use case. At home I’m a big Alexa user. I have an echo dot in most rooms. I really find it useful,” he wrote. “Now on the go I use Siri because I am an iPhone user. But it’s not great, is it? Thoughts?”</p><p>This is not dissimilar from a point Molly White <a href=\"https://www.citationneeded.news/ai-isnt-useless/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">made this week</a>, who wrote, “[AI tools] do a poor job of much of what people try to do with them, they can't do the things their creators claim they one day might, and many of the things they are well suited to do may not be altogether that beneficial.” </p><p>The funny thing is there is a clear use case for AI-powered hardware and it becomes overwhelmingly obvious when you walk through what an AI chat interface requires: A stable internet connection and a place quiet enough to talk to it. Generative-AI should just be a smart home device. Both Google Home and Alexa were supposed to get some kind of <a href=\"https://www.zdnet.com/article/google-home-will-get-a-generative-ai-boost-too/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">generative-AI feature</a>, but, as a Home user, I haven’t noticed any difference. In fact, most of my Google-connected devices don’t even really work anymore.</p><p>So why weren’t Smart Home devices the first stop for this tech and why is everyone clamoring to build some kind of wearable? Well, my hunch is, first, because wearables are seen by other people and tend to advertise themselves and, second, because smart home devices have been so bad and so useless for so long that it’s basically tarnished for at least a generation.</p><hr /><h2>Coachella Is Weird Now, Which Is Cool, But Probably Not Good For Coachella</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/a78a3236-94f6-4629-95e2-9d58e350cfb4/Screenshot_2024-04-17_at_12.54.23_PM.png?t=1713372876\" /><div><span><p>(YouTube/Coachella)</p></span></div></div><p>This year’s Coachella is a fantastic snapshot of how fragmented pop culture is right now. It has probably the weirdest, most eclectic lineup its had in years, including Japanese vocaloid Hatsune Miku, Clown Core, The Aquabats somehow, Grimes, Blur, and Taking Back Sunday. Which has already resulted in some very funny drama.</p><p>Miku fans <a href=\"https://www.sfgate.com/sf-culture/article/coachella-hatsune-miku-hologram-review-19401378.php?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">are mad</a> the virtual pop star performed on a backdrop instead of her usual hologram. Blur got such a lukewarm response they <a href=\"https://news.sky.com/story/blurs-damon-albarn-tells-lacklustre-coachella-crowd-youll-never-see-us-again-13116163?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">vowed</a> to never come back. Grimes <a href=\"https://musictech.com/news/music/grimes-coachella-dj-set/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">revealed</a> she can’t do basic math and had to stop her set several times because the BPMs of her songs were all accidentally doubled. (I get it, I recently had to reboot my entire laptop on stage during a Garbage Day live set.) And zoomers <a href=\"https://twitter.com/_bunnylouise/status/1779865457782108439?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">discovered</a> that Taking Back Sunday is, arguably, the worst sounding professional live band of all time. They usually still put on a good show, though.</p><p>If the internet is anything go off of — and it isn’t tbh — the standout performance this year was Chappell Roan, who’s blowing up right now because zoomers have Twenty One Pilots brain and don’t know who Marina And The Diamonds is. “Casual” rips, though.</p><p>All of this has <a href=\"https://www.billboard.com/business/touring/coachella-ticket-sales-lower-than-usual-2024-festival-trend-1235655410/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">resulted</a> in a ticket sales drop of 15%-20% since last year. Which is possibly related to the lack of monoculture right now. But it also might be the rampant piracy of performance streams and high-quality fancams. But it also might be related to music festivals, as a whole, losing their status as a place to see and be seen. But all of that also might just be related to the lack of monoculture right now.</p><p>Speaking of which…</p><hr /><h2>Websites Might Be Coming Back</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/a879f350-edb9-4769-b73c-68bfbb0ed492/Screenshot_2024-04-17_at_1.13.05_PM.png?t=1713374002\" /><div><span><p>(<a href=\"http://castexotic.com/realistikstudios/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">castexotic.com/realistikstudios</a>)</p></span></div></div><p>One of the most exciting new music releases this year is a double album called <i>Diamond Jubilee</i> by the artist Cindy Lee, which was released, not on a streamer like Spotify, but on a <a href=\"https://www.geocities.ws/ccqsk/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">Geocities page</a>.</p><p><i>Pitchfork</i> <a href=\"https://pitchfork.com/reviews/albums/cindy-lee-diamond-jubilee/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">gave</a> <i>Diamond Jubilee</i> an astonishing 9.1 and, while it’s not exactly my thing, I think it’s pretty good! But the release strategy is what I’m geeking out about more. And Cindy Lee isn’t the only artist beginning to experiment with this kind of album drop. Last week, Pharrell <a href=\"https://blackyachtrock.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">released</a> an album on standalone website, as well. </p><p>One thing that I don’t think is highlighted enough is the role music, as an art form, has in bringing about philosophical changes in how we use technology. Peer-to-peer music piracy laid the groundwork for all viral media sharing that would come after. MP3 players like the iPod were the forefathers of the smartphone. Spotify, you could argue, popularized streaming media faster than Netflix did. And TikTok used shareable, iterative audio to standardize short-form video.</p><p>So I don’t think it’s overblown to say that if musicians can find a new utility for single-purpose websites, everyone else eventually will, too.</p><hr /><h2>@lukefoods_ Has Done It Again</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@lukefoods?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\"> @lukefoods </a><p>Garlic Naan And Butter Chicken Fountain?! #butterchicken #indianfood #indianfoodie #garlicnaan #naan #foodcritic #indianfoodblogger #taste... See more</p></section></blockquote><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.nytimes.com/2024/04/17/style/today-in-tabs-rusty-foster-media-gossip-maine.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">Rusty Foster somehow has an internet connection up in Maine</a></p></li><li><p><a href=\"https://www.theverge.com/c/24070570/internet-cables-undersea-deep-repair-ships?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">“The invisible seafaring industry that keeps the internet afloat”</a></p></li><li><p><a href=\"https://www.theguardian.com/technology/2024/apr/16/techscape-ai-gadgest-humane-ai-pin-chatgpt?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">“How cheap, outsourced labour in Africa is shaping AI English”</a></p></li></ul><hr /><p><span>P.S. here’s a </span><span><a href=\"https://twitter.com/jack_vening/status/1780388782078128540?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=new-dinner-party-simulation-app-dropped\" target=\"_blank\">good post</a></span><span>.</span></p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=67b1c3a1-ba91-450a-96e0-0622ca4f4d03&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"c1ce13b9f17187efb23a88c42d90f842aa1d3c069a7bcd0bcc15f66045c063d7","category":"default"}