{"title":"Here’s how to live: Love.","link":"https://sive.rs/htl22","date":1640131200000,"content":"<p>\nNot love, the feeling, but love the active verb.\n<br />\nIt’s not something that happens to you.\n<br />\nIt’s something you do.\n<br />\nYou choose to love something or someone.\n<br />\nYou can love anything or anyone you decide to love.\n</p><p>\nLove is a combination of attention, appreciation, and empathy.\n</p><p>\nTo love something, first you have to connect with it.\n<br />\nGive it your full attention.\n<br />\nDeliberately appreciate it.\n<br />\nTry this with places, art, and sounds.\n<br />\nTry this with activities and ideas.\n<br />\nTry this with yourself.\n</p><p>\nMany times a day, you have the opportunity to connect.\n<br />\nYou can dash through a place, or stop to appreciate it.\n<br />\nYou can do an activity absent-mindedly, or pay full attention to every detail of it.\n<br />\n(Work is love in action.)\n<br />\nYou can make shallow small-talk, or really get to know someone.\n<br />\nChoose to connect every time.\n</p><p>\nSharing is connecting.\n<br />\nShare your knowledge.\n<br />\nShare your home.\n<br />\nShare your time.\n</p><p>\nLearning is loving.\n<br />\nThe more you learn about something, the more you can love it.\n<br />\nLearn about a place to appreciate it.\n<br />\nLearn about people to empathize with them.\n<br />\nNot just individuals, but cultures, mindsets, and worldviews.\n<br />\nIf you are apathetic about or against something, learn more about it.\n</p><p>\nActively listen to people.\n<br />\nWhen they’re succinct, ask them to elaborate.\n<br />\nPeople aren’t used to someone being sincerely interested, so they’ll need some coaxing to continue.\n<br />\nBut never try to fix them.\n<br />\nWhen someone tells you what’s broken, they want you to love the brokenness, not try to eliminate it.\n</p><p>\nBreak down the walls that separate you from others and prevent real connections.\n<br />\nTake off your sunglasses.\n<br />\nDon’t text when you should talk.\n<br />\nAvoid habitual comebacks and clichés.\n<br />\nAdmit what you’re really feeling, even when it’s uncomfortable.\n<br />\nKeep communicating instead of shutting down.\n<br />\nWe think walls protect us from enemies, but walls are what create enemies in the first place.\n</p><p>\nThe hardest part of connecting with someone is being honest.\n<br />\nIf you say what you think someone wants to hear, you’re preventing a real connection.\n<br />\nManners are shallow.\n<br />\nHonesty is deep.\n<br />\nAlways tell the real truth, or they’ll never know the real you, so you’ll never really feel loved.\n</p><p>\nHonesty is an ideal that’s always a little further away.\n<br />\nIt has no finish line.\n<br />\nNo matter how honest you are, there’s always more honest.\n</p><p>\nDon’t exaggerate to be more entertaining.\n<br />\nDon’t downplay.\n<br />\nIf you downplay your achievements to make someone else comfortable, you’re preventing connection with that person and even with yourself.\n<br />\nJust be honest.\n<br />\nIf you’ve done something great, say so.\n<br />\nIf you’re not doing well, say so.\n</p><p>\nIf you have feelings for someone, and you don’t let that person know, you’re lying with your silence.\n<br />\nBe direct.\n<br />\nIt saves so much trouble and regret.\n</p><p>\nYou could live with others, pleasing only them.\n<br />\nYou could live in solitude, pleasing only yourself.\n<br />\nBut ideally, when with others, be the same person you’d be when alone.\n</p><p>\nThe more you really connect with people, the more you learn about yourself: what excites you, what drains you, what attracts you, and what intimidates you.\n</p>\n<hr />\n<p>\nAnd then there’s romantic love.\n<br />\nYou never really regret falling in love.\n<br />\nDo it as much as possible.\n</p><p>\nFlirting and romance is like eating dessert first.\n<br />\nAfter you come down from the sugar rush, you get to the more nourishing part of the meal.\n</p><p>\nBeware of the feeling that someone completes you or will save you.\n<br />\nYou have wounds in your past.\n<br />\nYou have needs that were ignored.\n<br />\nYou seek someone to fill these gaps — someone that has traits you crave.\n<br />\nBut nobody will save you.\n<br />\nYou have to fill those gaps yourself.\n<br />\nWhen you’re going through an unstable time in your life, you latch on to whatever makes you feel stable.\n<br />\nInstant obsessive love is a bad sign that you’re thinking of someone as the solution.\n<br />\nProjecting perfection onto someone is not love.\n<br />\nYou say “I love you” but really mean “I love this”.\n</p><p>\nNotice how you feel around people.\n<br />\nNotice who brings out the best in you.\n<br />\nNotice who makes you feel more connected with yourself — more open and more honest.\n<br />\nDon’t worry about anyone’s opinion of you.\n<br />\nDon’t hope that someone is impressed.\n<br />\nImpress yourself.\n<br />\nBe your ideal self.\n<br />\nIf that’s not impressive, then nothing would be.\n<br />\nIf the relationship isn’t going to work, it’s better to know early, instead of hiding your true self and putting up a façade for a long time before finding out.\n</p><p>\nBetween any two people is a third thing: the relationship itself.\n<br />\nActively nurture it.\n<br />\nIf you improve it, it will improve you.\n</p><p>\nOnce you’re in a relationship, avoid harming it.\n<br />\nIt’s easy to love someone’s best qualities, but it’s work to love their flaws.\n<br />\nDon’t try to change someone, or teach them a lesson, unless they ask you to.\n</p><p>\nWhen one of you is being childish, the other needs to be the adult.\n<br />\nLike a dance, you can’t both dip at the same time.\n<br />\nOne of you has to stay upright to keep the other from collapsing.\n</p><p>\nUnless you are drops of liquid, one plus one never equals one.\n<br />\nYou must both be free and able to live without each other.\n<br />\nBe together by choice, not necessity or dependence.\n<br />\nLove your partner, but don’t need your partner.\n<br />\nNeed is insatiable.\n<br />\nNeed destroys love.\n</p><p>\nIf you choose not to love someone, break up with one last boost of love, empathy, and kindness, instead of showing your lack of love.\n</p><p>\nBe wary of marriage.\n<br />\nDon’t make a life-long commitment based on an emotional state.\n<br />\nIt’s illegal to sign contracts when drunk, so you shouldn’t sign a marriage contract when drunk on infatuation.\n</p><p>\nHaving a child is like being in love.\n<br />\nIt’s such a tight bond.\n<br />\nYou’re so close.\n<br />\nSo much trust.\n<br />\nSo much support.\n<br />\nBut, just like the other people you love, your child’s interests and values will be different than yours.\n</p><p>\nYou don’t love someone to shape their future.\n<br />\nYou don’t judge your friendships by how successful your friend becomes.\n<br />\nSo don’t love and judge your children that way.\n<br />\nDon’t try to change them.\n<br />\nJust give them a great environment where they can thrive.\n<br />\nGive them the safety to experiment, make mistakes, and fail up.\n</p><p>\nThe saddest life is one without love.\n<br />\nThe happiest life is filled with love.\n<br />\nChoose to love as much as you can.\n<br />\nLoving is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"c215bc6d264296328e6b8be24f3f4764fcd3d5133fa6fef258b866a3c9feeda6","category":"Sites"}