{"title":"About my book notes","link":"https://sive.rs/bfaq","date":1643155200000,"content":"<p>\nAt <a href=\"https://sive.rs/book\">sive.rs/book</a> I have a collection of my notes from the 320+ books I’ve read since 2007.\n</p><p>\nThis page is just to answer some questions about it.\n</p>\n<h3>\nMy notes are not a summary of the book!\n</h3>\n<p>\nWhen I’m reading and come across a surprising or inspiring idea, I save it.\n</p><p>\nThat’s all my notes are.\nI’m not summarizing the book.\n<strong>\nI’m just saving ideas for myself, for later reflection.\n</strong>\n</p><p>\nIf I’m reading a book about a subject I already know well, I’ll have very few notes, because not much surprised me.\n</p><p>\nI kept these notes private for years, but decided it couldn’t hurt to put them on my site.\n</p>\n<h3>\nNotes don’t replace the book\n</h3>\n<p>\nIt makes me sad when people email to say thanks for my notes because it saved them time from reading the book.\n</p><p>\nMy notes are just some tiny tidbits with no context.\n<strong>\nIt’s like reading a punchline without the joke.\n</strong>\nIf you hear an elaborate joke, then the punchline — (“The little piece of rope said, ‘No. I’m a frayed knot!’”) — is all you need to remember the full joke.\nBut if you just hear the punchline, without the joke, it makes no sense.\nI just save the punchlines to remind myself what I’ve read.\n</p><p>\nAgain: these notes are really just for me but I’m sharing them on my site.\n</p><p>\nIf you look through a book’s notes and like the ideas, please go read the whole book.\nIt gives so much more context and meaning.\n</p>\n<h3>\n“How do you choose the rating?”\n</h3>\n<p>\nMy 0-10 rating is <em>not</em> just how much I liked the book.\nIt’s how strongly I would recommend it to almost anyone.\nSo I would give a little lower rating to a book I loved about an obscure subject, like the culture of Switzerland, because I wouldn’t recommend it to most people.\n</p>\n<h3>\n“How do you use these notes?”\n</h3>\n<p>\nThis will always be changing.\n</p><p>\nFor the past few years, when I have a few minutes, I’ll just pick some book from the past that might apply to a situation I’m working on now, and re-read all the notes on it.\n</p><p>\nI’ve also used them to research a certain subject, like discipline for example, I’ll go search all notes for any mention of discipline, and re-read the thoughts on that subject.\n</p>\n<h3>\n“How do <em>you</em> use your book notes?”\n</h3>\n<ol><li>\nSave the ideas I find most interesting, and worthy of further thought.\n</li><li>\nRe-read those notes occasionally.\n</li><li>\nReflect on one.\nI write the idea at the top of a page, then write at least a page of my own thoughts about this idea.\n</li></ol>\n<h3>\n“Why don’t I see __(some book)___?”\n</h3>\n<p>\nI do read fiction, but I don’t take notes on it.\nFor fiction, I prefer audiobook.\n</p><p>\nI also read hundreds of books before 2007, but didn’t start taking notes until I realized I was forgetting what I had read.\n</p><p>\nAnd ultimately, I only read things that apply to my life or current interests right now.\nI say no to all requests, and publishers asking me to do reviews.\n</p>\n<h3>\n“Which one should I read?”\n</h3>\n<p>\nWhichever one seems to apply to your current situation.\nI find books most useful when they solve a problem I’m having now.\n</p><p>\nBy default I have <a href=\"https://sive.rs/book\">the list</a> sorted with my top recommendations up top.\nBut really the best one for you is the one that speaks to your current situation.\n</p>\n<h3>\n“Don’t the authors get mad?”\n</h3>\n<p>\nNo, but this was my biggest surprise!\n</p><p>\nThe main reason I didn’t post these for years is because I assumed it was against copyright law.\nBut I quietly tried it, without announcing it.\n</p><p>\nThen as the site got more popular, I was scared I’d get in trouble, but instead I got emails of thanks from the authors of those books.\nMaybe especially since I really am trying to get people to go buy the books whose notes they like.\n</p>\n<h3>\n“Exactly how do you take these notes?”\n</h3>\n<p>\nWhen reading a paper book, I just underline or circle the bits I find surprising or useful.\nThen when I’m done reading the book, I type those bits into a text file.\n</p><p>\nOn Kindle, I just highlight the bits I find surprising or useful.\nThen when I’m done reading the book, I connect the Kindle by USB, copy the «/documents/My Clippings.txt» file, and edit from there.\n</p><p>\nEither way, I tend to edit a lot, and re-shape the sentences into something that works for me.\n</p>\n<h3>\n“Hey you might like this other book summary site!”\n</h3>\n<p>\nNo.\nI don’t want to read summaries of books.\nI like reading the whole book!\n</p><p>\nI aim to read even harder books, like “<a href=\"https://sive.rs/book/HowToReadABook\">How to Read a Book</a>” describes well.\n</p>\n<h3>\n“Why are there not more women authors?”\n</h3>\n<p>\nIt’s a good question, and it bothers me too.\n</p><p>\nI’m kind of a feminist.\nMost of my friends are women.\nMost of my favorite musicians are women.\nWhen hiring, I try to hire only women.\nBut yet the authors of the books I read are mostly men.\nWhy?\n</p><p>\nIt seems the publishing industry is biased that way.\nA female author sent her manuscrupt to twenty publishers, and all twenty rejected it.\nShe sent it again to all twenty publishers using a male pen name, and half of them accepted it.\nI suspect that many men will only read books by men, whereas women will read books by men and women.\nSo publishers are just meeting the market, expecting male authors to sell better, which then feeds the problem.\n</p><p>\nWhen I seek a book to solve a current problem or curiosity, I look for a book that seems to be the most highly recommended by the most people, or people I already admire.\nSo whether it’s their bias or the publishing industry, these books are too-often by men.\n</p><p>\nBut please also read my short article, “<a href=\"https://sive.rs/you-not-them\">The mirror: It’s about you, not them.</a>”, because ultimately I don’t care who the author is.\nWhen I read a book, it’s about me, not them.\n</p>\n<hr />\n<h3>\nGo to <a href=\"https://sive.rs/book\">sive.rs/book</a> to browse the notes.\n</h3>\n<a href=\"https://sive.rs/book\"><img src=\"/images/bookstand.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"c254b8c4408394eb549424e4d826830e9597a67e8be936a7c80d18e939723d69","category":"Sites"}