{"title":"How Are You Doing?","link":"https://kottke.org/24/11/how-are-you-doing-1","date":1730736622000,"content":"\n        <p>No seriously, how is everyone doing today? We’re coming down to the wire on the most cuckoo bananapants presidential election campaign in recent memory. There’s so much at stake and there are so many unknowns, a potent cocktail for anxiety. If that’s where you are right now, I hope you know you’re not alone. If you’re feeling confident, that’s great and I’m happy for you. If my Instagram feed is any indication, many of you have already voted and are volunteering to knock on doors, phone bank, or to cure ballots in swing states — thanks so much for doing that! (<a href=\"https://gregpak.net/2024/10/27/time-to-get-out-the-vote-practical-suggestions-for-last-minute-action/\">Greg Pak’s list of last minute actions</a> is a good place to start if you want to pitch in.)</p>\n\n<p>Me? Last week was a rough one — lots of anxiety about the election and other things. I’m feeling better this morning; I got out for some exercise this weekend, spent some really nice time with my son, and generally kept social media at arm’s length. Even though it’s pretty cold here today, I’m heading out for a bike ride this afternoon to load up on some good dopamine. I started season two of <a href=\"https://www.netflix.com/title/81288983\">The Diplomat</a> last night and it seems to have picked up right where it left off last season — the perfect diversionary viewing for me.</p>\n\n<p>But I’m also struggling to work out what to post here this week. I am very nearly done with anything political in nature (I don’t want to contribute to doomscrolling) but posting anything else at this critical juncture, when people’s actual lives and freedoms are on the line, seems frivolous. I suppose I’ll figure it out, but heads up: things might be a little lighter than usual around here — or maybe the opposite? We’ll see.</p>\n\n<p>In the meantime, if you don’t mind sharing, let us know how you’re doing in the comments.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Greg%20Pak\">Greg Pak</a> · <a href=\"https://kottke.org/tag/politics\">politics</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/11/how-are-you-doing-1\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"c2b4508faf9f66f8392b753f75b1e583cb36fa0bef8533620a278cd8b4715edb","category":"Sites"}