{"title":"Who Goes Nazi?","link":"https://kottke.org/24/07/who-goes-nazi","date":1721404011000,"content":"\n        <p>In 1934, <a href=\"https://en.wikipedia.org/wiki/Dorothy_Thompson\">Dorothy Thompson</a> became the first American journalist to be expelled from Nazi Germany for writing critically &amp; <a href=\"https://www.historynet.com/encounter-dorothy-thompson-underestimates-hitler/\">unfavorably</a> about the regime and its leader, Adolf Hitler:</p>\n\n<blockquote><p>He is formless, almost faceless, a man whose countenance is a caricature, a man whose framework seems cartilaginous, without bones. He is inconsequent and voluble, ill-poised, insecure. He is the very prototype of the Little Man.</p></blockquote>\n\n<p>Back in America as one of the most famous journalists and women of her time, she spent the rest of the 30s and early 40s trying to warn the nation of fascism both here and abroad. In 1941, she wrote a piece for Harper’s Magazine called <a href=\"https://harpers.org/archive/1941/08/who-goes-nazi/\">Who Goes Nazi?</a>, in which she muses about which guests at a party would become Nazis.</p>\n\n<blockquote><p>The saturnine man over there talking with a lovely French emigree is already a Nazi. Mr. C is a brilliant and embittered intellectual. He was a poor white-trash Southern boy, a scholarship student at two universities where he took all the scholastic honors but was never invited to join a fraternity. His brilliant gifts won for him successively government positions, partnership in a prominent law firm, and eventually a highly paid job as a Wall Street adviser. He has always moved among important people and always been socially on the periphery. His colleagues have admired his brains and exploited them, but they have seldom invited him — or his wife — to dinner.</p>\n\n<p>He is a snob, loathing his own snobbery. He despises the men about him — he despises, for instance, Mr. B — because he knows that what he has had to achieve by relentless work men like B have won by knowing the right people. But his contempt is inextricably mingled with envy. Even more than he hates the class into which he has insecurely risen, does he hate the people from whom he came. He hates his mother and his father for being his parents. He loathes everything that reminds him of his origins and his humiliations. He is bitterly anti-Semitic because the social insecurity of the Jews reminds him of his own psychological insecurity.</p>\n\n<p>Pity he has utterly erased from his nature, and joy he has never known. He has an ambition, bitter and burning. It is to rise to such an eminence that no one can ever again humiliate him. Not to rule but to be the secret ruler, pulling the strings of puppets created by his brains. Already some of them are talking his language — though they have never met him.</p>\n\n<p>There he sits: he talks awkwardly rather than glibly; he is courteous. He commands a distant and cold respect. But he is a very dangerous man. Were he primitive and brutal he would be a criminal — a murderer. But he is subtle and cruel. He would rise high in a Nazi regime. It would need men just like him — intellectual and ruthless. But Mr. C is not a born Nazi. He is the product of a democracy hypocritically preaching social equality and practicing a carelessly brutal snobbery. He is a sensitive, gifted man who has been humiliated into nihilism. He would laugh to see heads roll.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Adolf%20Hitler\">Adolf Hitler</a> · <a href=\"https://kottke.org/tag/Dorothy%20Thompson\">Dorothy Thompson</a> · <a href=\"https://kottke.org/tag/Nazis\">Nazis</a> · <a href=\"https://kottke.org/tag/politics\">politics</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"c2f2f986bb9bacdae38f932e59ee59b643f6a90ce964b69d253bdf4e8fd9ccc4","category":"default"}