{"title":"18 Life-Learnings from 18 Years of The Marginalian","link":"https://www.themarginalian.org/2024/10/22/marginalian-18/","date":1729644139000,"content":"<p><img width=\"270\" height=\"270\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/10/monogram_circle.png?fit=270%2C270&amp;ssl=1\" alt=\"18 Life-Learnings from 18 Years of The Marginalian\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/10/monogram_circle.png?w=270&amp;ssl=1 270w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/10/monogram_circle.png?resize=240%2C240&amp;ssl=1 240w\" /></p><p>Somewhere along the way, you realize that no one will teach you how to live your own life — not your parents or your idols, not the philosophers or the poets, not your liberal arts education or your twelve-step program, not church or therapy or Tolstoy. No matter how valuable any of that guidance, how pertinent any of that wisdom, in the end you discover that you make the path of life only by walking it with your own two feet under the overstory of your own consciousness — that singular miracle never repeated in all the history and future of the universe, never fully articulable to another. </p>\n<p>This is all to say: Ever since I first began reflecting on what I have learned about living with each passing year of writing <em>The Marginalian</em> (because writing is the best means I have of metabolizing my own life), these learnings have always been profoundly personal — not overt advice to anyone else, but notes to myself about what I have needed to learn and keep relearning. I write them and share them for the same reason I read — so that we may feel less alone in our individual experience, which is just a commonplace fractal of the total human experience. (“You think your pain and your heartbreak are unprecedented in the history of the world,” James Baldwin reflected in <a href=\"https://www.themarginalian.org/2017/05/24/james-baldwin-life-magazine-1963/\">his finest interview</a>, “but then you read.”) </p>\n<p>On this 18th anniversary of <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">the birth of <em>The Marginalian</em></a>, here are all of these learnings so far as they were originally written in years past, beginning with the present year’s — the most challenging and most transformative of my life.</p>\n<blockquote><p><strong>18. How you love, how you give, and how you suffer is just about the sum of who you are.</strong> Everything in life is a subset of one or a combinatorial function of all three. Seek people who love and give generously, who have the strength to suffer without causing damage. (Only strong people are safe people, the measure of strength being not the absence of vulnerability — and “weakness” is just a judgment term for vulnerability — but the ability to carry one’s vulnerability with such self-awareness and valor so as not to harm other lives.) Seek to be such a person.</p>\n<p><strong>17. Everything is eventually recompensed, every effort of the heart eventually requited, though not always in the form you imagined or hoped for.</strong> What redeems all of life’s disappointments, what makes all of its heartbreaks bearable, is the ability to see how the dissolution of a dream becomes the fertile compost of possibility. Buried between parentheses in the middle of <em>Leaves of Grass</em> is Whitman’s testament to this elemental truth, which turned his greatest heartbreak into his greatest masterpiece:</p>\n<p><em>Sometimes with one I love I fill myself with rage for fear I effuse unreturn’d love,<br />\nBut now I think there is no unreturn’d love, the pay is certain one way or another,<br />\n(I loved a certain person ardently and my love was not return’d,<br />\nYet out of that I have written these songs.)</em></p>\n<p><strong>16. <a href=\"https://www.themarginalian.org/2019/10/21/iris-murdoch-unselfing/\">Unself</a>.</strong> Nothing is more tedious than self-concern — the antipode of wonder.</p>\n<p><strong>15. <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">Outgrow yourself</a>.</strong></p>\n<p><strong>14. Choose joy.</strong> Choose it like a child chooses the shoe to put on the right foot, the crayon to paint a sky. Choose it at first consciously, effortfully, pressing against the weight of a world heavy with reasons for sorrow, restless with need for action. Feel the sorrow, take the action, but keep pressing the weight of joy against it all, until it becomes mindless, automated, like gravity pulling the stream down its course; until it becomes an inner law of nature. If Viktor Frankl can exclaim <a href=\"https://www.themarginalian.org/2020/05/17/yes-to-life-in-spite-of-everything-viktor-frankl/\">“yes to life, in spite of everything!”</a> — and what an everything he lived through — then so can any one of us amid the rubble of our plans, so trifling by comparison. Joy is not a function of a life free of friction and frustration, but a function of focus — an inner elevation by the fulcrum of choice. So often, it is a matter of attending to what Hermann Hesse called, as the world was about to come unworlded by its first global war, <a href=\"https://www.themarginalian.org/2017/03/06/hermann-hesse-little-joys-my-belief/\">“the little joys”</a>; so often, those are the slender threads of which we weave the lifeline that saves us.</p>\n<p>Delight in the age-salted man on the street corner waiting for the light to change, his age-salted dog beside him, each inclined toward the other with the angular subtlety of absolute devotion. </p>\n<p>Delight in the little girl zooming past you on her little bicycle, this fierce emissary of the future, rainbow tassels waving from her handlebars and a hundred beaded braids spilling from her golden helmet.</p>\n<p>Delight in the snail taking an afternoon to traverse the abyssal crack in the sidewalk for the sake of pasturing on a single blade of grass. </p>\n<p>Delight in the tiny new leaf, so shy and so shamelessly lush, unfurling from the crooked stem of the parched geranium.</p>\n<p>I think often of this verse from Jane Hirshfield’s splendid poem <a href=\"https://www.themarginalian.org/2019/10/23/the-weighing-jane-hirshfield/\">“The Weighing”</a>: </p>\n<p><em>So few grains of happiness<br />\nmeasured against all the dark<br />\nand still the scales balance.</em></p>\n<p>Yes, except we furnish both the grains and the scales. I alone can weigh the blue of my sky, you of yours.</p>\n<p><strong>13. In any bond of depth and significance, forgive, forgive, forgive. And then forgive again.</strong> The richest relationships are lifeboats, but they are also submarines that descend to the darkest and most disquieting places, to the unfathomed trenches of the soul where our deepest shames and foibles and vulnerabilities live, where we are less than we would like to be. Forgiveness is the alchemy by which the shame transforms into the honor and privilege of being invited into another’s darkness and having them witness your own with the undimmed light of love, of sympathy, of nonjudgmental understanding. Forgiveness is the engine of buoyancy that keeps the submarine rising again and again toward the light, so that it may become a lifeboat once more.</p>\n<p><strong>12.</strong> Because Year 12 is the year in which I finished writing <a href=\"https://www.themarginalian.org/tag/figuring/\"><em>Figuring</em></a> (though it emanates from my entire life), and because the sentiment, which appears in the prelude, is the guiding credo to which the rest of the book is a 576-page footnote, I will leave it as it stands: <strong><a href=\"https://www.themarginalian.org/2018/11/01/figuring/\">There are infinitely many kinds of beautiful lives</a>.</strong></p>\n<p><strong>11.</strong> A reflection originally offered by way of <a href=\"https://www.themarginalian.org/2017/10/23/wislawa-szymborska-pi/\">a wonderful poem about pi</a>: <strong>Question your maps and models of the universe, both inner and outer, and continually test them against the raw input of reality</strong>. Our maps are still maps, approximating the landscape of truth from the territories of the knowable — incomplete representational models that always leave more to map, more to fathom, because the selfsame forces that made the universe also made the figuring instrument with which we try to comprehend it.</p>\n<p><strong>10. Don’t just resist cynicism — fight it actively.</strong> Fight it in yourself, for this ungainly beast lies dormant in each of us, and counter it in those you love and engage with, by modeling its opposite. Cynicism often masquerades as nobler faculties and dispositions, but is categorically inferior. Unlike that great <a href=\"https://www.themarginalian.org/2012/06/01/rilke-on-questions/\">Rilkean life-expanding doubt</a>, it is a contracting force. Unlike critical thinking, that <a href=\"https://www.themarginalian.org/2016/05/18/bertrand-russell-free-thought-propaganda-doubt/\">pillar of reason</a> and <a href=\"https://www.themarginalian.org/2015/02/09/hope-cynicism/\">necessary counterpart to hope</a>, it is inherently uncreative, unconstructive, and spiritually corrosive. Life, like the universe itself, tolerates no stasis — in the absence of growth, decay usurps the order. Like all forms of destruction, cynicism is infinitely easier and lazier than construction. There is nothing more difficult yet more gratifying in our society than living with sincerity and acting from a place of largehearted, constructive, <a href=\"https://www.themarginalian.org/2016/04/04/erich-fromm-anatomy-of-human-destructiveness/\">rational faith in the human spirit</a>, continually bending toward growth and betterment. This remains the most potent antidote to cynicism. Today, especially, it is an act of courage and resistance.</p>\n<p><strong>9. Don’t be afraid to be an idealist.</strong> There is much to be said for our responsibility as creators and consumers of that constant dynamic interaction we call culture — which side of the fault line between catering and creating are we to stand on? The commercial enterprise is conditioning us to believe that the road to success is paved with catering to existing demands — give the people cat GIFs, the narrative goes, because cat GIFs are what the people want. But E.B. White, one of our last great idealists, was eternally right when he <a href=\"https://www.themarginalian.org/2012/04/17/e-b-white-paris-review-interview/\">asserted</a> half a century ago that the role of the writer is “to lift people up, not lower them down” — a role each of us is called to with increasing urgency, whatever cog we may be in the machinery of society. Supply creates its own demand. Only by consistently supplying it can we hope to increase the demand for the substantive over the superficial — in our individual lives and in the collective dream called culture.</p>\n<p><strong>8. Seek out what magnifies your spirit.</strong> Patti Smith, in <a href=\"https://www.themarginalian.org/2015/10/19/patti-smith-m-train-loss-time/\">discussing William Blake and her creative influences</a>, talks about writers and artists who magnified her spirit — it’s a beautiful phrase and a beautiful notion. Who are the people, ideas, and books that magnify your spirit? Find them, hold on to them, and visit them often. Use them not only as a remedy once spiritual malaise has already infected your vitality but as a vaccine administered while you are healthy to protect your radiance.</p>\n<p><strong>7. “Expect anything worthwhile to take a long time.”</strong> This is <a href=\"http://explore.noodle.org/post/53767000482/the-ever-wise-debbie-millman-shares-10-things-she\" target=\"_blank\">borrowed</a> from the wise and wonderful <a href=\"https://www.themarginalian.org/tag/debbie-millman/\">Debbie Millman</a>, for it’s hard to better capture something so fundamental yet so impatiently overlooked in our culture of immediacy. The myth of the overnight success is just that — a myth — as well as a reminder that our present definition of success <a href=\"https://www.themarginalian.org/2012/07/12/thoreau-on-success/\">needs serious retuning</a>. The flower doesn’t go from bud to blossom in one spritely burst and yet, as a culture, we’re disinterested in the tedium of the blossom<em>ing</em>. But that’s where all the real magic unfolds in the making of one’s character and destiny.</p>\n<p><strong>6. Presence is far more intricate and rewarding an art than productivity.</strong> Ours is a culture that measures our worth as human beings by our efficiency, our earnings, our ability to perform this or that. The cult of productivity has its place, but worshipping at its altar daily robs us of the very capacity for joy and wonder that makes life worth living — for, as <a href=\"https://www.themarginalian.org/2013/06/07/annie-dillard-the-writing-life-1/\">Annie Dillard memorably put it</a>, “how we spend our days is, of course, how we spend our lives.”</p>\n<p><strong>5.</strong> As <a href=\"https://www.themarginalian.org/tag/maya-angelou/\">Maya Angelou</a> famously advised, when people tell you who they are, believe them. Just as important, however, when people try to tell you who <em>you</em> are, don’t believe them. <strong>You are the only custodian of your own integrity</strong>, and the assumptions made by those that misunderstand who you are and what you stand for reveal a great deal about them and absolutely nothing about you.</p>\n<p><strong>4. Build pockets of stillness into your life.</strong> Meditate. Go for walks. Ride your bike going nowhere in particular. There is a creative purpose to <a href=\"https://www.themarginalian.org/2013/10/09/mind-wandering-and-creativity/\">daydreaming</a>, even to <a href=\"https://www.themarginalian.org/2012/10/26/susan-sontag-on-boredom/\">boredom</a>. The best ideas come to us when we stop actively trying to coax the muse into manifesting and let the fragments of experience float around our unconscious mind in order to click into new combinations. Without this essential stage of <a href=\"https://www.themarginalian.org/2012/05/04/a-technique-for-producing-ideas-young/#unconscious\">unconscious processing</a>, the entire <a href=\"https://www.themarginalian.org/2013/08/28/the-art-of-thought-graham-wallas-stages/\">flow of the creative process</a> is broken. Most important, sleep. Besides being <a href=\"https://www.themarginalian.org/2012/10/01/breakthrough-alex-cornell/\">the greatest creative aphrodisiac</a>, sleep also <a href=\"https://www.themarginalian.org/2012/08/21/dreamland-science-of-sleep-david-randall/\">affects our every waking moment</a>, <a href=\"https://www.themarginalian.org/2012/05/11/internal-time-till-roenneber/\">dictates our social rhythm</a>, and even <a href=\"https://www.themarginalian.org/2012/08/13/the-twenty-four-hour-mind-rosalind-cartwright/\">mediates our negative moods</a>. Be as religious and disciplined about your sleep as you are about your work. We tend to wear our ability to get by on little sleep as some sort of badge of honor that validates our work ethic. But what it really is is a profound failure of self-respect and of priorities. What could possibly be more important than your health and your sanity, from which all else springs?</p>\n<p><strong>3. Be generous.</strong> Be generous with your time and your resources and with giving credit and, especially, with your words. It’s so much easier to be a critic than a celebrator. Always remember there is a human being on the other end of every exchange and behind every cultural artifact being critiqued. To understand and be understood, those are among life’s greatest gifts, and every interaction is an opportunity to exchange them.</p>\n<p><strong>2. Do nothing for prestige or status or money or approval alone.</strong> As <a href=\"https://www.themarginalian.org/2012/02/27/purpose-work-love/\">Paul Graham observed</a>, “prestige is like a powerful magnet that warps even your beliefs about what you enjoy. It causes you to work not on what you like, but what you’d like to like.” Those extrinsic motivators are fine and can feel life-affirming in the moment, but they ultimately don’t make it thrilling to get up in the morning and gratifying to go to sleep at night — and, in fact, they can often distract and detract from the things that do offer those deeper rewards.</p>\n<p><strong>1. Allow yourself the uncomfortable luxury of changing your mind.</strong> Cultivate that capacity for <a href=\"https://www.themarginalian.org/2012/11/01/john-keats-on-negative-capability/\">“negative capability.”</a> We live in a culture where one of the greatest social disgraces is not having an opinion, so we often form our “opinions” based on superficial impressions or the borrowed ideas of others, without investing the time and thought that cultivating true conviction necessitates. We then go around asserting these donned opinions and clinging to them as anchors to our own reality. It’s enormously disorienting to simply say, “I don’t know.” But it’s infinitely more rewarding to understand than to be right — even if that means changing your mind about a topic, an ideology, or, above all, yourself.</p></blockquote>\n<p>And here, drawn from the archive, are 18 pieces consonant with these learnings — readings and writings that have fomented these reckonings with how to live. </p>\n<h3>1. <a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\"><strong><em>Hannah Arendt on Love and How to Live with the Fundamental Fear of Loss</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2019/02/25/love-and-saint-augustine-hannah-arendt/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/10/abzlove.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>2. <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><strong><em>An Almanac of Birds: Divinations for Uncertain Days</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/birddivination00-1.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>3. <a href=\"https://www.themarginalian.org/2022/07/31/simone-de-beauvoir-coming-of-age/\"><strong><em>How to Keep Life from Becoming a Parody of Itself: Simone de Beauvoir on the Art of Growing Older</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/07/31/simone-de-beauvoir-coming-of-age/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/SimoneDeBeavuoir_BarbaraKlemm0.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>4. <a href=\"https://www.themarginalian.org/2024/03/22/love-anyway/\"><strong><em>Love Anyway</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2024/03/22/love-anyway/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/raven_JackieMorris1-1.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>5. <a href=\"https://www.themarginalian.org/2022/12/26/jeanne-villepreux-power-argonaut/\"><strong><em>The Seamstress Who Solved the Ancient Mystery of the Argonaut, Pioneered the Aquarium, and Laid the Groundwork for the Study of Octopus Intelligence</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/12/26/jeanne-villepreux-power-argonaut/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/12/JeanneVillepreux-Power_argonaut_TheMarginalian.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>6. <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\"><strong><em>What Happens When We Die</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/pillarsofcreation.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>7. <a href=\"https://www.themarginalian.org/2022/05/17/beethoven-ode-to-joy/\"><strong><em>Trial, Triumph, and the Art of the Possible: The Remarkable Story Behind Beethoven’s “Ode to Joy”</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/05/17/beethoven-ode-to-joy/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/beethoven00.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>8. <a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\"><strong><em>A Spell Against Stagnation: John O’Donohue on Beginnings</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2023/12/30/john-odonohue-blessings-beginnings/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/beginning.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>9. <a href=\"https://www.themarginalian.org/2015/02/12/the-missing-piece-meets-the-big-o-shel-silverstein/\"><strong><em>The Missing Piece Meets the Big O: Shel Silverstein’s Sweet Allegory for the Simple Secret of Love and the Key to Nurturing Relationships</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2015/02/12/the-missing-piece-meets-the-big-o-shel-silverstein/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/02/themissingpiecemeetsthebigo0.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>10. <a href=\"https://www.themarginalian.org/2022/11/09/steinbeck-log-from-the-sea-of-cortez/\"><strong><em>The Log from the Sea of Cortez: John Steinbeck’s Forgotten Masterpiece on How to Think and the Art of Seeing the Pattern Beyond the Particular</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/11/09/steinbeck-log-from-the-sea-of-cortez/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/05/johnsteinbeck3.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>11. <a href=\"https://www.themarginalian.org/2022/08/28/margaret-wise-brown-michael-strange-poems/\"><strong><em>The Eternal Lyric of Love and Loss: “Goodnight Moon” Author Margaret Wise Brown’s Little-Known Poems for the Tragic Love of Her Life</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/08/28/margaret-wise-brown-michael-strange-poems/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/08/mwb_ms.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>12. <a href=\"https://www.themarginalian.org/2024/07/02/birds-dream-rem/\"><strong><em>What Birds Dream About: The Evolution of REM and How We Practice the Possible in Our Sleep</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2024/07/02/birds-dream-rem/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/11/thelostspells000.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>13. <a href=\"https://www.themarginalian.org/2022/07/09/ferdinand-civilon/\"><strong><em>The Bittersweet Story of the Real-Life Peaceful Bull Who Inspired Munro Leaf and Robert Lawson’s Ferdinand</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2022/07/09/ferdinand-civilon/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/ferdinand_civilon.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>14. <a href=\"https://www.themarginalian.org/2017/10/11/a-life-of-ones-own-joanna-field-marion-milner/\"><strong><em>A Life of One’s Own: A Penetrating Century-Old Field Guide to Self-Possession, Mindful Perception, and the Art of Knowing What You Really Want</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2017/10/11/a-life-of-ones-own-joanna-field-marion-milner/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/02/thewellofbeing_weill0.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>15. <a href=\"https://www.themarginalian.org/2023/03/23/thoreau-friendship/\"><strong><em>An Introvert’s Field Guide to Friendship: Thoreau on the Challenges and Rewards of Candid Connection</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2023/03/23/thoreau-friendship/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/sophieblackall_thingstolookforwardto00-1.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>16. <a href=\"https://www.themarginalian.org/2017/01/13/rachel-carson-dorothy-freeman-letters/\"><strong><em>The Monarchs, Music, and the Meaning of Life: The Most Touching Deathbed Love Letter Ever Written</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2017/01/13/rachel-carson-dorothy-freeman-letters/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/01/rachelcarson00.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>17. <a href=\"https://www.themarginalian.org/2024/08/05/iris-murdoch-imagination/\"><strong><em>How to See More Clearly and Love More Purely: Iris Murdoch on the Angst of Not Knowing Ourselves and Each Other</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2024/08/05/iris-murdoch-imagination/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/irismurdoch3.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<h3>18. <a href=\"https://www.themarginalian.org/2023/07/23/platero-and-i/\"><strong><em>The Donkey and the Meaning of Eternity: Nobel-Winning Spanish Poet Juan Ramón Jiménez’s Love Letter to Life</em></strong></a></h3>\n<p><a href=\"https://www.themarginalian.org/2023/07/23/platero-and-i/INK\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/07/HealerOnADonkey_Pirosmani0.jpg\" width=\"600\" /></a></p>\n<p><br /><br /></p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"c352e3262a027f6bf3fd07252c5f774ecd88375a668b23ea30ec35a54a3d8226","category":"Sites"}