{"title":"Cicadas and Prime Numbers","link":"https://kottke.org/24/05/cicadas-and-prime-numbers","date":1715877048000,"content":"\n        <p>You may have heard that this year, for the first time since 1803, <a href=\"https://www.vox.com/science/24047261/cicada-brood-xix-xiii-19-13-map\">two different broods of cicadas will emerge at the same time</a>.</p>\n\n<blockquote><p>This year, though, will be a rare event. Two groups, or “broods,” are waking up during the same season. There will likely be billions, if not trillions, of the insects.</p>\n\n<p>There’s the 17-year-group called Brood XIII, which is concentrated in northern Illinois (brown on the map below), and the 13-year clutch, Brood XIX, which will emerge in southern Illinois, Missouri, Arkansas, and throughout the Southeast.</p></blockquote>\n\n<p>You may have noticed the lengths of both periodicities (13, 17) are prime numbers — and that does not appear to be a coincidence. Scientists haven’t nailed down an exact cause, but <a href=\"https://www.newyorker.com/tech/annals-of-technology/the-cicadas-love-affair-with-prime-numbers\">one hypothesis has to do with predator cycles</a>:</p>\n\n<blockquote><p>According to the paleontologist Stephen J. Gould, in his essay “Of Bamboo, Cicadas, and the Economy of Adam Smith,” these kind of boom-and-bust population cycles can be devastating to creatures with a long development phase. Since most predators have a two-to-ten-year population cycle, the twelve-year cicadas would be a feast for any predator with a two-, three-, four-, or six-year cycle. By this reasoning, any cicada with a development span that is easily divisible by the smaller numbers of a predator’s population cycle is vulnerable.</p>\n\n<p>Prime numbers, however, can only be divided by themselves and one; they cannot be evenly divided into smaller integers. Cicadas that emerge at prime-numbered year intervals, like the seventeen-year Brood II set to swarm the East Coast, would find themselves relatively immune to predator population cycles, since it is mathematically unlikely for a short-cycled predator to exist on the same cycle. In Gould’s example, a cicada that emerges every seventeen years and has a predator with a five-year life cycle will only face a peak predator population once every eighty-five (5 x 17) years, giving it an enormous advantage over less well-adapted cicadas.</p></blockquote>\n\n<p>See also <a href=\"https://www.nature.com/articles/497545a\">Long-lived insects raise prime riddle</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/mathematics\">mathematics</a> · <a href=\"https://kottke.org/tag/science\">science</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/05/cicadas-and-prime-numbers\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"c3f692c41c7e396406647d4001bd271e91349f4596b4d0808c83ba6977683a39","category":"default"}