{"title":"Investing at the Edge of Large Markets Under Transformative Pressure","link":"https://www.usv.com/writing/2024/01/investing-at-the-edge-of-large-markets-under-transformative-pressure/","date":1706026847000,"content":"<p>Union Square Ventures turns 20 this year.  Brad and Fred began to deploy the first USV fund in 2004. The dot com bubble had recently popped, modern smartphones hadn’t been invented, “social media” wasn’t a thing, and the first bitcoin transaction wouldn’t be recorded for another 5 years.</p>\n\n\n\n<p>Since then, we have raised and invested a total of 14 funds (8 “Core” early stage funds, 2 early stage Climate Funds, and 4 Opportunity Funds), and have made more than 230 investments across many categories &amp; technologies: social media, marketplaces, developer tools, learning, health, fintech, web3 &amp; decentralized systems, energy &amp; climate and more.   </p>\n\n\n\n<p>Throughout our history, we’ve developed investment theses around moments where major technological or societal changes were likely to enable new approaches:</p>\n\n\n\n<ul>\n<li>In 2003/4, the <a href=\"https://drive.google.com/file/d/19gBfw7SHJbYP_TxicvQrhiotALqZIQqW/view\">opportunity</a> was to build at the application layer of the internet, leveraging the core infrastructure investments of the dot-com bubble era.  </li>\n\n\n\n<li>By the mid 2000s, it became clear that it would be possible to build new <a href=\"https://twitter.com/BradUSV/status/78512458419015680?ref_src=twsrc%5Etfw%7Ctwcamp%5Etweetembed%7Ctwterm%5E78512458419015680%7Ctwgr%5E3e1af5e6a5bc87eca49a811e17aef5d3f45e456d%7Ctwcon%5Es1_&amp;ref_url=https%3A%2F%2Fwww.usv.com%2Fapproach%2F\">networks</a> (social networks, marketplaces, etc) as a specific, and very powerful type of internet application.  </li>\n\n\n\n<li>Then, as broad-based networks began to solidify in the early 2010s, <a href=\"https://www.usv.com/writing/2015/12/usv-thesis-2-0/\">we began to look for</a> narrower vertical networks (for example, in learning and health), new layers of enabling infrastructure (developer tools, fintech), and <a href=\"https://www.usv.com/writing/2013/10/bitcoin-as-protocol/\">decentralized computing systems</a> (blockchains and cryptocurrencies).  </li>\n\n\n\n<li>As internet applications became even more central to the global economy in the late 2010s, we looked to leverage them to <a href=\"https://www.usv.com/writing/2018/04/usv-thesis-3-0/\">broaden access</a> to key resources (such as knowledge, capital, and wellbeing), and also looked for opportunities to increase our <a href=\"https://www.usv.com/writing/2019/05/trusted-brands/\">trust</a> in these key systems.  </li>\n\n\n\n<li>Approaching 2020, with the <a href=\"https://www.usv.com/writing/2021/01/usv-climate-fund/\">rapid acceleration of the climate crisis</a> becoming clear, we sought to identify transformational startup opportunities to mitigate its impacts, accelerate the energy transition, and adapt to a changing world.  </li>\n\n\n\n<li>Today, we’re seeing LLMs and AI <a href=\"https://www.usv.com/writing/2023/10/open-source-the-ai-stack-and-need-for-permissionless-experimentation/\">exponentially increase</a> the ubiquity and usefulness of software everywhere, while also underscoring the need to invent <a href=\"https://avc.com/2022/12/sign-everything/\">new forms of digital trust</a>.</li>\n</ul>\n\n\n\n<p>Looking back at this 20-year history of investing across distinct moments in time and many diverse sectors, we recently asked ourselves: what is the through line in how we approach investing?  </p>\n\n\n\n<p>Here’s how we describe it: </p>\n\n\n\n<p><strong><em>USV invests at the edge of large markets being transformed by technological and societal pressures</em></strong></p>\n\n\n\n<p>Across time, sectors, and technologies, we have consistently looked for, and will continue to look for, a common set of attributes that we believe lead to novel products and experiences:</p>\n\n\n\n<p><strong>The Edge</strong></p>\n\n\n\n<p>The “edge” of large markets is often the best place to introduce new ideas and approaches. Startups at the edge often start out looking <a href=\"https://www.usv.com/writing/2024/01/weird/\">weird</a>, yet have the potential to take on incumbents in surprising new ways.  </p>\n\n\n\n<p>For example, early social media didn’t look like it was competing with traditional media; early cryptocurrencies didn’t look like they were competing with the financial system; many consumer learning products don’t look like they are competing head-on with the legacy education system.</p>\n\n\n\n<p>New technologies enable behaviors that weren’t previously possible.  In hindsight, these new behaviors are obvious, but they require experimentation to explore as they emerge. Rapid experimentation is the fastest path to progress – but change is hard. Institutions and incumbents resist it. </p>\n\n\n\n<p>“Edge” approaches – such as consumer-first, prosumer, developer-first, and open source models – have the potential to avoid market gatekeepers and enable freer experimentation.  We love them for this reason.</p>\n\n\n\n<p><strong>Pressures</strong></p>\n\n\n\n<p>Technological and societal pressures can upset existing market structures, creating openings for new companies and networks to meet the market in new ways.  </p>\n\n\n\n<p>Technological pressures can include new technologies and platforms, such as new operating systems, crypto assets, and the AI stack.  The most profound technological pressures introduce new business models, often ones that incumbents are structurally unable to pursue. </p>\n\n\n\n<p>Societal pressures can include planetary forces like the climate crisis, loss of faith in civic institutions, or changing social norms and attitudes.  These pressures can rapidly produce changes in behavior that would otherwise have been unimaginable or at least improbable.</p>\n\n\n\n<p>Together, these pressures can cause otherwise static market structures to become dynamic. Startups have the opportunity to position themselves in alignment with these pressures, allowing themselves to work “<a href=\"https://suntzusaid.com/book/7/33/\">downhill</a>” against legacy incumbents.  We continually seek out these pressures and look for opportunities for startups to draft behind them.</p>\n\n\n\n<p><strong>Looking Ahead</strong></p>\n\n\n\n<p>Looking ahead at the next 20 years of investing at USV: as global change accelerates, and as new technologies emerge and mature, we will continue to develop and publish specific theses about where we see opportunity.  As we do so, we expect to stay consistent with this overarching framework of seeking out opportunities at the edge of large markets, propelled by the tailwinds of transformative pressure.</p>\n\n\n\n<p>We are excited to partner with founders who are aligned with our thesis and we look forward to exploring the edge together.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/01/investing-at-the-edge-of-large-markets-under-transformative-pressure/\">Investing at the Edge of Large Markets Under Transformative Pressure</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"c409abed2e21f6b8f1429742d69fb3838bf0d04a11027abdfe130e45866eb1a7","category":"default"}