{"title":"A personal renaissance","link":"https://blog.webb.page/2024-09-16-personal-renaissance.txt","date":1726444800000,"content":"<p>I tire of platforms. So of course, I'm building a platform.</p>\n<p>I think a major reason why dystopian games like Cyberpunk 2077, Deus Ex: Human\nRevolution and Mankind Divided, and even the Watch Dogs series fascinates me so\nis because in these games, I am not a mere bystander. In these fantasies, I have\nthe power to fight back against injustice. I can literally \"stick it to the man\"\nand in my own way, save the world. In other words, I can be the change I wish to\nsee in these worlds AND have immediate effect for the betterment of most, if\nnot all.</p>\n<p>When I power down my PS5 however, reality beckons and I see red orbs indicating\nactivity from online friends and acquaintances on platforms where I'm\npigeonholed into the same box as everyone else; my expression and originality\nwelcome as long as they fit into neat compartments designated by the platform.\nI do not particularly enjoy using these platforms as much as I enjoy\ncommunicating with humans who also feel the way I do. The term \"necessary evil\"\ngets thrown around a lot…why must evil be necessary? I don't have the stomach\nfor such a rabbit hole, I'll let others investigate that topic further.</p>\n<p>Twitter is a cesspool. You hear that? A lot of grumbles in agreement,\nreverberating across the internet. No one is happy about it and even though many\n(most?) of the accounts we follow have since fled to Mastodon and Bluesky, they\naren't replacements. I haven't posted gameplay clips to my gaming Twitter in a\nyear but I keep the account because the amazing illustrators, game developers,\nand composers I follow there are very much active and will not move elsewhere.</p>\n<p>Remember Myspace? Pepperidge Farms remembers. I'm sure you do too (if you're\nyounger than a millennial, get rekt). I was a teen when it was THE online place\nto be. Everyone I knew, even \"cool\" kids and jocks understood enough about HTML\nand CSS to customize their profiles. People gatekept themes sites so peers\nwouldn't have a better-looking profile. It was a point of pride when you could\nde-obfuscate CSS to replicate something or even customize it more to make some\neffect your own. Anecdotally, it seemed like the collective intelligence of the\ninternet was higher when we had to use our minds more. We should get back to\nthat. We COULD get back to that.</p>\n<p>Much has been said about how advertising ruined the web experience (by giving\nbirth to the data brokerage economy) and while that's true, isn't it super\nfucking sad that Silicon Valley is spending all of its money and attention on\nm̶a̶s̶s̶i̶v̶e̶ i̶f̶/t̶h̶e̶n̶/e̶l̶s̶e̶ f̶a̶c̶t̶o̶r̶i̶e̶s̶ LLMs? Trick question, they got us into this\nmess, why fix it?</p>\n<p>This is where I tell you I'm saving the world with my platform. I mean, it could\nhappen, right? My lil' social network could upend everything and I'll have VCs\ngroveling at my feet. My TED Talk will feature me in muted hacker-wear (hoodie\nand jeans) and I'll pseudo-humbly recount my beginnings and half-smile while the\nslide behind me shows $1 billion in quarterly revenue.</p>\n<p>No, this is me being the change I wish to see in the world.</p>\n<p>I wish other people would build things I want to use so I can spend my free time\nplaying Fortnite and watching shows. I mean, I do do those things but it's kinda\nlike someone who learned what kerning is and then notices terrible kerning on\nevery street corner. I know too much. I took the old \"should designers code\"\nmeme seriously and did just that. Building is my verb it's what I <em>do</em>.</p>\n<p>The last post on this blog was literally eight months ago. I felt compelled to\npublish today for some reason. The funny thing is, the last time I posted about\nsocii (the social network/platform I'm building) was several years ago<a href=\"/2021-02-15-an-update-on-socii.txt\">1</a>. I\ntook a detour and did a lot of work for the Handshake blockchain in that time\nbut quit due to ideological differences<a href=\"https://blog.neuenet.com/post/devlog-014\">2</a>. It turns out, perverse incentives\nare rampant everywhere and the only way to win is not to play.</p>\n<p>Quitting Handshake made me re-evaluate my life in whole. Where I am not\nfulfilled, I'm making changes. I'm reclaiming my space on the web, starting with\nmy homepage. There's no reason why it cannot also be the testing ground for the\npersonal OS concept<a href=\"/2019-12-02-a-personal-api.txt\">3</a> I published years ago. Music I intended to publish 15\nyears ago will finally release (they were trapped in Acid Pro 6, I bought a\nbasic Windows PC to free them). Sci-fi novels scribbled in notebooks will be\nscrutinized by the world. I don't care. I've been hoarding ideas and concepts\nfor far too long. Not enough characters to share 'em? Who cares, I have a blog.</p>\n<p>This post is rambly but again, who cares? I am constantly inspired by others so\nthe least I can do is put myself out there more.</p>\n<p>Okay, socii<a href=\"https://socii.network\">4</a> (click the logo to hear the pronounciation: \"sew-key\") is a paid\nservice. Not expensive, but not cheap either. Social networking with advanced\nanti-harassment tools and customization like you wouldn't believe (I mentioned\nMyspace for a reason). Small groups because large groups invoke trolls. The UI\nof Big Social becoming mere feature/theme toggles. True data ownership. I could\ngo on but I'd rather get back to building. 2025.01.01 is the launch date.\nNewsletter signup is on the site if you're interested.</p>\n<p>All this to say, I think I'm gonna enjoy having my homepage be the source of\ntruth for all the things I do online. And, I have an intense interest in making\nBig Social suffer. If I can get my favorite creators on socii too, I'm happy.</p>\n<p>🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"c418b5c2e5afd713e9a9326eae1810125855ab2f89a9022c28b37325835096dc","category":"Sites"}