{"title":"no fear of being seen","link":"https://keningzhu.com/journal/no-fear-of-being-seen","date":1729017298000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/15-no-fear-of-being-seen/id1731169431?i=1000673204673\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/4LAZ4z8o3rXz5tcmx4iqGS?si=55dabd127a504947\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>on untangling the fear of being seen -- and understanding where the desire to hide (in your creative work, life, or your digital expressions) comes from, and exploring how to release it. we'll dive into: </p><ul><li><p>the practice of un-hiding yourself</p></li><li><p>the tension of being different </p></li><li><p>being present is more important than being public </p></li><li><p>deliberately curating your safe zones </p></li><li><p>facing your imaginary shadow gaze </p></li><li><p>why making art in public -- IS the practicing seeing yourself</p></li><li><p>becoming the loving, attentive gaze </p><p></p></li></ul><p><strong>🌱 additional resources</strong></p><p><a href=\"https://keningzhu.com/journal/make-art-for-no-audience\">⁠make art for no audience⁠</a></p><p><a href=\"https://keningzhu.com/journal/make-art-in-the-void\">⁠make art in the void⁠</a></p><p><a href=\"https://keningzhu.com/journal/the-internet-as-a-creative-practice-podcast\">⁠⁠the internet as a creative practice⁠⁠</a></p><p><a href=\"https://keningzhu.com/house-on-the-webs\">⁠house on the webs⁠</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6e845bf5-c3c7-48ce-b8ff-1ce7f7a5adcb/ep+15%E2%80%93+10.15.24.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction </h1><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening, and I'll be your guide.</p><p>I've returned to podcasting after a little break. I went on a two-week road trip with my partner and dog Luna, and I've been trying to decide whether I want this podcast to be more deliberately seasonal or consistently weekly-ish.</p><p>And I don't have the answer to this question yet, so thank you for bearing with me through this process.</p><p>This week's topic is a subject close to my heart.</p><p>It's about the fear of being seen, and it's for anyone who's ever felt more comfortable hiding in the shadows of their inner worlds rather than being exposed in the light of a public space.</p><p>And today I want to untangle this fear, to examine the root source of it and think about where it comes from, and then to offer some reframings and as well as an antidote to begin the process of releasing this fear.</p><p>I will explore the tension of being different and drawing safe zones for how to be in public, how to identify your imaginary shadow gaze, and last but not least, embracing the practice of seeing yourself.</p><p></p><h1>untangling the fear </h1><p>So let's begin with untangling.</p><p>What does it feel like to be afraid of being seen?</p><p>For me, this fear comes from feeling too naked, like overexposed, in what feels like could be a hostile or indifferent environment.</p><p>To be seen in that way threatens a sense of safety and survival.</p><p>My nervous system reacts and says, \"Don't be foolish, those parts of yourself have no place here, so it's better just to tuck them away, to hide them, and just to be quiet.\"</p><p>Before I know it, my fear of being seen turns into an act of self-exiling.</p><p>I feel a sense of un-belonging, a sort of homelessness for those parts of me that don't quite fit in.</p><p>Where does this reaction come from?</p><p>When I think back to the earliest origins, I think about, for me, this tension of being different, being different from other people that I was surrounded by.</p><p>I've felt this tension of difference my entire life.</p><p>As a child, as long as I can remember, I've always felt like an outsider in every space, including my own family and friend groups and a cultural environment.</p><p>I've always had to translate between what was happening out there and what was happening in here, in my inner emotional world.</p><p>There was always an enormous dissonance, and I didn't know what to do with this dissonance.</p><p>And being different can feel lonely.</p><p>My nervous system says being different is lonely, being different is foolish, and being different is unsafe.</p><p>Therefore, in survival mode, I feel like I only have two possibilities.</p><p>To conform, which is what most of us are taught as children, to fit ourselves into recognizable shapes and forms, to pass as good enough, as legitimate, as like everyone else in the eyes of everyone else's metrics.</p><p>Or to hide.</p><p>Hide because you're different and you don't know how to be different in public spaces.</p><p>Actually, you can.</p><p>I will propose a third possibility and unpack that in this episode.</p><p>But before we go there, first, I want to talk about this practice of unhiding.</p><p></p><h1>the practice of un-hiding yourself </h1><p>Unhiding yourself and being seen is not a binary.</p><p>You don't have to choose between being very public and seen, or being very private and unseen.</p><p>You can decide which parts of your life or practices you get to keep behind the veil and which parts you want to reveal and how and when.</p><p>I find that when I feel overexposed, it's because I haven't really learned how to navigate the in-betweenness of public and private.</p><p>I haven't created a sense of safety for myself.</p><p>In unhiding yourself, remember that the goal here is not to be extremely public.</p><p>The goal is to be extremely present in the spaces you choose to show up.</p><p>If we think of the act of hiding as like drawing a small circle around your zone of safety and trying not to venture past the circle, then the act of unhiding is not to get rid of the circle entirely, but to expand its boundaries.</p><p>It's about cultivating safety in deliberately chosen spaces until eventually that circle moves wherever you move, and you don't have to be everywhere at once.</p><p>You can be very intentionally present.</p><p>Let go of this nebulous, scary idea of a general public space that is out there, and be specific about where you're drawing a circle around your zones of safety.</p><p>For me, I felt such enormous relief when I let go of any inkling of being on social media or being on platforms and instead distilled my public practice into three spaces.</p><p>My website, this podcast, and my newsletter.</p><p>For me, these three spaces feel safe and that they feel almost semi-private.</p><p>It's public in that anyone can find me, but there is a sense of intimacy when you come to visit me when I offer my voice in your ears through this podcast and send you a letter to the privacy of your inbox.</p><p>The idea of being very public can sound scary.</p><p>Remember that your work is never for the general public.</p><p>You can decide which spaces you want to be present in and practice making those spaces feel like a home.</p><p></p><h1>the imagined shadow gaze</h1><p>To unhide is to release the imaginary gaze that we think we're hiding from.</p><p>What kind of gaze is it?</p><p>Judging, dismissing, disapproving, and who is doing the looking?</p><p>Because remember this, being seen is neutral.</p><p>It's an event that happens.</p><p>Our fear is not of being seen, but of what happens next.</p><p>How does the seer respond to you?</p><p>What do they think or say or do?</p><p>And I think actually the fear is not about being seen.</p><p>Paradoxically, the fear is about not being seen.</p><p>The fear is about having someone look at you and not see you as you desire to be seen, as you are.</p><p>What we fear most, I will call the imaginary shadow gaze.</p><p>It's the fear of being ignored, dismissed, overlooked, or judged, ridiculed, admonished, or minimized, misunderstood, and unacknowledged.</p><p>What does your shadow gaze feel like?</p><p>What does it say to you?</p><p>For me, my fear of being seen was deeply intertwined with my fear of being ignored, minimized, and misunderstood.</p><p>And ultimately, it comes down to fear of being not enough.</p><p>When I followed my fear to its dead end, because I think that is what fear is, a dead end road, I realized that I was afraid that if I showed myself to the world and then I was ignored for it, then it would open up this deep abyss of loneliness in me, like a black hole of meaninglessness that I would fall into forever and never come out.</p><p>It would mean that my ideas and my art had no value or worthiness, because no one understood them or acknowledged them.</p><p>I spent a long time being with this fear, walking into this fear until I couldn't walk further.</p><p>And then I found my peace with it.</p><p>I decided that even if no one saw me, even if I was totally alone in the world, then so be it.</p><p>I would still make art because my art is for me and no one else.</p><p>The only gaze that mattered was my own.</p><p>And to hear more about this, you can listen to the podcast episode number eight, Make Art for No Audience.</p><p></p><h1>the practice of seeing yourself  </h1><p>I think we all live with our own imaginary shadow gazes or shadow voices.</p><p>oftentimes these are programmed early on from childhood, voices that might be well-intentioned, trying to keep us safe or voices that are simply passed down, like inherited scripts that we downloaded and now have put this lock or paralysis on our psychic and creative systems.</p><p>The fear of being seen comes from the tension of being different.</p><p>And that shadow gaze, it doesn't know how to resolve this tension except the binary options of conforming or hiding.</p><p>To unhide yourself is to bring yourself into the light where it feels safe to be whole, to be seen as yourself by the other.</p><p>And the secret I want to tell you, and it is no secret because I've said it before, is that there is actually no other.</p><p>There's only the universal interconnected capital I and the universal seeing I.</p><p>To see yourself is to see the other.</p><p>To see yourself is to be seen by others.</p><p>What does it feel like to be seen?</p><p>To feel seen?</p><p>What is the quality of attention that you desire and crave?</p><p>I think the practice here is to embody this and to give that gaze to yourself in small ways every day.</p><p>For me, journaling is definitely one way of doing this, meditating, tuning into my body.</p><p>All of these are practices of paying wrapped, awake attention to the nuances of your psychic being.</p><p>All of these are practices of self-love that extend so far beyond just you.</p><p>Actually, it's an act of freedom and rebellion because it gives permission to all of us to be different, to unhide our differences in our own ways, and let it take up space.</p><p>And so beyond this binary of conformity or hiding, the third option I'll propose is very simple.</p><p></p><h1>make art in public </h1><p>The practice of seeing yourself is this.</p><p>Make art in public.</p><p>The very process of art necessitates that you see yourself and your life.</p><p>Making art requires more than anything your presence and attention.</p><p>Sharing it requires that you unhide and make space for your particular ways of seeing.</p><p>To make art in public is both the thing that you probably fear and the means through which you will transform and release the sphere.</p><p>When you feel the tension of your difference, the dissonance between your inner and outer worlds, your immediate response can be to turn inwards to your creative practice to make art about it and then to share it like completing an exhale.</p><p>Because this tension of difference can be a fuel for the creative impulse.</p><p>For me, my creativity is always trying to resolve the strangeness and foreignness I feel everywhere I go.</p><p>This is why I draw and write and come up with new ideas for how to be in the world as my whole self.</p><p>It's like I'm constantly trying to solve this puzzle, how I can create belonging for my messiness, for my ongoingness in the world.</p><p>And the process is always the way.</p><p>The process of making art is always the solution.</p><p>Making art in public requires that you become the gaze.</p><p>You become the one that sees and your gaze is the one that truly matters.</p><p>In the past, I've written a manifesto called \"Make Art in the Void\" and I'd say that making art in public is actually the same thing.</p><p>It is only public because you're not hiding from yourself.</p><p>You're not hiding from the void, from your imagined shadow gaze, or from anyone else.</p><p>When you have no fear of being seen, you no longer worry about who sees you or doesn't.</p><p>Because you're just unself-consciously being yourself, fully present with the creative life force in you wherever you go.</p><p>And I'm convinced that this is the greatest gift you can give to others, to become the loving, attentive, accepting gaze always present at the other end of this infinite internet vastness.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"c42b892d1ed1b5e87206dcd570d7a170fb728c68cf8941fa70fe0ea14aea6abc","category":"Sites"}