{"title":"AI is changing writing","link":"https://om.co/2024/03/19/ai-is-changing-writing-here-is-what-to-do-about-it/","date":1710892800000,"content":"<p>I recently <a target=\"_blank\" href=\"https://om.co/2024/03/16/why-i-redesigned-my-home-page/\">redesigned my homepage</a> to provide a clearer context about “me” as a writer and as a person. Not just to simplify things, but also to put more “I” in the new age of “AI” where it will increasingly become challenging to distinguish hu<em>man</em> from machine. </p>\n\n\n\n<p>The best part of the Internet is that it is always evolving. </p>\n\n\n\n<p>It is nothing if not a reflection of <strong><em>we the people, who use, evolve,</em></strong> and shape the network. Just as the network shapes us. This truth about constant change has helped me embrace and evolve with it. And a lot of that is reflected in what I write. </p>\n\n\n\n<p>The latest change that is going to shape the network, and how we work on it is the emergence of “AI” — artificial intelligence to some, but “augmented intelligence to me.” </p>\n\n\n\n<p>Despite all the existential anxiety over AI, this is a natural progression of how we have worked with technology in general, and software in specific. Increased automation and simplification of tools are just part of making technology (and software) work for way more people. And that means it has to be simpler and faster. And like everything that tries to do that, it has its side effects and downsides. </p>\n\n\n\n<p>Just look at blogs — when we started, blogging was not easy. You needed specialized software. Since those days, the “blogs” as we knew them have been atomized. The platforms have taken over, and blogging is everywhere: social media, newsletters, and communities – they do what we all used to do. But ultimately, the ideology of blogging is still the same. Whether you post on Twitter or LinkedIn, you are doing what I have been doing on specialized software.</p>\n\n\n\n<p>The rise of various platforms means a lot more is being published. A lot of new ideas are flowing freely, but so is the drivel. You don’t have to look too far to see how much of the internet is essentially thinly veiled marketing “content.” It is a pet peeve of mine (I have my <a href=\"https://om.co/2019/06/16/the-problem-with-content/\" target=\"_blank\">reason</a>s.) </p>\n\n\n\n<p>“Content is inherently transactional; its goal is to drive towards some kind of conversion, some kind of exchange of value,” <a href=\"https://www.subtraction.com/2019/06/06/writing-content-vs-writing-writing/\" target=\"_blank\">said</a> Khoi Vinh, designer and blogger.</p>\n\n\n\n<p>The emergence of generative AI tools means that we will see more content being generated and put on the web. It would be a unique challenge for all the major technology platforms — Facebook, Instagram, YouTube, and most importantly Google Search — to tame the beast that has been unleashed. Recently, we have seen generative AI has been beneficial for the SEO business, <a target=\"_blank\" href=\"https://twitter.com/neilpatel/status/1765069352074870996\">but not for long</a>. Technology giveth, <a target=\"_blank\" href=\"https://searchengineland.com/google-released-massive-search-quality-improvements-with-march-2024-core-update-and-multiple-spam-updates-438144\">and taketh.</a></p>\n\n\n\n<p>My approach to AI has been to embrace and extend my capabilities. <a href=\"https://om.co/2024/03/12/my-most-used-apps-have-ai-inside/\" target=\"_blank\">I use quite a few tools</a> with AI inside. Many of them have boosted my productivity. I am on the lookout for more to add to my arsenal, so I can become more effective when it comes to my creative output. I don’t need it to write for me. I need AI to make sure I don’t make spelling mistakes, point out some overused phrases, repetitive usage of phrases, and what my editors used to call “Om” things. </p>\n\n\n\n<p>Media entities have this ludicrous trend of disclosing that they have used “AI” on some article or the other. If that is the case, they should disclose they used Google Docs or Microsoft Office and their built-in “grammar” and “spelling” and other features. Anyway, media companies are big on disclosures and less on actually doing interesting things with new technology.</p>\n\n\n\n<p>Writing, thinking, and creating <em>is how my soul works</em>, and AI can’t replace that. And AI can’t replace that reality, which needs to be reflected not only in my work, but also on my website, and everywhere else I exist on the Internet. </p>\n\n\n\n<p>And that is why I decided to remix the homepage of my website. If you are a newcomer or a casual visitor, then you get a very good idea about me – the person behind the blog and my various interests—with a quick scan. I believe this reflection of “self” or a person will be important in the times ahead. The rise of generative AI means that there will be more indistinguishable content on the internet, and the only way to stand out — is by reminding people that you are human.</p>\n\n\n\n<p>I am putting more I in the “AI” — as a way to stand out and stay ahead. </p>\n\n\n\n<p>March 19, 2024/ San Francisco. </p>\n\n\n\n<p><em><strong>Editor’s Note: If some of this sounds too familiar, then it is because I used some of the key points in an earlier post. I wrote this piece to primarily share on Twitter. </strong></em></p>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2019/06/16/the-problem-with-content/\">The Problem With “Content”  </a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"c4916f21fdb68d76449207ca59edbc602df60c63ff824ab88dc7663bd7a08b96","category":"default"}