{"title":"","link":"http://scripting.com/2024/03/05.html#a135148","date":1709646708000,"content":"<img src=\"https://imgs.scripting.com/2023/08/01/mrmet.png\" /><a href=\"https://www.threads.net/@emilyreesnunn/post/C4GDOWGr9T6\">Emily Nunn</a>: \"I don’t understand how all the outcry about their bizarre and defensive political coverage and the scary effect it can have on the election is not a major investigative story being written by other journalists. Not some fancy media critic opinion or an editorial. A real report, taking defensiveness out of it and applying accountability.\" A regular reader of this blog will know how totally I agree with this. But oddly when I agreed with her, perhaps a little to strongly for her liking, she accused me of being a MAGA. It's so totally not true, and very typical of reporters, to use an ad hominem to not have to listen to a non-journalist opinion about journalism. I have been a reader of the NYT since I was a small child. I wanted to be a writer like <a href=\"https://en.wikipedia.org/wiki/Russell_Baker\">Russell Baker</a>. I was quoted by <a href=\"https://en.wikipedia.org/wiki/William_Safire\">William Safire</a> in an op-ed. I have done some of the <a href=\"http://scripting.com/davenet/2002/04/10/newYorkTimesAndUserland.html\">most successful work</a> of my career with the NYT. I love journalism <a href=\"http://scripting.com/2018/06/24/181734.html\">like I love the Mets</a>. I don't expect them to do great things every season, but I do hope for a <a href=\"https://en.wikipedia.org/wiki/1969_New_York_Mets_season\">1969</a> or <a href=\"https://en.wikipedia.org/wiki/1986_New_York_Mets_season\">1986</a> every once in a while. These days I don't see much hope for the NYT returning to its former glory. I also wonder if they ever really were that great, that maybe I was just a naive young hero-seeker, growing up in Queens in the 1960s. We <i>all</i> have to work together to dig out of the hole we're in. And that means reporters have to start looking at themselves, and they have to listen to us, the people who care about the job that we need journalism to do, that it isn't doing.","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"c4ed703e1a65e3a563270661d1c33af70ef168b58c2e2501155dee5e743e3289","category":"default"}