{"title":"Duplicate, infiltrate, and undermine","link":"https://www.garbageday.email/p/duplicate-infiltrate-and-undermine","date":1702328749000,"content":"<div><div><h2>Grok Is Woke Unfortunately</h2><p>Late last week, Grok started rolling out to users and it’s a resounding flop. It hallucinates constantly, its “funny” answers aren’t funny, it routinely <a href=\"https://twitter.com/JaxWinterbourne/status/1733339886155968714?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">spits out</a> text that seems to be directly from OpenAI’s ChatGPT, most likely because it was trained on tainted data, and, most disastrous of all, <a href=\"https://twitter.com/BobSaietta/status/1734076023950459103?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">it’s too woke</a>. </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/54b55ce5-0a42-491d-9419-ea3a3937af30/1738c34f-f3da-4916-8fbb-13c858336a5d_721x154.png?t=1705691564\" /></div><p>It almost doesn’t even matter what these guys think is “woke” about Grok, but just for the curious, the major complaints are that Grok acknowledges the existence of trans people, credits Black Americans with coining the term “woke” and calls conservative whining about the “woke mind virus” a distraction from real issues, and a lot of users seem to really want it to say racial slurs, which it won’t. Some are even saying it’s <a href=\"https://twitter.com/disclosetv/status/1733239811148845232?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">more “left”</a> than ChatGPT. Oh no! Luckily, though, the cringefail CEO of Gab, Andrew Torba, said he’s building a “Based AI,” that <a href=\"https://twitter.com/BasedTorba/status/1733931621999419623?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">isn’t trained</a> on woke data. Whatever that means.</p><p>The thing is, even if Grok was transphobic and said slurs, it was never going to satisfy these people for the sole fact that it’s not OpenAI’s ChatGPT. And Grok is absolutely not going to replace it, which is the only thing conservatives want it to do. </p><p>Ten years ago, the online right wing learned three main tactics for waging their culture war: duplicate, infiltrate, and undermine. The order changes depending on the project and it usually functions as a loop, but it’s same whether we’re talking about a social network, cable TV, or school boards. These tactics are not really working so well in the AI age, though, because something like ChatGPT isn’t like a social network. You can’t infiltrate it because it’s a closed system, you can’t undermine it easily because its largely automated, and you can’t duplicate it because it's almost impossibly expensive to run and maintain. And it’s fascinating that Musk and his biggest supporters are only just now beginning to realize this.</p><p>The real dividing line for American conservatism online, the shift from angry bloggers racing for <i>Drudge Report</i> referrals to the organized culture war we have now started in 2012, when Steve Bannon took over Breitbart and started to reimagine the blog as a conservative equivalent to <i>Gawker</i> or <i>VICE</i> (duplicate). By 2014, the site was flush with Facebook traffic and assigned Milo Yiannopoulos as its de facto <a href=\"https://www.salon.com/2014/10/28/gamergates_fickle_hero_the_dark_opportunism_of_breitbarts_milo_yiannopoulos/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">Gamergate correspondent</a> (infiltrate). Which gave Bannon’s Breitbart a new demographic to target, angry young men, and a replicable playbook for repackaging internet chatter into coherent narratives that conservatives could weaponize (undermine). This would set the stage for Pizzagate, QAnon, January 6th, and, well, every facet of our lives now.</p><p>When these tactics work, they’re very powerful. I mean, all Donald Trump did as president for four years was make shitty right-wing knock-offs of existing institutions and infiltrate and undermine the ones he couldn’t. But it requires a locked in connection to people’s attention, like being the President or astroturfing a social network or institution people can’t live without. But when you lose that — or can’t get it — you end up looking super embarrassing. Which has become an increasing problem for conservatives since for the last two years.</p><p>On January 8th, 2021, Twitter joined the rest of the big social platforms in banning Donald Trump for incendiary content about the insurrection. For the right wing, Trump’s ban, following Trump’s loss at the polls the November before, was a Death Star level event. Twitter, especially post-COVID, was the main feed for news, politics, and culture in the US. So not only did conservatives not have the White House and couldn’t successfully steal it, suddenly their main man was also now, effectively, blocked from the only feed that still mattered. And so, for a couple years, conservatives were throwing a bunch of stuff against the wall trying to find a new way to hijack attention. That is, until Musk showed up on their radar.</p><p>Before the pandemic, Elon Musk’s Twitter presence was mostly surface level, at best. As <i>Yahoo! Finance</i> <a href=\"https://finance.yahoo.com/news/twitter-tesla-ceo-elon-musk-a-timeline-193347566.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">reported</a>, it was mostly shitty memes about Tesla and SpaceX, until February 2020, when he <a href=\"https://twitter.com/elonmusk/status/1223756247612186625?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">started</a> to complain about crypto spam on the platform. The pandemic supercharged crypto markets and Twitter, as the only non-algorithmic feed that still did real-time content, became ground zero for scamcoins. And a disproportionate amount of these <a href=\"https://www.cnbc.com/2021/05/17/elon-musk-impersonators-stole-more-than-2-million-in-crypto-scams-.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">were using Musk’s likeness</a> in some capacity to give themselves a sense of legitimacy (can you imagine lol). </p><p>This newfound interest in Twitter as an influence network culminated in 2022, when Musk first announced he wanted to build a Twitter substitute (duplicate), before, in April, instead, offering to buy it (infiltrate). After his announcement, his phone started blowing up with texts from powerful folks in both tech and politics, including one still unknown sender who literally outlined a four step plan for reinventing Twitter that could basically be condensed down into “undermine, infiltrate, undermine, duplicate.” </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/18b9906d-99b0-440a-bda4-7aed45390fff/c89f06c3-0f7b-46f4-b849-f95319c4aadd_610x313.png?t=1705691564\" /></div><p>As you can see, the assumption was that users and, more importantly, advertisers would stick around as Musk cannibalized Twitter. And now we know they haven’t. Users are fleeing, especially the important ones, and advertisers are finally beginning to move on, as well. This text is only part of the conversation, but it’s extremely funny that nowhere amid this supervillain monologue was it ever questioned if Twitter would continue to even be relevant as it transformed into Gab. Perhaps Musk didn’t have the “savvy cultural/political view” to pull it off.</p><p>Making matters worse, as Twitter has died, so too has the general interest in even having a site like that anymore. This is also why conservatives are now scrambling to legislate TikTok away. They can’t infiltrate it and undermine it because they don’t understand it and they can’t duplicate it because it’s too complex. All of which made last week’s launch of Grok, X’s new AI, all the more important. And it’s wet fart launch all the more funny.</p><p>The culture war only works as long as culture stays the same.</p><hr /><h2>Think About Supporting Garbage Day!</h2><p>There are a couple ways to support Garbage Day. For $5 a month or $45 a year, you get Discord access and paid weekly issues. And for $150 a year, you get all of that, plus in-depth monthly intelligence reports. Hit the green button below to find out more!</p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\"><span> Subscribe now </span></a></div><hr /><h2>There Actually Were A Lot Of Memes This Year</h2><p>Julia Reinstein, an excellent internet culture reporter, put <a href=\"https://www.rollingstone.com/culture/culture-lists/best-memes-2023-1234918358/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">together a list</a> of the 21 best memes from 2023 for <i>Rolling Stone</i> and it’s real good. It’s also a really great portrait of what our first year of a decentralized internet has felt like.</p><p>There’s a couple interesting trends here I wanted to dig into. First, the fact that many of the biggest memes involve large corporate marketing campaigns doesn’t feel like an accident. Things like <i>Barbie</i>, <i>M3GAN</i>, the McDonald’s Grimace shake, and and Timothée Chalamet’s Wonka were huge this year because you need a lot more resources to truly make something popular now. Taylor Swift is not on Reinstein’s list — fair enough, she’s not really a meme — but I think her popularity this year would fit in this category, as well.</p><p>The other interesting thing with these memes is a lot of them aren’t just TikTok trends, but trends that originated on TikTok before mutating on platforms like X, like girl dinner or “Planet Of The Bass”.</p><p>All of which is to say that it’s not like internet culture isn’t happening anymore. In fact, more of it is happening now than ever, probably. But there does seem to be a middle missing, things like reaction images and more traditional memes have been replaced with concepts and trends. Though, it’s also possible those are still happening too, but have just become so localized and specific that you don’t really see them anymore.</p><hr /><h2>@chefreactions Weighs In On The Disgusting Airpline Sink Mashed Potatoes</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/fd3d0079-7708-4c85-beea-759813107b42/237575a9-5bcd-4006-96f0-4683970a2685_1222x1408.png?t=1705691565\" /></div><p>I’m not totally sure why I can’t embed this as a TikTok, but I think it’s because there’s a “dangerous activity” warning on it. Anyways, if you don’t want to watch it on X, you can <a href=\"https://www.tiktok.com/@chefreactions/video/7310609475600272646?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">click over here</a> to do that. He gave it a 0/10.</p><p>Also, I cannot verify this video of a person cooking a steak on an airplane toilet, but if you want to ruin your day, <a href=\"https://twitter.com/schizarella/status/1733252227899543870?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">you can click here</a> to watch that next.</p><hr /><h2>There’s A New “Crank That” Speedrun Record</h2><div></div><p>I’ve written about this before, but music producers are filming themselves trying to remake popular songs as fast as possible. Soulja Boy’s “Crank That” is a popular one to try because it’s pretty simple to put together. TikTok user @prodrobtmb was able to get a version of the song together in under 17 seconds.</p><hr /><h2>A Bunch Of Teens On TikTok Are Crawling Around Malls</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/cfc2135b-49de-4b9d-8a4a-f2ce65161219/4d22ebe7-2df3-48cd-be4c-960bf8ab66ac_2096x1218.png?t=1705691566\" /></div><p>I am not going to be a boomer about this and say that it’s a dangerous new TikTok trend, but it is pretty popular. There’s a group of teenagers in a “group crawl cult,” where they go to stores in the mall and crawl around. Based on signs in the videos, I think they’re in Poland.</p><hr /><h2>Least Horny Generative AI Guy</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/599777e0-aa74-45a4-ac54-63db80a8251b/710ca7bd-c6da-4087-bb2a-1d34e185660c_2188x1604.png?t=1705691569\" /></div><p>A user in the DALL-E 2 subreddit <a href=\"https://www.reddit.com/r/dalle2/comments/18cwtvj/a_date_with_rapunzel_sfw/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">recently shared</a> an album of photos titled, “A Date With Rapunzel (SFW),” which feature the character Rapunzel from Disney’s <i>Tangled</i>. The overwhelming reaction from users is that this is “weird” and extremely “unnerving”.</p><p>But a lot of other users are also impressed with how consistent the character came out across the different images.</p><p>The original poster was nice enough to clarify in a comment that Rapunzel in <i>Tangled</i> is 18 years old canonically. Uh, good to know, I guess. The OP also said that no matter how many people message, they’re not going to generate NSFW pics of her. Also good to know, I guess.</p><hr /><h2>The Story Behind The Isopods Doritos Photo</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8d044763-290a-4a7e-897e-67e28d3caf2c/cec454e3-15ba-4496-a02e-30ced9ebc662_800x450.jpeg?t=1705691569\" /></div><p>I assume everyone has seen this picture? idk maybe I’m Too Online. Anyways, Tumblr user meowllorydesigns <a href=\"https://www.tumblr.com/meowllorydesigns/735816515271753728/the-origin-of-this-image-so-in-my-etsy-i-sell-a?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">recently shared</a> the story behind the photo and it’s really interesting!</p><p>The photo was taken in 2014 during a <a href=\"https://www.researchgate.net/publication/259087461_Biological_and_Archaeological_Analysis_of_Deepwater_Shipwrecks_in_the_Gulf_of_Mexico_Studying_the_Artificial_Reef_Effect_of_Six_World_War_II_Shipwrecks?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">research trip</a> studying shipwrecks in the Gulf of Mexico. The isopods were deceased and being transferred to storage when one of the researchers saw the Doritos bag and staged the photo to look like they were eating from it.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.theverge.com/23981318/chatgpt-open-ai-launch-anniversary-future?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">“ChatGPT is winning the future — but what future is that?”</a></p></li><li><p><a href=\"https://nymag.com/intelligencer/2023/12/is-your-phone-the-reason-you-feel-broke.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">“Is Your Phone the Reason You Feel Broke?”</a></p></li><li><p><a href=\"https://www.404media.co/no-record-of-russian-economist-who-flew-to-lax-without-a-ticket-didnt-remember-how-he-got-here/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">“No Record of 'Russian Economist' Who Flew to LAX Without a Ticket, Didn't Remember How He Got Here”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://twitter.com/daltondeschain/status/1734218378343059810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=duplicate-infiltrate-and-undermine\" target=\"_blank\">System Of A Down’s “Chop Suey” in the style of the B-52s</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=25785bce-3263-4739-b7ad-b7192b0a6749&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"c500091e9f59cd7b241d763b27b7e4c02eee050629e928af834b0dbcacf0754d","category":"default"}