{"title":"How many pets do you have?","link":"https://sive.rs/pets","date":1628812800000,"content":"<p>\nI used to have too many pets.\n</p><p>\nEach time I adopted one, I was fully in love.\nI was enamored with the potential.\nEach new pet was meant to be my constant companion.\nSo I would take it home, and love it.\nBut eventually I would discover a new pet, and the process would repeat.\n</p><p>\nMy house was overflowing.\nBut it didn’t feel that way at the time.\nIn each moment, I was giving just one pet my full attention.\nMy life was full of so many loves.\n</p><p>\nAh, but that’s seeing it from my point of view.\nWhat about from theirs?\nEach pet only got a little of my time each week.\nThe rest of the time they were neglected, waiting for my attention.\n</p><p>\nI sadly realized this was unfair.\nThe situation was hurting them.\nNo pet was thriving.\nNo pet was getting the attention it deserved.\nThe situation was also hurting me.\nAnyone who wanted to come into my life had to compete for my attention, or love all of my pets.\nI was scattered and unavailable.\n</p><p>\nSo, I started releasing them back into the wild.\nOne at a time, reluctantly, I’d set one free, or find it a new home with someone who was really going to give this pet 100% of their love.\nI mourned the loss of possibility with each one as I said goodbye.\n</p><ul><li>\nMy pet project to start a business.\n</li><li>\nMy plan to travel everywhere.\n</li><li>\nMy dream to learn Chinese.\n</li><li>\nMy goal to plant a forest.\n</li><li>\nMy wish to build a house.\n</li></ul><p>\nAlthough each goodbye was sad, it opened up more space.\nI enjoyed the freedom and feeling unconflicted.\n</p><p>\nBefore, I’d glance at each pet and feel love but guilt for not giving it more time.\nNow, I picture what could have been, and just enjoy the daydream.\n</p><p>\nI let my last pet go, came home, and cleaned the house.\nThere’s so much room for focus now.\n</p><p>\nSurprising end to this story:\nOne pet kept coming back, no matter how many times I set her free.\nShe refused to stay away.\nSo now it’s just me and her, and I’m giving her all my time.\n</p>\n<img src=\"/images/pets.jpg\" alt=\"drawing of pets\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"c51d4f87b5a30b17adcff66f291a85fde1a5cd3a8124289e0538d33fed4304bf","category":"Sites"}