{"title":"Of Stars, Seagulls, and Love: Loren Eiseley on the First and Final Truth of Life","link":"https://www.themarginalian.org/2024/08/11/loren-eiseley-love/","date":1723381233000,"content":"<p><a href=\"https://www.amazon.com/Unexpected-Universe-Loren-Eiseley/dp/0156928507/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"535\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/loreneisely_unexpecteduniverse_TheMarginalian.jpg?fit=320%2C535&amp;ssl=1\" alt=\"Of Stars, Seagulls, and Love: Loren Eiseley on the First and Final Truth of Life\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/loreneisely_unexpecteduniverse_TheMarginalian.jpg?w=598&amp;ssl=1 598w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/loreneisely_unexpecteduniverse_TheMarginalian.jpg?resize=320%2C535&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/loreneisely_unexpecteduniverse_TheMarginalian.jpg?resize=240%2C401&amp;ssl=1 240w\" /></a></p><p>Somewhere along the way of life, we learn that love means very different things to different people, and yet all personal love is but a fractal of a larger universal love. Some call it God. I call it wonder. Dante called it “the Love that moves the Sun and the other stars.” </p>\n<p>Because the capacity for love may be the crowning achievement of consciousness and consciousness the crowning achievement of the universe, because the mystery of the universe will always exceed the reach of the consciousness forged by that mystery, love in the largest sense is a matter of active surrender (to borrow Jeanette Winterson’s perfect term for <a href=\"https://www.themarginalian.org/2014/10/27/jeanette-winterson-art-objects/\">the paradox of art</a>) to the mystery. </p>\n<p>It may be that we are only here to learn how to love. </p>\n<p>The paleontologist, philosopher of science, and poet <strong>Loren Eiseley</strong> (September 3, 1907–July 9, 1977) channels this idea with uncommon loveliness and lucidity in one of the essays found in his superb 1969 collection <a href=\"https://www.amazon.com/Unexpected-Universe-Loren-Eiseley/dp/0156928507/?tag=braipick-20\" target=\"_blank\"><strong><em>The Unexpected Universe</em></strong></a> (<a href=\"https://search.worldcat.org/title/60515\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>Writing at the dawn of the space age, when the human animal with its “restless inner eye” first reached for the stars, Eiseley observes:</p>\n<blockquote><p>The venture into space is meaningless unless it coincides with a certain interior expansion, an ever growing universe within, to correspond with the far flight of the galaxies our telescopes follow from without… That inward world… can be more volatile and mobile, more terrible and impoverished, yet withal more ennobling in its self-consciousness, than the universe that gave it birth.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=680%2C753&amp;ssl=1\" width=\"680\" height=\"753\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=240%2C266&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=320%2C354&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=768%2C850&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/02/thomaswright6.jpg?resize=600%2C664&amp;ssl=1 600w\" /></a><figcaption>Plate from <a href=\"https://www.themarginalian.org/2021/02/16/thomas-wright-original-theory/\"><em>An Original Theory or New Hypothesis of the Universe</em></a> by Thomas Wright, 1750. (Available as <a href=\"https://society6.com/product/art-from-thomas-wrights-an-original-theory-or-new-hypothesis-of-the-universe-17504457506_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/collection/vintage-science-cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Picking up Dante’s thread, Eiseley offers a sweeping meditation on what ennobles our small stardusted lives, beginning with the story of a seemingly mundane accident that thrusts him, as sudden shocks to the system can often do, toward transcendence.</p>\n<p>Walking to his office afternoon, deep in thought while working on a book, Eiseley trips on a street drain, crashes violently onto the curb, and finds himself facedown on the sidewalk in a pool of his own blood. In the delirium of disorientation and pain, he looks at the vermillion liquid in the sunshine and suddenly sees life itself, suddenly feels all the tenderness one feels for the miracle of life whenever one is fully feeling. And then, with that wonderful capacity we humans have, he surprises himself:</p>\n<blockquote><p>Confusedly, painfully, indifferent to running feet and the anxious cries of witnesses about me, I lifted a wet hand out of this welter and murmured in compassionate concern, “Oh, don’t go. I’m sorry, I’ve done for you.” </p>\n<p>The words were not addressed to the crowd gathering about me. They were inside and spoken to no one but a part of myself. I was quite sane, only it was an oddly detached sanity, for I was addressing blood cells, phagocytes, platelets, all the crawling, living, independent wonder that had been part of me and now, through my folly and lack of care, were dying like beached fish on the hot pavement. A great wave of passionate contrition, even of adoration, swept through my mind, a sensation of love on a cosmic scale, for mark that this experience was, in its way, as vast a catastrophe as would be that of a galaxy consciously suffering through the loss of its solar systems. </p>\n<p>I was made up of millions of these tiny creatures, their toil, their sacrifices, as they hurried to seal and repair the rent fabric of this vast being whom they had unknowingly, but in love, compounded. And I, for the first time in my mortal existence, did not see these creatures as odd objects under the microscope. Instead, an echo of the force that moved them came up from the deep well of my being and flooded through the shaken circuits of my brain. I was they — their galaxy, their creation. For the first time, I loved them consciously, even as I was plucked up and away by willing hands. It seemed to me then, and does now in retrospect, that I had caused to the universe I inhabited as many deaths as the explosion of a supernova in the cosmos.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2021/05/18/ernest-everett-just/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust3-scaled.jpg?w=1360&amp;ssl=1\" /></a><figcaption>Art by Luisa Uribe from <a href=\"https://www.themarginalian.org/2021/05/18/ernest-everett-just/\"><em>The Vast Wonder of the World</em></a> — a picture-book biography of cellular biology pioneer <a href=\"https://www.themarginalian.org/2023/12/25/ernest-everett-just-life-time/\">Ernest Everett Just</a></figcaption></figure>\n<p>It is often like this, in some small sudden experience, that we awaken to reality in all its immensity and complexity. Eiseley’s blood-lensed realization is elemental and profound: We are not the sum total of the tiny constituent parts that compose us — we are only ever-shifting and regenerating parts operating under the illusion of a sum we call a self. Any such awareness — whether we attain it through science or art or another spiritual practice — is an act of <a href=\"https://www.themarginalian.org/2019/10/21/iris-murdoch-unselfing/\">unselfing</a>, to borrow Iris Murdoch’s perfect term. And every act of unselfing is an act of love — it is how we contact, how we channel, “the Love that moves the Sun and the other stars.” It is the self — the prison of it, the illusion of it — that keeps us trapped in lives of less-than-love. But a self is a story, which means we can always change the story to change, to dismantle, to be set free from the self — and it might not even require a bloody face. </p>\n<p>Observing that while other animals live out their lives by obeying their nature, the human animal has the freedom to define and redefine its own humanity, Eiseley considers both the gift and the danger of our malleable and impressionable self-definition. A decade before James Baldwin admonished in his <a href=\"https://www.themarginalian.org/2015/03/26/margaret-mead-james-baldwin-a-rap-on-race-2/\">superb conversation with Margaret Mead</a> that “you’ve got to tell the world how to treat you [because] if the world tells you how you are going to be treated, you are in trouble,” and half a century before Maya Angelou wrote in <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">her staggering poem to the cosmos</a> that “we are neither devils nor divines,” Eiseley reminds us of something fundamental that we so easily forget, so easily abdicate, in these times of social imaging and performative selfing:</p>\n<blockquote><p>To the degree that we let others project upon us erroneous or unbalanced conceptions of our natures, we may unconsciously reshape our own image to less pleasing forms. It is one thing to be “realistic,” as many are fond of saying, about human nature. It is another thing entirely to let that consideration set limits to our spiritual aspirations or to precipitate us into cynicism and despair. We are protean in many things, and stand between extremes. There is still great room for the observation of John Donne, made over three centuries ago, however, that “no man doth refine and exalt Nature to the heighth it would beare.”</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Kingisher_kindness.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-kingfisher-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-kingfisher-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>With that great countercultural courage of defying cynicism, Eiseley insists that it was the humans who nourished the highest in their nature by means of love, who lived with such exquisite tenderness for life in all of its expressions, that propelled our species from the caves to the cathedrals, from savagery to sonnets. (A particularly countercultural point, given he is writing in the middle of the Cold War — an ideology of hate, like all war, under which humans on both sides are taught that those on the other are devils, that power and not peace is the pinnacle of our humanity.) Drawing on his singular access to deep time as a scientist who studies fossils long predating <em>Homo sapiens</em>, he considers what made us human — what keeps us human:</p>\n<blockquote><p>A great wealth of intellectual diversity, and consequent selective mating, based upon mutual attraction, would emerge from the dark storehouse of nature. The cruel and the gentle would sit at the same fireside, dreaming already in the Stone Age the different dreams they dream today.</p>\n<p>[…]</p>\n<p>Some of them, a mere handful in any generation perhaps, loved — they loved the animals about them, the song of the wind, the soft voices of women. On the flat surfaces of cave walls the three dimensions of the outside world took animal shape and form. Here — not with the ax, not with the bow — man<a href=\"https://www.themarginalian.org/2014/10/17/ursula-k-le-guin-gender/\">*</a> fumbled at the door of his true kingdom. Here, hidden in times of trouble behind silent brows, against the man with the flint, waited St. Francis of the birds — the lovers, the men who are still forced to walk warily among their kind.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-by-virginia-frances-sterrett-from-old-french-fairy-tales-1920_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=680%2C883&amp;ssl=1\" alt=\"Art by Virginia Frances Sterrett, Old French Fairy Tales, 1920\" width=\"680\" height=\"883\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=320%2C416&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=600%2C780&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=240%2C312&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=768%2C998&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/01/oldfrenchfairytales_sterrett2.jpg?resize=1182%2C1536&amp;ssl=1 1182w\" /></a><figcaption>One of teenage artist Virginia Frances Sterrett’s century-old <a href=\"https://www.themarginalian.org/2022/01/27/virginia-frances-sterrett-old-french-fairy-tales/\">illustrations for old French fairy tales</a>. (Available as <a href=\"https://society6.com/product/art-by-virginia-frances-sterrett-from-old-french-fairy-tales-1920_print?curator=brainpicker\" target=\"_blank\">a print</a> and <a href=\"https://society6.com/brainpicker/cards?sort=new?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Millions of years later, Eiseley finds himself one of the lovers as he befriends a large old seagull, grey as himself. Day after day, he sits on an old whiskey crate half-buried in the sand at the edge of the ocean — that crucible of life, that <a href=\"https://www.themarginalian.org/2021/06/07/rachel-carson-the-edge-of-the-sea/\">ultimate lens on its meaning</a> — and watches the gull. “I came to look for this bird,” he recounts, “as though we shared some sane, enormously simple secret amidst a little shingle of hard stones and broken beach.” And then, one day, the gull is gone. </p>\n<p>With an eye to what remains — which is what always remains when something or someone we love leaves — Eiseley writes:</p>\n<blockquote><p>Here, I thought, is where I shall abide my ending, in the mind at least. Here where the sea grinds coral and bone alike to pebbles, and the crabs come in the night for the recent dead. Here where everything is transmuted and transmutes, but all is living or about to live. </p>\n<p>It was here that I came to know the final phase of love in the mind of man — the phase beyond the evolutionists’ meager concentration upon survival. Here I no longer cared about survival — I merely loved. And the love was meaningless, as the harsh Victorian Darwinists would have understood it or even, equally, those harsh modern materialists… I felt, sitting in that desolate spot upon my whiskey crate, a love without issue, tenuous, almost disembodied. It was a love for an old gull, for wild dogs playing in the surf, for a hermit crab in an abandoned shell. It was a love that had been growing through the unthinking demands of childhood, through the pains and rapture of adult desire. Now it was breaking free, at last, of my worn body, still containing but passing beyond those other loves.</p></blockquote>\n<p>Here, in this scientist’s farewell to life, we find an echo of Dante and of Larkin’s timeless insistence that “what will survive of us is love,” we find the first truth of life, which is also its final truth. (This too is why we, fallible and vulnerable to the bone, ought to <a href=\"https://www.themarginalian.org/2024/03/22/love-anyway/\">love anyway</a>.)</p>\n<p>Complement with Eiseley’s contemporary and kindred spirit Lewis Thomas on <a href=\"https://www.themarginalian.org/2022/03/02/the-fragile-species-lewis-thomas/\">how to live with our human nature</a> and Iris Murdoch on <a href=\"https://www.themarginalian.org/2024/08/05/iris-murdoch-imagination/\">how to love more purely</a>, then revisit Eiseley’s <a href=\"https://www.themarginalian.org/2017/06/22/loren-eiseley-muskrat/\">muskrat-lensed meditation on the meaning of life</a> and his <a href=\"https://www.themarginalian.org/2024/02/03/loren-eiseley-birds/\">warbler-lensed meditation on the miraculous</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"c5512f1b7909916d056be3bf1f25f1741d723253ecd68a00baab5d2fcfa068d5","category":"default"}