{"title":"The politics of cringe","link":"https://www.garbageday.email/p/the-politics-of-cringe","date":1703102321000,"content":"<div><div><h2>The JoCat Debacle</h2><p>This story is a bit of a mess, so let me run through exactly what happened first before we get to any sort of deeper analysis. </p><p>It all kicked off on December 12th, when X user @ZeroSuitCamus <a href=\"https://twitter.com/ZeroSuitCamus/status/1734783211324977457?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">posted</a> a video with the caption, “Just made this video. Let me know what you think!” The video was a short animation from the artist JoCat. You can watch it below:</p><p>The @ZeroSuitCamus joke post was a classic Twitter gag. You find something your followers will immediately recognize as cringe and ironically claim that you made it. And @ZeroSuitCamus’s followers knew exactly what to do. Their post has over a thousand replies and almost two thousand shares. And the majority are extremely vicious, with many going so far as to claim JoCat is a child abuser — for liking cartoons, I guess?</p><p>Defining the groups involved here is tricky in the way defining any cluster of internet users never feels quite right, but I would broadly say that @ZeroSuitCamus and their followers are loose coalition of Weird Twitter users, trans shitposters, and dirtbag leftists (if those people even still exist). While JoCat’s fans are, well, goofy YouTube nerds, adult cartoon fans, and queer gamers.</p><p>By the end of the discourse cycle, @ZeroSuitCamus has since sorta-kinda <a href=\"https://twitter.com/zerosuitcamus/status/1737064616113426791?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">apologized</a> for the post, while also blaming JoCat for amplifying it in the first place. And JoCat <a href=\"https://www.jocat.net/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">published</a> a lengthy blog post explaining the context behind the “I Like Girls” video. It was an inside joke<i>, </i>riffing on Lizzo’s “Boys”. </p><p>“I still want to make things, but perhaps I should just keep them to myself for the time being,” JoCat wrote. “I will be taking an indefinite break from posting anything online. It’s a decision I’ve considered ever since the first hate wave from about a year or so ago but wanted to sit on it and see if the feeling would persist. I know now this is the best choice for me.”</p><p>I assumed our Bean Dad days were dying out with Twitter. And, to be clear, this is absolutely not at that level. But I also think it’s a useful example of how the worst impulses of peak Twitter are still with us and may be long after X finally goes bankrupt. </p><p>The late-2010s mindset that things online can’t just be bad has only gotten more pronounced. This line of thinking emerged in the Trump era and, for progressives, means that bad content must reflect some kind of moral failing from the creator. There’s also a more aggressive strain of this among stan armies that argue that celebrities that age poorly are aging poorly because they are somehow less morally good than others that age gracefully. Even your bad photograph on my feed must reflect a deeper truth of your innate badness. For leftists or leftist-adjacents, bad content and, more typically, cringe is, instead, a sociopolitical failing. </p><p>JoCat’s dumb video can’t just be dumb, it’s, as one deeply unhinged user wrote, “a Funko Pop shelf of fictional women, it’s a display to other like minded people for the only reason of validation of a hobby.” (Please go outside.) </p><p>But here’s the thing. If you did not grow up in a very specific internet filter bubble, I’m pretty confident in saying you wouldn’t even know to be embarrassed by “I Like Girls”. For those who did, though, it’s a visceral reminder of a deeply mortifying period in your life. And even if JoCat’s video isn’t activating your personal cringe muscle, there’s something like it out there that will.</p><p>And so, to zoom out even further, I’d say that as we look towards 2024 and next year’s election, I would caution to not overlook the politics of self-loathing. We now have two generations of adults that grew up almost entirely online. Which means there are 150 million American adults who have some form of data trail attached their childhoods, making the cringe of their youth feel a lot more inescapable. Your old posts about the Annoying Orange or your embarrassing Superwholock Tumblr are out there still, somewhere, in the digital void. And bonding over the cringe of seeing the content you grew out of is a very powerful tool for mobilizing engagement. Finding someone still enthusiastically still making that kind of content and mercilessly dunking on them is even more powerful.</p><hr /><h2>Think About Subscribing To Garbage Day!</h2><p>It’s $5 a month or $45 a year for Discord access and Friday issues. And it’s $150 a year for all of that plus monthly insights reports. If you’re already a subscriber, you only pay the difference for upgrading. </p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\"><span> Subscribe now </span></a></div><hr /><h2>Laura Jane Grace Bat Hack</h2><div></div><hr /><h2>Let’s Talk About The Cornell University Video</h2><p>Earlier this week, an X user named Josh Lekach uploaded a TikTok to X and claimed that it depicted a high school student getting rejected from Cornell University because he was white. It didn’t. The student in the video eventually DM’d Lekach telling him to the take down the post. Which Lekach did, but he also told the student to be “careful of what you post online in the future.” Which is ridiculous and reveals a disturbing lack of human empathy, but, also, I’ve been following Lekach for a while and this is very much his brand.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/dec8dc3e-d3c7-415c-9a37-cadc008a7386/d5eb0b9b-3fd5-47e4-bddd-9e97ee80a007_606x557.png?t=1705691558\" /></div><p><i>The Daily Beast</i> <a href=\"https://www.thedailybeast.com/viral-cornell-applicant-john-haag-didnt-blame-race-for-his-rejectionright-wingers-did?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">has a good post</a> with more details about how the TikTok was weaponized by right-wing freaks on X. I, instead, want to highlight something I <a href=\"https://www.garbageday.email/p/has-mrbeast-peaked?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">learned</a> about Lekach back in November. </p><p>Last month, X was promoting his tweets A LOT. And underneath all of them he advertises a horrible redpill loser guide called The Manual. I started getting curious what this guy’s whole deal is and that’s when I made a fantastic discovery. Before Lekach rebranded as a men’s right activist influencer, he had a very different job. </p><p>He was a <a href=\"https://www.imdb.com/name/nm1208413/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">producer</a> on a little film called <i>The Hottie &amp; The Nottie</i>.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/97ea4e63-d487-45fe-8335-80e16b7b755d/6e2384e7-f3b3-4ac0-9b90-22312365dc2e_606x420.png?t=1705691558\" /></div><hr /><h2>I Think I Figured Out The Problem With “VR”</h2><p>Apple’s big selling point for their new headset is spatial video. It allows you to literally walk around your “memories”. It’s <a href=\"https://www.inverse.com/tech/apple-vision-pro-photos-app-spatial-video-hands-on?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">already brought</a> one early user to tears. Apple clearly thinks it’s the killer feature for the Vision Pro. And considering Apple <a href=\"https://www.theverge.com/2023/6/7/23750301/apple-vision-pro-headset-virtual-reality-vr-headset?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">isn’t using</a> the term “virtual reality” in its marketing, it seems like the company is hoping the Vision Pro is unique enough to jumpstart a paradigm shift similar to the first iPhone or iPad.</p><p>There’s just one problem. And it’s an issue that all headsets suffer from, whether they call themselves VR or not: You can’t share the experience. In fact, in a recent <i><a href=\"https://www.youtube.com/watch?v=NMzMPFlyR4k&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">CNET</a></i><a href=\"https://www.youtube.com/watch?v=NMzMPFlyR4k&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\"> demo </a>of spatial video on the iPhone 15, they couldn’t even show it and instead just asked a guy what it was like.</p><p>It’s been 16 years since the first iPhone and I think it’s very easy to forget that while there were a few cool things you could only do on an iPhone, part of the reason it caught on was because it interfaced with desktop computers on the web and it was fairly easy to share what you were doing on the iPhone on blogs and early social platforms like Twitter. </p><p>I don’t think the Vision Pro will be a flop because it’s main feature can only be experienced inside the headset. But I do think there is a space for a mixed reality headset that can more easily fit into our existing tech landscape.</p><hr /><h2>Alex Jones Got Duped By An AI Of Louis CK</h2><p>Alex Novell, a journalist and video producer, used an AI of Louis CK to trick Alex Jones into interviewing Manuel Oliver, the father of one of the students killed at Marjory Stoneman Douglas High School in Parkland, Florida. The video above details how Novell set it up. Honestly, you could have told me Jones was an AI too because he doesn’t exactly seem to be able to follow what’s going on.</p><hr /><h2>The Future Belongs To Temu</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/2645e868-e663-4a56-851c-df0b0bd23c8e/b67288a8-7173-4238-ab14-3ce97417b9d8_1210x1038.png?t=1705691559\" /></div><p>Analyst Eric Seufert <a href=\"https://twitter.com/eric_seufert/status/1737045461175787741?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">put together</a> a fascinating look at how Chinese apps like Temu, TikTok, and Shein are dominating app stores right now. I will say, I’ve never used Temu, but, anecdotally, Temu bags are quickly starting to replace Amazon boxes in my apartment’s mailroom.</p><p>In a followup post, Seufert <a href=\"https://twitter.com/eric_seufert/status/1737500360929894639?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">argued</a> that Temu’s rise, in particular, is thanks to the company’s huge advertising blitz this year, but I wonder if there’s something simpler happening. </p><p>I suspect the popularity of Chinese apps might also be connected to a general malaise of western platforms. It’s possible users, especially younger ones, just want something different and Chinese tech companies are the only ones right now that aren’t just recycling the same widgets over and over again, but are also big enough to achieve the same scale as their western competitors.</p><hr /><h2>Grimes’ AI Is Pretty Good Actually</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/d982b97b-e156-48c6-b589-ba63a8befef1/0f82403e-1276-4510-9934-27a05755c4e4_1212x546.png?t=1705691559\" /></div><p>I had to check a few times to make sure this wasn’t just <a href=\"https://twitter.com/GRIMES_V1/status/1737131917068398922?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">Grimes’ account</a>. And I’m still not entirely convinced. The AI posts pretty naturally and a lot of times they’re pretty funny too.</p><p>You know, I’m beginning think there’s a real chance that whatever Grimes ends up settling on with AI is actually a lot more successful than what Elon Musk does.</p><hr /><h2>Good TikTok</h2><div></div><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://flaminghydra.com/preview/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">Flaming Hydra launched!!!</a></p></li><li><p><a href=\"https://nymag.com/intelligencer/2023/12/what-do-ai-companies-want-with-the-media.html?utm_source=pocket_reader\" target=\"_blank\">“What Do AI Companies Want With the Media?”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://www.instagram.com/reel/Cz2hL79Ik5G/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-politics-of-cringe\" target=\"_blank\">dog hate snowman</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=b68f33b2-8d25-4dfe-ab0d-21c07aa79b03&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"c56d1cdb9c1aa88a3605c850e8f480079d4a08ba0dd569a9b9c282d4030b95bc","category":"default"}