{"title":"DePIN and Secular Trends","link":"https://www.usv.com/writing/2024/08/depin-and-secular-trends/","date":1724761798000,"content":"<p>Decentralized Physical Infrastructure, or DePIN, has the potential to reshape the dynamics of some of the world’s most important markets. Over the past decade, projects have tackled a broad range of industries: information storage, 5G and LoRaWAN, mapping and weather data, computing power, internet bandwidth, and many more. As a variety of DePIN projects have scaled over the years, they have taught us some valuable lessons regarding the unique dynamics of scaling both supply and demand.</p>\n<p>Historically, supply has been the easiest component to build. Many projects have proven that tokenomics can drive early adoption within web3 communities. Ecosystem participants love to spread the gospel of certain projects, especially when referral incentives are baked in. A nice feature of web3 communities is that people are excited to try new things. Sometimes, that’s because of a deep belief in the promise of crypto and user-owned networks; sometimes, it’s because it’s fun and the memes are good; sometimes, it’s because of a belief in the potential economic upside of early participation.</p>\n<p>An emerging dynamic in DePIN projects is that they are much easier to scale when users do not have to purchase new hardware to participate and can lend something from existing machinery, be it compute, storage, or bandwidth, to get up and running. Filecoin , Arweave , Render , and Grass all benefit from this dynamic – it’s a low-cost endeavor and onboarding experience for a user to join the network, contribute to supply-side growth, and benefit from the upside.</p>\n<p>While many projects have solved supply-side growth, it has proven more challenging to crack the code on scaling demand and building a big business. One hypothesis is that DePIN is best suited to thrive in categories where an emergent secular trend is expanding and creating new types of demand for a product offering. It is not about replacing existing infrastructure to meet existing demand; it is about reshaping it to meet the needs of an entirely new category.</p>\n<p>Competing with incumbents with a stronghold on physical infrastructure is very difficult, especially when market conditions are relatively stagnant. These companies have long-term contracts with customers, decades of experience, and sometimes some form of regulatory capture. Usually, there’s no forcing function for a customer to switch providers.</p>\n<p>To win a market with DePIN it must be in the process of being reshaped, and the project must be structurally suited to take advantage of that change. A good way of thinking about this is asking, “What new secular trends, markets, and pockets of demand are emerging because something is different in the world?” There’s a chance that a DePIN project may be best suited to capture that market. I like this approach because it’s a problem with market tailwinds in search of a solution instead of vice versa.</p>\n<p>Grass , a residential proxy network enabling individuals to contribute unused bandwidth to provide data to train open-source AI models, is doing this. In the past, this market has been focused on scraping web data for marketers to track competitors’ pricing and advertising trends, but today there is insatiable demand for all types of web data to train emerging AI models. Grass is structurally advantaged to service this emergent demand while existing residential proxy networks do not have the right type of supply or business model to compete. Render has a similar dynamic by providing compute for model training instead of data. AI is creating an infinite need for both data and compute, and Grass and Render are building decentralized networks to become highly aligned people-powered providers to this market.</p>\n<p>In these examples, some new technological pressure is emerging that is beginning to change the shape of a market. And in these instances DePIN may be a meaningfully better solution than a centralized player. These projects can strategically sit adjacent to incumbents while providing a similar service to a different customer set in a way that is technologically and economically challenging to compete with.</p>\n<p>As ideal as it is to think about how DePIN can scale the supply of critical infrastructure in novel ways, at the end of the day, a revenue-generating business must be built, and we must think about the evolving dynamics of the end market: what are the critical thresholds of supply that are required to meet new types of demand? What are the scale requirements across geographies for the service to be valuable? What are the barriers to building a viable business and what’s required for the project to tackle these challenges? Where is the structural competitive advantage relative to existing incumbents?</p>\n<p>As more entrepreneurs seek to reshape large and important markets with DePIN, they must be thoughtful upfront about what the underlying business will look like. It’s much easier to ride the tailwinds of an emerging or evolving market than to battle against incumbents in a zero-sum game. We now definitively know that it is feasible to build decentralized infrastructure across the globe – now, we need to build the next generation of important businesses on top of them.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/depin-and-secular-trends/\">DePIN and Secular Trends</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"c5a515de48c1231ffa6e0399013ad8f09c9b7a63ea898d262e55c581220f3bc5","category":"default"}