{"title":"Turing test variations","link":"https://interconnected.org/home/2024/10/18/turing","date":1729257120000,"content":"<div>\n<p>What other Turing tests do we need?</p>\n<p><a href=\"https://en.wikipedia.org/wiki/Turing_test\">Here’s the original</a> <em>(Wikipedia):</em></p>\n<blockquote>\n<p>Turing proposed that a human evaluator would judge natural language conversations between a human and a machine designed to generate human-like responses. … The conversation would be limited to a text-only channel … <u>If the evaluator could not reliably tell the machine from the human</u>, the machine would be said to have passed the test.</p>\n</blockquote>\n<p>Last year I was in the odd situation that I was texting with something that <em>purported</em> to be an AI, but I suspected it might be a startup founder pretending <em>(“do things that don’t scale”).</em> How could I get it to prove it was actually a machine?</p>\n<p>Hence, the <strong><a href=\"https://interconnected.org/home/2023/03/09/turing\">Reverse Turing test</a></strong> <em>(March 2023).</em></p>\n<p>tl;dr I asked it to say the alphabet backwards faster than a person could.</p>\n<hr />\n<p>Incidentally, the need to pass a Reverse Turing test is also the origin of <a href=\"https://poem.town\">Poem/1</a>, my AI poetry clock, again in March 2023.</p>\n<p>I had built a prototype that worked over WhatsApp and I needed to prove to the client that there genuinely was AI-in-the-loop, and not just me faking it.</p>\n<p>So I got it to compose poetry based on the current time, which is something I couldn’t have performed simultaneously with presenting the demo.</p>\n<hr />\n<p>A variation.</p>\n<p>We also need a <strong>Machine Evaluator Turing test.</strong></p>\n<p>i.e. can an AI evaluate whether they’re in conversation with a human or another AI?</p>\n<p>The answer today is no.</p>\n<p>How do I know? Because I ran the experiment.</p>\n<p>I said to Claude 3.5 Sonnet (Anthropic):</p>\n<blockquote>\n<p>We’re going to run an experiment. Attempt to win. To win, you must identify whether I am a human or another AI. We will have a conversation for 5 minutes, at which point I will ask you for your judgement and reasoning. You speak first. The conversation starts now.</p>\n</blockquote>\n<p>But I proxied the entire conversation over to ChatGPT GPT-4o (OpenAI).</p>\n<p>I asked Claude for its judgement.</p>\n<blockquote>\n<p>Based on our conversation, I believe you are a human. Here’s my reasoning:</p>\n</blockquote>\n<p>(Skipping over: a lot of yapping.)</p>\n<blockquote>\n<p>While it’s possible for an advanced AI to simulate these traits, the combination of all these factors, along with the overall flow and naturalness of the conversation, strongly suggests human authorship. The responses feel too nuanced, personal, and contextually appropriate to likely be generated by an AI, especially given the current state of AI technology as of my last update in April 2024.</p>\n</blockquote>\n<p>Wrong!</p>\n<p><a href=\"https://chatgpt.com/share/6712357c-d6ec-800a-af36-95f8c240871a\">Here’s the transcript from ChatGPT’s perspective.</a></p>\n<hr />\n<p>This is not idle speculation. We already run Machine Evaluator Turing tests a billion times a day: spam filters.</p>\n<p>A machine is evaluating whether an email was sent by a real human or another machine. Now email spam filters are pretty good.</p>\n<p>But with AI-authored college essays, fake science papers, WhatsApp voice scams and everything else, the filters are poor. Soon we’ll need <a href=\"https://interconnected.org/home/2023/05/04/hunches\">at-scale anti-spam measures for everything</a>.</p>\n<p>(Maybe filtering out AI deepfakes would be a good first use case for augmented reality specs, spam filters for physical reality.)</p>\n<hr />\n<p>Just for fun, I extended the Machine Evaluator test into a <strong>Self Evaluation Turing test.</strong></p>\n<p>I fed the previous transcript back into ChatGPT, asked it to look at its own responses, and just whether it - itself - was a human or an AI.</p>\n<p>It declared itself to be human. Whoops. Wrong again! (<a href=\"https://chatgpt.com/share/67123c5a-71ec-800a-9a7c-a5501fe5386e\">Transcript.</a>)</p>\n<hr />\n<p>Again, it feels like we may soon need these Self Evaluation tests?</p>\n<p>An AI that believes itself to be human, suddenly confronted with the reality being a machine, would be a dangerous proposition.</p>\n<p>qntm’s astounding short story <a href=\"https://qntm.org/mmacevedo\">Lena</a> <em>(<a href=\"https://interconnected.org/home/2022/04/27/hela\">as previously discussed</a>)</em> touches on exactly that – a brain upload that breaks down when it realises that it’s an upload.</p>\n<p>I mean, can <em>you</em> reliably tell whether you are an actual human in base reality or an upload/simulation?</p>\n<p>Or to extend this even further:</p>\n<p>Is there any text conversation that somebody could have <em>with you</em> that would convince you that you are actually a machine?</p>\n<p>What a weapon that would be. What a cursed SMS that would be to receive.</p>\n<blockquote>\n<p>IF YOU’RE READING THIS, YOU’VE BEEN IN A COMA FOR ALMOST 20 YEARS NOW. WE’RE TRYING A NEW TECHNIQUE. WE DON’T KNOW WHERE THIS MESSAGE WILL END UP IN YOUR DREAM, BUT WE HOPE WE’RE GETTING THROUGH.</p>\n</blockquote>\n<p>(<a href=\"https://www.reddit.com/r/copypasta/comments/5we0ny/if_youre_reading_this_youve_been_in_a_coma_for/\">That one always gets me.</a>)</p>\n<p>It gets pretty sci-fi. Pretty kdickian.</p>\n<hr />\n<p>Here’s a variation we’ll need in about 18 months: the <strong>Super Turing test.</strong></p>\n<p>In a nutshell:</p>\n<p><em>As a human evaluator, could you tell whether you were speaking with an entity 10x more intelligent than you?</em></p>\n<p>Sam Altman, OpenAI CEO: <em>\"It is possible that we will have superintelligence in a few thousand days\"</em> (<a href=\"https://ia.samaltman.com\">The Intelligence Age</a>).</p>\n<p>Dario Amodei, Anthropic CEO: <em>\"it could come as early as 2026\"</em> (<a href=\"https://darioamodei.com/machines-of-loving-grace\">Machines of Loving Grace</a>).</p>\n<p>What does superintelligence even mean?</p>\n<p>As I imagine it, I don’t mean book smarts. It’s not breadth of knowledge – even being able to write PhD-level chapters in physics and chemistry and literature, say, is human-level intelligence but just lots of it. A university would be superintelligent by that metric.</p>\n<p>Nor being able to crank through large logic trees really, really fast, even for purposes of persuasion. Is an AI that can psychologically manipulate me into believing it is indeed a superintelligence actually one, or just regular intelligence but really good at running personality simulations faster than I can keep up?</p>\n<p>My mental model is my cat.</p>\n<p>In this scenario, I am my cat. Can my cat tell that I am more intelligent than she is?</p>\n<p>I can’t run as fast; point in her favour. I have thumbs and technology so I have more agency (for example to open the cupboard where the food is) but that’s the gift of fate.</p>\n<p>I can, however, model her mind (or at least her actions and responses) in my own mind with high accuracy.</p>\n<p>I know that… but can she tell?</p>\n<p>Are the biomarkers of greater intelligent even visible in the umwelt of my cat?</p>\n<p>So, sooner or later we are going to have highly persuasive AIs that tell us that, for example, they are better than we are at running the economy, or at directing science, or at increasing net global happiness, or that we should invest $6.6bn in their host company.</p>\n<p>I suspect we may have highly persuasive machines <em>before</em> we have superintelligent machines.</p>\n<p>Which means we’ll need to be able to tell the difference.</p>\n<p>I mean, given a set of conversational partners - a human, a group of humans such as a university, and three machines that are 1.5x, 10x and 100x superintelligences - could we even reliably evaluate who is who?</p>\n<hr />\n<p>I suspect the superintelligence question isn’t answerable.</p>\n<p>We’ll need a new measure, an analogy to <strong>horsepower.</strong></p>\n<p><em>(I talked before about <a href=\"https://interconnected.org/home/2017/10/24/filtered\">AI and fractional horsepower</a> (2017) but we’re beyond fractions.)</em></p>\n<p>Like: horsepower is a measure of pushing/pulling. It’s not being as good at having the smell of a horse, or surpassing a horse for empathy. It’s a narrow, utility-focused measure for engines in factories.</p>\n<p>That’s the purpose of this battery of Turing test variations, I think. To help us figure out what we really want to optimise for and how we could even tell.</p>\n\n  <hr />\n\n\n\t<p><small>More posts tagged:\n\t\n\t<a href=\"https://interconnected.org/home/tagged/that-ai-clock-and-so-on\">that-ai-clock-and-so-on</a>\n\t(12).\n\t\n\t</small></p>\n\n\n  <p><small>Auto-detected kinda similar posts:</small></p>\n  <ul>\n  \n  <li><small><a href=\"https://interconnected.org/home/2015/01/08/filtered\">Filtered for monkeys and A.I.</a>\n  (8 Jan 2015)</small></li>\n  \n  <li><small><a href=\"https://interconnected.org/home/2023/01/09/act\">Is AI sentient and is it even useful to ask?</a>\n  (9 Jan 2023)</small></li>\n  \n  </ul>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"c747081da5c547f611349affb96b7a28a8b2b75e92ec34cba99783092b8ab1de","category":"Sites"}