{"title":"The Unseen Fallout: Chernobyl’s Deadly Air Pollution Legacy","link":"https://feeds.feedblitz.com/~/902214905/0/marginalrevolution~The-Unseen-Fallout-Chernobyls-Deadly-Air-Pollution-Legacy.html","date":1722597614000,"content":"<p>A fascinating new paper <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://conference.nber.org/conf_papers/f205791.pdf\">The Political Economic Determinants of Nuclear Power: Evidence from Chernobyl</a> by Makarin, Qian, and Wang was recently presented at the NBER Pol. Economy conference. The paper is nominally about how fossil fuel companies and coal miners in the US and UK used the Chernobyl disaster to successfully lobby against building more nuclear power plants. The data collection here is impressive but that is just how democracy works. I found the political economy section less interesting than some of the background material.</p>\r\n<p>First, the Chernobyl disaster created ended nuclear power plant (NPP) construction in the United States (top-left panel), the country with the most NPPs in the world . Surprisingly, the Three Mile Island accident in 1979 (much less serious than Chernobyl) had very little effect on construction; albeit the 1-2 punch with Chernobyl in 1986 surely didn’t help. The same pattern is very clear across all countries and also all democracies (top-right panel). The bottom two panels show the same data but looking at new plants rather than the cumulative total–there was a sharp break in 1986 with growth quickly converging to zero new plants per year.</p>\r\n<p><img src=\"https://marginalrevolution.com/wp-content/uploads/2024/07/Chernobyl.png\" width=\"1026\" height=\"709\" srcset=\"https://marginalrevolution.com/wp-content/uploads/2024/07/Chernobyl.png 1026w, https://marginalrevolution.com/wp-content/uploads/2024/07/Chernobyl-300x207.png 300w, https://marginalrevolution.com/wp-content/uploads/2024/07/Chernobyl-1024x708.png 1024w, https://marginalrevolution.com/wp-content/uploads/2024/07/Chernobyl-768x531.png 768w\" /></p>\r\n<p>Fewer nuclear plants than otherwise would have been the case might have made a disaster less likely but there were countervailing forces:</p>\r\n<blockquote><p>We document that the decline in new NPPs in democracies after Chernobyl was accompanied by an increase in the average age of the NPPs in use. To satisfy the rise in energy demand, reactors built prior to Chernobyl continued operating past their initially scheduled retirement dates. Using data on NPP incident reports, we show that such plants are more likely to have accidents. The data imply that Chernobyl resulted in the continued operation of older and more dangerous NPPs in the democracies.</p></blockquote>\r\n<p>Moreover, safety decline because the existing plants got older but in addition “<span>the slowdown of new NPP construction…delayed the adoption of new safer plants.” This is a point about innovation that I have <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/06/the-marginal-revolution-theory-of-innovation.html\">often emphasized</a> (see also <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/?s=glide+path\">here</a>)</span></p>\r\n<blockquote><p><span>The key to innovation is continuous refinement and improvement…. Learning by doing requires doing….Thus, when considering innovation today, it’s essential to think about not only the current state of technology but also about the entire trajectory of development. A treatment that’s marginally better today may be much better tomorrow.</span></p></blockquote>\r\n<p>Regulation increased costs substantially:</p>\r\n<blockquote><p>The U.S. NRC requires six-to-seven-years to approve NPPs. The total construction time afterwards ranges from decades to indefinite. Cost overruns and changing regulatory requirements during the construction process sometime forces construction to be abandoned after significant sunk costs have been made. This often leads investors to abandon construction after already sunk billions of dollars of investment. Worldwide, companies have stopped construction on 90 reactors since the 1980s. 40 of those were in the U.S. alone. For example, in 2017, two South Carolina utilities abandoned two unfinished Westinghouse AP1000 reactors due to significant construction delays and cost overruns. At the time, this left two other U.S. AP1000 reactors under construction in Georgia. The original cost estimate of $14 billion for these two reactors rose to $23 billion. Construction only continued when the U.S. federal government promised financial support. These were the first new reactors in the U.S. in decades. In contrast, recent NPPs in China have taken only four to six years and $2 billion dollars\r\n<br />\r\nper reactor. When considering the choice of investing in nuclear energy versus fossil fuel energy, note that a typical natural gas plant takes approximately two years to construct (Lovering et al., 2016).</p></blockquote>\r\n<p>Chernobyl to be clear was a very costly disaster</p>\r\n<blockquote><p>The initial emergency response, together with later decontamination of the environment, required more than 500,000 personnel and an estimated US$68 billion (2019 USD). <em>Between five and seven percent of government spending in Ukraine is still related to Chernobyl.</em> (emphasis added, AT) In Belarus, Chernobyl-related expenses fell from twenty-two percent of the national budget in 1991 to six percent by 2002.</p></blockquote>\r\n<p>The biggest safety effect of the decline in nuclear power plants was the increase in air pollution. The authors use satellite date on ambient particles to show that when a new nuclear plant comes online pollution in nearby cities declines significantly. Second, they use the decline in pollution to create <strong>preliminary</strong> estimates of the effect of pollution on health:</p>\r\n<blockquote><p>According to our calculations, the construction of an additional NPP, by reducing the total suspended particles (TSP) in the ambient environment, could on average save 816,058 additional life years.</p>\r\n<p>According to our baseline estimates (Table 1), over the past 38 years, Chernobyl reduced the total number of NPPs worldwide by 389, which is almost entirely driven by the slowdown of new construction in democracies. Our calculations thus suggest that, globally, more than 318 million expected life years have been lost in democratic countries due to the decline in NPP growth in these countries after Chernobyl.</p></blockquote>\r\n<p>The authors use the Air Quality Life Index from the University of Chicago which I think is on the high side of estimates. Nevertheless, as you know, I think the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2021/12/why-the-new-pollution-literature-is-credible.html\">new air pollution literature is credible</a> (also <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2023/06/air-pollution-redux.html\">here</a>) so I think the bottom line is almost certainly correct. Namely, Chernobyl caused <em>many</em> more deaths by reducing nuclear power plant construction and increasing air pollution than by its <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2019/05/chernobyl.html\">direct effects which were small albeit not negligible</a>.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/08/the-unseen-fallout-chernobyls-deadly-air-pollution-legacy.html\">The Unseen Fallout: Chernobyl’s Deadly Air Pollution Legacy</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/902214905/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/902214905/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/902214905/marginalrevolution,https%3a%2f%2fmarginalrevolution.com%2fwp-content%2fuploads%2f2024%2f07%2fChernobyl.png\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/902214905/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/902214905/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/902214905/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/the-unseen-fallout-chernobyls-deadly-air-pollution-legacy.html#respond\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/the-unseen-fallout-chernobyls-deadly-air-pollution-legacy.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/mark-skousen-on-free-trade-from-my-email.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=mark-skousen-on-free-trade-from-my-email\">Mark Skousen on free trade (from my email)</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/cowens-third-law-illustrated.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=cowens-third-law-illustrated\">Cowen’s Third Law, illustrated</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/venezuela-under-brutal-capitalism.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=venezuela-under-brutal-capitalism\">Venezuela under “Brutal Capitalism”</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"c77dab61b5f04a53117676c293d41bdc5f0cc39ec49c101c9502481f622d6884","category":"default"}