{"title":"A Lighthouse for Dark Times","link":"https://www.themarginalian.org/2024/11/06/transition/","date":1730910875000,"content":"<p>This is the elemental speaking: It is during phase transition — when the temperature and pressure of a system go beyond what the system can withstand and matter changes from one state to another — that the system is most pliant, most possible. This chaos of particles that liquefies solids and vaporizes liquids is just the creative force by which the new order of a more stable structure finds itself. The world would not exist without these discomposing transitions, during which everything seems to be falling apart and <a href=\"https://www.themarginalian.org/2022/04/07/the-more-loving-one-auden-universe-in-verse/\">entropy</a> seems to have the last word. And yet here it is, solid beneath our living feet — feet that carry value systems, systems of sanity, just as vulnerable to the upheavals of phase transition yet just as resilient, saved too by the irrepressible creative force that makes order, makes beauty, makes a new and stronger structure of possibility out of the chaos of such times. </p>\n<figure><a href=\"https://society6.com/product/light-distribution-on-soap-bubble-from-le-monde-physique-1882_print?sku=s6-11475521p4a1v1?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?resize=680%2C993&amp;ssl=1\" width=\"680\" height=\"993\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?w=2197&amp;ssl=1 2197w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?resize=240%2C351&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?resize=320%2C467&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?resize=768%2C1122&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?resize=600%2C876&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?w=1360&amp;ssl=1 1360w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/08/4.jpg?w=2040&amp;ssl=1 2040w\" /></a><figcaption>Light distribution on soap bubble from the 19th-century French physics textbook <a href=\"https://www.themarginalian.org/2019/08/20/amedee-guillemin-le-monde-physique/\"><em>Le monde physique</em></a>. (Available as <a href=\"https://society6.com/product/light-distribution-on-soap-bubble-from-le-monde-physique-1882_print?sku=s6-11475521p4a1v1?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/products/light-distribution-on-soap-bubble-from-le-monde-physique-1882_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Cultures and civilizations tend to overestimate the stability of their states, only to find themselves regularly discomposed by internal pressures and tensions too great for the system to hold. And yet always in them there are those who harness from the chaos the creative force to imagine, and in the act of imagining to effect, a phase transition to a different state. </p>\n<p>We call those people artists — they who never forget it is only what we can imagine that limits or liberates what is possible. “A society must assume that it is stable,” James Baldwin wrote in <a href=\"https://www.themarginalian.org/2014/08/20/james-baldwin-the-creative-process/\">reckoning with the immense creative process that is humanity</a>, “but the artist must know, and he must let us know, that there is nothing stable under heaven.” In the instability, the possibility; in the chaos, the building blocks of a stronger structure.</p>\n<p>A century of upheavals ago, suspended between two World Wars, <a href=\"https://www.themarginalian.org/tag/hermann-hesse/\">Hermann Hesse</a> (July 2, 1877–August 9, 1962) considered the strange power and possibility of such societal phase transitions in his novel <a href=\"https://www.amazon.com/Steppenwolf-Novel-Hermann-Hesse/dp/0312278675/?tag=braipick-20\" target=\"_blank\"><strong><em>Steppenwolf</em></strong></a> (<a href=\"https://search.worldcat.org/title/698117126\" target=\"_blank\"><em>public library</em></a>). He writes:</p>\n<blockquote><p>Every age, every culture, every custom and tradition has its own character, its own weakness and its own strength, its beauties and ugliness; accepts certain sufferings as matters of course, puts up patiently with certain evils. Human life is reduced to real suffering, to hell, only when two ages, two cultures and religions overlap. A man of the Classical Age who had to live in medieval times would suffocate miserably just as a savage does in the midst of our civilisation. Now there are times when a whole generation is caught in this way between two ages, two modes of life, with the consequence that it loses all power to understand itself and has no standard, no security, no simple acquiescence.</p></blockquote>\n<p>We too are living now through such a world, caught again between two ages, confused and conflicted, suffocating and suffering. But we have a powerful instrument for self-understanding, for cutting through the confusion to draw from these civilizational phase transitions new and stronger structures of possibility: the creative spirit. </p>\n<p>Hesse observes that artists feel these painful instabilities more deeply than the rest of society and more restlessly, and out of that restlessness they make the lifelines that save us, the lifelines we call art. A century before Toni Morrison, living through another upheaval, insisted that <a href=\"https://www.themarginalian.org/2016/11/15/toni-morrison-art-despair/\">“this is <em>precisely</em> the time when artists go to work,”</a> Hesse insists that artists nourish the goodness of the human spirit “with such strength and indescribable beauty” that it is “flung so high and dazzlingly over the wide sea of suffering, that the light of it, spreading its radiance, touches others too with its enchantment.” </p>\n<figure><a href=\"https://society6.com/product/the-dove-no-1-by-hilma-af-klint-1915_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=680%2C900&amp;ssl=1\" width=\"680\" height=\"900\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=320%2C424&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=600%2C795&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=240%2C318&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=768%2C1017&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/HilmaAfKlint_Dove_small.jpg?resize=1160%2C1536&amp;ssl=1 1160w\" /></a><figcaption><em>The Dove No. 1</em> by Hilma af Klint, painted during World War I. (Available as <a href=\"https://society6.com/product/the-dove-no-1-by-hilma-af-klint-1915_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/the-dove-no-1-by-hilma-af-klint-1915_cards\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Often, they do the nourishing at great personal cost. He considers what it means, and what it takes, to be an artist:</p>\n<blockquote><p>You will, instead, embark on the longer and wearier and harder road of life. You will have to multiply many times your two-fold being and complicate your complexities still further. Instead of narrowing your world and simplifying your soul, you will have to absorb more and more of the world and at last take all of it up in your painfully expanded soul, if you are ever to find peace.</p></blockquote>\n<p>Most people, Hesse laments while watching his contemporaries, are instead “robbed of their peace of mind and better feelings” by the newspapers they read daily — the social media of his time — through which the world’s power-mongers manipulate our imagination of the possible. “The end and aim of it all,” he prophecies, “is to have the war over again, the next war that draws nearer and nearer, and it will be a good deal more horrible than the last.”</p>\n<p>That is what happened. The next war did come, the world’s grimmest yet — a phase transition that nearly destroyed every particle of humanity. And yet something was left standing, stirring — that same creative force that made of the chaos a new era of possibility never previously imagined: civil rights and women’s liberation, solar panels and antibiotics, <em>One Hundred Years of Solitude</em> and Nina Simone.</p>\n<p>On the other side of that war’s ruins, another thinker of uncommon depth and sensitivity considered the role of the artist and of art in the collapse and reconfiguring of civilizations. In a 1949 address before the American Academy of Arts and Letters, later included in his lifeline of a collection <a href=\"https://www.amazon.com/Two-Cheers-Democracy-M-Forster/dp/0713156589/?tag=braipick-20\" target=\"_blank\"><strong><em>Two Cheers for Democracy</em></strong></a> (<a href=\"https://search.worldcat.org/title/364466\" target=\"_blank\"><em>public library</em></a>), the English novelist, essayist, and broadcaster <a href=\"https://www.themarginalian.org/2024/10/31/e-m-forster-sensitive/\">E.M Forster</a> (January 1, 1879–June 7, 1970) celebrates the stabilizing power of art in times of incoherence and discord:</p>\n<blockquote><p>A work of art… is the only material object in the universe which may possess internal harmony. All the others have been pressed into shape from outside, and when their mould is removed they collapse. The work of art stands up by itself, and nothing else does. It achieves something which has often been promised by society, but always delusively. Ancient Athens made a mess — but the <em>Antigone</em> stands up. Renaissance Rome made a mess — but the ceiling of the Sistine got painted. James I made a mess — but there was <em>Macbeth</em>. Louis XIV — but there was <em>Phèdre</em>. Art… is the one orderly product which our muddling race has produced. It is the cry of a thousand sentinels, the echo from a thousand labyrinths; it is the lighthouse which cannot be hidden.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/04/12/virginia-woolf-alkayat-cosford/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/04/virginiawoolf2.jpg\" /></a><figcaption>Art by Nina Cosford from the <a href=\"https://www.themarginalian.org/2016/04/12/virginia-woolf-alkayat-cosford/\">illustrated biography of Virginia Woolf</a>, who wrote <a href=\"https://www.themarginalian.org/2020/04/03/virginia-woolf-to-the-lighthouse/\"><em>To the Lighthouse</em></a> in a transitional time.</figcaption></figure>\n<p>Because art is the antipode to the destructive forces sundering society, the artist — endowed with <a href=\"https://www.themarginalian.org/2024/10/31/e-m-forster-sensitive/\">the personal and political power of the sensitive</a> — will invariably tend to be an outsider to the society in which they are born. A decade before Auden observed that <a href=\"https://www.themarginalian.org/2018/01/11/auden-art-politics/\">“the mere making of a work of art is itself a political act,”</a> before Iris Murdoch observed that <a href=\"https://www.themarginalian.org/2019/02/12/iris-murdoch-salvation-by-words/\">“tyrants always fear art because tyrants want to mystify while art tends to clarify,”</a> Forster writes:</p>\n<blockquote><p>If our present society should disintegrate — and who dare prophesy that it won’t? — [the figure of the artist] will become clearer: the Bohemian, the outsider, the parasite, the rat — one of those figures which have at present no function either in a warring or a peaceful world. It may not be dignified to be a rat, but many of the ships are sinking, which is not dignified either — the officials did not build them properly. Myself, I would sooner be a swimming rat than a sinking ship — at all events I can look around me for a little longer — and I remember how one of us, a rat with particularly bright eyes called Shelley, squeaked out, “Poets are the unacknowledged legislators of the world,” before he vanished into the waters of the Mediterranean… The legislation of the artist is never formulated at the time, though it is sometimes discerned by future generations.</p></blockquote>\n<p>This, he assures us, is not a pessimistic view — it is a kind of faith in the future, made of our creative devotion to the present. (I am reminded here of his contemporary Albert Camus’s insistence that <a href=\"https://www.themarginalian.org/2016/06/17/albert-camus-the-rebel/\">“real generosity toward the future lies in giving all to the present,”</a> and of C.S. Lewis, who <a href=\"https://www.themarginalian.org/2022/10/19/c-s-lewis-learning-in-war-time/\">reckoned with our task in troubled times</a> from the middle of a World War to remind us that “the present is the only time in which any duty can be done or any grace received.”) Forster writes:</p>\n<blockquote><p>Society can only represent a fragment of the human spirit, and that another fragment can only get expressed through art… Looking back into the past, it seems to me that that is all there has ever been: vantage-grounds for discussion and creation, little vantage-grounds in the changing chaos, where bubbles have been blown and webs spun, and the desire to create order has found temporary gratification, and the sentinels have managed to utter their challenges, and the huntsmen, though lost individually, have heard each other’s calls through the impenetrable wood, and the lighthouses have never ceased sweeping the thankless seas.</p></blockquote>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?resize=680%2C582&amp;ssl=1\" width=\"680\" height=\"582\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?resize=320%2C274&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?resize=600%2C514&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?resize=240%2C205&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/SophieBlackall_lighthouse.jpg?resize=768%2C657&amp;ssl=1 768w\" /><figcaption>Art by Caldecott-winning children’s book author and artist <a href=\"https://www.instagram.com/sophieblackall/\" target=\"_blank\">Sophie Blackall</a></figcaption></figure>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"c7f1d0b2024f98e50ed69a8b77a5e4d477606da022b735936de78859f587d7d6","category":"Sites"}