{"title":"MrBeast is getting too old to make content slop","link":"https://www.garbageday.email/p/mrbeast-getting-old-make-content-slop","date":1707772977000,"content":"<div><div><h2>MrBeast’s Next Move</h2><p><i>—by Adam Bumas</i></p><p>Garbage Day has been covering MrBeast a lot recently. And you can blame some of that on me. I’ve been tracking his massive rise month to month for almost a year now for our insight reports and if you still think of him as the YouTube face guy, you may not realize he is equally popular on pretty much every platform right now. He’s regularly in the top five fastest-growing accounts on both X and Instagram and, on YouTube, he’s reigned supreme for nearly a year, with his only real competition being the Skibidi Toilet guy. It’s not just that he’s big. He’s big and he’s STILL growing.</p><p>As I see it, the key to MrBeast’s success is relentless optimization. Everything he makes is meticulously edited and presented a dozen different ways for each platform it goes out on. But that also means that he can only stay on top as long as no one figures out how to *<a href=\"https://www.youtube.com/watch?v=uYPbbksJxIg&amp;t=144s&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Edward Teller voice</a>* build a bigger growth hack.</p><p>In January, an account named <a href=\"https://www.youtube.com/@cosmo-tv?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Cosmo TV</a> surpassed MrBeast as the fastest growing YouTube channel. Now, for context, MrBeast still has an enormous 238 million subscribers, while Cosmo TV only has around 14 million. But the latter grew by roughly a million more subscribers than him over the course of last month. </p><p>And that growth is largely thanks to Cosmo TV’s much simpler and cheaper strategy for targeting the algorithm. They record a video of a phone playing a YouTube Short that’s already massively popular, then they switch over to the sensory app <a href=\"https://apps.apple.com/us/app/magic-fluids-lite/id1437514764?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Magic Fluids</a> to fill out the last few seconds. I’ve said before that “<a href=\"https://www.garbageday.email/p/an-onslaught-of-toilets?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Skibidi Toilet has artistic integrity</a>,” but I’m not mounting the same defense here. This is slop.</p><p>The videos Cosmo TV reposts are the kind of thing that gets popular pretty regularly on short-form video apps. I think of it as TikTok spackle — short, wordless, reposted material that inevitably fills up various feeds with visual stimuli. Its simplicity means it can show up on everyone’s For You page and its length means people barely have time to object.</p><p>I spoke to the man behind Cosmo TV,  a self-described “developer, exploiter and professional idiot” who goes by <a href=\"https://seed.soy/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Seed</a>, over DMs. Seed told me he found the formula through trial and error, which is just about the only way to get any reliable reaction out of most algorithms. Even so, it was still surprisingly easy for this one growth hack to zoom past MrBeast, considering he has millions of dollars and dozens of staff members dedicated to keeping him on top.</p><p>If all that can't measure up to a video of a phone playing another video of colorful goop, then how long can MrBeast keep it up? Well, if you’ve been following his non-YouTube maneuvers lately, they paint a clear picture of someone looking for a chair before the music stops. </p><blockquote><a href=\"https://www.instagram.com/p/C3OqtMeRxrV/?hl=en&amp;img_index=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"><p> Instagram post by @mrbeast </p></a></blockquote><p>We’ve covered his <a href=\"https://www.youtube.com/watch?v=52OOi5eIpTI&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">continuing experimentation</a> with X, but in late January, he started uploading videos <a href=\"https://www.businessinsider.com/mrbeast-chinese-social-media-bilibili-x-expanding-empire-2024-1?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">in Mandarin</a> to the Chinese video platform Bilibili. That same week, <i>Variety</i> <a href=\"https://variety.com/2024/digital/news/mrbeast-reality-show-amazon-prime-video-1235882230/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">reported</a> he’s in talks with Amazon to make a game show for Prime Video.</p><p>MrBeast knows he can’t do the same thing forever and he’s trying everything to build the broadest and most stable audience he can while he still has the clout and the money to spare. He also seems dead set on avoiding the post-peak careers of fellow YouTubers. The Smosh guys have become <a href=\"https://www.youtube.com/playlist?list=PLShD8ZZW7qjk2FgS7ml5EltfgzlSLYP-I&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">elder statesmen</a>, Markiplier is <a href=\"https://www.imdb.com/title/tt27564844/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">going Hollywood</a>, <a href=\"https://www.dexerto.com/entertainment/youtuber-pewdiepie-welcomes-baby-boy-with-wife-marzia-2208608/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">PewDiePie</a> took parental leave last year, and <a href=\"http://www.neilcic.com/mouthdreams/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Neil Cicierega</a> does mouth music now. But MrBeast wants to graduate YouTube as something else, something bigger.</p><p>And the Amazon game show tips off where his ambition is pointed. Other internet stars who get TV deals tend to make either <a href=\"https://www.imdb.com/title/tt5467814/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">irony poisoned autofiction</a> or <a href=\"https://www.imdb.com/title/tt13890060/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Kardashian-esque reality shows</a>. Both of these need a lot of charisma and personality — and real stardom of some kind — which MrBeast seems to understand he doesn’t really have. So he wants to make his debut in the analog-ish world as a game show host. </p><p>And, honestly, MrBeast becoming Gen Z’s Bob Barker would probably be a best-case scenario for everyone involved (especially us, since we could stop writing about him). But what would it mean for YouTube if their biggest success story of the past decade turns his attention away from the platform and becomes a streaming TV game show host because he can’t keep up with their algorithms?</p><p>When you go back through MrBeast videos from a few years ago, you can see how much his style has changed to stay on the cutting edge. You can also see that he hasn’t had a video that came close to the success of “Squid Game in real life” more than two years ago. And a<i> </i>streaming TV show means a whole new set of production considerations and challenges without the same kind of latitude for trial and error he gets on YouTube.</p><p>More stability, less energy to stay at the forefront of what’s popular — there's a term for this and it's \"growing up\". None of those other huge YouTubers I listed were past their mid-20s at their peak, and MrBeast turns 26 in a few months. Maybe YouTube stardom will always be a game for the young, and MrBeast, the consummate optimizer, knows he's getting too old to keep up.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><h2><b>For some election-year reading…</b></h2><p>Over the past few years, FWIW has become the go-to newsletter for journalists and political operatives tracking digital tactics and trends in American politics. From interviews with the White House to investigations of shady right-wing content farms on Facebook, subscribe to FWIW to monitor the online forces impacting our elections.</p><p><a href=\"https://www.fwiw.news/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\"><span><b>Read + subscribe here &gt;&gt;</b></span></a></p><hr /><h2>A Good Bluesky Post</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/825e9dca-367b-49df-8123-08c7938dfec4/IMG_4678.jpeg?t=1707749868\" /><div><a href=\"https://bsky.app/profile/lolennui.bsky.social/post/3kl6p7ozs6r2j?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\"><span><p>(Bluesky/@lolennui)</p></span></a></div></div><hr /><h2>Biden’s Big Game</h2><blockquote><p></p><p>Just like we drew it up.</p><p></p><a href=\"https://twitter.com/JoeBiden/status/1756888470599967000?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"><p> — Joe Biden (@JoeBiden) <br /> Feb 12, 2024 </p></a></blockquote><p>President Biden had an interesting Super Bowl Sunday. He <a href=\"https://www.reuters.com/sports/nfl/biden-skip-traditional-super-bowl-interview-second-year-2024-02-10/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">skipped</a> the Super Bowl interview for the second year, which, as someone who doesn’t really follow sports of any kind, was a thing I didn’t know existed until he started skipping it. Pundits like James Carville are making the rounds <a href=\"https://edition.cnn.com/videos/politics/2024/02/10/smr-carville-on-dems-after-special-counsel-fallout.cnn?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">saying</a> it’s a bad sign, but I think it’s much more interesting to look at what his team did do yesterday.</p><p>Right now the president and his campaign have the same setup on X and Threads, with a @potus account and a @joebiden account. And comparing the reaction to the president’s Super Bowl posts yesterday can, I think, tell us a lot about both the internet at the moment and also, our politics. (Biden also <a href=\"https://www.tiktok.com/@bidenhq?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">launched a TikTok yesterday</a> which is very curious, but let’s put a pin in that for now and come back to it in a few weeks.)</p><p>As I see it, there were two big posts across the Biden Digital Universe yesterday:</p><ul><li><p><a href=\"https://twitter.com/POTUS/status/1756713597864988940?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">The shrinkflation video</a> — a weirdly surreal, but ultimately pretty sensible video about food brands shrinking their sizes while keeping the price the same, shared to @potus.</p></li><li><p>“<a href=\"https://twitter.com/JoeBiden/status/1756888470599967000?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">Just like we drew it up.</a>” — a trolly Dark Brandon meme engaging with right-wing conspiracy theory that Democrats fixed the Super Bowl because Taylor Swift is a CIA PsyOp or whatever, shared to @joebiden.</p></li></ul><p>Now, if you only follow Biden’s content on X, you’d think all of these were a resounding failure. X is a right-wing social network now and, more broadly, the discourse there is so poisoned that no one is looking to meaningfully engage with the president, whether it’s a post about a policy or a meme. On Threads, however, the reactions were different. </p><p>As I see it there are three community layers to Threads. First, there is the basic Meta static, the unavoidable cruft of users on every Meta platform who seem to have literally just got the internet yesterday. Those users are all in the replies of Biden’s shrinkflation video taking photos of their kitchens and writing things like “Charmin toilet paper, price the same yet smaller rolls.” I love them. Second, you have former Twitter libs, who are writing things like, “really, this is what you’re focused on when [XYZ] is happening?”. I hate these people. Get a life. And, finally, because of the way Threads rolled out simultaneously to the X rebrand, you have a group that I’m going to call LinkedIn Sociopaths and because Biden chose to focus the video on snack companies (snacks, the Super Bowl, etc.), they are vehemently convinced that “shrinkflation” could be fixed if people stopped eating junk food and just lost weight. I love these guys too. But they also need to be studied in a lab and are clearly a danger to society.</p><p>As for the Dark Brandon “Just like we drew it up.” meme, guys, I kid you not, there are people on Threads responding to it with Texts from Hillary memes. We are so fucking back.</p><p>So what does this say about both the internet and politics? Well, more and more we’re all seeing the same content — because there are just too many sites we have to share it to — but each site is becoming a vastly different prism through which to view it. Also, we don't really have much of a media apparatus left to create even an illusion of consensus for this stuff. Which means, more often than not, that we can’t really assess importance. And that makes me wonder if, someday sooner than we think, we’ll start to see important figures like the president give up on posting all together because ultimately there’s no way to make sense of the reactions. The days of “winning the internet” are over.</p><hr /><h2>I Am 99% Sure This TikTok Of A Dog Using The Vision Pro Is Fake But I Still Hate It Anyways</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@brodiethatdood?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"> @brodiethatdood </a><p>Brodie tries Apple Vision Pro! #apple #visionpro #goldendoodle </p></section></blockquote><p>As I said above. I’m fairly certain this is fake. But it’s still awful. Especially the part towards the end where the dog supposedly replays a video of his owner playing fetch with him, which is so dystopian that I can’t really even process it. It’s like something out of <i>Robocop</i>.</p><p>Anyways, in the case that technology to do this eventually does exist, please do not make your dog live out a virtual representation of its own memories. Please don’t do that.</p><hr /><h2>Threads Will Never Be A Place For News Content</h2><p>Last week, Meta, once again, reiterated in no uncertain terms, that news content is not welcome on Threads. Which is, of course, a ridiculous position to take. But who knows. Maybe Meta knows something we don’t and actually the future of text on the web is the Duolingo bird and Taco Bell talking to Elmo about about trauma.</p><p>Per <a href=\"https://www.washingtonpost.com/technology/2024/02/10/politics-meta-threads-instagram/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\"><i>The Washington Post</i></a><i>, </i>Threads will not show content relating to “laws, elections or social issues from accounts those users don’t follow.” Threads already doesn’t default to a chronological timeline nor does it support lists. Which is one obvious and one less obvious feature you need for any sort of real-time content creation and curation.</p><p>Which is all very unfortunate seeing as how every major journalist I follow has decamped there from X/Twitter. Though, I think a large part of that was because Instagram verifications carried over to Threads and journalists love clout regardless of who’s giving it to them.</p><p>But I also don’t see Threads’ “no politics” stance lasting very long. Everything online eventually becomes political with enough time and scrutiny. In the short term, this dumb policy will stifle and squash conversation on the app led by women, people of color, and queer people. And in the long term it’ll either kill the app’s relevance entirely — because no social network has ever survived without those groups influencing the public discourse — or it’ll lead to new ways of using the app that bypass their dumb policy entirely. Meta cannot win this, but it’s sorta fun watching them waste all this effort trying, I guess.</p><hr /><h2>A UMG Artist Is Leaking Their Unreleased Music To TikTok</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@peachprc?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"> @peachprc </a><p>umg tryna keep my music a secret</p></section></blockquote><p>Australian pop star Peach PRC is making TikTok videos <a href=\"https://twitter.com/cameronwilson/status/1756195800491974722?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">featuring</a> her unreleased music to skirt UMG’s block on the platform. I’ve seen some users <a href=\"https://twitter.com/thebigjohnnyd/status/1756193890942734461?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">speculate</a> that this music just hasn’t been released yet and that when it does, it would then get muted. Which is actually an interesting little attention hack.</p><hr /><h2>Jay Eazy Is Dropping A New Song This Week</h2><blockquote><p></p><p>Bridget Dropping Feb 15th ‼️</p><p></p><a href=\"https://twitter.com/jayeazywhat/status/1756101622164263323?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"><p> — Jayeazywhat (@jayeazywhat) <br /> Feb 9, 2024 </p></a></blockquote><p>Jay Eazy is the rapper <a href=\"https://www.garbageday.email/p/the-great-silent-majority-of-american?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">who went viral</a> for his song “Mega Man” last year. The virality of his last big single ended up connecting him with professional <i>Super Smash Bros</i>. players and competitive e-sports more broadly and it seems like he’s leaning into that with his new song. It’s called “Bridget,” which is a reference to a <a href=\"https://www.dexerto.com/gaming/guilty-gear-strive-creator-confirms-bridget-is-a-trans-woman-1932868/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">fan-favorite trans character</a> from the fighting game <i>Guilty Gear</i>. Jay Eazy’s video, embedded above, also features him playing football with a bunch of Bridget cosplayers.</p><p>The one sort of Big Takeaway Thought I have here is that this is actually a pretty good example of how virality and niches interact right now. Jay Eazy went viral, connected with a pre-existing community that seemed to fit his whole deal, and his now making music specifically for that community. It’s a nice inversion of how this kind of thing used to work.</p><hr /><h2>A Good Japanese X Post</h2><blockquote><p></p><p>過去最高に酔っ払って目が覚めた時</p><p></p><a href=\"https://twitter.com/animenetabot/status/1756205763180310589?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"><p> — 錆兎 (@animenetabot) <br /> Feb 10, 2024 </p></a></blockquote><p>“When I woke up the drunkest I've ever been.”</p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and the coveted weekend issue. Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\"><span> Upgrade </span></a></div></div><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://sicweekly.substack.com/p/sic-282-malicious-compliance?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">A good podcast featuring… ME!</a></p></li><li><p><a href=\"https://www.engadget.com/who-makes-money-when-ai-reads-the-internet-for-us-200246690.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">“Who makes money when AI reads the internet for us?”</a></p></li><li><p><a href=\"https://www.theverge.com/2024/2/8/24065821/snap-versus-the-world?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">“It’s Snap versus the world”</a></p></li></ul><hr /><p>P.S. here’s some <a href=\"https://twitter.com/artnlc2250/status/1754840081100427353?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=mrbeast-is-getting-too-old-to-make-content-slop\" target=\"_blank\">extremely powerful grilling content</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=646cb383-fcba-47d4-aae2-6201961d7be9&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"c7f73101e32ff487a03e757f55c39dd22ca21568863964ae2fbaa9e081b25844","category":"default"}