{"title":"","link":"http://scripting.com/2024/02/01.html#a150936","date":1706800176000,"content":"<img src=\"https://imgs.scripting.com/2024/02/01/runner.png\" />Here's what's going to happen. A bunch of new networks are forming, and they will melt into one, following a pattern established by the internet itself, when they formed a <a href=\"https://en.wikipedia.org/wiki/Transmission_Control_Protocol\">net of nets</a> based on a common protocol called TCP. On top of that HTTP was built, with a number of years following with very productive building and bootstrapping, and from there it was a lot of chaos, around the advent of Twitter, Facebook and Google Reader. The last time we had a common way of <a href=\"http://scripting.com/2014/03/21/theWebIsMadeOfInterop.html\">interop</a> was 17 years ago. I think/hope we're incentivized to make one edit box suffice, in place of the 5-10 <a href=\"http://scripting.com/2024/01/14.html#a145854\">tiny little textboxes</a> we now all have to copy-paste between, and btw one way of addressing nodes, and then we can start building again as we did last in the 90s and 00s. I see something brilliant in the <a href=\"https://www.theverge.com/2024/1/31/24057231/iconfactory-kickstarter-internet-reader-project-tapestry-twitterrific\">new path</a> that Twitteriffic wants to go down (I gave <a href=\"https://www.kickstarter.com/projects/iconfactory/project-tapestry\">them</a> $128). It's same path I've been going down, mostly without partners, for the 17 years since we crawled on land and started tweeting. I don't see the negative shit that's happening on Twitter, it's easy to avoid the mess -- I don't think that's the reason we're breaking out of that silo -- it's that all at once all the devs who had been quietly suffering with Twitter were set free. Boom. All at once. And it turns out perhaps we don't give up so easily. <span>😄</span>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"c908944d6c9e1a5b8d4b06c4b494d49292078dbf90bcc0e53621baec0baa1f3d","category":"default"}