{"title":"The Erosion of Financial Privacy","link":"https://feeds.feedblitz.com/~/870359933/0/marginalrevolution~The-Erosion-of-Financial-Privacy.html","date":1707999592000,"content":"<p>Here is a bit on privacy from Eric Hughes’s <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://nakamotoinstitute.org/cypherpunk-manifesto/\">Cypherpunk’s Manifesto</a> of 1993.</p>\r\n<blockquote><p>Privacy is necessary for an open society in the electronic age. Privacy is not secrecy. A private matter is something one doesn’t want the whole world to know, but a secret matter is something one doesn’t want anybody to know. Privacy is the power to selectively reveal oneself to the world.</p>\r\n<p>…Since we desire privacy, we must ensure that each party to a transaction have knowledge only of that which is directly necessary for that transaction….In most cases personal identity is not salient. When I purchase a magazine at a store and hand cash to the clerk, there is no need to know who I am. When I ask my electronic mail provider to send and receive messages, my provider need not know to whom I am speaking or what I am saying or what others are saying to me; my provider only need know how to get the message there and how much I owe them in fees. When my identity is revealed by the underlying mechanism of the transaction, I have no privacy. I cannot here selectively reveal myself; I must <em>always</em> reveal myself.</p>\r\n<p>Therefore, privacy in an open society requires anonymous transaction systems. Until now, cash has been the primary such system. An anonymous transaction system is not a secret transaction system. An anonymous system empowers individuals to reveal their identity when desired and only when desired; this is the essence of privacy.</p></blockquote>\r\n<p>I am saddened and dispirited by the evolving situation. Privacy is losing. Cash has nearly vanished without being replaced by cryptographically private alternatives. Instead, we rely on credit cards, debit cards, Venmo, PayPal, and other systems that log every transaction in vast databases.</p>\r\n<p>Cash gave us substantial privacy by default because there was no technological alternative but there was never a collective vote for cash or, sadly, a consensus for privacy. You might hope that people would demand to keep the privacy rights they they once had but no. The populace seems indifferent to the erosion of privacy. Instead, paranoia about criminals hijacks the narrative. “What about the sex traffickers and terrorists?!” they shout. People seem more than willing to give up their privacy in exchange for a promise of security–false though the promise may be. Thus, we get ever more draconian regulations, effectively strangling our financial freedom. <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://josephhollander.com/news-blog/illegal-large-amounts-cash/\">The $10,000 cash rule</a>, for example, is insane, a reflection of Nixonian paranoia and not fit for a free society.</p>\r\n<blockquote><p>If you deposit or withdraw cash in excess of $10,000, your bank must fill out a currency transaction report (CTR) on a Department of the Treasury Financial Crimes Enforcement Network (FinCEN) Form 104. The person making the deposit or withdraw must provide identification to the bank, and the bank must report details of the transaction as well as the name, address, social security number, and birthdate of the person making the deposit or withdrawal. Multiple deposits made in one day must be added together and will trigger the reporting requirement if, combined, they exceed $10,000.</p>\r\n<p>Bankers are also required to file suspicious transaction reports (STRs). Withdrawing or depositing amounts just under $10,000 often does not succeed in avoiding reports to the government, because STR’s have no dollar limit. A person who withdraws $8,000 three times in a week may trigger the filing of an STR, and that person will not be notified that the STR was filed. Banks are also directed to perform account audits to look for suspicious activity. If the banking activity is not consistent with the “customer’s profile,” banks are directed to file a suspicious activity report (SAR).</p>\r\n<p>Reporting requirements are not limited to banks. Business are also required to report cash transactions over $10,000. Any business (including a sole proprietorship) that receives more than $10,000 in cash in a single transaction or in related transactions must file an IRS Form 8300. If a business or individual fails to file a Form 8300 when required, the business or individual can be fined. The penalty for intentionally disregarding the filing requirement is the greater of $25,000 or the amount of cash received in the transaction not to exceed $100,000.</p></blockquote>\r\n<p>Currency transaction reports and suspicious transaction reports, do they not sound like something the Stasi would demand in communist East Germany? A free people would throw off this outrageous transgression. But could we get rid of such rules today? Could we even index the rules to inflation? $10,000 in 1970, when the Bank Secrecy Act was passed, is about $80,000 today.</p>\r\n<p>Privacy suffers from a collective action dilemma: individually it isn’t worth much and so we don’t defend it, but lack of privacy is immensely costly when lost en masse. Moreover, our data, en masse, is worth a lot to corporations and governments. Thus privacy has few defenders and strong attackers.</p>\r\n<p>We are on technology path that by default leads to less and less financial privacy. Another path exists, a path on which technology safeguards our financial privacy, but that path must be chosen and time is running short.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html\">The Erosion of Financial Privacy</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/870359933/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/870359933/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/870359933/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/870359933/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/twitter20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/870359933/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/870359933/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comment-160718280\">In reply to Thoughts and Prayers.   &gt; Weren't you the guy that ...</a> <i>by PHinton</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comment-160718257\">In reply to Kevin.   “I think privacy advocates need to make ...</a> <i>by The Null Hypothesis</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comment-160718216\">It's the same with reporting foreign assets via the FBAR fwiw. ...</a> <i>by Adam</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comment-160718200\">Fanni Willis seemed to believe in cash</a> <i>by Paagal Swami</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comment-160718170\">In reply to Kaleberg.   Ok, but I’d rather have that option ...</a> <i>by Oldcurmudgeon</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/02/the-erosion-of-financial-privacy.html#comments\">Plus 10 more...</a></li></ul></div> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"caa48bdcf64b216f0cc6e3175462b14e58e0d7592a65c057cde8a9264a36601e","category":"default"}