{"title":"","link":"http://scripting.com/2024/02/25.html#a154445","date":1708875885000,"content":"<img src=\"https://imgs.scripting.com/2024/02/25/tinytinylittletextbox.png\" />BTW, apparently my <a href=\"http://scripting.com/2024/02/24.html#a161904\">post</a> yesterday where I said I was \"doing some of my best writing in ChatGPT\" was confusing. I meant literally what I said. <i>My</i> writing. Not that I was using ChatGPT to do my writing for me. I can understand that some people do that, writing isn't one of their things. However writing is one of my things. I've been writing every day for almost thirty years. My writing style has changed a lot over the years. I don't necessarily think it's gotten better, it's just different. I would never post writing publicly written by a anyone other than me without saying it was. Writing for me is very personal. On the other hand, I don't draw very well, never have. I used to be good at box diagrams with arrows, but I'm really out of practice. So if you see something colorful here, that <i>was</i> drawn by a bot, unless it says otherwise. I think we all have to be very clear about that. Now, I do write a lot in ChatGPT because I'm trying to get it to help me solve problems, almost always technical. Basically you have to <a href=\"https://chat.openai.com/share/b4235922-c4e2-4996-89cf-48c34cf2af67\">sketch</a> out the problem in English very specifically so it gives you back what you want. I never thought I'd be programming in English, but here I am doing it. I really want a copy of everything I write, because someday I might want to feed it into a bot other than ChatGPT. There's the lock-in. <i>They own part of me, and I don't even get a copy. </i>Yes yes I know I can download individual conversations, but not if they include an image btw, did you think of that? And who has time to remember to download them. This is fucked up. One of my action items is to hook <a href=\"http://drummer.land/\">Drummer</a> up to their API so I'm not relying on their editor. Every time you find yourself typing into a <a href=\"http://scripting.com/2024/01/14/031201.html\">tiny little text box</a> the alarms should go off.","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"cae697a4b3e9d5adab43a731a8f3f60c24b23d96a4a095404f3b4ec0442c2e8e","category":"default"}