{"title":"Shame and the Secret Chambers of the Self: Pioneering Sociologist and Philosopher Helen Merrell Lynd on the Uncomfortable Path to Wholeness","link":"https://www.themarginalian.org/2024/04/17/shame-lynd/","date":1713360678000,"content":"<p><a href=\"https://www.amazon.com/Shame-Search-Identity-Helen-Merrell/dp/1138875422/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"474\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/lynd_shame.jpg?fit=320%2C474&amp;ssl=1\" alt=\"Shame and the Secret Chambers of the Self: Pioneering Sociologist and Philosopher Helen Merrell Lynd on the Uncomfortable Path to Wholeness\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/lynd_shame.jpg?w=669&amp;ssl=1 669w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/lynd_shame.jpg?resize=320%2C474&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/lynd_shame.jpg?resize=600%2C890&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/04/lynd_shame.jpg?resize=240%2C356&amp;ssl=1 240w\" /></a></p><p>There are certain experiences that shatter the eggshell of the self and spill the yolk of the unconscious, slippery and fertile, aglow with potential for growth. Shame is one of them — an experience private and powerful, rife with the most elemental questions of who we are and where we belong. At its core is a peculiar form of <a href=\"https://www.themarginalian.org/2023/06/07/karen-horney-our-inner-conflicts/\">inner conflict</a>, in which one part of the self gasps with revulsion at the choices of another, exposing the fundamental incoherence of our inner lives and the longing for what D.H. Lawrence called <a href=\"https://www.themarginalian.org/2024/04/10/parts/\">“living unison,”</a> exposing the unsteady foundations of reality itself.</p>\n<p>The pioneering sociologist and philosopher <strong>Helen Merrell Lynd</strong> (March 17, 1896–January 30, 1982) examines shame as a singular lens on the self, and on the human potential for integration and transformation, in her revelatory 1958 book <a href=\"https://www.amazon.com/Shame-Search-Identity-Helen-Merrell/dp/1138875422/?tag=braipick-20\" target=\"_blank\"><strong><em>On Shame and the Search for Identity</em></strong></a> (<a href=\"https://search.worldcat.org/title/194185\" target=\"_blank\"><em>public library</em></a>) — an investigation of the disconnect between the people we think ourselves to be and the people we act ourselves into being, inviting a proper understanding of shame as a pathway toward a more conscious and coherent self.</p>\n<figure><a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=680%2C873&amp;ssl=1\" width=\"680\" height=\"873\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?w=1453&amp;ssl=1 1453w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=320%2C411&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=600%2C770&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=240%2C308&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=768%2C986&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?resize=1197%2C1536&amp;ssl=1 1197w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/thelionandthebird0.jpg?w=1360&amp;ssl=1 1360w\" /></a><figcaption>Art by Marianne Dubuc from <a href=\"https://www.themarginalian.org/2014/05/07/the-lion-and-the-bird-marianne-dubuc/\"><em>The Lion and the Bird</em></a></figcaption></figure>\n<p>Lynd writes:</p>\n<blockquote><p>Shame is an experience that affects and is affected by the whole self. This whole-self involvement is one of its distinguishing characteristics and one that makes it a clue to identity… In this moment of <em>self</em>-consciousness, the self stands revealed. Coming suddenly upon us, experiences of shame throw a flooding light on what and who we are and what the world we live in is.</p></blockquote>\n<p>Those experiences that involve the whole self are particularly vulnerable to our compulsion for categories and labels, born of an anxiety to contain the in the finite the infinities of the mind, to wrest order from the chaos of the heart. With an eye to the challenge of comprehending and communicating such complex experiences — experiences like love, wonder, longing, self-respect, and shame — Lynd cautions against the limiting nature of labels:</p>\n<blockquote><p>Reliance on accepted categories and methods may mean that certain phenomena essential for understanding identity escape attention. In the present climate of psychological thought any observed human characteristic speedily acquires a label, which encases it within one of the experimentalists’ or the clinicians’ categories. Extensive as these categories are, applied to some life situations they may be more constricting than informing. </p>\n<p>Certain pervasive experiences, not easily labeled, may slip through the categories altogether or, if given a location and a name, may be circumscribed in such a way that their essential character is lost. Habituation to such usage may blind us still further to the necessity of searching more deeply into the nature of these experiences.</p></blockquote>\n<p>To look more closely at experiences “hard to isolate and confine,” she argues, is to look into the very nature of the self, into what William James called the “blooming buzzing confusion” of consciousness. Lynd writes:</p>\n<blockquote><p>It is no accident that experiences of shame are called <em>self</em>-consciousness. Such experiences are characteristically painful. They are usually taken as something to be hidden, dodged, covered up — even, or especially, from oneself. Shame interrupts any unquestioning, unaware sense of oneself. But it is possible that experiences of shame if confronted full in the face may throw an unexpected light on who one is and point the way toward who one may become. Fully faced, shame may become not primarily something to be covered, but a positive experience of revelation.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2014/05/27/ulysses-mimmo-paladino/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/05/ulysses_paladino1.jpg?w=600&amp;ssl=1\" /></a><figcaption>Illustration by Mimmo Paladino for <a href=\"https://www.themarginalian.org/2014/05/27/ulysses-mimmo-paladino/\">a rare edition of James Joyce’s <em>Ulysses</em></a></figcaption></figure>\n<p>Part of what makes shame so misunderstood and underinvestigated is that it is often conflated with guilt. Although the two may complement and reinforce one another, guilt tends to arise from the feeling of wrongdoing, of having transgressed a boundary, while shame stems from the feeling of falling short, of failing to reach a hope or meet an expectation, which anchors it in a deeper stratum of the personality — for rules and boundaries are externally constructed, while our hopes, expectations, and ideals are the most intimate building blocks of personhood. This is why an apology accepted and pardon granted can vanquish guilt, but they do little to allay shame. Lynd writes:</p>\n<blockquote><p>Guilt can be expiated. Shame, short of a transformation of the self, is retained. This transformation means, in Plato’s words, a turning of the whole soul toward the light.</p></blockquote>\n<p>Drawing on a kaleidoscope of examples from literature — Shakespeare and Sartre, The Bible and <em>Anna Karenina</em>, Virginia Woolf’s diaries and <em>Huckleberry Finn</em> — she observes that shame is most often contrasted not with extrinsic measures like righteousness and approval by others but with the elemental, intrinsic values of truth and honor. It is a mirror held up to the self, brutal and sobering — a revelation of a profound breach between the ideal self, in which our self-image is rooted, and the real self. She writes:</p>\n<blockquote><p>Experiences of shame appear to embody the root meaning of the word — to uncover, to expose, to wound. They are experiences of exposure, exposure of peculiarly sensitive, intimate, vulnerable aspects of the self. The exposure may be to others but, whether others are or are not involved, it is always… exposure to one’s own eyes… Shame is the outcome not only of exposing oneself to another person but of the exposure to oneself of parts of the self that one has not recognized and whose existence one is reluctant to admit.</p>\n<p>[…]</p>\n<p>The feeling of unexpectedness marks one of the central contrasts between shame and guilt. This unexpectedness is more than suddenness in time; it is also an astonishment at seeing different parts of ourselves, conscious and unconscious, acknowledged and unacknowledged, suddenly coming together, and coming together with aspects of the world we have not recognized. Patterns of events (inner and outer) of which we are not conscious come unexpectedly into relation with those of which we are aware.</p></blockquote>\n<p>This feeling of internal incongruence is the most painful aspect of shame — a vivid reminder that we know ourselves only incompletely and have but marginal control over <a href=\"https://www.themarginalian.org/2024/04/10/parts/\">which parts of us</a> take the reins of personhood at any given moment. (And yet this aspect of self-surprise is something shame shares with some of the most beautiful capacities of consciousness — wonder and delight, also marked by the gasp at another dimension of reality revealed. Homer linked Aidos — the Greek goddess of shame — to awe.) Lynd writes:</p>\n<blockquote><p>Being taken unawares is shameful when what is suddenly exposed is incongruous with, or glaringly inappropriate to, the situation, or to our previous image of ourselves in it… We have acted on the assumption of being one kind of person living in one kind of surroundings, and unexpectedly, violently, we discover that these assumptions are false. We had thought that we were able to see around certain situations and, instead, discover in a moment that it is we who are exposed; alien people in an alien situation can see around us.</p></blockquote>\n<p>What makes shame most unbearable is this feeling of sudden expatriation from reality, which leaves trust — in oneself, in the world — dangerously jeopardized. Paradoxically, it is often not the darkest but the brightest in us that is most vulnerable to shame. Lynd writes:</p>\n<blockquote><p>Part of the difficulty in admitting shame to oneself arises from reluctance to recognize that one has built on false assumptions about what the world one lives in is and about the way others will respond to oneself… Shame over a sudden uncovering of incongruity mounts when what is exposed is inappropriate positive expectation, happy and confident commitment to a world that proves to be alien or nonexistent… Even more than the uncovering of weakness or ineptness, exposure of misplaced confidence can be shameful — happiness, love, anticipation of a response that is not there, something personally momentous received as inconsequential. The greater the expectation, the more acute the shame.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-by-friedrich-wilhelm-winter-from-cephalopod-atlas-by-carl-chun-1910-benefitting-greenpeace2663643_print?sku=s6-13477919p4a1v1?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?resize=680%2C971&amp;ssl=1\" width=\"680\" height=\"971\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?resize=240%2C343&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?resize=320%2C457&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?resize=768%2C1097&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/03/CephalopodAtlas15.jpg?resize=600%2C857&amp;ssl=1 600w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2020/03/03/cephalopod-atlas-carl-chun/\"><em>Cephalopod Atlas</em></a>, the world’s first encyclopedia of deep-sea creatures. (Available <a href=\"https://society6.com/product/art-by-friedrich-wilhelm-winter-from-cephalopod-atlas-by-carl-chun-1910-benefitting-greenpeace2663643_print?sku=s6-13477919p4a1v1?curator=brainpicker\" target=\"_blank\">as a print</a> and as <a href=\"https://society6.com/product/art-by-friedrich-wilhelm-winter-from-cephalopod-atlas-by-carl-chun-1910-benefitting-greenpeace2663643_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Shame is so difficult to bear because it takes us back to the core vulnerabilities of childhood, that tender need for congruence between the world of our imagination and the real world, the longing for a single world that coheres. Lynd writes:</p>\n<blockquote><p>Basic trust in the personal and in the physical world that surrounds him is the air that the child must breathe if he is to have roots for his own sense of identity and for the related sense of his place in the world. As he gradually differentiates the world of in here from the world of out there he is constantly testing the coherence, continuity, and dependability of both… Expectation and having expectation met are crucial in developing a sense of coherence in the world and in oneself.</p></blockquote>\n<p>Because it is so rooted in our grasp of reality, the shame of having misjudged a situation, misplaced an expectation, miscalculated one’s own merits, is a profound unmooring of the psyche:</p>\n<blockquote><p>What we have thought we could count on in ourselves, and what we have thought to be the boundaries and contours of the world, turn out suddenly not to be the “real” outlines of ourselves or of the world, or those that others accept. We have become strangers in a world where we thought we were at home. We experience anxiety in becoming aware that we cannot trust our answers to the questions <em>Who am I? Where do I belong?</em></p>\n<p>[…]</p>\n<p>Because personality is rooted in unconscious and unquestioned trust in one’s immediate world, experiences that shake trusted anticipations and give rise to doubt may be of lasting importance… Shattering of trust in the dependability of one’s immediate world means loss of trust in other persons, who are the transmitters and interpreters of that world. We have relied on the picture of the world they have given us and it has proved mistaken; we have turned for response in what we thought was a relation of mutuality and have found our expectation misinterpreted or distorted; we have opened ourselves in anticipation of a response that was not forthcoming. With every recurrent violation of trust we become again children unsure of ourselves in an alien world.</p></blockquote>\n<p>In the remainder of <a href=\"https://www.amazon.com/Shame-Search-Identity-Helen-Merrell/dp/1138875422/?tag=braipick-20\" target=\"_blank\"><strong><em>On Shame and the Search for Identity</em></strong></a>, Lynd goes on to explore examples of shame and its conciliation across the canon of Western literature, then examines the two natures of shame, what it offers in confronting the tragedy of life, and how to think from parts to wholes. Couple it with Lynd’s contemporary Karen Horney on <a href=\"https://www.themarginalian.org/2023/06/07/karen-horney-our-inner-conflicts/\">the conciliation of our inner conflicts</a>, then revisit Ellen Bass’s magnificent poem <a href=\"https://www.themarginalian.org/2023/11/28/how-to-apologize-ellen-bass/\">“How to Apologize.”</a> </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"cae98ea33bc815cf45e6e06290fcf70fe106930d6cd197a7ac985207a301f25a","category":"default"}