{"title":"Vertically Integrated and AI-first","link":"https://www.usv.com/writing/2024/02/the-edge-of-physical-industry/","date":1708627082000,"content":"<p>A new pattern is emerging that we are excited about at USV: entrepreneurs are upgrading physical industries with an AI-first and vertically integrated approach. Instead of selling software to industry incumbents, startups are increasingly deciding to use their technical know-how to compete head-on. </p>\n\n\n\n<p>We think this approach is especially important for companies in physical industries, and it fits our thesis of <a href=\"https://www.usv.com/writing/2024/01/investing-at-the-edge-of-large-markets-under-transformative-pressure/\">investing</a> at the edge of large markets being transformed by technological and societal pressures. The physical industries we look at in our climate fund – from energy to minerals exploration and mining to agriculture and beyond – are massive but dominated by stodgy incumbents. Though there are many different end-customers, the markets often consolidate under just a few producers. </p>\n\n\n\n<p>These incumbent producers effectively serve as gatekeepers between startups with new technology and the end customers they want to benefit. They tend not to operate at the bleeding edge of what is technologically possible and struggle to evaluate or integrate novel tools. And when they get interested in some new technology, they can exert their market power to push egregiously favorable terms. </p>\n\n\n\n<p>The combination of advancements in AI and demand from the world’s largest economies to accelerate the energy transition creates a unique set of conditions for reshaping these markets. Instead of working with and growing through incumbents, we believe climate startups should leverage proprietary technology as a wedge to create a differentiated and vertically integrated offering.</p>\n\n\n\n<p>Our portfolio company <a href=\"https://www.usv.com/writing/2022/08/zanskar/\">Zanskar</a> is a paradigmatic example of this trend: Zanskar is using its AI tools to compete with incumbent geothermal developers instead of trying to sell them software. USV companies <a href=\"https://www.usv.com/writing/2022/03/radiant/\">Radiant</a> and <a href=\"https://www.usv.com/writing/2021/07/transmutex/\">Transmutex</a> are accelerating the design of their nuclear systems with novel approaches to software simulation.</p>\n\n\n\n<p>We plan to make more investments in startups that employ an AI-first vertically integrated approach when it comes to various types of energy generation and <a href=\"https://www.usv.com/writing/2023/07/mind-the-storage-gap/\">storage</a>. We are also excited about similar opportunities in the exploration and mining of critical minerals that are needed to electrify and decarbonize the economy, the development of new materials for everything from sorbents for carbon capture to consumer goods, and novel ways to grow the food that is required to feed the world. These are huge markets under strong technological and societal pressures that software alone has failed to change.</p>\n\n\n\n<p>Vertical integration is hard. It requires courage and skill to simultaneously be best in class at developing software and hardware and be operationally excellent at managing supply chains, regulatory hurdles, geopolitical dynamics, and much more. This approach also requires founders to be extraordinary fundraisers since the <a href=\"https://www.usv.com/writing/2023/02/building-out-the-climate-capital-stack-the-opportunity-for-pilot-foak-and-series-b-funds/\">climate capital stack</a> is not yet fully developed and these companies rarely have metrics investors can benchmark against. But the only way out is through. We are eager to partner with and support entrepreneurs who are committed to solving these generational challenges.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/02/the-edge-of-physical-industry/\">Vertically Integrated and AI-first</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Matt Mandel","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"caff5706d5defa546076e46987c5b0a4357f8b8e93060d6535957c62538482f1","category":"default"}