{"title":"Ai, Big Tech, & Markets","link":"https://om.co/2024/11/12/ai-big-tech-markets/","date":1731425626000,"content":"<figure><table><thead><tr><th>Company</th><th>Nov 5, 2024</th><th>Nov 11, 2024</th><th>Change ($B)</th><th>Change (%)</th></tr></thead><tbody><tr><td>Meta</td><td>$1,445B</td><td>$1,471B</td><td>+$26B</td><td>+1.80%</td></tr><tr><td>Amazon</td><td>$2,174B</td><td>$2,175B</td><td>+$1B</td><td>+0.05%</td></tr><tr><td>NVIDIA</td><td>$3,432B</td><td>$3,563B</td><td>+$131B</td><td>+3.82%</td></tr><tr><td>Microsoft</td><td>$3,059B</td><td>$3,108B</td><td>+$49B</td><td>+1.60%</td></tr><tr><td>Tesla</td><td>$808.9B</td><td>$1,124B</td><td>+$315.1B</td><td>+38.95%</td></tr><tr><td>Apple</td><td>$3,378B</td><td>$3,389B</td><td>+$11B</td><td>+0.33%</td></tr><tr><td>Alphabet</td><td>$2,078B</td><td>$2,211B</td><td>+$133B</td><td>+6.40%</td></tr><tr><td>Total</td><td>$16,374.9B</td><td>$17,041B</td><td>+$666.1B</td><td>+4.07%</td></tr></tbody></table></figure>\n\n\n\n<p>My good friend John Gruber was quite upset about the election results. He was even more upset by the words used by big technology executives to congratulate the president-elect. <a target=\"_blank\" href=\"https://daringfireball.net/2024/11/i_wonder\">He didn’t mince words.</a></p>\n\n\n\n<p>As is often the case, his blog serves as a good prompt for my brain to explore some strange paths. Not surprisingly, his blog post prompted me to examine the market capitalization of big tech companies (including Tesla for obvious reasons) at the close of the market the day before the elections and compare it with the same figure a week later. These seven companies have added $666 billion in market capitalization since the election results were announced.</p>\n\n\n\n<p>In a way, this reflects stock market sentiment around “cloud” and “AI.” Nvidia, Microsoft, Alphabet and Meta are all in on AI, and you can see their stocks reflecting that. Apple has dipped its toes. And Amazon is still the laggard among the big tech companies when it comes to AI.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"605\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-1024x605.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-1024x605.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-300x177.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-768x454.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-192x113.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-1100x650.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease-560x331.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/BigTechMarketCapincrease.jpg 1456w\" /></figure>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.danablankenhorn.com/\">Dana Blankenhorn,</a> a veteran technology journalist, pointed out on his blog that AI is the newest king of the economy and will end up making the rules. He notes that when cotton was the most important crop, slavery made the rules. When railroads were booming, they set the table. Utilities, manufacturers and oil have all had their chance to define the rules for the economy and thus our society. The rise of the cloud means that large tech companies have defined the way society works. And now it is AI’s turn.</p>\n\n\n\n<p>Of course, like all booms, there’s going to be a bust. The AI boom will result in unmet expectations, much like the internet in the 1990s. The cost structure of AI is wonky for now. A lot of energy is required to make it all work. The costs are out of whack with what people are willing to pay. Eventually, technology — newer silicon or newer sources of energy — will bring down these costs. For instance, this week, Google announced <a target=\"_blank\" href=\"https://cloud.google.com/tpu/docs/v6e\">it has developed a new version of its Tensor Processing Unit,</a> Trillium, which, to put it simply, will help them lower the costs of their Gemini API.</p>\n\n\n\n<p>In time, other rivals to Nvidia will emerge—just as they did for Cisco’s biggest routers, which were once the hottest-selling piece of internet gear and helped Cisco become one of the most valuable companies in the world during the late 1990s and early 2000s. For now, Nvidia is making bank, selling $40,000 Blackwell GPUs or whatever it can charge. Next year, it will launch Rubin.</p>\n\n\n\n<p>Currently, the industry is frothing over AI. The market suggests that with the new administration in place, the AI boom has more room to become a real bubble. I’m sure I’ll be writing more about that in weeks to come.</p>\n\n\n\n<p><em>November 12, 2024, San Francisco</em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"cb36a712c3b173a41dd3546f0f9acfded25f80714529df6aaa7e3a35e09157e7","category":"Sites"}