{"title":"Beyond Either/Or: Kierkegaard on the Passion for Possibility and the Key to Resetting Relationships","link":"https://www.themarginalian.org/2024/07/26/kierkegaard-either-or-relationships/","date":1721994330000,"content":"<h3>“Were I to wish for anything I would not wish for wealth and power, but for the passion of the possible, that eye which everywhere, ever young, ever burning, sees possibility.”</h3>\n<hr />\n<p><a href=\"http://www.amazon.com/Either-Fragment-Life-Penguin-Classics/dp/0140445773/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/04/kierkegaard_eitheror.jpg?w=680&amp;ssl=1\" /></a>Some of the most difficult moments in life are moments of having to choose between two paths leading in opposite directions — to tell or not to tell, to leap or not to leap, to leave of not to leave — each rife with losses (even if they are <a href=\"https://www.themarginalian.org/2023/11/21/necessary-losses/\">necessary losses</a>) the pain of which you will feel acutely and with gains which you are <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">constitutionally unable to imagine</a>. </p>\n<p>You could do it rationally, applying Benjamin Franklin’s <a href=\"https://www.themarginalian.org/2018/11/14/benjamin-franklin-joseph-priestley-pros-cons/\">framework of weighing the pros and cons</a>. You could do it emotionally, polling the people you trust, despite the fact you alone know what is best for you since you alone know what it’s like to be you. You could concede <a href=\"https://www.themarginalian.org/2016/07/25/sam-harris-free-will/\">the futility of free will</a> and flip a coin. Still, that bifurcation of the soul remains because life, in all its irreducible complexity, is not something you can optimize the way you optimize a route for minimal traffic or maximal scenery. What makes those moments so difficult is the knowledge that there will never be a way of testing where the other path would have led — you only have the one life, lived.</p>\n<p>But perhaps there is a third way — one based not on renunciation, which is at the heart of all binary choices, but of integration, which is the pulse-beat of possibility. A way to stop trudging the ground of forking paths and lift off into the sky of the possible.</p>\n<figure><a href=\"https://www.themarginalian.org/2023/10/24/we-are-starlings/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/10/wearestarlings0.jpg\" /></a><figcaption>Art by Marc Martin from <a href=\"https://www.themarginalian.org/2023/10/24/we-are-starlings/\"><em>We Are Starlings</em></a></figcaption></figure>\n<p>That is what the Danish philosopher <strong>Søren Kierkegaard</strong> (May 5, 1813–November 11, 1855) explores in his 1843 masterwork <a href=\"http://www.amazon.com/Either-Fragment-Life-Penguin-Classics/dp/0140445773/?tag=braipick-20\" target=\"_blank\"><strong><em>Either/Or</em></strong></a> (<a href=\"http://www.worldcat.org/title/eitheror-a-fragment-of-life/oclc/1368441&amp;referer=brief_results\" target=\"_blank\"><em>public library</em></a>). Long before Alan Watts admonished against <a href=\"https://www.themarginalian.org/2015/11/06/alan-watts-swimming-headless/\">the trap of thinking in terms of gain and loss</a>, before George Saunders offered <a href=\"https://www.themarginalian.org/2024/03/11/regret/\">his lovely lens for living an unregretting life</a>, Kierkegaard writes:</p>\n<blockquote><p>If you marry, you will regret it; if you do not marry, you will also regret it; if you marry or if you do not marry, you will regret both; whether you marry or you do not marry, you will regret both. Laugh at the world’s follies, you will regret it; weep over them, you will also regret it; if you laugh at the world’s follies or if you weep over them, you will regret both; whether you laugh at the world’s follies or you weep over them, you will regret both. Believe a girl, you will regret it; if you do not believe her, you will also regret it; if you believe a girl or you do not believe her, you will regret both; whether you believe a girl or you do not believe her, you will regret both. If you hang yourself, you will regret it; if you do not hang yourself, you will regret it; if you hang yourself or you do not hang yourself, you will regret both; whether you hang yourself or you do not hang yourself, you will regret both. This… is the sum of all practical wisdom.</p>\n<p>[…]</p>\n<p>Many people think [they are in the mode of eternity] when, having done the one or the other, they combine or mediate these opposites. But this is a misunderstanding, for the true eternity lies not behind either/or but ahead of it.</p></blockquote>\n<p>Kierkegaard considers the frame of mind necessary for living beyond either/or:</p>\n<blockquote><p>Were I to wish for anything I would not wish for wealth and power, but for the passion of the possible, that eye which everywhere, ever young, ever burning, sees possibility. </p></blockquote>\n<p>In no region of life is this passion for possibility more vital than in our closest relationships, which at their strongest and most nourishing must transcend the either/or confines of labels and categories, but must retain deep friendship at the core. There are times in life when an important relationship collides with the confines of practical reality and must shape-shift in order to survive — a collision that can be incredibly painful yet incredibly fertile in the change it precipitates within both persons involved and in the third person that is the dynamic between them. </p>\n<figure><a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=650%2C472&amp;ssl=1\" width=\"650\" height=\"472\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?w=650&amp;ssl=1 650w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=240%2C174&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=320%2C232&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/friendship-1.jpg?resize=600%2C436&amp;ssl=1 600w\" /></a><figcaption>Illustration by Maurice Sendak from <a href=\"https://www.themarginalian.org/2014/01/29/lets-be-enemies-maurice-sendak/\">a vintage ode to friendship</a> by Janice May Udry</figcaption></figure>\n<p>A century before Anne Morrow Lindbergh wrote so beautifully about <a href=\"https://www.themarginalian.org/2024/02/11/anne-morrow-lindbergh-change/\">embracing the mutability of intimate relationships</a>, Kierkegaard considers what it takes to let a relationship change organically in order to feed the soul in a new way: </p>\n<blockquote><p>The same relationship can acquire significance again in another way… The experienced farmer now and then lets his land lie fallow; the theory of social prudence recommends the same. All things, no doubt, will return, but in another way; what has once been taken into rotation remains there but is varied through the mode of cultivation.</p></blockquote>\n<p>What a way to remember that <a href=\"https://www.themarginalian.org/2023/10/22/17/\">everything is eventually recompensed, every effort of the heart eventually requited, though not always in the form you imagined or hoped for</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"cbab8048b76e819d991dbb19b999957c5000f964900f7091f06b77cf5c729e1e","category":"default"}