{"title":"Ben Kihnel","link":"https://sive.rs/ben-kihnel","date":1711584000000,"content":"<p>\nI just got the call from the super-connected <a href=\"https://inmusicwetrust.com/about.html\">Alex Steininger</a> that our mutual friend Ben Kihnel died in his sleep.\nHe was only 48.\n</p><p>\nBen was employee #2 of CD Baby.\n(#1 was the great <a href=\"https://www.linkedin.com/in/johnsteup\">John Steup</a>.)\nJohn hired Ben the day we moved the company to Portland, Oregon.\nI don’t even know how we met Ben.\nThen all of the early employees at CD Baby were Ben’s friends, so Ben was really the start and the heart of everything for us in Portland.\n</p><p>\nBen was one of my favorite people.\nSuch a warm, open, empathetic guy.\nSuch a great conversationalist.\nPeople often talk insincerely — echoing cliché phrases, or saying one thing but meaning another.\nBut even Ben’s shortest communications were really sincere and engaged — fully listening, understanding, and sharing.\nHe was always great at getting to the heart of things.\n</p><p><em>\nI hope I remember to tell people how I appreciate them when they’re alive.\n</em></p><p>\nSo sad he died so young.\nWe last talked a year or two ago, and he was wonderful as ever.\nI’ll always remember him fondly.\nHe was a really special person — an exceptional soul.\nThe world was a better place with him in it.\n</p><p>\nBen was the one who told me to post the <a href=\"https://sive.rs/232\">“232 sand dollars” story</a> on my website, because he thought it defined me.\nThat’s why many of <a href=\"https://sive.rs/232#comments\">the comments on that page</a> from 2011 are thanking Ben.\n</p><p>\nI don’t take many photos, so the only two I have of him are from 2002: on the phone at work, and at a New Year’s Eve party.\nBut I can hear his voice clearly in my head.\n</p>\n<img src=\"/images/ben-kihnel-1.jpg\" alt=\"Ben Kihnel\" title=\"Ben Kihnel\" />\n<img src=\"/images/ben-kihnel-2.jpg\" alt=\"Ben Kihnel\" title=\"Ben Kihnel\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"cbbc2d56c09fd75f667685cbce06d70251eaeb913d1b37de1e09fd16dd235191","category":"default"}