{"title":"o1 explains why you should not dismiss Fischer Black on money and prices","link":"https://feeds.feedblitz.com/~/909037583/0/marginalrevolution~o-explains-why-you-should-not-dismiss-Fischer-Black-on-money-and-prices.html","date":1733636960000,"content":"<blockquote><p>The prediction of inflation dynamics—how prices change over time—has increasingly confounded modern macroeconomists. Throughout much of the twentieth century, there seemed to be clear relationships linking the money supply, economic slack, and price levels. Monetarism, the school of thought that posits a stable connection between the growth rate of a money aggregate and the subsequent rate of price inflation, emerged from these apparent regularities. However, in the decades since, inflation’s behavior has grown more elusive. At present, even the most sophisticated forecasting models struggle to produce accurate predictions, and this persistent difficulty has led many economists to abandon or at least sideline monetarist frameworks, even as broad conceptual approximations of what drives price-level changes.</p>\r\n<p>Several factors have contributed to the increasing complexity and unpredictability of inflation. First, the financial innovations and regulatory changes of the late twentieth and early twenty-first centuries dramatically altered the relationship between money and economic activity. Monetary aggregates—like M1 or M2—that once served as dependable indicators of policy stance and future inflation now behave erratically due to shifts in the velocity of money, the proliferation of shadow banking, and the globalization of financial flows. Simply put, where money resides and how quickly it moves through the economy has become too fluid and too complex for older monetarist simple rules to capture.</p>\r\n<p>Second, the nature of central banking and fiscal policymaking has changed. Central banks now intervene in a host of unconventional ways, from massive purchases of financial assets to the forward guidance of policy expectations. These tools are not well-explained by the classic monetarist perspective, which centered on controlling a particular measure of the money supply. The recent experience following the Global Financial Crisis vividly illustrates this: The Federal Reserve and other central banks undertook unprecedented quantitative easing programs, dramatically expanding their balance sheets. According to traditional monetarist logic, this rapid increase in the monetary base should have led to substantial inflation. Yet inflation remained persistently below target levels in many advanced economies for years, confounding those who relied on old monetary aggregates as a guide.</p>\r\n<p>Third, the determination of prices today involves a bewildering interplay of global supply chains, technological advances, labor market transformations, and shifts in consumer behavior. Globalization means that prices for goods and services are influenced not just by domestic monetary conditions, but also by distant supply shocks, currency fluctuations, and international competition. Technological change increases productivity and can compress prices in certain sectors, while leaving other parts of the economy less affected. Labor markets have also evolved, with changes in union power, demographic shifts, and altered labor-force participation patterns influencing wage formation and cost pressures. These micro-level frictions and structural changes make the older macro-level equations linking money supply growth to inflation too coarse and imprecise.</p>\r\n<p>Expectations add another layer of complexity to predicting inflation. Modern theories emphasize the importance of how households and firms anticipate future prices. If inflation expectations are well-anchored—due perhaps to the credibility and transparency of central banks—then inflation may remain muted even in the presence of large monetary expansions. This expectations-driven feedback loop can be fragile and influenced by factors that monetarist models never fully accounted for, such as long-standing policy credibility, real-time policy communication, and evolving social norms around price-setting.</p>\r\n<p>The persistent difficulty in accurately forecasting inflation has thus fostered widespread skepticism regarding monetarist frameworks. Economists have increasingly turned to more eclectic, multi-factor models that mix elements of behavioral economics, sectoral and supply-side analyses, and forward-looking expectation frameworks. In these models, money plays at most a peripheral role, subsumed within larger financial conditions indexes or treated as a secondary variable rather than a primary determinant of prices. While many of these frameworks remain works-in-progress, they arguably do a better job reflecting the messy reality of modern economies than the neat but now outmoded equations of monetarism.</p>\r\n<p>Moreover, as central banking has shifted toward inflation targeting and the careful management of expectations, the levers of policy have diverged even further from the simple control of monetary aggregates. Instead, policymakers pay more attention to interest rates, output gaps, and inflation targets. Market participants and researchers look to high-frequency data, surveys of inflation expectations, measures of wage growth, and detailed sectoral price indices to glean insights into future inflation trends.</p>\r\n<p>In sum, today’s difficulty in predicting inflation stems not from a lack of effort or sophistication on the part of economists, but from a world that has grown too complex for the old, more mechanical relationships. As the empirical evidence over recent decades has mounted, it has pushed policymakers and scholars away from monetarism. Central bankers and macroeconomists have concluded that merely tracking money supply is insufficient to explain or predict the course of price levels. They have rejected monetarism not out of ideological bias, but because the data and events of recent history have shown that the old assumptions and simplifications no longer approximate the reality of modern inflation dynamics.</p></blockquote>\r\n<p>Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://chatgpt.com/share/6752cf2c-0044-8010-ba81-885021bb2e52\" target=\"_blank\">the link</a>, and I will add a few points:</p>\r\n<p>1. o1 is a very good economist.  Try to stump it if you can.</p>\r\n<p>2. I am very familiar with Scott Sumner’s monetary theory arguments about medium of account, cash balances, and the like.  I grew up with those in pretty much the same manner that Scott did.  That said, after decades of watching the data, I have surrendered many of my earlier intuitions.</p>\r\n<p>3. I actually stand to “the quantity theory side” of the current macroeconomic consensus.  That is, I think the quantity theory is <em>sometimes</em> quite relevant, such as right after the pandemic, when the inflation rate rose considerably along with M2 aggregates.  But often quantity theory modes of thought are far less relevant, and we do not have a good theory for distinguishing when.  Note that a lot of the empiricists who work in this area, say for the Fed, do not think money supply magnitudes are very relevant <em>at all</em>.  If anything, I am leaning in Scott’s direction, rather than going out on a limb relative to mainstream doctrine.</p>\r\n<p>4. Basically, the people who dismiss the Fischer Black view would have a tougher time of it if they started with this evidence.</p>\r\n<p>5. In Scott’s comment on his post he starts by citing me and then writes: “[TC] I read Scott as significantly overrating the forecasting power of the nominal in the data. [end TC]”  No, that is misreading me. My post wasn’t considering the forecasting power of nominal data. For instance, I don’t believe that changes in the money supply are a good way of forecasting inflation.  My post was a critique of the view that central banks cannot control inflation, i.e., the view that they do not affect nominal variables. I was not claiming that they have perfect control over inflation.”</p>\r\n<p>A few points: a) I read Scott <em>in general</em> as overemphasizing the nominal, it wasn’t a comment about that post per se.  The data on inflation dynamics show how poorly we understand the nominal.  b) we still need a good way of thinking about inflation, and that re-opens the door to Black-like insights, and c) neither Black nor I claim that central banks cannot affect nominal variables. They do this best when people think they can, or when they are willing to act irresponsibly with the currency or possibly monetary base lever.  But often they are not willing to act irresponsibly, so much of it boils down to expectations.  That is close to Black’s view, though I think he overemphasized expectations as the sole relevant factor.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html\">o1 explains why you should not dismiss Fischer Black on money and prices</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/909037583/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/909037583/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/909037583/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/909037583/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/909037583/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/909037583/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comment-160844311\">o1 is very good at understanding what other people have written ...</a> <i>by Dave C</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comment-160844296\">In reply to Larry Siegel.   Why not target real income and ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comment-160844294\">In reply to Larry Siegel.   Is that the Reagan era calling, ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comment-160844292\">In reply to mkt42.   Can I quote to you from “Noise”? ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comment-160844289\">In reply to Larry Siegel.   《more satisfying theoretically》 ...</a> <i>by rsm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/o1-explains-why-you-should-not-dismiss-fischer-black-on-money-and-prices.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/noah-smith-presents-ryan-oprea.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=noah-smith-presents-ryan-oprea\">Noah Smith presents Ryan Oprea</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/how-is-the-russian-war-economy-doing.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=how-is-the-russian-war-economy-doing\">How is the Russian war economy doing?</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/12/why-are-no-trillion-dollar-companies-being-created-in-europe.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=why-are-no-trillion-dollar-companies-being-created-in-europe\">Why are no trillion dollar companies being created in Europe?</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"cbc5dba67cf52c55e8a6c69803817ef6307337c1aa5d233a776f803567d3caf1","category":"Sites"}