{"title":"Real-life Networks","link":"https://www.usv.com/writing/2024/07/real-life-networks/","date":1720547517000,"content":"<p>This is part two in a series about how web3 will influence the future of social networks. In Part One , I wrote about how public social networks will be unbundled and siphoned off into smaller networks that form around interests (e.g., Phish Phans, bird-watching enthusiasts, biohackers, Swifties, etc.) and have unique user experiences and business models that are specific to that network.</p>\n<p>This second installment focuses on private social networks. I think of these as communities of people who know each other in real life and frequently assemble in groups on messaging applications. When we were building GroupMe we called it the “real life network.” We thought of it as a network of smaller networks and a place for people to stay connected to their “close ties.” Private social networks are the group chats that keep you connected with your family, your best friends from school, your kid’s little league team, your church group, your fitness buddies, and of course, your crew that you go see jamband concerts with. These networks are usually persistent threads in your life. Sometimes they’re hyperactive, and sometimes there’s a lull in the conversation for a week, month, or year(s). But they usually stay with you for a very long time, if not a lifetime.</p>\n<p>What’s interesting about private social networks is that they live primarily in messaging applications: groupme, WhatsApp, iMessage, signal, discord, telegram, etc. They’re fragmented, but they seldom burrow themselves into a broadcast platform. That means that the ways we interact with them are fundamentally different than the way we interact with traditional social media. We don’t sit there scrolling and consuming content – we engage and tell jokes, share photos and videos and memes, make real-world plans, wish friends happy birthday, etc. The UX that supports these groups is distinct and simple, but it is also overdue for an upgrade.</p>\n<p>Several weeks ago, groupme rolled out its largest release in over a decade. It became one of the first messaging applications to integrate AI into the group chat experience and shipped a handful of other features and upgrades, too. I have long felt that messaging applications – the place where our real-life networks live –  have hit an evolutionary wall. There has been little to no innovation with regard to how we interact with these groups, and the UX has been relegated to a chat interface that looks and feels the same across these important applications.</p>\n<p>There are three core areas of functionality that need to be explored: applications, money, and AI.</p>\n<p>Every real-life network should be able to access a robust suite of applications they can invite to a group chat and interact with together . Years ago when we were building groupme we used to talk about how we were going to create a world where developers could build applications that groups could use together in the app. We wanted people to be able to play Words with Friends together right in their groups. Why can’t groups play interactive games together in a group chat? Why aren’t there applications for collaboratively planning and booking trips, reservations, events, etc.? Real-life networks have real problems and needs, and they should be addressed in the interfaces in which they live.</p>\n<p>Groups of people use money to do things together. Splitting the bill at a restaurant? Paying for rent with roommates? Planning an event? Going on a trip? Paying dues for Little League? Making friendly wagers? The list is endless. All of these are pain points. Money needs to be native to group experiences. Every group should have a ledger of contributions, easily be able to split payments, and program their collective and individual money to do whatever they want.</p>\n<p>AI is the thing that can keep groups interesting, fun, and useful and give them longevity. MetaAI is available to chat 1-1 in WhatsApp, and now co-pilot is enabled in groupme. Groups should be able to ask agents questions together. Agents should be able to make helpful recommendations to groups and provide value to them in novel ways: suggestions of activities to do together, reservations at places, birthday reminders, surfacing old photos and choice quotes from the chat, rekindling activity when things have gone dormant, telling jokes, etc. The possibilities are limitless. They can be general purpose or even entertainment oriented: imagine inviting an AI into the group that you created together in the image of a friend or one that represents a historical figure, celebrity, musician, etc. AI can be a friend, comedian, personal group concierge, facilitator or counselor in service of your group.</p>\n<p>These are all relatively rudimentary and obvious ideas, but they are sorely missing from real-life networks. Why? All of our groups are stuck inside monolithic messaging applications that are designed to service the needs of their owners and not our own. Incumbents care about retaining users in their own messaging applications. They will prioritize the features and strategies that are best suited to entrenching the parent company. This usually means a focus on locking in its username and being closed to outside developers. As a result, messaging applications are way behind the innovation curve. Sure, they are fast and secure, but those are tablestakes characteristics. This thread by Shane Mac, the founder of XMTP , does a good job highlighting this issue:</p>\n<p>Shane Mac</p>\n<p>@ShaneMac</p>\n<p>People ask me what’s different about building on XMTP?</p>\n<p>The answer: privacy, security, and our commitment to being open.</p>\n<p>The protocol update we released today is the biggest improvement since we started XMTP.</p>\n<p>Groups with the highest level of privacy and security.</p>\n<p>It takes…</p>\n<p>XMTP</p>\n<p>@xmtp_</p>\n<p>Since day 1, devs have asked us for 1 thing:</p>\n<p>Secure + private group chat.</p>\n<p>Today, we are stoked to announce the production launch of XMTP groups, leveraging MLS to bring the most secure, privacy preserving, soon-to-be decentralized group chat to devs.</p>\n<p>Scroll down to:</p>\n<p>Learn…</p>\n<p>8</p>\n<p>1:59 PM • Jun 17, 2024</p>\n<p>I believe the only way to create the real-life network experience we deserve and to unseat the incumbent messaging applications is to be Open. An open ecosystem means that anyone can build a client on top of a messaging protocol. People should be able to build unique user experiences for certain demographics without having to rebuild the network itself (similar to the idea in Part One ). Building the killer “use case” experience, like a college-focused one, a church congregation, or a recreational sports team, should be much easier. This is why I am excited about protocols like XMTP that are laying the foundation for these ideas to be realized.</p>\n<p>Being open means that the applications and AI agents that are invited into every chat can be accessed by every client as well. Imagine an open marketplace of applications that you can invite into 1-1 and group chats that are accessible across any messaging application built atop a shared protocol. What an incredible feature for developers to build once and ship everywhere. The exact same experience could extend to a marketplace of AI agents. I don’t want to only be able to use Meta AI or MSFT’s whatever-they-call-it-today bot. I want to choose for myself. And when it comes to the economics of these real-life networks, being open means lock-in is not possible. Money that moves around within and between groups can also flow from client to client and in and out of the protocol.</p>\n<p>For nearly a decade, I get a pitch every month or so from an entrepreneur saying they are going to build the groupme killer. Nobody has done it yet. It’s not because groupme is a stellar application, it’s because you need a forcing function to move all your groups to another application. The only way to do this is to pray the app either gets shut down or to build something that is 10x better. It’s really hard to build something that is 10x better. WhatsApp is a superb messaging application. So is Signal and Telegram. 10x better means something important needs to be fundamentally different. Being open and nurturing a robust developer ecosystem of builders who are chomping at the bit to push forward the paradigm of messaging and real-life networks feels like the way to go about it. People need a reason to switch. It’s time to give them one.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/real-life-networks/\">Real-life Networks</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"cbe78b37de0dccf193fc81d4d99490605acf353a6f893b93585ffda4a689b89d","category":"default"}