{"title":"honoring your creative energy in business","link":"https://keningzhu.com/journal/business-as-honoring-creative-energy","date":1724164560000,"content":" \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=1000w\" width=\"2000\" height=\"1600\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/6ccd2f8e-f421-4bd4-8f24-b871e9119135/business_as_creative_energy_8-20.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n\n  <p><em>an ongoing exploration of </em><a href=\"https://keningzhu.com/entrepreneurship\"><em>artist business ethos</em></a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p>after eight years of working primarily for myself, I'm reframing what business means to me. </p><p>I’m moving away from thinking about business as <em>\"work that makes me money\"</em> or, as <em>\"selling products/services that people pay me for…”</em> even though, technically, that is what happens. these last eight years, this kind of (<em>call it transactional</em>) mindset hasn't felt inspiring or expansive. </p><p>why? </p><p>first of all, because two questions naturally follow from this definition: </p><p>1. will <em>this activity that I’m doing</em> lead to money? <em>(if not, is it even worth my time?)</em></p><p>2. how can I get people to pay for this? </p><p></p><p></p><h1>resistance against business </h1><p>for a long time, I thought that I was just <em>bad at business</em> -- because I really didn't enjoy asking myself these questions. under this framework, thinking about <em>how to sell</em> or <em>how to make things people will buy</em> felt like pulling teeth. I hated it. I avoided it. I did it half-heartedly, or I made an offering — then, too exhausted by the effort, I ghosted it. as a result, for many years, I did very little \"selling\" or “offering” or \"advertising;” most of my money came from incoming client requests that arrived, seemingly, out of nowhere.</p><p>last year, I did a lot of inner/shadow work around art and money through writings on <a href=\"https://keningzhu.com/journal/artist-entrepreneur\">becoming an artist-entrepreneur</a>. in deliberately thinking about what kind of business I want to grow -- I've slowly formed a new framework -- a framework to help me <strong><em>fully inhabit, commit to, and embody my business</em></strong> — as my full creative self. </p><p>this is the ultimate purpose around ALL the work I do: the practice of continually asking: <em>how can I show up to this (whatever this is) as my true self?</em>  </p><p><br /></p><h1>a new framework </h1><p>rather than thinking about business as the exchange of <em>value for money</em>, instead, I’m thinking about <strong>business as:</strong></p><p><strong><br />a set of systems and processes <br />to help me honor my creative energy, <br />shared with purpose in the world.</strong></p><p><br />first, this framework starts with seeing all business exchanges as about the giving and receiving of <strong>energy</strong> — including money. </p><p>the purpose of a business — all of its systems of marketing, selling, and operating — is thus to make <strong>energy exchange feel as easeful and efficient as possible</strong>. it’s about treasuring and making the most of this energy — and finding ways to <strong>magnify</strong> its power and effect. <br /><br />in other words, my business exists to help me share my creative gifts -- in service to my values and ethos -- in the most <strong>energetically efficient way</strong> possible. when my business is <a href=\"https://keningzhu.com/journal/7-processes-for-energetically-aligned-business-flow\" target=\"_blank\">in alignment with my energy</a>, it is a generative, self-renewing ecosystem. it is an ecosystem which allows me to rest. <br /></p><p>I’ll explore this framework in a few parts: </p><p>1. why focus on energy, not labor -- as the essential resource</p><p>2. the concept of energetic reciprocity</p><p>3. what is energy generative work? </p><p>2. creating efficient systems and containers for energy to flow </p><p></p><p></p><h1>why focus on energy, not labor</h1><p><strong>creative energy</strong> is any process within you that imagines, envisions, guides, manifests, shapes, or evolves a raw form — into something new. this is why I talk about creative alchemy; it is alchemical in that it transforms. </p><p>this energy can be tangible, intangible, or energetic; it takes creative energy to send a newsletter, edit a podcast episode, to open a cafe, to grow a garden, to build a website, to write a book, to do tarot readings, or to offer therapy sessions. each activity is the directed movement of energy through processes of creation, or co-creation.  </p><p>within this framework, <strong>the key input into a business system is NOT <em>labor</em></strong> -- defined in measurable blocks of units/time -- <strong>but instead,</strong> <strong><em>creative energy.</em></strong> </p><p>labor is an approximation of energy — but it is NOT energy itself. </p><p>labor is contingent on time and effort. energy is not. </p><p>labor is measured in minutes and hours. energy is not. </p><p>energy is far more fluid, nebulous, and shapeshifting. there is energy in a spark of an idea. an intention or desire. a singular moment.</p><p>labor can be monetized (and thus compensated) with an hourly wage. </p><p>energy can only be channeled into containers of time. </p><p>most importantly: <strong>labor is not renewable.</strong> once you spend labor, you cannot get it back. energy, when given in alignment, can be generative. energy invested in the right places can create more energy. </p><p></p><h1>energetic reciprocity</h1><p><strong>here's a simple example:</strong> five hours of writing might be deeply energy nourishing, but more \"labor\" for no immediate profit. a 2 hour meeting with a misaligned client can be much less \"labor,\" (and yes, you're being paid for it) -- but it could be energetically draining in such a way that its effects linger on for days. </p><p><em>(or is that just me?)</em></p><p>in this situation, how do you decide where to spend your time and energy? if you are prioritizing labor-of-hours-for-money, than it'd be hard to silence the voice that clearly distinguishes between \"paid work\" and \"unpaid work\" <em>(as if all creative work lives so easily in this binary dichotomy of capitalist-defined worthiness.)</em></p><p>but if you're focused on <strong><em>energy</em></strong> as the primary resource, then your decisions will depend on your sense of energetic reciprocity; that is: <span><em>you'll see money as another form of energy</em>.</span> you'd ask yourself: is this dollar amount an nourishing, net-positive exchange to compensate for the energy I'm spending on this person/project?</p><p>to be honest, most of the time, I don't know the answer to this until I've tried it. and -- this amount is <em>always</em> relative, depending on where you're at in your life and business. </p><p></p><h1>prioritizing energy-generative work </h1><p>so, how does your perspective change when you see <strong><em>energy</em></strong> as the key resource -- rather than labor? </p><p>you'd see activities that replenish your creative energy (like rest, or wandering, or daydreaming) as absolutely essential to the wellbeing of your psychic and business ecosystem as a whole -- rather than feeling guilty for taking time off, when you could be working. </p><p>you start to see how energy works in mysterious, non-linear ways; how <em>the yin</em> is a source of insight, wisdom, and creative power. </p><p>when <strong><em>labor</em></strong> is the limited resource, the business prerogative would be to minimize how you spend labor-time — per unit of money earned. </p><p>but if <strong><em>energy</em></strong> is the resource, then the objective would be to channel energy in a way that not only creates <strong><em>money</em></strong> (one form of energy) -- but also feeds and propagates <span>more</span> creative energy. </p><p>you'd prioritize directing your energy into the places and projects that feels most generative — capable of giving back in folds. this is like planting a seed that grows more seeds — which will feed you, in later seasons, or years. </p><p></p><p></p><h1>building efficient systems &amp; containers </h1><p><br />the practice of business, thus, is about taking raw creative energy — and cultivating the systems and skills to harness its power — that is, to be creative/prolific/expressive/aligned, AND to be in service for a higher set of values or ethos. I write about this integration of art and service <a href=\"https://keningzhu.com/journal/the-guiding-question-to-build-wealth-as-an-artist\" target=\"_blank\"><span>here</span></a>. </p><p>this deliberate devotion to <em>harnessing creative energy</em> is what makes you an artist — while dedication to <em>serving a higher purpose</em> is what makes you an entrepreneur. at least, this is my very personal definition of those two words. </p><p>I’ll explore this further in three parts — that is, the purpose of business systems is to:  </p><p>(1) CREATE: channel creative energy </p><p>(2) SHARE: sharing creative energy with the world </p><p>(2) OFFER: direct energy into paid offerings &amp; containers <br /></p><p><strong>CREATION: channeling creative energy </strong></p><p>to be energetically efficient is to take creative energy and build clear channels for it to flow through. these are the systems, processes, and creative rituals that harness raw power -- not like unlike harnessing water, or wind power. the weather might change, but the systems are always there to catch it. </p><p>this work requires designing the systems that dance with <a href=\"https://keningzhu.com/journal/the-three-rhythms-of-the-creative-process\" target=\"_blank\">time and creative rhythms</a> -- to create a sense of effortlessness and momentum. it's like carving out multiple paths in a mountain for a stream to flow through, so that when it rains, the water will have places to go. learning how to ride your own creative energy and psychic metabolism is a cultivated skill; a muscle that you can improve with time and practice.  </p><p>I’ve written a gazillion posts about channeling creative energy <a href=\"https://keningzhu.com/creative-process\">here</a>. <br /><br /></p><p><strong>SHARING: giving creative energy</strong> <strong>to the world</strong> </p><p>my philosophy for sharing creative energy was born from the question, <em>“how do I do it in a way that is most energy-efficient (nourishing to my soul), effortless, and </em><span><em>generative</em></span><em> to my ecosystem?”</em>  </p><p>from this question, I came up with a few key principles, which you can read about, or listen to — here: </p><ul><li><p><a href=\"https://keningzhu.com/journal/build-a-world-not-an-audience\" target=\"_blank\">build a world, not an audience</a></p></li><li><p><a href=\"https://keningzhu.com/journal/how-i-share-my-work-as-an-introverted-artist\" target=\"_blank\">how I share my work as an introverted artist</a></p></li><li><p><a href=\"https://keningzhu.com/journal/introvert-marketing-for-creative-hermits\" target=\"_blank\">introvert marketing for creative hermits</a></p></li><li><p><a href=\"https://keningzhu.com/journal/sharing-your-work-as-creative-release\" target=\"_blank\">sharing your work as creative release</a> (podcast episode) </p></li><li><p><a href=\"https://keningzhu.com/journal/the-joy-of-missing-out-on-platforms\" target=\"_blank\">the joy of missing out on platforms</a> (podcast episode) </p><p></p></li></ul><p></p><p><strong>OFFERING: directing energy into paid containers</strong></p><p>when it comes to directing your energy into paid containers - as offerings, services, or products - consider how to make each output of creative energy more efficient. </p><p><strong>here are a few questions to consider:</strong> </p><ul><li><p><strong>efficiency:</strong> how can this energy feel more efficient and effortless <em>(ie, by riding natural cycles and momentum, or through batching projects, doing intensive sprints)</em> </p></li><li><p><strong>generative:</strong> how can my energy create more creative energy, and/or also feed other parts of my ecosystem? how can the same amount of energy can have <span>more</span> of an impact — by fertilizing other ideas, systems, or processes? how can each energy output be a growth experience for the system as a whole? </p></li><li><p><strong>projection:</strong> how can this energy be projected outwards — to have more of an impact? (the key here is to think long term; hence why I prefer building digital worlds rather than <a href=\"https://keningzhu.com/journal/the-joy-of-missing-out-on-platforms\" target=\"_blank\">giving my work to platforms</a>). </p></li><li><p><strong>self-sustaining:</strong> how can this energy continue to give, without my time-effort input? how can this energy be more <em>renewable? <br /></em></p></li></ul><p>the results of these explorations differ depending on the specifics of your business, but here’s an example of some shifts that it’s inspired in mine: </p><ul><li><p>creating more offerings that shares my creative energy without my active time/psychic input (or, \"products\" over services)</p></li><li><p>how to “sell” in a way that requires minimal to zero energy? instead of doing launches (which are very energy draining) or marketing funnels, <a href=\"https://keningzhu.com/journal\" target=\"_blank\">building labyrinths</a> of integrated offerings and creations that connect to each other</p></li><li><p>offering my creative services in time-bound intensive sprints, to save start-stop energy and lost momentum. </p></li><li><p>using each website/branding sprint as an opportunity to hone my systems, templates, and processes, and as fertilizer for other offerings. </p><p></p></li></ul><p></p><h1>the practice of cherishing energy </h1><p>this way of doing business is about <strong>honoring and making the most of my energy —</strong> </p><p>it feels 1000% human design <em>projector</em> style — working with energy that usually gets easily depleted from “labor” and overwork — by designing the right systems and containers to magnify its power and effect.  </p><p>for me, these practices are most certainly centered around: </p><ul><li><p><a href=\"https://keningzhu.com/worldbuilding\">digital world-building</a> over being on platforms </p></li><li><p><a href=\"https://keningzhu.com/journal/build-a-labyrinth-not-a-funnel\" target=\"_blank\">building labyrinths over funnels</a> </p></li></ul><p>when I focus on designing the business systems that, first and foremost, <em>cherish</em> my creative energy -- rather than attempting to offer enough “value for money” — I'm able to focus on building an ecosystem that prioritizes my energetic wellbeing, above all else. </p><p><strong>a business that nourishes <em>me</em> — is a business that will allow me to be more giving and generous.</strong> </p><p><strong>a business system that deeply honors my creative energy — is a business that will honor the energy of others </strong>— and the time, money, and energy they invest into my world. </p><p>this is a business where I don't constantly exhaust myself, and burn out from over-giving (and subsequently feel the need to disappear). the kind of business I want to build is one that allows me to <em>give</em> fully, in aligned ways, and receive fully. </p><p>it is the practice of letting my energy — <em>not my labor</em> — to do the work of sustaining, inspiring, and making magic in the world. that, to me, is alchemy. ✨</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n <hr />\n\n\n  <p><strong>see more:</strong> </p><p><a href=\"https://keningzhu.com/journal/energy-studies\" target=\"_blank\">energy studies: an ongoing practice</a><br /><a href=\"https://keningzhu.com/journal/artist-entrepreneur\" target=\"_blank\">the way of the artist entrepreneur</a><br /><a href=\"https://keningzhu.com/journal/world-building-is-wealth-building\" target=\"_blank\">why world-building is wealth building</a><br /><a href=\"https://keningzhu.com/journal/web-world-as-water\" target=\"_blank\">web world as water: digital ecosystems that give life</a></p><p></p><p><em>💌 I write a weekly newsletter on creative alchemy called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>. Find me also on my podcast: </em><a href=\"https://keningonline.squarespace.com/podcast\" target=\"_blank\"><em>botanical studies of internet magic</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"cc3eeeca17ef46f04f9244346b4d518e531544ae23b78bf9475b24b4ecde7c2c","category":"Sites"}