{"title":"OK Milt, I’ll start writing again","link":"https://sive.rs/milt","date":1386547200000,"content":"<p>\nYesterday I procrastinated, tinkered, and wasted time, doing nothing of any value.\n</p><p>\nThen this morning, I found out that one of my best friends died yesterday.\nHe was out on a bike ride on a quiet street when a car swerved into the bike lane, <a href=\"https://losangeles.cbslocal.com/2013/12/08/bicyclist-struck-and-killed-by-sheriffs-radio-car-in-calabasas/\">killing him instantly</a>.\n</p><p>\nWe shared my online music account.\nI see he had just downloaded the entire Bruce Springsteen and Neil Young catalog yesterday before he left on his ride.\n</p><p>\nI’ve been crying off and on all morning, thinking about what we do with our time — what’s worthy and what’s a waste.\n</p><p>\nTime really is limited.\nWe can’t pretend it’s not.\nTime spent doing one thing is time spent not doing something else.\n</p><p>\nIt’s so easy to waste time doing stuff that’s not important, not really fun, and not useful to anyone, not even yourself.\n</p><p>\nIt’s so hard to fight the <a href=\"https://sive.rs/book/WarOfArt\">resistance</a> to do the more difficult but more important thing.\nFinishing that book.\nWriting that song.\nLaunching that project.\n</p><p>\nI spent this morning thinking about what doesn’t matter and what does.\nFor me, writing is about the most worthy thing I can do with my time.\nI love how the distributed word is eternal — that every day I get emails from strangers thanking me for things I wrote years ago that helped them today.\nI love how those things will continue to help people long after I’m gone.\n</p><p>\nMy friend was a brilliant conversationalist, one of the brightest minds I’ve met, but he never put his thoughts into writing.\n<strong>\nIt’s extra-sad that his thoughts are gone, too.\n</strong>\n</p><p>\nSo this lesson is dedicated to you, Milt Olin.\nI’m going to start writing again.\n</p>\n<img src=\"/images/miltolin.jpg\" alt=\"Milt Olin Twitter page\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"cc641954bec4f332a528f59714159ad85fe797a4723896c6a28cb82c9690e506","category":"default"}