{"title":"Why the Job Search Sucks","link":"https://blog.webb.page/2018-01-11-why-the-job-search-sucks.txt","date":1515628800000,"content":"<p>I have been unemployed since November 1st, <em>four days</em> after my wedding. The\ncompany I was working for went out of business for various reasons I won't get\ninto but at least I got one last paycheck! This was the first time in my life\nthat I'd been let go from a job. I'd either leave on my own accord or be fired\n(this only happened twice, once in my professional career). I went into this\nnew development in my life fairly non-plussed because I've <em>always</em> been able\nto find work relatively quickly. Of course, life has a way of reminding you\nnot to get comfortable. <em>Hooray</em>.</p>\n<h2>Rounds of interviews</h2>\n<p>Lots and <em>lots</em> of rounds. I really don't understand why this is necessary.\nHere's what what makes sense to me:</p>\n<ol>\n<li>Phone screen</li>\n<li>Tech screen</li>\n<li>Meet the team</li>\n</ol>\n<p>After this, shouldn't you <em>know</em> if you want to work with someone or not?\nWhat's wrong with your process that you need <em>more</em> than three steps? Last\nmonth, I ran an interview <em>gauntlet</em> with a company I (previously) admired. I\nhad a video interview with HR and a phone interview with <em>another</em> person from\nHR days later. Then, I had to clear my entire Friday from <em>9am to 6pm</em> for\n<em>five</em> video interviews with the shortest one being 45 minutes. I thought I\naced it! I even wrote a tutorial on how to use one of their products and\nintegrated said product into some of my projects. I was told that I'd hear\nback from someone in a few days and if not, to email.</p>\n<p>Stop me if you've heard this before.</p>\n<p>I waited. Emailed. Waited. Emailed again. By this point, another week passed\nand I was <em>pissed</em>. I even checked my mail server to see if messages were l\nst in the ether. <em>Nothing</em>.</p>\n<p>Companies don't seem to realize that every interview is an investment of time\nand emotion for the applicant. I apply for positions where I feel I can make a\npositive impact and work on an awesome product or help an idea form and gain\ntraction. <em>There is no excuse for not communicating.</em> While these companies\nare internally deciding who to vet next, they can at least send a templated\nreply back. I don't care if it looks like:</p>\n<blockquote>\n<p>Dear Paul, Hahahahahahahahahahahahahahahahahahahahahahahahahahahahahahahaha\nhahahahahahahahahahahahahahahahahahahahahahahahahahahahaha NO.</p>\n</blockquote>\n<p>At least I know not to waste my time waiting on you.</p>\n<h2>Coding/design tests</h2>\n<p>See also: whiteboarding.</p>\n<p>I've <em>never</em> met someone who performs exceptionally well with thinking on the\nspot in front of people they've never met when the grand prize is gainful\nemployment. Not only are you thinking about whatever question you've been\nasked to demonstrate your thought process on, you're also thinking about what\nthey might want to see. Do you have your back turned too much? Should you\nover-explain to \"prove\" you fundamentally understand the concept(s)? What\nhappens if you don't understand the question? Do they take \"points\" off for\nthat?</p>\n<p>That shit is incredibly stressful.</p>\n<p>You know what I love about coding tests? Finding a use for one-off code\nexercises in my own work so I feel like my time wasn't completely wasted. You\nknow what else I love about them? Absolutely nothing. These <em>tests and\nwhiteboarding are not indicative of your skill level</em>, they are\n<em>approximations</em> of what you can do with what is likely to be limited\ninformation and ambiguous scope.</p>\n<p>Assuming you are gainfully employed, dear reader, think about your job today:\nyou (typically) aren't asked to create a solution for something with three\nbullet points in a README file with a section for \"extra credit ;)\".</p>\n<p>I recently did one of these tests and yes, I've identified a portion of the\ncode I wrote for integration in one of my projects. After days of waiting to\nhear yay or nay, I decided to email a few hours ago and was told other people\nhad more impressive code submissions and tech stack cohesion. Makes sense but,\nwould I have gotten that rejection email today if I hadn't checked in? Next\nweek? Next month? In my experience, I either don't get that email until at\nleast two weeks later at the earliest, if ever.</p>\n<p>Segue!</p>\n<h2>Feedback</h2>\n<p>It's very rare that you'll get helpful emails on how you can improve your\nchances in interviews from the very companies that rejected you, especially\nif you ask for it. This is at odds with the initial tone and type of\ncommunication that's exchanged when figuring out if you two are a good fit.\n\"Other candidates were a better fit, feel free to apply again in the future.\"\nUm, okay, but why would I do that when <em>I don't know why I wasn't a fit to\nbegin with</em>? I view these canned statements as passive aggressive and make a\nnote of avoiding the company and their products going forward.</p>\n<h2>How to deal</h2>\n<p>Depends on the person.</p>\n<p>For me, open world video games are a great outlet for expending frustration\nand allows me to cool down. I also enjoy writing and that's why I've written\nthis post. Having my time wasted is one of my chief pet peeves and it's an\nunavoidable part of the job search…falling in love with a product and/or\ncompany only to later be rejected, dismissed, and ignored is a <em>soul-crushing</em>\nexercise, one that we subject ourselves to because we quite literally don't\nhave a choice.</p>\n<p>It fucking sucks.</p>\n<p>I was at a seminar today about dealing with stress in the job search and I\nheard from people over the age of 40 expressing their experiences and\nfrustration with age bias. They do well with initial email contact and phone\ninterviews but when it's time for the in-person interview, they see and feel\nquite accurately that their age is what prevents them from moving forward in\nthe process. I feel bad for these people because their only enemy is time.\nRather than hire the best, some companies look to hire recent graduates so\nthey can 1) be overworked and 2) offered less pay. They don't know what they\ndon't know and certainly won't ask questions. Older people and those with\nexperience would never put up with that.</p>\n<p>In the seminar we were told:</p>\n<blockquote>\n<p><em>You are not at fault for being in the situation you are in.</em> External\nforces changed your lives in a (mostly) negative way but, it's up to you to\ndeal with it in a productive way.</p>\n</blockquote>\n<p>Have you ever tried guided meditation? It was the first time my brain was\nsilent outside of sleep…it was weird. I almost fell asleep, haha! I'm going to\ntry practicing mindfulness<a href=\"https://en.wikipedia.org/wiki/Mindfulness\">1</a> more.</p>\n<h2>Upsides?</h2>\n<p>Losing my job and not finding a new one shortly after has awarded me something\nthat's been lacking in me for quite some time, and that is <em>focus</em>. As I\nmentioned in my last post<a href=\"/2017-12-31-year-in-review.txt\">2</a>, I put a stop to all but one of my projects and\nam focusing on just one<a href=\"/2017-12-30-who-creates-social-networks.txt\">3</a>.</p>\n<p>Seeing my year-old child grow and learning new words, colors, and numbers has\nbeen a fascinating experience. He'll randomly point at something and say\nwhatever he's looking at: \"Red! Nine! A! Lellow!\" (Yellow) and so on. Pretty\nneat.</p>\n<p>Constantly retelling my employment history has encouraged me to shorten my\n\"elevator pitch\" so I can at least get that part of the conversation over and\ndone with quickly. My cover letter has seen <em>many</em> shifts and improvements. I\nstate upfront that I have zero React experience because 99.999999% of tech\ncompanies want someone with 18 years of experience with a four-year-old\nJavaScript framework. I'm being facetious here but that requirement is\n<em>ridiculous</em> for a fad. Writing CSS in JS? <em>GROSS</em>.</p>\n<p>I redesigned my resume to put my skills upfront (responsive front-end web\ndesign and development, yes I can design <em>and</em> code), followed by projects\nthat utilize those skills, and then experience. As tired as I am of the\nbullshit companies put you through in the hiring process, I'm sure companies\ndeal with all sorts of other bullshit too. I like to think my cover letter and\nresume do a very good job of informing potential employers if I'm a good tech\nfit. If not, no need to respond! Just keep it moving. Getting me invested in\nthe conversation, your company and product, and then ignoring me?</p>\n<p><em>Maaaaan</em>, go <em>fuck</em> yourself. 🕸</p>\n<p>P.S. When I eventually hire people for my own company I'm reading this post\nevery week to remind myself that applicants aren't just numbers or Post-Its on\na board, they are people with feelings and expectations that they will be\nreplied to in a timely manner because they have life and responsibilities to\ndeal with.</p>\n<p>P.P.S. This post has garnered more interest than I thought it would on\nHackerNews<a href=\"https://news.ycombinator.com/item?id=16127697\">4</a>. You can read varying viewpoints ranging from those who've been\nin this situation and are employers doing MUCH better than the ones I've\noutlined in this post, to people who are just plain dismissive of myself and\nothers like me. It's a pretty good read regardless, I love discourse.</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"cd0f3304fe43900cbae4c612c638074bd63d282c34a5c9e8601b864c4eef8d72","category":"Sites"}