{"title":"Why Weather Forecasts Have Gotten So Good","link":"https://kottke.org/24/03/why-weather-forecasts-have-gotten-so-good","date":1710885808000,"content":"\n        <p>You may not have noticed, but weather forecasts — temperature, precipitation, hurricane tracks — have improved greatly over the past few decades. </p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/accuracy-weather-forecasts.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/accuracy-weather-forecasts.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/accuracy-weather-forecasts.jpg 1200w\" loading=\"lazy\" width=\"1300\" height=\"1068\" alt=\"a graph that shows that weather forecasts have become much more accurate since 1981\" /></p>\n\n<p>Dr. Hannah Ritchie of Our World in Data <a href=\"https://ourworldindata.org/weather-forecasts\">explains why</a>.</p>\n\n<blockquote><p>The first big change is that the data has improved. More extensive and higher-resolution observations can be used as inputs into the weather models. This is because we have more and better satellite data, and because land-based stations are covering many more areas around the globe, and at a higher density. The precision of these instruments has improved, too.</p>\n\n<p>These observations are then fed into numerical prediction models to forecast the weather. That brings us to the next two developments. The computers on which these models are run have gotten much faster. Faster speeds are crucial: the Met Office now chunks the world into grids of smaller and smaller squares. While they once modeled the world in 90-kilometer-wide squares, they are now down to a grid of 1.5-kilometer squares. That means many more calculations need to be run to get this high-resolution map. The methods to turn the observations into model outputs have also improved. We’ve gone from very simple visions of the world to methods that can capture the complexity of these systems in detail.</p>\n\n<p>The final crucial factor is how these forecasts are communicated. Not long ago, you could only get daily updates in the daily newspaper. With the rise of radio and TV, you could get a few notices per day. Now, we can get minute-by-minute updates online or on our smartphones.</p></blockquote>\n\n<p>If you’re in the US, you can see how accurate the weather forecast is in your area by using <a href=\"https://www.forecastadvisor.com/\">ForecastAdvisor</a>.</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Hannah%20Ritchie\">Hannah Ritchie</a> · <a href=\"https://kottke.org/tag/meteorology\">meteorology</a> · <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/weather\">weather</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/why-weather-forecasts-have-gotten-so-good\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"cd678f8595784d2d2c90784a6096913a89c5c1c0588b28e5c2a62a351b8b529a","category":"default"}