{"title":"On the Reverse","link":"https://kottke.org/24/03/on-the-reverse","date":1709580207000,"content":"\n        <p><img src=\"/plus/misc/images/prado-on-the-reverse-01.jpg\" width=\"1200\" height=\"1567\" alt=\"some stickers and tape on the back of an old painting\" /></p>\n\n<p><img src=\"/plus/misc/images/prado-on-the-reverse-02.jpg\" width=\"1200\" height=\"1404\" alt=\"some faint overlapping drawings on the back of an old painting\" /></p>\n\n<p><img src=\"/plus/misc/images/prado-on-the-reverse-03.jpg\" width=\"1200\" height=\"567\" alt=\"a view of a show at the Prado museum called 'On the Reverse'\" /></p>\n\n<p>Madrid’s Museo Nacional del Prado recently put on an exhibition called <a href=\"https://www.museodelprado.es/en/whats-on/exhibition/on-the-reverse/97f46507-60c9-197b-8632-274da919ea3f\">On the Reverse</a> that featured the backs of notable works of art.</p>\n\n<blockquote><p>This exhibition goes beyond the simple action of turning paintings around. Rather, the Museo del Prado is undertaking a complete reassessment of the backs of works in its collections while also identifying relevant examples in other major museums which reveal how appreciation of works of art is enhanced when we do more than just look at the front. The exhibition addresses issues that have never previously been brought together and in which there is also space for imaginative interpretations: the emergence of the reverse as a pictorial motif in two sub-genres: the self-portrait of the artist behind the canvas and the depiction of the picture back in trompe l’oeil; the poetic reading of the stretcher as a cross; two-sided paintings; the back as a field for experimentation and subjective expression; aesthetic appreciation of the material nature of the works, and the issue of the viewer seen from behind, which makes us aware of the particular spatial relationships that are generated by human interaction with art.</p></blockquote>\n\n<p>I once went with an artist friend to an art museum where they hung some of the paintings so you could see both sides of them at once, and she was often more interested in seeing the backs, where you could maybe see who owned the painting previously, etc.</p>\n\n<p>Sadly, the show ended on March 3, but <a href=\"https://hyperallergic.com/869083/prado-show-reveals-the-hidden-artworks-on-the-backs-of-masterpieces/\">Hyperallergic has a good writeup</a>.</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/art\">art</a> · <a href=\"https://kottke.org/tag/Museo%20Nacional%20del%20Prado\">Museo Nacional del Prado</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/on-the-reverse\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"cf7dd71fbed71ed65aff4f047a9853181c1bb33b30495bc3ca4273c68618faee","category":"default"}