{"title":"Flying With My Dad","link":"https://kottke.org/24/06/flying-with-my-dad-1","date":1719353350000,"content":"\n        <p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/me-dad-flying.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/me-dad-flying.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/me-dad-flying.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"435\" alt=\"Me Dad Flying\" /></p>\n\n<p>Growing up, I had a pretty conventional childhood. In the northern Wisconsin of the 70s and 80s, that meant living in the country, dogs and cats, making ramps for our bikes in the driveway, Oscar Meyer bologna sandwiches for lunch, and a nuclear family of four that split into two soon after Ronald Reagan took office. But conventional childhoods are a myth. Every kid has some weird thing that distinguished their experience from everyone else’s. My weird thing is that I spent a lot of time in and around airplanes when I was young.</p>\n\n<p>My dad joined the Navy after high school but couldn’t fly because of his eyesight. But sometime later, he got his private pilot’s license. In the 1970s, after bouncing around between two dozen different jobs and business ideas, he took a small rented airplane and turned it into a thriving freight and commuter airline called Blue Line Air Express.<sup><a href=\"#fn:1434145103\">1</a></sup> At its height, his company had 8 planes, a small fleet of cars and trucks,<sup><a href=\"#fn:1434143482\">2</a></sup> more than a dozen employees, and hangars at several different airports around northern WI. He and his employees delivered packages and people<sup><a href=\"#fn:1434143537\">3</a></sup> all over the tri-state area, from Chicago and Milwaukee to Minneapolis and Duluth.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/blue-line-air-express-logo.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/blue-line-air-express-logo.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/blue-line-air-express-logo.jpg 1200w\" loading=\"lazy\" width=\"627\" height=\"193\" alt=\"Blue Line Air Express Logo\" /></p>\n\n<p>And every once in awhile, I got to tag along. I remember one time in particular, we got up early on a Saturday, drove to a nearby town, hopped in the plane, and made it to Minneapolis, usually a two-hour drive, in time for breakfast. I’d go with him on deliveries sometimes; we’d drive a small piece-of-shit truck<sup><a href=\"#fn:1434143579\">4</a></sup> up to this huge FedEx hub in Minneapolis, load it full of boxes, and drive an hour to some small factory in a Wisconsin town and unload it. Once he had to deliver something to a cheese factory and my sister and I got a short tour out of it.</p>\n\n<p>For family vacations, we would jump in the plane to visit relatives in the Twin Cities or in St. Louis. We flew down with some family friends to Oshkosh to attend the huge airshow. When I was in college, my dad would sometimes pick me up for school breaks in his plane. It was just a normal thing for our family, like anyone else would take a car trip. The only time it seems weird to me is when people’s eyes go wide after I casually mention that we had a runway out behind the house growing up.<sup><a href=\"#fn:1434143678\">5</a></sup></p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/backyard-runway.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/backyard-runway.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/backyard-runway.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"310\" alt=\"Backyard Runway\" /></p>\n\n<p>One of the last times I went flying with my dad, before it finally became too expensive for him to keep up his plane,<sup><a href=\"#fn:1434143719\">6</a></sup> we were flying into a small airport where he still kept a hangar. It was a fine day when we set out but as we neared our destination, the weather turned dark.<sup><a href=\"#fn:1434143782\">7</a></sup> You could see the storm coming from miles away and we raced it to the airport. The wind had really picked up as we made our first approach to land; I don’t know what the windspeed was, but it was buffeting us around pretty good. About 50 feet off the ground, the wind slammed the plane downwards, dropping a dozen feet in half a second. In a calm voice, my dad said, “we’d better go around and try this again”.<sup><a href=\"#fn:1434143808\">8</a></sup></p>\n\n<p>The storm was nearly on top of us as we looped around to try a second time. It was around this time he announced, even more calmly, that we were “running a little low” on fuel. Nothing serious, you understand. Just “a little low”. There was a heavy crosswind, blowing perpendicular to the runway. Landing in a crosswind requires the pilot to point the airplane into the wind a little.<sup><a href=\"#fn:1434143917\">9</a></sup> Or more than a little…my memory probably exaggerates after all these years, but I swear we were at least 30 degrees off axis on that second approach. Just before touching down, he oriented the plane with the runway and the squawk of the tires let us know we were down. I don’t think it was much more than a minute or two after landing that the rain, thunder, and lightning started.<sup><a href=\"#fn:1434144093\">10</a></sup></p>\n\n<p>But the thing was, I was never scared. I should have been probably…it was an alarming situation. I’d been flying with my dad my whole life and he’d kept me safe that whole time, so why should I start worrying now? That’s what fathers are supposed to do, right? Protect their children from harm while revealing the limits of the world?</p>\n\n<ol><li><p>The internet is amazing. I originally wrote this piece for <a href=\"https://quarterly.co/\">Quarterly</a> as part of a physical package of stuff that was sent out to subscribers. While doing some research for it, I found <a href=\"http://www.timetableimages.com/i-19/4u82ca.jpg\">an image of an old Blue Line brochure</a>, which I distinctly remember from when I was a kid. From there, I was able to figure out <a href=\"https://www.myfonts.com/fonts/adobe/revue/\">the font</a> and recreate the logo. Two of the items in my Quarterly package featured the logo: a balsa-wood airplane and a leather luggage tag. Blue Line flies again! It was very satisfying to use my professional skills (internet sleuthing and design) to “resurrect” my dad’s old business.<a href=\"#fnref:1434145103\">↩</a></p><p></p></li>\n\n<p><li><p>There was a car or two stashed at every airport Blue Line regularly flew in to. To simplify the logistics, the key to the ignition was usually left under the rear wheel well of the car. Which was occasionally a problem w/r/t disgruntled former employees.<a href=\"#fnref:1434143482\">↩</a></p><p></p></li></p>\n\n<p><li><p>Living and dead…transporting cadavers was a particularly lucrative business.<a href=\"#fnref:1434143537\">↩</a></p><p></p>\n\n<p><li><p>My dad’s fleet of cars and trucks were optimized for cost and performance…if you could load 1200 pounds of boxes into something without busting the springs and get it there at 80 MPH on the freeway, it didn’t matter if the fenders were rusted off.<a href=\"#fnref:1434143579\">↩</a></p><p></p></li></p>\n\n<p><li><p>Oh, did I not mention that earlier? We lived on a farm and rented out all the land to nearby farmers…all except the runway that my dad had cut into the field behind the house so that he could commute by plane to whatever airport he needed to be at that day. As you do.<a href=\"#fnref:1434143678\">↩</a></p><p></p></li></p>\n\n<p><li><p>Blue Line went out of business soon after my parents divorced, but my dad kept a plane and a hangar. Sometimes he transported freight for money but mostly just flew as a hobby and transportation. Private piloting was cheaper back then, especially when your plane was long since paid for, the price of gas was obscenely low by today’s standards, gear/radios were cheaper, and you were also a mechanic (as my dad was).<a href=\"#fnref:1434143719\">↩</a></p><p></p></li></p>\n\n<p><li><p>The Midwest is like this in the summer. Radar shows nothing, then, boom, thunderstorm.<a href=\"#fnref:1434143782\">↩</a></p><p></p></li></p>\n\n<p><li><p>That droningly relaxed pilot voice you hear while thumbing through the latest issue of the inflight magazine? My dad never talked like that outside of an airplane but every single thing he said inside one sounded unbelievably steady and serene.<a href=\"#fnref:1434143808\">↩</a></p><p></p></li></p>\n\n<p><li><p>It is <em>seriously</em> weird that the runway you’re landing on is not directly in front of you. <a href=\"https://youtube.com/watch?v=TJurZfXcW5I\">This video gives you a taste of what it’s like</a>. Start at the 3:10 mark…that’s some crazy sideways flying.<a href=\"#fnref:1434143917\">↩</a></p><p></p></li></p>\n\n<p><li><p>And this is far from the craziest thing that ever happened to my dad while flying. Once we had to go pick him up in a nearby corn field after an emergency landing.</p><p>But my favorite story he tells is when he landed on a runway in winter in a twin-engine plane and discovered shortly afterwards that the entire surface was black ice. So the brakes didn’t work. And it was too late to throttle up again and take off. And there’s a lake at the end of the runway. Thinking quickly, he throttles up one of the engines, spins the plane around 180 ° on the ice, and then throttles up both engines to stop the plane. That sounds like total action movie BS, but my dad insists it really happened. Regardless, I love to hear him tell that story.<a href=\"#fnref:1434144093\">↩</a></p><p></p></li></p></li></p></ol><p></p>\n\n         <p><em>[This is a vintage post originally from Jun 2015.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/flying\">flying</a> · <a href=\"https://kottke.org/tag/Jason%20Kottke\">Jason Kottke</a> · <a href=\"https://kottke.org/tag/Jerry%20Kottke\">Jerry Kottke</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"cf88b2cbca2f87fd9b2b8e035d3b9ce75e78708c00254ea9abe868d9f5127643","category":"default"}