{"title":"Fragile Plan vs Robust Plan","link":"https://sive.rs/robust","date":1371254400000,"content":"<p>\nWhen I <a href=\"https://sive.rs/eg\">first had the idea for Wood Egg</a> — publishing 16 books about 16 countries every year — I thought I would write them all <strong>myself</strong>.\nVisit 16 countries for 3 weeks each, doing intensive research the whole time.\nThat’s 48 weeks, so I could do it again each year.\n</p><p>\n… But I had a baby on the way, so that idea lasted about a minute.\n</p><p>\nThen I thought of <strong>a journalist</strong> I know who would love that kind of life.\nI asked, she said yes, she flew to Singapore, and started working.\n</p><p>\n… But it was a really bad fit, so after five weeks, we called it quits.\n</p><p>\nThen I decided to hire <strong>one writer per-country</strong>.\n16 authors to write 16 books.\nThis went OK at first.\n<a href=\"http://mohitpawar.com/about/\">Mohit Pawar</a> did a great job with India, and <a href=\"http://www.cameronkeng.com/about/\">Cameron Keng</a> did a great job with Taiwan.\n</p><p>\n… But the people I hired for the other countries flaked out, so I realized this plan was still too fragile.\n</p>\n<h4>\nMaking a Robust Plan\n</h4>\n<p>\nI really wanted this to work.\nI had to be smart.\nI had to make a better plan.\n</p><p>\nI re-read my notes on <a href=\"https://sive.rs/book/EMythRevisited\">E-Myth</a>, <a href=\"https://sive.rs/book/WisdomOfCrowds\">The Wisdom of Crowds</a>, <a href=\"https://sive.rs/book/Crowdsourcing\">Crowdsourcing</a>, and <a href=\"https://sive.rs/book/HereComesEverybody\">Here Comes Everybody</a>.\n(In fact, I re-read <a href=\"https://sive.rs/book\">my notes on 130 books</a>. It was an enlightening week.)\n</p><p>\nI learned a few things:\n</p><ol>\n<li><strong>\nIf you want help, it helps to get specific.\n</strong></li>\n<li><strong>\nA plan that’s too dependent on any one person is too fragile.\n</strong></li>\n</ol>\n<h4>\nGetting Specific:\n</h4>\n<p>\nBefore, I had a very vague outline of what I wanted the book to cover.\nI asked the authors to include sections on culture, government, business setup, hiring, banking, and marketing.\nThat was it.\nThe details were up to them.\nGo!\n</p><p>\nIn hindsight, I can see how daunting it was.\nToo wide open.\nI’ve written about the need to get specific before — (see “<a href=\"https://sive.rs/get-specific\">Get specific</a>” and “<a href=\"https://sive.rs/restrictions-will-set-you-free\">Restrictions will set you free</a>”) — but I had forgotten to apply it to this.\n</p><p>\nSo I spent a couple weeks and <strong>came up with <a href=\"http://woodegg.com/in#toc\">200 specific questions</a></strong>.\nNow, to write the book, we just had to answer those 200 questions.\n</p><p>\nIt’s infinitely easier to find someone to answer a specific question than to find someone to impart wisdom on a vague topic.\nIt <strong>puts the burden on the asker</strong>, to come up with a good question, and <strong>lifts the burden from the answerer.</strong>\n</p>\n<h4>\nMultiple People:\n</h4>\n<p>\nSo that the book was not dependent on any one person, and the book was not one person’s opinion, I made a system where each of those 200 questions had to be <strong>answered by three different people</strong>.\nIdeally, one local, one foreigner, and one other.\n</p><p>\n16 countries × 3 researchers = 48 people.\nI used <a href=\"https://www.upwork.com/\">Upwork.com</a> to find people in each country.\n</p><p>\nOf course, some disappeared, some never finished, and a few gave bad answers, but that was OK.\nLife happens.\nPeople’s circumstances change.\nI understand.\nBut it won’t hurt my plan.\nIf any one person is gone, I can still carry on.\n</p><p>\nWhen all 200 questions had 3 answers each, (16 × 200 × 3 = 9600 answers), I hired a few writer/editors to combine the answers into one essay per question.\nAgain, one person disappeared, but it was easy for another to step in.\n</p><p>\nAnd that was the robust plan that got it <a href=\"http://woodegg.com/\">done</a>.\n</p><p>\n<em>\n(Note: I was also visiting every country myself, and contributing my own research to the books. But it was important that the plan didn’t require me, either.)\n</em>\n</p>\n<h4>\nLessons learned?\n</h4>\n<p>\nIf you’re starting a project or company:\n</p>\n<ol>\n<li>\nDon’t expect anyone to care as much as you.\n</li>\n<li>\nDon’t require them to think as hard about this as you have.\n</li>\n<li>\nDo expect them to change their mind and disappear.\n</li>\n<li>\nMake a robust plan that includes #1-3.\n</li>\n</ol>\n<p>\n<strong>\nAs the founder, the burden is on you to come up with a great plan, to lift the burden from the people helping you.\n</strong>\n</p><p>\nThen, when you find some <a href=\"https://sive.rs/book/Linchpin\">brilliant people</a>, it’s a great bonus, instead of an absolute necessity.\n</p>\n<img src=\"/images/table-many-legs.jpg\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"cfa5511b8794cecfb4e382ebecfd8406549c66816accb48c833cc42f12f5eb9b","category":"default"}