{"title":"How to make the best possible translation of a book?","link":"https://sive.rs/bpt","date":1723593600000,"content":"<p>\nYou know that frustration of reading a book that should have been an article?\nMe too.\nSo I try to do the opposite — to write so succinctly that you wish I would have said a little more.\nYou complete it with your own thoughts.\n</p><p>\nThat’s why I edit the hell out of my writing.\nI delete every unnecessary sentence and word, then craft the few that remain.\nIt takes more time for me, but saves time for everyone else.\nHopefully this approach, where you fill my gaps with your own examples, is more powerful and effective.\nMaybe, as a side-effect, even more beautiful.\n</p><p>\n<strong>\nBut then how should I approach its translation?\n</strong>\nI’m willing to spend time and money to help make the best possible translations into Chinese, Spanish, Portuguese, and French.\nMaybe other languages, too, based on the potential audience.\nMy books have been the primary creations of my life, and will be what’s left of me after I’m dead, so I’d like to help make great translations of them while I’m here.\n</p><p>\nThey’re not poetry, but I put the same care into rhythm, structure, and even sound of the words.\nI can’t just crap out a computer-generated translation, or under-pay an over-worked translator.\nI could hire one expensive translator, and that person could do one interpretation, but then what if it’s too uniquely biased?\n</p><p>\nYou’ve heard of <a href=\"https://sive.rs/book/WisdomOfCrowds\">The Wisdom of Crowds</a>?\nThe collected ideas of many people can be better than any one person’s ideas.\nIt doesn’t apply to everything, but might apply to translations.\n</p><p>\n<strong>\nI built a tool for translators, reviewers, and editors, called <a href=\"https://inchword.com/\">Inchword</a>.\n</strong>\nIt lets anyone suggest translation improvements, even if they have just a few minutes or hours to improve a few words or chapters.\nEditors review and approve those suggestions.\nReviewers read the finished chapters.\nAll of these people can ask me questions for clarification.\nAnd at some point, multiple people agree that it’s as good as can be, and I mark the translation as finished.\nIt’s the “official author-approved translation.”\n(What to do with it after that is a different issue.)\n</p><p>\n<strong>\nI’m not sure this is the best plan, so I’m open to suggestions.\nPlease leave a reply, below, with any ideas.\n</strong>\nOr if you can help as a translator, reviewer, or editor, please <a href=\"https://sive.rs/contact\">email me</a>.\n</p><hr /><p><em>\nP.S. For the past few years I’ve licensed to <a href=\"https://sive.rs/fp\">foreign publishers who do their own translations</a>, and nothing wrong with that, but I’d rather collaborate more closely with the translators to make sure each translation is the best it can be.\n</em></p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"d11088dc66286d8bcfc35611d6693a595cdc21f466eb347b327606ec5fffd6b5","category":"Sites"}