{"title":"New year, who dis?","link":"https://blog.webb.page/2021-01-03-new-year-who-dis.txt","date":1609632000000,"content":"<p>I'm not going to mention last year in number, I don't even want to hear people\nwith perfect vision talk about their eyes. We're in a new year, Drumpf is going\nto be out of office in less than three weeks, and I have a new design for my\nblog…more like, LACK of design.</p>\n<h2>Why</h2>\n<p>I published a grand total of two posts last year. TWO. I was busy working on\npersonal projects, dealing with this general malaise of uncertainty, and didn't\nfeel like dealing with the annoying process of updating my blog. Yuk. As a\nresult though, I have several half-finished posts I can/will upload this year\nsince my blog setup is extremely pared down.</p>\n<p>Being an architech (a designer who codes and vice-versa) is hella annoying. I\nam displeased by my design AND my code after a period of time, and then I\ndetest it far too much. Maybe my experience and age has brought me to the point\nof realizing I don't need the latest fancy UI b̶l̶e̶m̶i̶s̶h̶e̶s̶ features and tooling to\nget something online. I <em>may</em> update this to support TypeScript and <code>import</code>s\nbecause I quite enjoy that.</p>\n<p>This blog is also missing analytics. They were never on the front-end, but in\nthe server. One of my many tasks this year is to overhaul my analytics\nplatform<a href=\"https://chew.sh\">1</a> to make it robust enough to charge money for.</p>\n<h2>What (now)</h2>\n<p>I think adding automated deployments would be a nice quality-of-life feature\nand would definitely encourage me to write more. Currently, I have to upload a\nnew text file to my server and refresh the pm2 job. In any event, this blog is\nthe first step in realizing my personalOS<a href=\"/2019-12-02-a-personal-api.txt\">2</a> concept in concrete forms and I\nsuppose this is the year to document everything as I go through it.</p>\n<p>You can check out the previous<a href=\"https://github.com/NetOperatorWibby/blog/tree/2020\">3</a> incarnation of this blog if you're curious to\nsee what it was like.</p>\n<p>I think 2021 is gonna be big for data portability and flat files are the\neasiest way to do it. The fact that this blog is just a single JavaScript file\nand a folder full of text files (okay AND a couple Node.js modules 😒) is kind\nof neat…actually, that wouldn't be a bad idea for socii<a href=\"https://socii.network\">4</a> to implement.\nMaybe I'll relaunch that soon. We'll see. 🕸</p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"d12ca10ce6c25ff15758f4159cd227e74e99b5ae54a251026e4b4947e8124d7d","category":"Sites"}