{"title":"Here’s how to live: Let randomness rule.","link":"https://sive.rs/htl09","date":1639008000000,"content":"<p>\nWe think we see patterns and causes.\n<br />\nReally there are none.\n<br />\nWe think events are meaningful.\n<br />\nReally they’re just coincidence.\n<br />\nWe’re not used to the logic of probability.\n<br />\nLife is more random than it seems.\n</p><p>\nIdentical twins were separated at birth and raised on opposite sides of the world.\n<br />\nThey met later in life, and found that they had freakishly identical preferences and circumstances.\n<br />\nWhat you think is free will might actually be your DNA.\n<br />\nWhere you go, what you do, and what you want are accurately predicted by algorithms.\n<br />\nYou are less random than you seem.\n</p><p>\nSo randomize your life.\n<br />\nUse a random generator — an app, a roll of the dice, or a shuffled deck of cards — to make all of your life’s decisions.\n<br />\nChoose a life where you choose nothing.\n<br />\nLet the random generator decide what you do, where you go, and who you meet.\n</p><p>\nIt’ll scramble your habits.\n<br />\nIt’ll break the myth of causality.\n<br />\nIt’ll guide you to see places you’d never ordinarily see, and do what you never would have done.\n</p><p>\nRandomness keeps your mind open and observant.\n<br />\nYou can’t predict, so you see clearly.\n<br />\nYou can’t use old solutions and rules-of-thumb.\n<br />\nYou can’t blame karma, astrology, demons, saints, anyone or anything else.\n<br />\nYou can’t think there’s a master plan.\n</p><p>\nInstead, you’ll calculate probability.\n<br />\nYou’ll be hyper-aware that statistics apply to all of us, and we’re more average than we think.\n<br />\nLife is determined not by causes, but by randomness and odds.\n<br />\nBy taking a minute to do the math, you’ll have a clearer understanding of why things are the way they are.\n</p><p>\nLet your random generator choose what you wear and how you cut your hair.\n<br />\nLet it send you to events you ordinarily wouldn’t have attended, including classes to learn skills you ordinarily wouldn’t have learned.\n<br />\nYou’ll become a member of groups you never would have chosen.\n<br />\nEventually, you’ll look, act, and socialize very differently than your previous self.\n<br />\nYou won’t define yourself by these things anymore, since you didn’t choose them.\n</p><p>\nWhen talking with people, ask deep open-ended questions — like “What’s your biggest regret?” — that will lead to unexpected stories.\n<br />\nWhen ordering in a restaurant, ask them to surprise you.\n<br />\nWhen doing creative work, let the random generator make your artistic decisions, shaking up your usual style.\n</p><p>\nLet your random generator decide where you live every year.\n<br />\nThat increases the randomness of everything else.\n</p><p>\nAsk anyone “Why?” on any subject, and they’ll make up explanations.\n<br />\nThey think everything has a reason, and won’t believe it’s random.\n<br />\nYou’ll know everything is random, and won’t believe it has a reason.\n</p><p>\nRandomness helps you learn acceptance.\n<br />\nYou can’t take the blame for failures.\n<br />\nYou can’t take credit for successes.\n<br />\nYou can’t regret what you didn’t cause.\n</p><p>\nHow liberating to not decide and not predict anything.\n<br />\nStoics and Buddhists work hard to feel indifferent to outcomes.\n<br />\nBut you’ll feel detachment as a natural side effect of every day being random.\n<br />\nSince nothing has consequences, you’ll greet everything with healthy indifference.\n<br />\nNeither upset nor joy — just seeing it as it is.\n<br />\nThanks to randomness, you’ll know that none of it has meaning.\n</p><p>\nYou’ll be living a lesson that everyone should learn.\n<br />\nRandom stuff happens.\n<br />\nAll you can control is your response.\n<br />\nEvery day, you’ll practice how to react to chaos: with dignity, poise, and grace.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"d23a28d407a1ddbd4cb5336816bb7eda8f57dff3b5bfef0d25d53a2fc9989d80","category":"default"}