{"title":"Don’t add your two cents","link":"https://sive.rs/2c","date":1469404800000,"content":"<p>\n“My two cents” is American slang for adding a small opinion or suggestion.\n</p><p>\nAn employee says to the boss, “I’ve been working for the past two weeks on this new design. What do you think?”\n</p><p>\nThe boss says, “Good job. Maybe just change the blue to gold, change the word ‘giant’ to ‘huge’, and get rid of the border. Other than that, it’s great!”\n</p><p>\nNow, because the boss said so, the employee will have to make those changes.\n</p><p>\nBut there’s a big downside:\nThe employee no longer feels full ownership of their project.\n(Then you wonder why they’re not motivated!)\n</p><p>\nImagine this instead:\n</p><p>\nThe employee says, “I’ve been working for the past two weeks on this new design. What do you think?”\n</p><p>\nThe boss says, “It’s perfect. Great work!”\n</p><p>\nThis slight change made a huge difference in the psychology of motivation.\nNow that person can feel full ownership of this project, which is more likely to lead to more involvement and commitment for future projects.\n</p><p>\nThe boss’s opinion is not necessarily better than anyone else’s.\nBut <strong>once you become the boss, your opinion is dangerous</strong> because it’s not just one person’s opinion anymore — it’s a command!\nSo adding your two cents can really hurt morale.\n</p><p>\nA business should not focus on the boss, so this restraint is healthy.\nYou shouldn’t give your opinion on everything just because you can.\n</p><p>\nObviously, if there’s more than “two cents” worth of stuff that needs to change, then this rule does not apply.\nBut if your contribution is small and just an opinion, let it go.\nLet the other person feel full ownership of the idea, instead. \n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"d25bf4fbe74825b55b05bce2c1f37c17bc4a87ea11ded7dc8d8a892aefe3ccdc","category":"default"}