{"title":"We&#8217;ve Only Been Roasting Veggies Since the 80s","link":"https://kottke.org/24/03/veggie-roasting","date":1711385460000,"content":"\n        <p><a href=\"https://slate.com/human-interest/2014/12/roasting-vegetables-history-when-did-this-technique-overtake-boiling.html\">According to this 2014 article in Slate</a>, roasting vegetables is a cooking technique popularized only in the 80s/90s.</p>\n\n<blockquote><p>The concept of roasting as a general vegetable technique seems to have originated in a famous Italian restaurant: Johanne Killeen and George Germon’s Al Forno, which opened in Providence, Rhode Island, in 1980. Forno means oven in Italian, and the critically acclaimed chefs made ample use of that apparatus.</p></blockquote>\n\n<p>This is a fact, which makes me feel old because I lived through it and makes me feel young because <strong>I</strong> lived through it. Old because I can remember a time before roasting vegetables was how anyone who is anyone prepared them, and young because what other cooking techniques are we going to invent during my lifetime? It’s a little like watching cities develop. For example, I used to work down in Fort Point in Boston and there were a ton of parking lots and then the guy who owned the parking lots sold them, bought the Los Angeles Baseball Dodgers and those parking lots have become a huge and glitzy neighborhood (?) with condos and offices and commerce</p>\n\n<p>As another aside, there’s a <a href=\"https://www.nytimes.com/1993/01/27/garden/what-s-a-roast-for-many-chefs-it-s-fish-or-garlic-or-bananas-or.html\">1993 NYT article</a> quoted in the Slate piece and I’m quoting the first three sentences here for reasons I will expound upon afterward. </p>\n\n<blockquote><p>Roasting wafts through the senses. In culinary terms it is freighted with mouthwatering aroma, comforting warmth, a crisping sizzle and anticipated succulence. And lately it is more appreciated than ever.</p></blockquote>\n\n<p>Anyway, the use of “freighted” just reminded me of the Emily Dickinson quotation, “The freight should be proportioned to the groove” from the poem <a href=\"https://www.americanpoems.com/poets/emilydickinson/that-love-is-all-there-is/\">That Love is all there is</a>. It’s a delightful poem and you can read it in about 3 seconds and think about it for the rest of your life.</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/cooking\">cooking</a> · <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/vegetables\">vegetables</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/veggie-roasting\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"d31f1b2146093138d29098d254c2d12829fa85fb6bfca09acdea1687f9a902c9","category":"default"}