{"title":"The Heroes Among Us: John Berger on the Courage to Create","link":"https://www.themarginalian.org/2024/11/19/john-berger-miners-heroes/","date":1732045392000,"content":"<h3>“The powerful fear art, whatever its form… because it makes sense of what life’s brutalities cannot, a sense that unites us… becomes a meeting-place of the invisible, the irreducible, the enduring.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Keeping-Rendezvous-John-Berger/dp/0679406328/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"481\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/berger_rendezvous.jpg?fit=320%2C481&amp;ssl=1\" alt=\"The Heroes Among Us: John Berger on the Courage to Create\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/berger_rendezvous.jpg?w=665&amp;ssl=1 665w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/berger_rendezvous.jpg?resize=320%2C481&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/berger_rendezvous.jpg?resize=600%2C902&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/berger_rendezvous.jpg?resize=240%2C361&amp;ssl=1 240w\" /></a></p><p>“What makes Heroic?” asked Nietzsche as he was <a href=\"https://www.themarginalian.org/2018/02/12/nietzsche-hope/\">emerging from depression</a>, then answered: “To face simultaneously one’s greatest suffering and one’s highest hope.” That is the heroism of the inner world, yes, but what makes a person heroic in the world we share is to face the greatest suffering — their own and the world’s — then make of it a found of hope and fulcrum of strength for others. Heroes are transmutation agents — people who alchemize suffering and restlessness and rage into love, who compost disappointment into fertilizer for growth, who break down cynicism to its building blocks of helplessness and hubris, then metabolize the toxin out of the system we call society. </p>\n<p>There are myriad kinds of heroes capable of myriad heroisms — the <a href=\"https://www.themarginalian.org/2017/01/27/rachel-carson-silent-spring-dorothy-freeman/\">epochal heroisms of speaking truth to power</a> that mobilize the consciousness of a civilization and the small daily heroisms of the <a href=\"https://departmentofinvisiblelabor.com\" target=\"_blank\">invisible labor</a> that makes the world cohere, the heroism of planting a tree and the heroism of abolishing a plantation, the heroism of keeping faith in a friend through a hard time and the heroism of leaving a false love.</p>\n<p>It helps to remember this diversity of heroisms, because it saves us from imprisoning our heroes in the expectation that everyone contribute to the shared cause — the great project of human flourishing — in the same way. The protest marcher and the poet are very different kinds of heroes, and it is an act of oppression against the gift of each to measure them on the register of the other. Only when we cease doing that can we begin to recognize the heroes who across the history of every civilization have <a href=\"https://www.themarginalian.org/2024/11/06/transition/\">kept the lighthouse blazing through the dark times</a> — the heroes we call artists.</p>\n<figure><a href=\"https://society6.com/product/the-star-lighter-by-rockwell-kent-1919_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?resize=680%2C597&amp;ssl=1\" width=\"680\" height=\"597\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?resize=320%2C281&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?resize=600%2C527&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?resize=240%2C211&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_star-lighter.jpg?resize=768%2C674&amp;ssl=1 768w\" /></a><figcaption><em>The Star-Lighter</em> by <a href=\"https://www.themarginalian.org/2022/02/15/rockwell-kent-wilderness/\">Rockwell Kent</a>, 1919. (Available as <a href=\"https://society6.com/product/the-star-lighter-by-rockwell-kent-1919_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/cards?sort=new?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>These are the heroes <a href=\"https://www.themarginalian.org/tag/john-berger/\">John Berger</a> (November 5, 1926–January 2, 2017) celebrates in one of the essays in his 1991 collection <a href=\"https://www.amazon.com/Keeping-Rendezvous-John-Berger/dp/0679406328/?tag=braipick-20\" target=\"_blank\"><strong><em>Keeping a Rendezvous</em></strong></a> (<a href=\"https://search.worldcat.org/title/25747448\" target=\"_blank\"><em>public library</em></a>) — the heroes we need in times “when the just cause is defeated… when our past is dishonoured and its promises and sacrifices shrugged off with ignorant and evil smiles, when whole families come to suspect that those who wield power are deaf to reason and every plea, and that there is no appeal anywhere, when gradually you realize… that They are out to break you, out to break your inheritance, your skills, your communities, your poetry, your clubs, your home and, wherever possible, your bones too.” Of such times, Berger writes:</p>\n<blockquote><p>The avenging heroes are now being dreamt up and awaited. They are already feared by the pitiless and blessed by me and maybe by you.</p>\n<p>I would shield any such hero to my fullest capacity. Yet if, during the time I was sheltering him, he told me he liked drawing, or… she told me she’d always wanted to paint, and had never had the chance or the time to do so, if this happened, then I think I’d say: Look, if you want to, it’s possible you may achieve what you are setting out to do in another way, a way less likely to fall out on your comrades and less open to confusion.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/12/beforeigrewup6-scaled.jpg\" /></a><figcaption>Art by Giuliano Cucco from <a href=\"https://www.themarginalian.org/2021/12/16/before-i-grew-up-miller-cucco/\"><em>Before I Grew Up</em></a> — a lyrical picture-book about the artist within</figcaption></figure>\n<p>Echoing Iris Murdoch’s abiding observation that <a href=\"https://www.themarginalian.org/2019/02/12/iris-murdoch-salvation-by-words/\">“tyrants always fear art because tyrants want to mystify while art tends to clarify”</a> and Auden’s insistence that <a href=\"https://www.themarginalian.org/2018/01/11/auden-art-politics/\">“the mere making of a work of art is itself a political act,”</a> Berger adds:</p>\n<blockquote><p>I can’t tell you what art does and how it does it, but I know that often art has judged the judges, pleaded revenge to the innocent and shown to the future what the past suffered, so that it has never been forgotten. I know too that the powerful fear art, whatever its form, when it does this, and that amongst the people such art sometimes runs like a rumour and a legend because it makes sense of what life’s brutalities cannot, a sense that unites us, for it is inseparable from a justice at last. Art, when it functions like this, becomes a meeting-place of the invisible, the irreducible, the enduring, guts, and honour.</p></blockquote>\n<p>Complement with Leonard Cohen on <a href=\"https://www.themarginalian.org/2023/02/23/leonard-cohen-beautiful-losers-saint/\">what makes a modern saint</a>, James Baldwin on <a href=\"https://www.themarginalian.org/2014/08/20/james-baldwin-the-creative-process/\">the artist’s role in society</a>, Toni Morrison on <a href=\"https://www.themarginalian.org/2016/11/15/toni-morrison-art-despair/\">the artist’s task in troubled times</a>, and Ernst Becker on <a href=\"https://www.themarginalian.org/2023/04/25/ernest-becker-heroism/\">heroism and our search for meaning</a>, then revisit Berger on <a href=\"https://www.themarginalian.org/2023/06/27/john-berger-some-notes-on-song/\">the power of music</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"d37b15f2cd5de265049abedbcd2f220320c055b3c74be16168a040527c26f2de","category":"Sites"}