{"title":"When nothing is important everything is","link":"https://www.garbageday.email/p/nothing-important-everything","date":1706557131000,"content":"<div><div><h2>The Infopocalypse Goes South</h2><p>Last week, Texas Governor Greg Abbott <a href=\"https://twitter.com/GregAbbott_TX/status/1750235544951349275?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">released a statement</a> which, idk about you, definitely inspired me to start googling things like, “how do states secede,” and “how do civil wars start +reddit”.</p><p>Abbott declared that he was invoking Texas’ “constitutional right to defend and protect itself” from a border crisis that I just, very simply, don’t think exists, but, oh well. Those kinds of details don’t matter in 2024.</p><p>Following Abbott’s statement, social networks — well, mainly <a href=\"http://X.com?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">X.com</a> — quickly began to fill up with content meant to make you think that militias and national guardsmen were converging on the Texas border to support Abbott, like this post from an X user named @DonaldTNews.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/8359b305-6348-4c03-8726-4db54f84c593/Screenshot_2024-01-29_at_11.42.09_AM.png?t=1706539365\" /><div><span><p>(X.com/donaldTNews)</p></span></div></div><p>It has 15 thousand retweets and over three million “views,” and, oh, whoops, it’s actually not from Texas or even from this year. It’s actually a bunch of far-right extremists<a href=\"https://twitter.com/FordFischer/status/1751006271560393134?s=19&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\"> marching in Portland</a> back in 2019. </p><p>There is a standoff of sorts, however, beginning at the border, but it’s between the Texas National Guard and border patrol agents, as CBS <a href=\"https://twitter.com/camiloreports/status/1751963297526559166?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">reported</a> this morning. There is also the beginning of a convoy forming, as <i>VICE</i> <a href=\"https://www.vice.com/en/article/5d9adk/trucker-convoy-eagle-pass-texas-border-dispute-christian-nationalism?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">reported</a>. It’s called the “Take Our Border Back” Convoy and it’s being organized on Telegram, where mods are <a href=\"https://twitter.com/alibreland/status/1751285532368224567?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">repeatedly reminding</a> its trigger-happy participants that it is NOT a militia. </p><p>There’s also a standoff happening in D.C., as well. With President Biden, in a statement, <a href=\"https://edition.cnn.com/2024/01/27/politics/biden-border-shut-down-us-mexico-immigration/index.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">signaling support</a> for a bipartisan deal that would give him, “as President, a new emergency authority to shut down the border when it becomes overwhelmed.” Which, if passed, would be what <i>Axios</i><a href=\"https://twitter.com/axios/status/1751925123337084976?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\"> is calling</a> “one of the harshest immigration bills of the century.” It would also be an incredible victory for Republicans, except Donald Trump <a href=\"https://edition.cnn.com/2024/01/25/politics/gop-senators-angry-trump-immigration-deal/index.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">is trying to kill the deal</a> so he can campaign on it. Which is pretty funny, I guess.</p><p>The most concise summary I’ve seen of the last few days was from X user @souljagoytellem, <a href=\"https://twitter.com/souljagoytellem/status/1751017580888752446?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">who wrote</a>, “Actually insane that for two years conservative media has straight-facedly lied about a massive ‘invasion’ of illegal immigrants and they’ve now been fully rewarded by having that lie become the mainstream narrative.”</p><p>Though, the right-wing panic about the border has been going on a lot longer than two years. Fox News <a href=\"https://www.foxnews.com/world/criminals-target-women-children-as-migrant-caravan-makes-its-way-to-mexico?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">started</a> their “migrant caravan” narrative in 2018. They even have a <a href=\"https://www.foxnews.com/category/world/migrant-caravan?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">topic page</a> for it, which is now, of course, so long you can’t even navigate it properly anymore. But what has changed in the last two years is that it’s become virtually impossible to ignore the right-wing fixation on a border crisis as some fringe conservative subplot.</p><p>Back in 2018, even with Trump in the White House, we still had a hybrid media environment where still-somewhat-healthy digital publishers, still-somewhat-searchable social networks, and fairly-large national news organizations all competed inside the attention economy. What <i>Semafor</i>’s Max Tani recently <a href=\"https://www.semafor.com/article/01/21/2024/inside-the-collapsing-us-political-media-industrial-complex?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">dubbed</a> the “U.S. political-media-industrial-complex”. And before the pandemic or Insurrection or the <a href=\"https://www.thecut.com/2022/02/a-vibe-shift-is-coming.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">vibe shift</a> — or whatever line in the sand from the last three years you want to point to — if something inside of one of those pipelines diverged too much from the others, you could tell simply by consulting the others. Now that this information apparatus, as Tani concludes, is collapsing, you can’t figure out what’s important because, in a sense, nothing is. So in the case of Texas this week, without proper signals from a “U.S. political-media-industrial-complex,” our politicians — especially Democrats, it seems — are more than happy to rush through legislation to chase something that <i>feels</i> important simply because there’s discourse about it. Just like we saw with Washington’s TikTok panic last year.</p><p>And I can prove to you how silly this all is because there are parts of the attention economy that have not completely rotted on the vine, yet. And when conservatives try to game those by flooding the zone with shit and manipulate meaningless leaderboards they end up looking as ridiculous as Abbott should have looked when he announced his self-defense plan. </p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/92e83ce2-ab9b-41a7-950d-de1f0c8d712a/Screenshot_2024-01-29_at_11.03.35_AM.png?t=1706537032\" /><div><span><p>(YouTube/Tom MacDonald)</p></span></div></div><p>Over the weekend, Tom MacDonald, a Canadian right-wing rapper, released a song titled, “Facts,” which features a verse from conservative commentator Ben Shapiro, which does not appear to have been generated by an AI. (I think an AI would have delivered the lines a bit better.) I am not linking to the song, not because I don’t want to give MacDonald views, or whatever, but because the song is absolutely heinous and I respect my readers too much to inflict that upon them.</p><p>About a day after the song went live, MacDonald and Shapiro began boasting about how it was number two on iTunes. Which makes sense. Republicans love iTunes because you can pump dark money into digital downloads and it doesn’t count as spam. </p><p>But even with all those mysterious downloads coming through over the weekend, anyone with a brain can look at this song and know that’s not the second-biggest song in the world. I don’t think radio stations are scrambling to get this one on the air. It doesn’t even have a million streams on Spotify. </p><p>And so, I don’t think it’s too much to ask that we apply the same kind of scrutiny to, uh, immigration bills that we do with rap songs.</p><hr /><p><i>The following is part of a promo swap I’m doing with </i>Semafor<i> this week. They were kind enough to give Garbage Day a shout out in their newsletter last week.</i></p><p><b>Friends of Garbage Day: </b>Meet <span><a href=\"https://www.semafor.com/newsletters/tech?utm_source=swaps&amp;utm_medium=email&amp;utm_campaign=garbageday1\" target=\"_blank\">Semafor Tech</a></span><span> </span> — It’s written by one of Silicon Valley’s most prolific reporters, Reed Albergotti. Twice a week, Reed delivers original reporting and exclusive scoops on the emerging themes happening in and around tech. Recent coverage includes an exclusive interview with the CEO of Colossal Biosciences, the startup trying to resurrect the woolly mammoth. </p><p><span><a href=\"https://www.semafor.com/newsletters/tech?utm_source=swaps&amp;utm_medium=email&amp;utm_campaign=garbageday1\" target=\"_blank\">Subscribe for free here</a></span><span>.</span></p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get access to paid issues and the Garbage Day Discord. Which is great. Hit the green button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\"><span> Upgrade </span></a></div><p><span>Also, for the next six months, I’m going to fix my ad prices to flat rate: </span><span><b>One ad in Garbage Day is $300 and if you buy more than one upfront it’s $250 each. </b></span><span>I still have some availability this month and next. Reply to this email or shoot me a message at </span><span><span><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></span></span><span> if you’re interested!</span></p><hr /></div><h2>Is It Finally Time To Admit All Media Is Not Digital Media?</h2><p><i>The Hollywood Reporter</i> last week <a href=\"https://www.hollywoodreporter.com/movies/movie-news/jordan-peele-joins-dev-patel-monkey-man-1235807960/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is#recipient_hashed=4099e28fd37d67ae86c8ecfc73a6b7b652abdcdb75a184f8cf1f8015afde10e9&amp;recipient_salt=f7bfecc7d62e4c672635670829cb8f9e0e2053aced394fb57d9da6937cf0601a\" target=\"_blank\">reported</a> that Dev Patel’s new film <i>Monkey Man</i> was originally going to be distributed by Netflix until Jordan Peele saw it and decided it “deserved” a theatrical release. This news quickly transformed into a narrative online that Peele had “saved” Patel’s movie from being plopped into a streaming library where it would disappear into obscurity.</p><p>As one X user <a href=\"https://twitter.com/EmperorOTN1/status/1750918266640269720?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">wrote</a> (in all caps), “IT'S ALMOST LIKE THE THEATRICAL RELEASE MODEL WORKS AND GIVES ADDED VALUE TO SHIT BEFORE IT ENDS UP JUST ANOTHER GODDAMN THING ON STREAMING.”</p><p>It’s an attitude that has continued to bubble up into the mainstream following the Hollywood-wide COVID-era jump into streaming. We’ve obviously had people for years banging on about the importance of physical media for collectors or the fidelity of, say, vinyl or film photography for people who want to truly experience a piece of <i>Content</i>. But the fact we’re moving back to a world where a theatrical release for a film is considered a signifier of quality over streaming is interesting because we aren’t applying that logic (yet) to other media.</p><p>One interesting detail about <i>The Drunken Canal</i>, the buzzy Gen Z publication that popped up during lockdown that would go on to define the deeply obnoxious New York Dimes Square downtown scene, was that it was print-only. And in many of the <a href=\"https://www.thecut.com/2020/12/drunken-canal-dimes-square-newspaper.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">early interviews</a> with its staff, they talked about how it built that buzz by being a product readers had to take a picture of to share on Instagram. It’s a trick that not even <i>The Drunken Cana</i>l’s founders seemed to <a href=\"https://www.nytimes.com/2023/06/08/style/the-drunken-canal-byline-media.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">have internalized</a> when launching their next project. </p><p>But it’s something I’ve definitely been thinking about. Because like most folks working in the wasteland of journalism right now, I’ve been watching with abject horror as layoffs and acquisitions destroy media outlets new and old, regional and national. And I’ve been desperately searching for a solution. And now I’m beginning to wonder if maybe there are just certain forms of journalism and media, in general, that, like Patel’s <i>Monkey Man</i>, deserve a physical release when we’ve been stuffing them in the back of a CMS thinking they should compete with MrBeast videos and Reddit posts.</p><hr /><h2>X Can’t Moderate Itself Fast Enough To Keep Up With Taylor Swift’s Lawyers</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/3c267eaf-f4a4-4588-88bb-0b83fdd1f801/Screenshot_2024-01-29_at_2.39.45_PM.png?t=1706549998\" /><div><span><p>(X.com)</p></span></div></div><p>Last week, an X user named @zvbear distributed non-consensual sexual material of Taylor Swift that was generated by an AI. Her team is reportedly looking into legal action and the White House is looking into legislation. It was an extremely quick response from the powers that be which is great, as long as you ignore that countless women who <a href=\"https://twitter.com/pureevilbich/status/1751662096381587457?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">have been terrorized</a> by this technology since the minute it was released to the public.</p><p>X, the everything app that has everything except moderators, responded to the unwanted attention they’re receiving as being the main distributor of what may soon, hopefully, be illegal sexual material of someone who is, arguably, the most famous person in the world, by removing the ability to search for Swift on the site. Masterful gambit, Mr. Musk.</p><p>I wrote this in the paid edition over the weekend, but I don’t think AI should even factor in here. There <a href=\"https://ballotpedia.org/Nonconsensual_pornography_(revenge_porn)_laws_in_the_United_States?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">are laws</a> against the non-consensual distribution of sexual material in 48 states at the moment. There’s also a federal legal framework for filing a lawsuit against someone who non-consensually distributes sexual material. These should all apply to AI-generated works, but at the moment <a href=\"https://www.technologyreview.com/2021/02/12/1018222/deepfake-revenge-porn-coming-ban/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">only two states</a> explicitly carve out protections against deepfaked or synthetic content. But clearly it’s time to update how we think about this stuff.</p><hr /><h2>The Stanley Lead Panic Has Begun</h2><p>Yes, what you may have heard recently is true. Stanley cups <a href=\"https://edition.cnn.com/2024/01/26/health/stanley-cups-lead-wellness/index.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">have a lead base</a>. Though, it seems like the consensus is that if the base isn’t damaged, you probably won’t get lead poisoning. I am sure that the vast and energetic community of bloggers and content creators that propelled Stanley into a once-in-a-generation phenomenon will be very normal about all of this.</p><blockquote><p></p><p>The Leadening has begun and the Stanley girlies are not okay.</p><p></p><a href=\"https://twitter.com/leamaric/status/1751790285561204753?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\"><p> — ɐ͎ʞ͎ć͎ı͎ɹ͎ɐ͎ɯ͎ (@LeaMaric) <br /> Jan 29, 2024 </p></a></blockquote><p>Jokes aside, I think it’s actually very reasonable to not want lead in your reusable water bottle. Dang, maybe one of those outlets that wrote fawning profiles about how the company’s head of marketing, Terence Reilly, conjures virality into sales, should spin back around and ask him what he thinks about all of this. Perhaps, Stanley is feeling a bit uncomfy <a href=\"https://blog.hubspot.com/marketing/stanley-cup-car-fire?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">about capitalizing on</a> that video of one of their cups still being usable after sitting inside of a burning car.</p><hr /><h2>Obviously, The George Carlin AI Thing Wasn’t Really AI</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/d09d6044-323b-4125-94a2-767c2e29ed38/Screenshot_2024-01-29_at_3.17.11_PM.png?t=1706552244\" /><div><span><p>(Can you imagine anything more pathetic than using an AI to fake-generate George Carlin jokes for your YouTube podcast lmao)</p></span></div></div><p>The Dudesy podcast, hosted by f<span>ormer </span><i>Mad TV</i><span> comedian Will Sasso uses a very dumb conceit that the whole show is run by an AI. And earlier this month, the AI that “runs” the show “produced” an hour-long comedy special from late comedian George Carlin.</span></p><p>As I wrote at the time, nothing that Sasso or his co-host claim is automated by an AI is actually possible. Especially for two comedians with a YouTube podcast. A human would have needed to ask an AI to generate an audio clone of Carlin’s voice. A human would have needed to ask an app like Midjourney to produce all the imagery in the special. And a human definitely would have had to write the jokes and align the images to be timed properly in the video.</p><p>And Sasso admitted that’s the case last week after a lawyer for Carlin’s estate filed a suit against the Dudesy podcast. <i>Ars Technica</i> <a href=\"https://arstechnica.com/ai/2024/01/george-carlins-heirs-sue-comedy-podcast-over-ai-generated-impression/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">has a good piece</a> on this. The special was actually written by Sasso’s co-host, Chad Kultgen. The lawsuit will continue even though they admitted an AI wasn’t involved.</p><hr /><h2>I Put All My MrBeast/Musk Reporting In A Video</h2><p>Also, I thought this might be out of date by today, but MrBeast just shared another full-length video to X and I’m pretty sure everything in the video above will be still apply to this new upload.</p><p>And in case you’re curious, other creators have still <a href=\"https://twitter.com/TierZoo/status/1752010609464394168?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">been unable</a> to get the same kind of revenue on X that MrBeast did.</p><hr /><h2>New Favorite Subreddit</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/7c8ef6de-9935-4be7-b4af-5fe6054f2595/Screenshot_2024-01-29_at_3.51.22_PM.png?t=1706554295\" /><div><span><p>(<a href=\"https://www.reddit.com/r/ididnthaveeggs/top/?t=all&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">r/ididnthaveeggs</a>)</p></span></div></div><p>I, somehow, did not know about the subreddit r/ididnthaveeggs until I came across a <a href=\"https://www.tumblr.com/mith652/740799389251043328?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">big roundup</a> on Tumblr about it this weekend. But it’s great. It’s dedicated to screenshots of people don’t follow recipes and end up complaining when it goes wrong. It’s very good.</p><hr /><h2>My Daily Mantra</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@sadbeige?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\"> @sadbeige </a><p>The days are just packed!! #satire #fun #fyp #hobbies </p></section></blockquote><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.rollingstone.com/culture/culture-features/ai-companies-advocates-cult-1234954528/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">“The Cult of AI”</a></p></li><li><p><a href=\"https://news.yahoo.com/disrespectful-and-demeaning-influencers-say-they-were-offered-payment-to-create-sexually-suggestive-videos-to-promote-a-book-221536302.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">“Influencers say they were offered payment to create sexually suggestive videos to promote a book”</a></p></li><li><p><a href=\"https://www.outfrontmagazine.com/dane-boe-annoying-orange-creator-comes-out-as-transgender/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">“Dane Boe, Annoying Orange Creator, Comes Out As Transgender”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://www.tiktok.com/@dangerbean55/video/7301924617143274758?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=when-nothing-is-important-everything-is\" target=\"_blank\">good tikTok video</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=9fbe0027-a7bc-40f2-ac1f-e23cd5cb67c5&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"d3e86f7f0c36379a6a06594f65b687aaf09acad06d1ba8fb058005cdfb2138e2","category":"default"}