{"title":"The Bird in the Heart: Terry Tempest Williams on the Paradox of Transformation and How to Live with Uncertainty","link":"https://www.themarginalian.org/2024/01/26/when-women-were-birds/","date":1706288356000,"content":"<h3>“We can change, evolve, and transform our own conditioning. We can choose to move like water rather than be molded like clay.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/When-Women-Were-Birds-Fifty-four/dp/1250024110/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"496\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?fit=320%2C496&amp;ssl=1\" alt=\"The Bird in the Heart: Terry Tempest Williams on the Paradox of Transformation and How to Live with Uncertainty\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?w=967&amp;ssl=1 967w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?resize=320%2C496&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?resize=600%2C931&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?resize=240%2C372&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/whenwomenwerebirds_williams.jpg?resize=768%2C1191&amp;ssl=1 768w\" /></a></p><p>It is strange how, in a universe governed by relentless change, human beings hunger for constancy — our bodies wired for homeostasis, our minds hooked on habit, our hearts yearning for everlasting love. We live as patterns unaware of perpetuating themselves, our aching resistance to change reflected in the routines and rituals and relationship formulae out of which we build the superstructure of belief that houses all of our actions, reactions, and choices. </p>\n<p>It is not easy, reconfiguring this superstructure to fit something new — a new practice, a new person, a new way of being. The more transformative the new element, the more challenging it is to figure it into the pattern of life as we know it — a pattern shaped by what we believe about love, that deepest sinew of the self. </p>\n<p>This delicate, difficult, wildly rewarding reconfiguration is what <a href=\"https://www.themarginalian.org/2018/04/12/the-hour-of-land-terry-tempest-williams/\">Terry Tempest Williams</a> explores in <a href=\"https://www.amazon.com/When-Women-Were-Birds-Fifty-four/dp/1250024110/?tag=braipick-20\" target=\"_blank\"><strong><em>When Women Were Birds: Fifty-four Variations on Voice</em></strong></a> (<a href=\"https://search.worldcat.org/title/759175000\" target=\"_blank\"><em>public library</em></a>) — a soaring meditation on life, love, and the stories we tell ourselves about who we are, sparked by an unexpected revelation: When Williams opened the journals her mother had bequeathed her, she was staggered to find them all blank — a kind of “second death” that catalyzed a profound reckoning with the meaning of voice, of words, of how we write the story of who we are and how we revise it, lensed through the love of birds she shared with her mother. </p>\n<figure><a href=\"https://www.themarginalian.org/2020/12/05/if-you-come-to-earth-sophie-blackall/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/12/IYCTE.Birds_.2000.jpg\" /></a><figcaption>Art by Sophie Blackall from <a href=\"https://www.themarginalian.org/2020/12/05/if-you-come-to-earth-sophie-blackall/\"><em>If You Come to Earth</em></a></figcaption></figure>\n<p>Two decades later, at the exact age her mother was when she died, Williams writes:</p>\n<blockquote><p>Love is to life what life is to death. And so we risk everything trying to touch the ineffable by touching each other. Over and over. Again and again… Patterned behavior alternates like shadow and light… We can change, evolve, and transform our own conditioning. We can choose to move like water rather than be molded like clay. Life spirals in and then spirals out on any given day. It does not have to be one way, one truth, one voice. Nor does love have to be all or nothing.</p></blockquote>\n<p>Because we suffer a congenital blindness to what lies on the other side of transformation — a blindness brilliantly illustrated by the <a href=\"https://www.themarginalian.org/2017/09/13/transformative-experience-vampire-problem/\">Vampire Problem thought experiment</a> — it is often chance, not choice, that brings about the profoundest change. Life sweeps us off course — a terrible diagnosis arrives, an unimagined opportunity emerges, an unexpected person enters the heart — and suddenly we must begin again, rebuilding the superstructure of being on this new terrain. (<a href=\"https://www.themarginalian.org/2024/01/21/william-stafford-yes/\">“It could happen any time…”</a>)</p>\n<p>Williams finds improbable consolation for the challenge of change in her encounter with a bird out of place. The painted bunting — the most exuberantly colored bird north of Mexico, which so confused Linnaeus with its exotic plumage that he falsely classified it as native to India; a species now thought to <a href=\"https://www.themarginalian.org/2021/09/24/wayfinding-m-r-oconnor/\">orient by the pole star</a> during migration — “had flown in on the tail of a blizzard, been blown off course, and stayed,” making a new life in Maine, a new pattern of being: Each day just before dawn, the painted bunting alighted to a neighbor’s bird feeder like clockwork. </p>\n<figure><a href=\"https://society6.com/product/painted-bunting-by-mark-catesby-1729-1731-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=680%2C897&amp;ssl=1\" width=\"680\" height=\"897\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=320%2C422&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=600%2C792&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=240%2C317&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=768%2C1013&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/01/PaintedBunting_MarkCatesby_small.jpg?resize=1164%2C1536&amp;ssl=1 1164w\" /></a><figcaption>Painted bunting by Mark Catesby, 1729-1731. (Available as <a href=\"https://society6.com/product/painted-bunting-by-mark-catesby-1729-1731-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">an art print</a> and as <a href=\"https://society6.com/product/painted-bunting-by-mark-catesby-1729-1731-benefitting-the-nature-conservancy_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>Watching the bird one snowy morning, Williams writes:</p>\n<blockquote><p>At 6:43 a.m. the painted bunting arrived, like a dream between the crease of shadow and light. His silhouette grew toward color for the seven short minutes he stayed. And when dawn struck his tiny feathered back, he ignited like a flame: red, blue, and green.</p>\n<p>[…]</p>\n<p>The bunting got caught in a storm and stayed. I have been seized in a storm of my own making. Whirlwind. World-wind. Distracted and displaced. In the wounding of becoming lost, I can correct myself.</p></blockquote>\n<p>Echoing Emerson’s indictment that <a href=\"https://www.themarginalian.org/2015/01/26/emerson-circles/\">“people wish to be settled [but] only as far as they are unsettled is there any hope for them,”</a> Williams adds:</p>\n<blockquote><p>We can take flight from our lives in a form other than denial and return to our authentic selves… Accidental sightings, whether witnessed in a brain or on a winter dawn, remind us there is no such thing as certainty.</p></blockquote>\n<p>A century after Virginia Woolf contemplated <a href=\"https://www.themarginalian.org/2020/04/03/virginia-woolf-to-the-lighthouse/\">finding beauty in the uncertainty of being</a> in the interlude between two world wars, Williams adds:</p>\n<blockquote><p>I want to feel both the beauty and the pain of the age we are living in. I want to survive my life without becoming numb. I want to speak and comprehend words of wounding without having these words become the landscape where I dwell. I want to possess a light touch that can elevate darkness to the realm of stars. </p>\n<p>This vascular malformation could bleed and burst. Or I can simply go on living, appreciating my condition as a vulnerable human being in a vulnerable world, guided by the songs of birds. What is time, sacred time, but the acceleration of consciousness? There are so many ways to change the sentences we have been given.</p></blockquote>\n<p>Complement these fragments of the entirely wonderful <a href=\"https://www.amazon.com/When-Women-Were-Birds-Fifty-four/dp/1250024110/?tag=braipick-20\" target=\"_blank\"><strong><em>When Women Were Birds</em></strong></a> with Milan Kundera on <a href=\"https://www.themarginalian.org/2015/10/16/milan-kundera-unbearable-lightness-of-being/\">life’s central ambivalence of knowing what we really want</a>, Rebecca Solnit on <a href=\"https://www.themarginalian.org/2014/08/04/field-guide-to-getting-lost-rebecca-solnit/\">how we find ourselves by getting lost</a>, and George Saunders on <a href=\"https://www.themarginalian.org/2023/04/09/george-saunders-uncertainty/\">the courage of uncertainty</a>, then revisit Williams on <a href=\"https://www.themarginalian.org/2018/04/12/the-hour-of-land-terry-tempest-williams/\">our responsibility to awe</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"d4804bf4f2afe1e36d33d0e86a81a4160c4dd6d5ce5a32b4bd1dd6079cbac4e5","category":"default"}