{"title":"&#8220;What Relationships Would You Want if You Believed They Were Possible?&#8221;","link":"https://kottke.org/24/02/what-relationships-would-you-want-if-you-believed-they-were-possible","date":1707321183000,"content":"\n        <p>I listened to <a href=\"https://www.nytimes.com/2024/02/06/opinion/ezra-klein-podcast-rhaina-cohen.html?unlocked_article_code=1.Tk0.MelG.8d_hhNfPd58N\">the latest episode of the Ezra Klein Show</a> while driving last night then spent the second half of the drive thinking about it. So I guess I’d better tell you to go and listen to it. Klein interviews Rhaina Cohen, who is the author of the forthcoming book <a href=\"https://www.amazon.com/exec/obidos/ASIN/1250280915/ref=nosim/0sil8\">The Other Significant Others: Reimagining Life with Friendship at the Center</a> (out Feb 13). They talked about loneliness, the changing definition of friendship (and family) throughout history, polyamory, co-parenting, and lots more.</p>\n\n<blockquote><p>How do we imagine many other possibilities for parenting, for aging, for intimacy, for friendship, for romance than what we have right now? Because the idea that what we have right now is a working norm and everything else should be understood as some deviation is wrong. It is factually untrue.</p>\n\n<p>It is not a norm. It is a wild experiment in the history of human existence. We have never done this before for any period of time. It’s not how we raised children. It is not how we have met each other. It is not how we have lived together.</p>\n\n<p>And it’s not working for a lot of people. So this is an experiment, and we should be trying more. And what Cohen’s book is about is these experiments, is looking at things people are already doing, and, in a sense, making clear that there are more relationships happening right now in the world around you, more forms of relationship, than you could possibly imagine.</p></blockquote>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/Ezra%20Klein\">Ezra Klein</a> · <a href=\"https://kottke.org/tag/interviews\">interviews</a> · <a href=\"https://kottke.org/tag/podcasts\">podcasts</a> · <a href=\"https://kottke.org/tag/Rhaina%20Cohen\">Rhaina Cohen</a> · <a href=\"https://kottke.org/tag/The%20Other%20Significant%20Others\">The Other Significant Others</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/02/what-relationships-would-you-want-if-you-believed-they-were-possible\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"d4a4bfaf9b4fa46803c9a6c0bdea5ff7fdb8854a38821bd6e55f01c48936179f","category":"default"}