{"title":"How to sync Mac and Linux /home","link":"https://sive.rs/macx","date":1725062400000,"content":"<h3>\nthe problem:\n</h3>\n<p>\nMy main computer is a Linux/BSD desktop, but I also use a Mac laptop for recording and travel.\nThis created a problem keeping them in sync.\n</p><p>\nI don’t like that the MacOS user’s home has directories like Movies and Pictures that we can’t delete, or that ~/Library is filled with Mac-only crap I don’t want on my other computer.\nAlso, why did Apple make it /Users/me and not <strong>/home/</strong>me?\n</p>\n\n<h3>\nthe solution: synthetic.conf\n</h3>\n<p>\nWe can use the fact that Mac has no <strong>/home/</strong> to our advantage.\nIn your terminal, type <a href=\"https://keith.github.io/xcode-man-pages/synthetic.conf.5.html\">man synthetic.conf</a> to read about it.\n</p><p>\n<strong>Assuming username “me” here</strong>, (meaning: <strong>replace “me”, below, with your actual username</strong>) I type, in the terminal:\n</p>\n<pre><code>\nsudo vi /etc/synthetic.conf\n</code></pre>\n<p>\nThen I add this one line, which has to be separated with a [tab]:\n</p>\n<pre><code>\nhome        Users/me\n</code></pre>\n<p>\nSave, verify, then reboot.\n</p>\n\n<h3>\n/home/me = /Users/me/me\n</h3>\n<p>\nMake a new directory ~/me which will now be /home/me\n</p>\n<pre><code>\nmkdir ~/me\ntouch /home/me/hello\nls ~/me\nls /home/me/\n</code></pre>\n<p>\nVerify it’s working, that whatever you put into /Users/me/me/ is also now in /home/me/ and vice-versa.\nThen…\n</p>\n\n<h3>\nrsync\n</h3>\n<p>\nOf course you have to be able to SSH into your other computer, so if not, go figure that out first.\nI’ll assume that “desktop” reaches your Linux/BSD/other computer, probably via a nice entry in ~/.ssh/config\n</p><p>\nThen use free and lovely <a href=\"https://rsync.samba.org/\">rsync</a> to synchronize:\n</p>\n<pre><code>\nrsync -av --delete desktop:/home/me /home/\n</code></pre>\n<p>\nWhen it’s done, verify that everything from /home/me on your Linux/BSD computer is in /home/me on your Mac.\nThen move a file from your Mac Desktop or Documents into /home/me/ and copy it back:\n</p>\n<pre><code>\nrsync -av --delete /home/me desktop:/home/\n</code></pre>\n<p>\nWhen it’s done, verify that whatever you just added from your Mac is now on your Linux/BSD computer.\nI like to go back and forth a couple times to be absolutely sure it’s working correctly, to make sure I can rely on it.\n</p><p>\nI use these two commands so much that I made them one-line shell scripts in /home/me/bin/ so I can just type “gethome” when I first open the Mac, or “puthome” when I’m done on the Mac.\n</p><p>\nNote this also works very well for a <strong>remote copy of your home directory</strong> on an encrypted remote server as described in <a href=\"https://sive.rs/ti\">my “Tech Independence” page</a>.\nIn that case, the shell script has three steps:\n</p>\n<ol><li>\nSSH into the remote server, so you can type the password to mount the encrypted partition.\n</li><li>\nrsync -av --delete between them\n</li><li>\nSSH into the remote server to unmount the encrypted partition.\n</li></ol>\n\n<h3>\nWhatever’s not in /home/me is Mac-only\n</h3>\n<p>\nThis /home/me where you’ll keep everything of value — everything you share between computers.\nWhatever’s in your /Users/me directory but <strong>not</strong> in your /Users/me/me is <strong>Mac-only</strong>, and won’t be copied to your other computer.\nSo whatever you have in the MacOS defaults of Desktop, Documents, Downloads, Library, Movies, Music, Pictures, and Public is only on the Mac.\nIf you want to sync anything in there to your other computer, move it to /home/me/\n</p><p>\nI actually like this if I’m travelling with the Mac laptop and want to download some music or movies into ~/Music or ~/Movies but wouldn’t want to sync that 20GB of media to my other computer.\n</p><p>\nBut most of all, I love having /home/me be the same on all computers, so I can be writing or coding on the Mac laptop on a train, then get home and type “puthome”, and get back to work on my desktop.\n</p><p>\nAnother nice side-effect of keeping them in sync is if I accidently delete a file on one computer, I can pick up the other one to restore it.\nOr if the entire computer is stolen or destroyed, I can just curse a bit, then get back to work on the other.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"d5458206a669a2056fc82e46f7520cfaf3a92c1ce7bcdbb281d6cd54f563daba","category":"Sites"}