{"title":"Mediaeater Digest Vol 30, No. 173","link":"https://ghuneim.com/2024/06/21/mediaeater-digest-vol-30-no-173/","date":1718976719000,"content":"<p> </p>\n<p><a href=\"https://www.nytimes.com/2024/06/22/technology/netflix-amazon-disney-sony-streaming.html\">The Future of Streaming (According to Roberts, Malone and Diller) </a> (nyt)  Netflix is highly profitable, with operating margins of 28 percent. In the first quarter of 2024, Netflix reported revenue of $9.4 billion, and $2.3 billion in net income. No one else comes close.</p>\n<p>OpenAI’s Mira Murati:<a href=\"https://www.threads.net/@nixcraft/post/C8dk-76Sq-H\"><em> “some creative jobs maybe will go away, but maybe they shouldn’t have been there in the first place” </em></a></p>\n<p>AI Do<a href=\"https://www.wsj.com/tech/ai/ai-replace-freelance-jobs-51807bc7\">esn’t Kill Jobs? Tell That to Freelancers</a> (wsj) Since the rollout of ChatGPT in November 2022, high-value tasks like IT &amp; Networking have seen pay increases of up to 8%, while low-value tasks such as Admin Support and Writing have experienced significant pay decreases of up to 17% and 18%  <em>“<a href=\"https://archive.is/20240622035620/https://www.wsj.com/tech/ai/ai-replace-freelance-jobs-51807bc7#selection-6339.0-6339.136\">When I see something that looks like it was written by AI, I just switch off,” she adds. “The internet has just gotten so much duller.”</a></em></p>\n<p><a href=\"https://ludic.mataroa.blog/blog/i-will-fucking-piledrive-you-if-you-mention-ai-agai\">I Will Fucking Piledrive You If You Mention AI Again</a> (mataroa) <em>“Look at us, resplendent in our pauper’s robes, stitched from corpulent greed and breathless credulity, spending half of the planet’s engineering efforts to add chatbot support to every application under the sun when half of the industry hasn’t worked out how to test database backups regularly.”</em></p>\n<p><a href=\"https://on.ft.com/3XxGWxm\"><span>Hackers ‘jailbreak’ powerful AI models in global effort to highlight flaws</span></a> <span>(ft) Machine learning security start-ups raised $213mn across 23 deals in 2023, up from $70mn the previous year</span></p>\n<p><a href=\"https://www.washingtonpost.com/business/2024/06/21/artificial-intelligence-nuclear-fusion-climate/\"><span>AI is exhausting the power grid. Tech firms are seeking a miracle solution.</span></a><span> (wapo) A ChatGPT-powered search on Google, according to the International Energy Agency, consumes almost 10 times the amount of electricity as a traditional search</span></p>\n<p><a href=\"https://calculatingempires.net/\"><span>Calculating Empires: A Genealogy of Technology and Power since 1500</span></a><span> (calculating empires) large-scale interactive visualization exploring how technical and social structures co-evolved over five centuries.</span></p>\n<p><a href=\"https://www.anthropic.com/news/claude-3-family\"><span>Introducing the next generation of Claude </span></a><span>  (anthropic) “<em>outperforms its peers on most of the common evaluation benchmarks for AI systems, including undergraduate level expert knowledge”.   </em></span></p>\n<p><a href=\"https://www.sequoiacap.com/article/ais-600b-question/\"><span>AI’s $600B Question</span></a><span> (sequoiacap) The AI bubble is reaching a tipping point. Navigating what comes next will be essential.</span></p>\n<p><a href=\"http://schelling.ai\"><span>schelling.ai</span></a>. <span>open-source, decentralized AI   </span></p>\n<p><a href=\"https://www.reuters.com/technology/cybersecurity/cdks-cyber-outage-hits-us-auto-dealers-second-day-row-2024-06-20/\">CDK cyber outage hits US auto dealers for second day in a row</a>  (reuters) 15,000 car dealers are now owned and operated by crackers.</p>\n<p>We are here:  <a href=\"https://www.threads.net/@drewharwell/post/C8fA8MAR0_2\">dub a dub a deeeee dub a dub a deeeee dub a dub a deeeee dubbbbla dooo</a>.  (Who wants to remix this with Crystal Waters lada di lada do with me ?</p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"d64ae86e82f05eae2999e204f325dbef76834f214c56b526d277175244c33cd6","category":"default"}