{"title":"John Quincy Adams on Impostor Syndrome and the True Measure of Success","link":"https://www.themarginalian.org/2024/06/03/john-quincy-adams-impostor-syndrome-success/","date":1717445430000,"content":"<p>“You will never get any more out of life than you expect,” Bruce Lee <a href=\"https://www.themarginalian.org/2016/08/01/bruce-lee-notebook/\">wrote to himself</a>. All expectation is a story of the possible. Every person lives inside a story of who they are, what they are worth, and what is possible for their life, and suffers in proportion to how conscious they are of the story, how much credence they give those inner voices over the raw input of reality. It is often when life blindsides us with a bright counternarrative to a limiting inner story that we suffer the most, because we are suddenly forced to revise our entire personal mythos, to relinquish our familiar ways of keeping ourselves small, to exceed our own expectations of the possible. </p>\n<p>At fifty-three, while serving as Secretary of State as presiding over the commission for weights and measurements, fighting valiantly for the adoption of the meter after <a href=\"https://www.themarginalian.org/2017/03/22/the-measure-of-all-things-delambre-mechain/\">its hard-won invention</a>, <strong>John Quincy Adams</strong> (July 11, 1767–February 23, 1848) received the unexpected news that he has been elected President of the American Academy of Arts and Sciences. None of his credentials, none of his merits so obvious to others, kept him from feeling unworthy of the post. </p>\n<figure><a href=\"https://www.amazon.com/John-Quincy-Adams-Diaries-1779-1821/dp/159853520X/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?resize=680%2C816&amp;ssl=1\" width=\"680\" height=\"816\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?w=1333&amp;ssl=1 1333w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?resize=240%2C288&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?resize=320%2C384&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?resize=768%2C922&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/08/johnquincyadams-1.jpg?resize=600%2C720&amp;ssl=1 600w\" /></a><figcaption>John Quincy Adams. Portrait by John Singleton Copley, 1796.</figcaption></figure>\n<p>In a diary entry from June of 1820, found in <a href=\"https://www.amazon.com/John-Quincy-Adams-Diaries-1779-1821/dp/159853520X/?tag=braipick-20\" target=\"_blank\"><strong><em>John Quincy Adams: Diaries 1779–1821</em></strong></a> (<a href=\"http://www.worldcat.org/title/diaries-i-1779-1821/oclc/956624206&amp;referer=brief_results\" target=\"_blank\"><em>public library</em></a>), Adams writes:</p>\n<blockquote><p>I answered the Letter and accepted the Office; because I thought there would be an appearance of affectation in refusing it — The Arts and Sciences have been the objects of my admiration through life; I would it were in my power to say they had been objects of my successful cultivation.</p></blockquote>\n<p>But beneath his private affection for these disciplines lurks Adams’s aching lack of confidence in his own authority. (Confidence is simply a way of moving through the world with a correct view of your strengths and vulnerabilities, a correct measure of your depths and your limits, in order to face the possible with unstoried willingness.) In a touching testament to how prevalent and indiscriminate the existential epidemic of impostor syndrome is, Adams writes:</p>\n<blockquote><p>Honours like these produce in my mind humiliation as well as pride. In this particular instance, I am mortified at being raised to the head of a learned Society, with qualifications so inadequate to the Station — Mortified, that in a Society which ought to include all the distinguished men of Letters and of Science in the State, there was no man so notoriously and conspicuously superior to me, as to have prevented the thought of me from occurring at-all — As the time is fast approaching, when if my life continues, I shall be consigned to retirement from Public life, the idea presents itself to me, that I may still exist for some purpose useful to my Country, by devoting the leisure of my declining days to the duties of this Scientific Office. To promote the taste, the culture and the refinement of Art and Science in my Country — Should my exit from the public theatre be such as to leave me with a competency for the comfortable subsistence of my family, and therefore the choice of employment for my time, this will perhaps offer me the means of filling it with satisfaction and with honour.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2013/08/12/salvador-dali-illustrates-montaigne/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2013/08/dalimontaigne35.jpg\" /></a><figcaption>One of Salvador Dalí’s <a href=\"https://www.themarginalian.org/2013/08/12/salvador-dali-illustrates-montaigne/\">illustrations for the essays of Montaigne</a></figcaption></figure>\n<p>Five years later, Adams was elected President not only of the nation’s cultural pantheon but of the nation itself — to this day America’s most science-literate, science-passionate leader. Having unsuccessfully advocated for the adoption of the metric system — the rejection of which was America’s first great act of international arrogance with consequences reaching across epochs and across worlds, confusing generations of global citizens and culminating in NASA’s tragicomical $125 million loss of the Mars Climate Orbiter after American engineers failed to correctly convert metric measurements — Adams understood uniquely <a href=\"https://www.themarginalian.org/2017/08/16/john-quincy-adams-diaries-effectiveness/\">the difference between efficiency and effectiveness, and the proper aim of ambition</a>.</p>\n<p>Complement with how Nobel laureate John Steinbeck <a href=\"https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/\">used the diary as a hedge against self-doubt</a> and a classical guitarist’s account of <a href=\"https://www.themarginalian.org/2015/01/07/glenn-kurtz-practicing/\">overcoming impostor syndrome</a>, then revisit Thoreau on <a href=\"https://www.themarginalian.org/2012/07/12/thoreau-on-success/\">defining your own success</a> and Henry Miller on <a href=\"https://www.themarginalian.org/2014/06/26/henry-miller-on-turning-eighty/\">what makes a fulfilling life</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"d70176ab0e14b664d110663a672c2abfb2c0ea5e9b2ebeda8f02d5f0256e1e67","category":"default"}