{"title":"Changing My Approach to Meetings to Take Back Control of My Attention","link":"https://www.usv.com/writing/2024/08/changing-my-approach-to-meetings-to-take-back-control-of-my-attention/","date":1723584308000,"content":"<p>I let meetings take over my life. For reasons that I might get into some other time I said yes to way too many meetings. My schedule became ever more packed, often running back-to-back for entire days. It became harder and harder to find time to read, think, and write. I also had virtually no time to deal with emergencies when those came up. My attention was no longer mine to direct. It had been hijacked by meetings.</p>\n<p>Having had a break from meetings on a six week voyage across the Atlantic , I will radically change my approach to meetings going forward. Of course I will still participate in board meetings and other group meetings. But I will dramatically cut down on one-on-one meetings both in terms of number and duration. Outside of a crisis situation I will no longer schedule standing meetings. And I will restrict the meetings to specific times, blocking out large chunks of time on my calendar for reading, thinking, and writing.</p>\n<p>Broadly my meetings fall into three categories: information/decision, emotion, idea generation.</p>\n<p>A large fraction of information/decision meetings is sadly a waste of time. They lack a clear objective and often amount to a recitation of somewhat random bits of information. Going forward I will ask for a lot more preparation in long-form writing. Sometimes the act of writing will obviate the need for such a meeting entirely as the decision will become clear. Often writing will significantly reduce the meeting time by focusing on the real substance. Also the only truly important such meetings are those where a type 1 decision needs to be made: something that cannot easily be reversed.</p>\n<p>A category of meeting that can matter greatly is when a lot of emotion is in play that cannot be easily expressed or processed in writing. I am happy to take such meetings because I know how lonely being a founder/CEO can be. Ultimately though these meetings rarely make a long term difference beyond providing an immediate outlet for frustration or receiving some consolation. The reason is that it’s hard and maybe impossible for founders/CEOs to be vulnerable with an investor, which is what would be required to really process an emotionally challenging situation.  This is why having a coach or therapist is so incredibly important and I encourage every founder/CEO to have one.</p>\n<p>Finally a great reason for a meeting is generative riffing. This works best in person and when both sides are well prepared. It is a lot like musicians improvising: only produces great music if they know how to play their instruments and how to give and take. I will set aside significant time for these kinds of meetings because they are often the source of something truly new (it also happens to be what we do a lot at USV internally).</p>\n<p>I am excited to regain more control over my attention. I will post an update later this year on how this new approach is working out.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/changing-my-approach-to-meetings-to-take-back-control-of-my-attention/\">Changing My Approach to Meetings to Take Back Control of My Attention</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"d7c557c6fe921b2cf5fc71cc57b4de91227390c8745fc2a9b08c2d39b1616d96","category":"default"}