{"title":"The System-of-Record Network Effect","link":"https://www.usv.com/writing/2024/10/the-system-of-record-network-effect/","date":1728092674000,"content":"<p>I was sitting with an investor friend earlier this week, describing the kinds of things that USV likes to invest in. She asked if USV invested much in SaaS (Software as a Service), and I said no, not really. But yes, in certain cases, especially where there is a network to be had, and I mentioned that one kind of network we like to invest in is a system-of-record style network.</p>\n<p>The canonical example is our portfolio company Carta , which is certainly SaaS, but really, it’s system-of-record, grounded in ownership interests (starting with equity ownership in startups) as the foundation record that binds the system together. From there, many stakeholders can engage and collaborate, all based on the shared interest in the records at the heart of the system.</p>\n<p>Since the beginning of USV, we have always asked the question: “is this a tool, or can it become a network?” In the early days of Carta (f/k/a eShares), you could look at it as a tool for managing cap tables, or you could look at it as a network of assets and stakeholders.</p>\n<p>The system-of-record network effect is also at heart of why blockchains are interesting. They are, by definition, ledgers that track the relationship between digital assets (money, date, etc) and a wide variety of stakeholders.</p>\n<p>With any system of record, the more data and records that the system holds, and the more stakeholder identities that interact with it, the more valuable it gets. It’s no surprise that the enterprise ERP systems (eg., SAP, Oracle, Microsoft, Salesforce, etc) that form the systems-of-record for most large companies are extremely highly valued and long-term durable.</p>\n<p>Perhaps all of this is obvious. But it has proven to be a helpful frame for us as we continue to consider software applications in a wider variety of contexts. For example, CarbonChain is building a system-of-record around carbon accounting, and Odyssey is building a system-of-record around financing and operations of distributed energy resources in emerging markets.</p>\n<p>Becoming a system of record is not easy — it requires placing oneself at the center of someone else’s workflow and digital life. Open source solutions (e.g., blockchains) are well suited to it because bring a high level of transparency and trust. Digitizing an asset type that was previously analog and making it 100x more useful is another way to generate enough momentum to get there.</p>\n<p>And with that, I will hit publish, and as I do so, this post will get recorded — permanently — in the arweave blockchain which provides the system-of-record datastore for this blog!</p>\n<p>Cover Photo by blocks on Unsplash</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/the-system-of-record-network-effect/\">The System-of-Record Network Effect</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Nick Grossman","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"d7d8eb41180d847324d375a7febadfdb3ebe5a5bc203c0426eb8b28f871168d7","category":"Sites"}