{"title":"Bizarre Traveling Flame Discovery","link":"https://kottke.org/24/04/bizarre-traveling-flame-discovery","date":1713978303000,"content":"\n        <p></p>\n\n<p>Steve Mould’s videos are always entertaining and informative but this one is also a little bit mind-blowing. If you build a circular trough with just the right dimensions and fill it with lighter fluid, a flame will travel around it. And other shapes will do other things — the effect created by the star/octopus shape is especially cool. The effect is an example of an <a href=\"https://en.wikipedia.org/wiki/Excitable_medium\">excitable medium</a>:</p>\n\n<blockquote><p>An excitable medium is a nonlinear dynamical system which has the capacity to propagate a wave of some description, and which cannot support the passing of another wave until a certain amount of time has passed (known as the refractory time).</p>\n\n<p>A forest is an example of an excitable medium: if a wildfire burns through the forest, no fire can return to a burnt spot until the vegetation has gone through its refractory period and regrown.</p></blockquote>\n\n<p>Other examples:</p>\n\n<blockquote><p>Normal and pathological activities in the heart and brain can be modelled as excitable media. A group of spectators at a sporting event are an excitable medium, as can be observed in a Mexican wave (so-called from its initial appearance in the 1986 World Cup in Mexico).</p></blockquote>\n\n<p>(via <a href=\"https://waxy.org/\">waxy</a>)</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/science\">science</a> · <a href=\"https://kottke.org/tag/Steve%20Mould\">Steve Mould</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/04/bizarre-traveling-flame-discovery\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"d84bf73a099c88e316ce8421683572510e4d6d70e2649d24b17a7a5173830a76","category":"default"}