{"title":"I’ve Moved Onchain (continued)","link":"https://www.usv.com/writing/2024/05/ive-moved-onchain-continued/","date":1716310478000,"content":"<p>A few weeks ago I started a new series on this blog talking about how I’ve moved my Internet presence onchain over the last few years. The first installment talked about blogging onchain.</p>\n<p>This installment is about tweeting.</p>\n<p>As many of you know, USV led the first round of investment in Twitter back in 2007 when it spun out of Odeo. I sat on the Twitter board for a number of years and was an active user of Twitter until it was bought by Elon Musk.</p>\n<p>When Twitter was put in play back in 2022, I said this:</p>\n<p>Fred Wilson</p>\n<p>@fredwilson</p>\n<p>Twitter is too important to be owned and controlled by a single person. The opposite should be happening. Twitter should be decentralized as a protocol that powers an ecosystem of communication products and services.</p>\n<p>6,777</p>\n<p>7:22 AM • Apr 14, 2022</p>\n<p>Unfortunately, what transpired is the opposite of what I believe should have happened and so I left Twitter and have been casting instead of tweeting since then.</p>\n<p>Casting is like tweeting but it happens on a decentralized social protocol called Farcaster which launched in June 2021. I joined immediately and I am Farcaster ID number 169 meaning I was among the first two hundred users of the protocol.</p>\n<p>Farcaster is still relatively small. It has less than a million total users and something like fifty thousand daily users.</p>\n<p>But it has something Twitter and Instagram and TikTok don’t have. It has a decentralized and open social graph and protocol. Just like the early days of Twitter, anyone can build a social app on top of Farcaster and they will all work together.</p>\n<p>The leading client for Farcaster is called Warpcast and it was built by the Farcaster team. But if I choose to use Supercast , Nook , Kiosk, or some other Farcaster client, anyone on any app can read and reply to my casts and visa versa. It is exactly like the early days of Twitter with Tweety and Tweetdeck and many other third-party clients.</p>\n<p>In a world where the company operating the social media app can de-platform a politician, can change the algorithm to optimize ads, or can be shut down by the US Government, we need a different model.</p>\n<p>And, ironically, the early days of Twitter showed us the way, but we did not have a business model back then to make that approach sustainable.</p>\n<p>Satoshi’s Bitcoin white paper in 2008 laid it out but it took another few years before the onchain business model was in plain sight and could be adopted by anyone.</p>\n<p>So that’s what Farcaster is. Simply put it is the Twitter ecosystem circa 2007 with an onchain business model that ensures that it cannot and will not ever be closed.</p>\n<p>Developers are not just building short text social (like Twitter) on the Farcaster protocol. They are also building social image sharing (like Instagram) and social video sharing (like TikTok) on Farcaster. They are also building blogging and marketplaces and more. All with interoperable identity and onchain posts.</p>\n<p>I am certain that onchain social is the best answer to the problems of monolithic big-tech social and that it will yield an enormous diversity of social experiences that are not attention optimizing and advertising driven and controlled and curated by a single entity.</p>\n<p>If you want to experience onchain social, you can follow me on Farcaster .</p>\n<p>Once you do that, you will have an onchain identity that you own and is not controlled by anyone other than you. That will be your gateway to many more onchain social apps that will be built over the next decade.</p>\n<p>We are going back to the future with onchain social and I am incredibly excited about it.</p>\n<p>Disclosure: USV is an investor in Farcaster and a number of other onchain social apps that were mentioned in or linked to in this post.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/05/ive-moved-onchain-continued/\">I’ve Moved Onchain (continued)</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"d895f2569bacd99d144f533bbcaf408673f5c6304b9aaaa3cf023bc60076f2fe","category":"default"}