{"title":"the joy of missing out on platforms","link":"https://keningzhu.com/journal/the-joy-of-missing-out-on-platforms","date":1723748923000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/11-the-joy-of-missing-out-on-platforms/id1731169431?i=1000665468465\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/1xLWKoRfKYTeMS9a5M512Z?si=7Yxkl6uzSLe4ZbeXuCQ_yQ\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>this episode is about my approach to cultivating a creative and business life outside of all social/content platforms (including Substack and Youtube). this is not a critique of platforms so much as a portrait of alternative possibilities: we’ll explore: </p><ul><li><p>why platforms are like cruise boats - seemingly “easy” and “effortless” by promising all the amenities you’d ever need (while keeping you locked in). </p></li><li><p>alternatives frameworks and approaches to (1) building community (2) being discovered (3) “monetization” (4) content creation/distribution </p></li><li><p>why embrace making art alone; why being hard to find is not a bad thing </p></li><li><p>the power of embodying your individual essence — centering in your creative process outside of the validation loop of platforms </p></li></ul><p>-</p><p><strong>additional resources</strong></p><p><a href=\"https://podcasts.apple.com/us/podcast/off-the-grid-leaving-social-media-without-losing-all/id1610399726\" target=\"_blank\">off the grid: leaving social media without losing all your clients</a></p><p><a href=\"https://keningzhu.com/journal/how-i-share-my-work-as-an-introverted-artist\" target=\"_blank\">how I share my work as an introverted artist</a></p><p><a href=\"https://keningzhu.com/journal/build-a-world-not-an-audience\" target=\"_blank\">build a world, not an audience</a></p><p><a href=\"https://keningzhu.com/journal/make-art-for-no-audience\" target=\"_blank\">make art for no audience</a></p><p><a href=\"https://keningzhu.com/journal/make-art-in-the-void\" target=\"_blank\">make art in the void</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/69577ea8-5f1d-4cbe-b086-8ca1b85bf1a4/ep_10._8-15.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction</h1><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening and I'll be your guide.</p><p>This week's episode is about the joy of missing out on platforms and the possibilities that arise from that missing out.</p><p>And when I say platforms, I definitely mean social media, but I'm also referring to sub-stack, YouTube, and any other digital space on the internet that is owned by a company and acts as its own microcosm with a specific set of rules for content creation, distribution, interaction, and a specific sort of algorithm.</p><p>I'm gonna use a couple of metaphors in this episode.</p><p>The first one is I think of platforms as kind of like parties or cruise boat resorts.</p><p>These environments entice you with a promise that they will have everything you need while keeping you inside their algorithm playing by their set of rules.</p><p>I will start this episode by exploring why platforms entice us with that sense of ease through four key components.</p><p>My purpose in this episode is not to critique platforms, but instead to offer alternative possibilities, to make a case that platforms are an easy way, but not the only way to be seen.</p><p>And maybe for you, it's not even the best way.</p><p>And then I'll spend some time exploring an alternative.</p><p>What it's like to build your own digital space, a website.</p><p>I think of a website as an independent environment on the internet that belongs to you where you get to make your own rules.</p><p>I've written about this under the topic world building.</p><p>Today I'm proposing that if being on platforms feels like being stuck on a cruise boat, having a website at first can feel like making a rowboat with your own two hands.</p><p>And maybe it's really hard and kind of rickety at first, but over time that grows into an island where you can live and make a home and where other people can visit you and be inspired and nourished by the ecosystem that you've created.</p><p>Being off platforms forces you to find your way rather than following someone else's template of what that looks like and what success is.</p><p>So let's dive in.</p><p></p><h1>how platforms promise everything</h1><p>Part one, how all the amenities are provided for you.</p><p>Number one is the built-in ease of finding community and connection.</p><p>I think whenever we're doing hard things or being creative or experimental on the internet, it is much easier or it feels much easier to go where people are.</p><p>That is the general rule of thumb.</p><p>Take your work to where people already are so that they don't have to do too much to see you.</p><p>The community is already there.</p><p>People are just a DM or a button away from following you.</p><p>There's a promise that if you come to my platform where all your friends are, where all your peers are, then you'll find a sense of belonging and as a result, new customers and clients and collaborators.</p><p>Number two is if you set up on this platform then you will be discovered.</p><p>On each platform, it's built into the system that your circle will be refreshed just enough to keep it expanding.</p><p>There'll be just enough new people into the mix.</p><p>You'll have the promise of nurturing your current community and growing your circle.</p><p>Three, there's a clear model of monetization with clear milestones.</p><p>Many platforms show you examples of people further down the path who have used the platform to financial independence and success with the implicit promise that if you use our platform, then you can be like this person.</p><p>With success stories, it's part of the selling point.</p><p>I think Substack is a perfect example of this.</p><p>It solves a problem of writers feeling isolated on the internet and struggling with how to build a business from their writing.</p><p>Whereas Instagram, the model is that of being an influencer and having brand sponsorships and YouTube, it's about surpassing a thousand subscribers before you can be a part of their ad network and 4,000 watch hours or some milestone.</p><p>Platforms promise a clear, structured and simple way to make money from your creations and from your presence.</p><p>Element four is a frictionless ease of content creation and distribution.</p><p>As in, it's much easier if you're creating into a square box or a series of square boxes that you would scroll through.</p><p>You have these limitations that guide you and give you structure and help.</p><p>And you have examples of other people's work that is trending or has gone viral or is successful in any sort of metric based way of looking at success.</p><p>Platforms simplify the containers for your creativity and then it makes that sharing process feel effortless and frictionless.</p><p>It takes care of the distribution without you having to think too much about it.</p><p>It gives you a container for you to fill.</p><p>It gives you the community who will receive it and the promise of being discovered by a new community and the path to making money from your creations.</p><p>So now that I've outlined these four elements, let me explore what the alternative looks like.</p><p></p><h1>what is the alternative? </h1><p>I already gave you the metaphor of platform as cruise resort boat and building a website as having your own rowboat.</p><p>Another metaphor is that if being on platforms is like having a booth in a festival or a state fair, then having a website is like building a home with your own two hands somewhere in the wilderness.</p><p>Platforms want us to believe that the website is obsolete, that the platform is where the party is, where the people are and where the money is.</p><p>But I wanna propose that this is just not true.</p><p>When I started out sharing my work, I felt a lot of platform fatigue.</p><p>I was on Instagram, I was on Facebook for a while.</p><p>I felt lots of FOMO from not being on sub-stack for a while.</p><p>And then over time, I just gave myself permission to focus my energy and put it where it feeds me and my world the most.</p><p>And that is not on other people's platforms inside other people's algorithms.</p><p>That is on my own website world.</p><p>Secondly, being on platforms felt extremely energy draining rather than energy giving.</p><p>And maybe it's because I'm such an introvert and hermit and I don't really like parties.</p><p>I like to invite people to my home and have tea together or have dinner together.</p><p>And that is what sharing my work on my website feels like.</p><p>I don't have to go anywhere for the sake of connection and community.</p><p>I can build my world and allow others to come to me.</p><p>So let's break it down into the four elements.</p><p></p><h1>a case for new possibilities: </h1><p></p><h1>1 - building community and connection </h1><p>Number one is community and connection.</p><p>When you build a website, it doesn't come with an audience and nor does it seem exactly straightforward to build one because you're not prompted to follow 10 people and then you wait for them to follow you back.</p><p>And so the fear is that you'll be languishing in obscurity for digital ego death and loneliness and facing the void.</p><p>I would say referring to my episode, make art for no audience.</p><p>The practice here is the act of seeing yourself.</p><p>And for those who do visit your world, maybe the barrier of entry is higher.</p><p>You're not prompted with a simple follow me button.</p><p>Instead you have to enter an email address to sign up for their newsletter.</p><p>But I believe that more friction is actually a good thing.</p><p>For someone to sign up for your newsletter is a bigger investment than for someone to follow you.</p><p>I believe a website should repel the wrong people by being extremely clear who are the right people, what is the right frequency?</p><p>And rather than it being about a numbers game as in more is better, it's a deliberate focused use of your energy to build deeper connections.</p><p>If you've landed in my world and you'd like to stay in touch, please leave your name and email address here.</p><p>Leading up to that point where you have nurtured a community through your website, there is so much power and freedom in building alone.</p><p>It takes some getting used to at first, of course, but over time, the more you build, the more you find that the same people are returning and you know that the fact they went out of their way to go to your website, that those people, they are the right ones you're speaking to.</p><p></p><h1>#2 - being discovered </h1><p>Element number two is discoverability.</p><p>This is a question of, oh, but if you are building a website, then how will people find you?</p><p>How will people know that you exist unless you point them to it from social media?</p><p>And I think the underlying fear is that maybe you'll be doing a lot of work that no one will ever see.</p><p>And to this point, I would say that the work itself, the creative process itself must feel sustainable like a reward that you want to do for the sake of it.</p><p>The typical solutions that people talk about for being discovered on your website has to do with sharing your website with people in your network, asking them to pass it along or to keep it in mind, or SEO, which is essentially writing about things that people will search for, search engine optimization.</p><p>But what I want to say about SEO, a very short note is that if it feels draining, it's probably not the right strategy for you.</p><p>Rather than focusing on what people know to search for, focus instead on writing or creating the best piece of work that you can to contribute to the collective library of knowledge or insight that is the internet.</p><p>The third way that people talk about being discovered is to borrow other people's audiences, as in to pitch and blog on other people's platforms by adding value to their audiences.</p><p>And I'm not saying this doesn't work, I'm sure it does, but I personally would rather spend my energy on my own world, even if fewer people see it.</p><p>Rather than thinking too much about SEO or guest blogging or referrals or shareability, my strategy is really to focus on personal expression and creation, trusting that the more I create and hone my craft, the more the right people will come to me.</p><p>The more I'm nourished by my work, the more that others have the possibility of being nourished by it too.</p><p>And the last thought I'll add is, I think the ultimate freedom here is to embrace being hard to find, as in to not need to be found.</p><p>If you're harder to find, then when people actually do find you, it feels like a gift.</p><p>It feels like stumbling upon a treasure, a moment of serendipity, a sort of encounter at an antique store or while thrift shopping.</p><p>You don't really forget such encounters.</p><p>You bookmark them and come back to them for a lazy Sunday afternoon to explore at leisure.</p><p>In this instance, of course, it's not about using your website as a tool for marketing and business, at least not at the very beginning, but instead as a vessel to hold your creative expression.</p><p>Your timeline has to be spacious.</p><p>This is a strategy that takes time, that builds relationships over time.</p><p></p><h1>3 - monetization </h1><p>Element three is a clear roadmap to monetization.</p><p>And I'm gonna start by sharing my distaste for the word monetization.</p><p>I don't love this word because I think it's the wrong attitude towards whatever it is being monetized, like our passion.</p><p>And it's the wrong word to talk about the energy of money.</p><p>Because it sort of proposes that you're taking this wild, organic thing and you're turning it into a machine that can produce money.</p><p>The idea of capitalizing on or profiting from creates this dichotomy between what is passion and art and what is money and the material world.</p><p>I think this dichotomy is an overly simplistic framework to look at money and how the work of our souls can relate to the work that feeds our lives.</p><p>But this is something for another episode.</p><p>Platforms provide a clear set of tools and a built-in machinery for conversion.</p><p>They allow you to not think about money because they've done the thinking for you.</p><p>If they've created the systems for you, they might even have those calculators.</p><p>Like if you have 10 subscribers, you'd make this much money a year.</p><p>If you had a hundred, you'd make that much money a year.</p><p>And as a result, when you're inside their system, you feel the need to try and achieve their metrics as a model of what success looks like.</p><p>I wanna propose that the process of grappling with money with your relationship to money is a deep journey in itself.</p><p>It's grappling with your relationship to giving and to receiving.</p><p>It's building your business through thinking clearly about your own containers for your energy, for your labor.</p><p>And I see business as simply a set of systems and processes for the efficient use and exchange of your energy.</p><p>Money is just one form of that energy.</p><p>And it's an important part of the process of giving and receiving.</p><p>It's not an end product, it's only a placeholder.</p><p>So when you're outside of platforms with these clear metrics and milestones for what financial success looks like, you really have to deepen in your own relationship to money.</p><p>You have an opportunity to think about how to do business your way.</p><p>And of course, there's so many models all around us for how to be a service provider, how to sell courses, how to market your courses.</p><p>But when you divest from the idea of monetizing your passion as the clear outlets provided by these platforms, then there's more room for experimentation on your own website.</p><p>How can you create business models that feel aligned with your energy instead of being a content creator on someone else's platform?</p><p></p><h1>4 - creation and distribution  </h1><p>The last element is the experience of creation and distribution.</p><p>The experience of creating in context and awareness of others feels very different than the experience of creating alone on your own digital island.</p><p>For one thing, when you share on a platform, you know that there are others on the other side receiving what you share, that you could get a like or a comment or a reshare and you get these positive boosts of dopamine immediately.</p><p>But when you share on your own website, there's a silence and that silence feels almost akin to that of a notebook.</p><p>It feels almost private.</p><p>It feels like whispering into the mountains and maybe you'll hear an echo back.</p><p>Maybe you won't until a year or three years later.</p><p>And I think this goes for newsletters as well.</p><p>You could send a newsletter, you could spend five hours on a newsletter or on a podcast and hear nothing about it.</p><p>Without this feedback loop, you truly have to center in practice and process to embody your own process as separate from the pleasure and validation of being on a platform.</p><p>I think platforms by collapsing the boundaries and making sharing feel so easy entangles the inner experience of creation from all the complicated feelings that can come with sharing.</p><p>And to embody your own process as separate from that validation of being on platforms, this takes work and time.</p><p>But in a world without templates, without models to follow, you get to define your own.</p><p>There is no predefined form for you to fill into.</p><p>You control both the container for your creative expressions and the expressions that fill those containers.</p><p>And you control how people move through and from one stream to another.</p><p>And you get to grow and build an ecosystem over time, the living place of your own digital world.</p><p>The experience of creating feels infinite and this can feel paralyzing at first to have a blank canvas that could literally be anything, but it's also an empty canvas for play and experimentation and possibility without worrying about what happens after you press share.</p><p>Probably nothing will happen.</p><p>And it's just a sketchbook that happens to be somewhat public.</p><p>An art studio with its doors open to the world for those who happen to wander into it and to feel connected enough to it to come back.</p><p></p><h1>closing thoughts </h1><p>As we wrap up this episode, I'll say building in the internet wild is not for everyone.</p><p>It's definitely not for the faint of heart, but its rewards are deeply transformative and the journey itself is filled with freedom, radical independence and a sense of infinite possibility.</p><p>To find success, first you have to define what success means for you and then embody in your truth, embody in your uniqueness.</p><p>It's definitely the hard way.</p><p>If you're looking for the most efficient way to build a business, perhaps some people would say that platforms are the way to go, but you could see their limitations as a dilution of the self, even a commodification of the self, not to mention the sacred space of our attention.</p><p>And if you're looking for more resources for leaving social media and for building your business off social media, I also highly recommend checking out my friend Amelia Hubry's podcast, \"Off the Grid,\" leaving social media without losing all of your clients.</p><p>Building a digital life, a world, a business, off of platforms is for those who feel expanded and challenged and excited by the possibility to create something new and different and to practice being 100% true and authentic to themselves in a space they own.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"d8fd6e13884f7fdb0fc5d2a582be8a0e94406dc1bfa2b042a56f2a81041926ac","category":"Sites"}