{"title":"The podcast-only feed, part 1","link":"http://scripting.com/2024/06/25/134922.html?title=thePodcastonlyFeedPart1","date":1719323362000,"content":"<p>I'm getting my podcast-only feed for Scripting News ready. </p>\n<p>It's going to be an Apple-compliant podcast feed. I'm enjoying the process. </p>\n<p>Of course when it came time to do the logo I went to my reasonably-priced graphics consultant, ChatGPT. It came breathtakingly close on the first attempt, but it repeated part of the story. Every time I asked it to fix a problem, it created another problem, and the image brightness was reduced, not just in terms of pixels but also the creativity of the image. Of course it isn't really creative. I know. Yadda yadda. </p>\n<p><img src=\"https://imgs.scripting.com/2024/06/25/scriptingNewsPodcastFullImage.png\" />Anyway I decided that since the motto of my blog and therefore my podcast is \"It's even worse than it appears\" that an obvious imperfection is totally consistent with the philosophy, and we move onward. As they say, still diggin!</p>\n<p></p><div><img src=\"https://imgs.scripting.com/2024/06/25/scriptingNewsInlineImageVersion.png\" />It's even worse than shit appears.</div><p></p>\n<p><img src=\"https://imgs.scripting.com/2024/06/25/scriptingNewsPodcastFullImage.png\" />The prompt for the image: \"I'm sure you're aware of my blog, Scripting News, scripting.com. I am doing a new podcast feed for the blog. This feed is designed to get through Apple's submission process so it can be listed in their podcast database. One of the requirements is a 3000 by 3000 image that serves as a logo for the podcast. I need something simple and bold that says 'Scripting News podcast' and then 'With Dave Winer and friends' and 'It's even worse than it appears.' On a background of corn fields in Iowa viewed from the air.\"</p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"d91d9e6a0e85e5a38053d1d6e9c52a16518e798382e02a0729e560903db321ef","category":"default"}