{"title":"Singing the counter-melody","link":"https://sive.rs/counter","date":1461196800000,"content":"<p>\nMy advice and opinions may sound strange on their own.\n</p><p>\nDo you know what <a href=\"https://en.wikipedia.org/wiki/Counterpoint\">musical counterpoint</a> is?\nUnderneath the main melody, you have a <a href=\"https://www.youtube.com/results?search_query=counter-melody\">counter-melody</a> that goes against it, and together they make harmony.\nThis is different from harmonizing, where someone sings along with the melody at an interval.\nThe counter-melody is a separate melody that could stand on its own, but is mainly there to complement the main melody.\n</p><p>\nWell, if my advice and opinions sound strange, it’s because I’m just the counter-melody.\n</p><p>\nI know I’m not the only voice you hear.\nThere’s a common message we all hear these days.\nLet’s call that the melody.\n</p><p>\nI may love that melody, too, but I don’t want to just duplicate it.\nSo I try to think of a good counter-melody.\n</p><p>\nI do it to <a href=\"https://sive.rs/compensate\">compensate</a> for something I think is missing in the common message.\n<strong>\nMy public writing is a counterpoint meant to complement the popular point.\n</strong>\n</p><p>\nOf course I don’t think the stuff I say is the only way to go.\nI’m just the counter-melody.\n</p><p>\nReally I hope you listen to the combination.\nEventually you’ll find yourself singing along with the melody you like best, or making up your own.\n</p>\n<a href=\"https://marcinryczek.com/portfolio-item/blackwhitegallery/\"><img src=\"/images/swans.jpg\" /></a>\n<div>“A Man Feeding Swans in the Snow” photo © <a href=\"https://marcinryczek.com/portfolio-item/blackwhitegallery/\">Marcin Ryczek</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"d92f535e984f0b40f5224bb1f6a17c7f2bdb94b3f83bf7060dc0e1cc9be606a3","category":"default"}