{"title":"the first time I met someone who believes in God","link":"https://sive.rs/locust","date":1732492800000,"content":"<p>\nMy parents never mentioned God or any religion.\nNot necessarily atheist — nothing against.\nThe subject just never came up.\n</p><p>\nI grew up across the street from a Catholic church.\n(440 South Clay Street in Hinsdale, Illinois.)\nLike any temple of a religion you’d heard nothing about, it had no meaning to me.\n</p><p>\nMy best friend, Mark Hemstreet, lived next door.\nWe were eleven years old, playing in the snow.\nI hit my hand on some ice and said, “God damn it.”\n</p><p>\nHe looked at me, surprised, and said, “You took the Lord’s name in vain!”\n</p><p>\nI said, “Wait, are you kidding or serious?”\n</p><p>\nHe said, “Serious!”\n</p><p>\nI thought he was straight-face kidding.\n<strong>\nI honestly didn’t know anyone believed in God.\n</strong>\nBecause the subject had never come up, I thought God was just like Santa Claus.\nA sweet idea, but almost nobody over the age of eight <em>actually literally</em> believes it, right?\n</p><p>\nI said, “Wait, so do you believe in the Easter Bunny and Tooth Fairy?”\n</p><p>\nHe looked scared and said, “Dude.\nThis is serious.\n<strong>\nIf you don’t believe in God, you’re going to turn into a locust on Judgement Day.\n</strong>\nThey told us at Sunday School.”\n</p><p>\nI laughed and said, “Oh really?\nWell if they’ve got all the facts, then what kind of locust will I be?\nWill I stay this same size, or shrink down?\nHow does that work?\nWhat are the details?”\n</p><p>\nHe didn’t answer but was really concerned for me, and said, “You can’t joke about this stuff.”\n</p><p>\nBecause that was my introduction to religion, I used to find them ridiculous.\nBut now, as an <a href=\"https://sive.rs/joke\">amateur anthropologist</a>, I’m trying to <strong>understand them all</strong>.\nSee <a href=\"https://sive.rs/pk\">my next post on this subject</a>.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"da9f1e7dcbad0b082b19b73ff48b87fb4c5dc02820c4d7b60dfa38babb1a3e0e","category":"Sites"}