{"title":"How to Live a Miraculous Life: Brian Doyle on Love, Humility, and the Quiet Grace of the Possible","link":"https://www.themarginalian.org/2024/11/24/brian-doyle-humility-love/","date":1732497002000,"content":"<p><a href=\"https://www.amazon.com/One-Long-River-Song-Wonder/dp/0316492892/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"483\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?fit=320%2C483&amp;ssl=1\" alt=\"How to Live a Miraculous Life: Brian Doyle on Love, Humility, and the Quiet Grace of the Possible\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?w=993&amp;ssl=1 993w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?resize=320%2C483&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?resize=600%2C906&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?resize=240%2C363&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/11/riverofsong_doyle.jpg?resize=768%2C1160&amp;ssl=1 768w\" /></a></p><p>Suppose we agree that we are here to <a href=\"https://www.themarginalian.org/2024/03/22/love-anyway/\">love anyway</a> — to love even though the work is almost unbearably difficult, even though we know that everything alive is dying, that everything beautiful is perishable, that everything we love will eventually be taken from us by one form of <a href=\"https://www.themarginalian.org/2022/04/07/the-more-loving-one-auden-universe-in-verse/\">entropy</a> or another, culminating with life itself. Suppose we agree that, as Rilke <a href=\"https://www.themarginalian.org/2015/01/29/rilke-on-love/\">so passionately insisted</a>, “for one human being to love another… is perhaps the most difficult of all our tasks, the ultimate, the last test and proof, the work for which all other work is but preparation.” </p>\n<p>This, then, is the agreement: Learning to live is learning to love, and learning to love is learning to die — the imperative in the inevitable that renders our transience meaningful and holy. The price of this holiness is absolute humility: There is no pact to be made with the universe — we die, whether or not we agree to it, whether or not we have learned <a href=\"https://www.themarginalian.org/2015/03/31/how-to-love-thich-nhat-hanh/\">how to love</a> in the bright interlude between atom and dust. We may or may not be lucky enough to live out the two billion heartbeats our creaturely inheritance has allotted us. But no matter how many we actually get, it matters how we spend them and what we spend them on. It may be the only thing that matters. </p>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/SnakeBird.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-snake-bird-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-snake-bird-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>Not long before his untimely death by an aggressive brain tumor, Brian Doyle — who described himself as “a muddle and a conundrum shuffling slowly along the road, gaping in wonder, trying to just see and say what is” — took up these immense and eternal questions in what became his posthumous essay collection <a href=\"https://www.amazon.com/One-Long-River-Song-Wonder/dp/0316492892/?tag=braipick-20\" target=\"_blank\"><strong><em>One Long River of Song: Notes on Wonder</em></strong></a> (<a href=\"https://search.worldcat.org/title/1229125333\" target=\"_blank\"><em>public library</em></a>).</p>\n<p>Because the harshest realities of our own lives are often easiest to see and easiest to bear lensed through the lives of other creatures cushioned in symbol and metaphor — this is why we have fables and fairy tales — Doyle finds himself reckoning with mortality and the meaning of life as he examines the dead body of a Townsend’s mole (<em>Scapanus townsendii</em>) in his garden. Curious about the animal, he turns to the scientific literature and is suddenly disquieted by reading about the species as a lump-sum of data points. Overcome with tenderness for “this particular individual, and the flavor and tenor and yearning of this one life,” he writes:</p>\n<blockquote><p>This tribe of mole is thought to be largely solitary, I read, and I want to laugh and weep, as we are all largely solitary, and spend whole lifetimes digging tunnels toward each other, do we not? And sometimes we connect, thrilled and confused, sure and unsure at once, for a time, before the family cavern empties, or one among us does not come home at all, and faintly far away we hear the sound of the shovel.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2022/05/27/the-boy-the-mole-the-fox-and-the-horse/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/05/theboythemolethefoxandthehorse_charliemackesie2.jpg?w=709&amp;ssl=1\" /></a><figcaption>Art by Charlie Mackesy from <a href=\"https://www.themarginalian.org/2022/05/27/the-boy-the-mole-the-fox-and-the-horse/\"><em>The Boy, the Mole, the Fox and the Horse </em></a> — a tender illustrated fable about what it means to love</figcaption></figure>\n<p>Over and over, through the different winding paths of the different essays, Doyle returns to his animating ethos that “love is our greatest and hardest work” — nowhere more poignantly articulated than in an essay about the people seen leaping out of the Twin Towers hand in hand, their hands “nestled in each other with such extraordinary ordinary succinct ancient naked stunning perfect simple ferocious love.” He reflects on this harrowing and holy emblem of our deepest humanity:</p>\n<blockquote><p>Their hands reaching and joining are the most powerful prayer I can imagine, the most eloquent, the most graceful. It is everything that we are capable of against horror and loss and death. It is what makes me believe… that human beings have greatness and holiness within them like seeds that open only under great fires, to believe that some unimaginable essence of who we are persists past the dissolution of what we were, to believe against such evil hourly evidence that love is why we are here.</p></blockquote>\n<p>The trick, of course, is learning how to be here — how to remain fully present and filled with that ferocious love — knowing we will one day be gone, knowing it might be tomorrow. In what may be the most soulful and sensible advice on how to live an actualized life since <a href=\"https://www.themarginalian.org/2016/05/31/walt-whitman-leaves-of-grass-preface/\">Whitman’s</a>, Doyle offers an anchor to that holy here:</p>\n<blockquote><p>You do your absolute best to find and hone and wield your divine gifts against the dark. You do your best to reach out tenderly to touch and elevate as many people as you can reach. You bring your naked love and defiant courage and salty grace to bear as much as you can, with all the attentiveness and humor you can muster. This life is after all a miracle and we ought to pay fierce attention every moment, as much as possible.</p></blockquote>\n<p>Paradoxically, this active and conscious effort is a heart that can only beat in the chest of surrender. Doyle adds the ultimate disclaimer: </p>\n<blockquote><p>You cannot control anything. You cannot order or command everything. You cannot fix and repair everything. You cannot protect your children from pain and loss and tragedy and illness. You cannot be sure that you will always be married, let alone happily married. You cannot be sure you will always be employed, or healthy, or relatively sane. All you can do is face the world with quiet grace and hope you make a sliver of difference.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/AzureMagpie_present.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/product/bird-divinations-azure-magpie-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-azure-magpie-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>At the center of this recognition is that most difficult triumph of unselfing for us creatures of self-importance: humility. In Doyle’s definition, humility is not a lowering down to the ground, as the word’s Latin root (<em>humus</em>) suggests, but a rising up and a reaching toward something we can never quite touch yet must trust is there. Some call this faith — faith that the world holds together, that our tiny and transient lives are nonetheless an essential part of the whole, that the choices we make within them change the shape of the whole, that love is the mightiest choice we could ever make and the highest form of faith. </p>\n<p>Doyle writes:</p>\n<blockquote><p>Humility does not mean self-abnegation, lassitude, detachment; it’s more a calm recognition that you must trust in that which does not make sense, that which is unreasonable, illogical, silly, ridiculous, crazy by the measure of most of our culture. You must trust that you being the best possible you matters somehow… That doing your chosen work with creativity and diligence will shiver people far beyond your ken. That being an attentive and generous friend and citizen will prevent a thread or two of the social fabric from unraveling.</p>\n<p>[…]</p>\n<p>This is what I know: that the small is huge, that the tiny is vast, that pain is part and parcel of the gift of joy, and that this is love, and then there is everything else. You either walk toward love or away from it with every breath you draw. Humility is the road to love. Humility, maybe, is love.</p></blockquote>\n<p>Complement with Seamus Heaney’s kindred <a href=\"https://www.themarginalian.org/2016/01/19/seamus-heaney-commencement/\">advice on life</a> and W.H. Auden’s kindred poem <a href=\"https://www.themarginalian.org/2022/04/07/the-more-loving-one-auden-universe-in-verse/\">“The More Loving One,”</a> then revisit Christian Wiman on <a href=\"https://www.themarginalian.org/2024/01/03/christian-wiman-love/\">love and the sacred</a> and Oliver Sacks on <a href=\"https://www.themarginalian.org/2024/11/08/oliver-sacks-letters-meaning-of-life/\">finding meaning without religious faith</a></p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"daf996bbf53c1f8b08918dac275f07d158deae3dd7cb1da810821b00b07bfda4","category":"Sites"}