{"title":"How Evolution Invented Faith: The Patience of the Penguin and the Art of Withstanding Abandonment","link":"https://www.themarginalian.org/2024/08/17/penguin/","date":1723909130000,"content":"<p>“Let us love this distance which is wholly woven of friendship, for those who do not love each other are not separated,” Simone Weil wrote in her soulful meditation on <a href=\"https://www.themarginalian.org/2015/08/24/simone-weil-friendship-separation/\">the paradox of closeness and separation</a>. To be separated from a loved one — in space or in silence, by choice or by circumstance — is a singularly discomposing experience. It takes a tremendous effort of the psyche to keep oneself from feeling abandoned, and <a href=\"https://www.themarginalian.org/2022/05/25/the-grieving-brain-mary-frances-o-connor/\">we know from fMRI studies</a> that every abandonment is experienced as a miniature death because the brain registers a loved one’s death — the ultimate abandonment — simply as a sudden and inexplicable separation.</p>\n<figure><a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=680%2C1052&amp;ssl=1\" height=\"1052\" width=\"680\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?w=1655&amp;ssl=1 1655w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=600%2C928&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=993%2C1536&amp;ssl=1 993w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Grosbeak_absence-scaled.jpg?resize=1324%2C2048&amp;ssl=1 1324w\" /></a><figcaption>Art from <em><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\">An Almanac of Birds: Divinations for Uncertain Days</a></em>. (Available as <a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-marias-woodpecker-about-almanacofbirdsorg8882527_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>We may call that tremendous effort <em>faith</em>.</p>\n<p>The wives of whalers had it when their husbands left on perilous voyages of months or years — faith that time and chance would smile upon that particular precious life adrift on the turbulent waters. Parents have it when their child takes those first steps, runs that first errand, goes to college — faith that across the developmental stages of individuation and separation, some unbroken bond of love will remain. Friends and lovers have it each time they embrace goodbye — faith that it will not be the last embrace.</p>\n<p>But no one in the history of the world has had more faith in the face of separation and uncertainty than the penguin.</p>\n<p>Penguins mate for life and lay one egg per year, which the parents take turns incubating and nursing for long stretches as each ventures into the sea hunting for food. The separation can last for months, during which the starving parent protecting the egg must retain unfaltering faith in the mate’s return — for if they too leave the nursery and go in search of food, the egg will perish.</p>\n<p>The extraordinary extent of that faith and the heroic patience it requires of the penguin come alive on the pages of <strong><em><a href=\"https://www.amazon.com/gp/product/0394528581/?tag=braipick-20\" target=\"_blank\">Voyage Through the Antarctic</a></em></strong> (<em><a href=\"https://search.worldcat.org/title/8669556\">public library</a></em>) — a collaboration between ornithologist and conservationist Ronald Lockley and novelist Richard Adams, who traveled together through the polar regions a decade after Adams wrote the repeatedly rejected manuscript turned modern classic <em><a href=\"https://www.themarginalian.org/2024/03/06/moonlight/\">Watership Down</a></em>.</p>\n<figure><a href=\"https://society6.com/product/the-king-penguin-by-thomas-waterman-wood-1871_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?resize=680%2C429&amp;ssl=1\" height=\"429\" width=\"680\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?resize=320%2C202&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?resize=600%2C379&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?resize=240%2C151&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/07/TheKingPenguin_ThomasWatermanWood.jpg?resize=768%2C484&amp;ssl=1 768w\" /></a><figcaption>The King Penguin by Thomas Waterman Wood, 1871. (Available as <a href=\"https://society6.com/product/the-king-penguin-by-thomas-waterman-wood-1871_print?curator=brainpicker\" target=\"_blank\">a print</a>.)</figcaption></figure>\n<p>Celebrating the emperor penguin as “a miracle of antarctic evolution” — its six-month courtship, its immense single-file march to remembered nursery sites far from the sea, its devoted co-parenting — Adams writes:</p>\n<blockquote><p>On the frozen breeding-grounds no food is accessible. The sea steadily retreats — perhaps for as much as 125 miles — as the winter ice extends outwards from Antarctica.</p>\n<p>When at last, in May, the female lays the single large (about 0.5 kg) egg, there is much excitement and mutual “talk.” The male awaits its appearance intently, and with his curved beak at once rolls it over his feet and up into a kind of pouch between his legs, where it is protected by a large flap of feathered belly skin and warmed by contact with the naked, hidden brood patch. If he did not do this, the egg would freeze within one minute. Exhausted by her efforts, and starving, having lost much weight during the long fast of mating and egg-building, the female now waddles seaward, tobogganing down slopes and now and then sleeping for short periods among the ice-hills.</p>\n</blockquote>\n<p>It takes her days, even weeks to reach open water, where she sets about restoring her body fat — a long recovery of vitality before she can return to the nursery at the end of the two-month incubation period. During that time, the males survive by crowding together in a solid shield known as <em>testudo</em>, which allows them to maximize body heat and keep from being blown away by the ferocious polar gales. It is only when the female returns to take over parenting duties that the male, weak and famished, can set out to sea to restore himself, having persevered through his mate’s long absence with total trust in her return.</p>\n<p>Adams marvels at this unparalleled act of faith:</p>\n<blockquote><p>The male’s stoic, heroic devotion to his duty as incubator and nurse must be unique in nature, involving that almost incredibly long fast under conditions of exposure to intense frost that would kill most other living creatures. It is at last rewarded, while the rookery is still sunless in July, by the return of his mate, fat an full-bellied from her long sojourn amid the krill and small fishes. She has had an even longer walk back to the rookery, since water ice is still forming far at sea. She usually arrives a few days after the chick is born at the time when, getting hungry, it begins to poke its head into the air and whine for food. The male, by an unusual provision of nature, manufactures sufficient nourishing fluid from bile and stomach secretions to keep the infant alive until the female arrives.\n</p></blockquote>\n<p>In a testament to <a href=\"https://www.themarginalian.org/2024/08/08/margaret-watts-hughes-voice-figures/\">voice as the fingerprint of the soul</a>, Adams adds:</p>\n<blockquote><p>When the female returns, she calls to and recognizes her mate by voice. This is a kind of ceremony, which may take some time, since after two months of testudo and other movement the mate is not likely to be where she left him nursing the precious egg. Once the ceremony of vocal recognition is over, the female persuades her mate to yield the chick to her. Within seconds it is transferred to her pouch. The male, in his turn, is now free to set out on the long walk to the ocean feeding-grounds… And here we rind another remarkable and unusual natural provision: the mother is able not only to live off her body fat but also to conserve the contents of her stomach to dole out enough daily food to keep the chick going until the male returns.</p>\n</blockquote>\n<p>That penguins have survived by an act of faith since they first diverged from albatrosses 71 million years ago is not only a miracle of evolution — there alongside such improbable and astonishing things as <a href=\"https://www.themarginalian.org/2023/06/21/scallop-eye/\">the eye of the scallop</a>, <a href=\"https://www.themarginalian.org/2024/05/05/cicadas/\">the periodicity of the cicada</a>, and <a href=\"https://www.themarginalian.org/2024/07/02/birds-dream-rem/\">REM</a> — but a living testament to patience as the guardian of love and the engine of the possible, a model for refusing to experience absence as abandonment, that miniature of death. For only love — the tenacity of it, the faith in it, the infinity of shapes it can take — makes life more stubborn than death.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"db08b5f064f19b90e55f92c33aa475f1692ccef88df168c7c8efa2d9abd65135","category":"default"}