{"title":"A decade in tech&#58; a retrospective","link":"https://blog.webb.page/2019-09-24-a-decade-in-tech.txt","date":1569283200000,"content":"<h3>The Beginning</h3>\n<p>I got my start in the web/tech space over a decade ago, during the economic\nrecession of 2008.</p>\n<p>Two years prior I was in college for a couple months until Johnson &amp; Wales'\ncampus police called to let me know I'd need to leave by the end of the week.\nUnbeknownst to me the college fund that was <em>allegedly</em> prepared for me never\nexisted (!!) and the funny thing about bounced checks is, <em>no one likes them</em>;\nespecially an institution that needs to pay its faculty. Anyhoo, in 2008 I was\ntasked with \"getting myself back into school\" <em>somehow</em> and was sent to the\nnext town over from JWU to start.</p>\n<p>My landlord, a portly self-deprecating guy with a glass eye and a heart of\nfriggin' <em>gold</em>, allowed me stay rent free as long as I kept him up to date\nwith my job search progress. In my downtime I perused online communities like\ndeviantART and Pixelfuckers (defunct) and attempted to emulate what I saw in\nthe awesome desktop modding scene. That led to attempting vector art and boy,\nthis was frustrating as hell to learn. Photoshop's pen tool just did not make\nsense at <em>all</em> and Illustrator was too strange. One day…it clicked. I could\ndo it!</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2019/a-decade-in-tech-a.png\">2nd Vector</a><a href=\"https://www.deviantart.com/nokadota/art/2nd-Vector-72286668\">1</a></p>\n<p>Yes, revel in this <em>monstrosity</em>. Admire it. <em>Fear</em> it (the later version<a href=\"https://www.deviantart.com/nokadota/art/Above-The-Clouds-71695497\">2</a>)\nof this looks <em>way</em> better).</p>\n<p>At some point I was designing so much<a href=\"https://www.deviantart.com/nokadota/gallery\">3</a> that I decided I needed a website,\nnaturally. I mocked something in Photoshop and emailed a PSD to HTML service\nto see how much it would cost to convert my \"super awesome\" design to a\nwebsite and I was quoted either $100 or $500. Whichever amount it was, I was\n<em>incensed</em>. Furious, even. Couldn't they see I was trying to start something?\nWhy would they charge me so much? The au<em>dacity</em> of these people!</p>\n<p>In my anger, I learned how to code my first website[FOOT1].</p>\n<p>Yes. I was petulant and figured it out because I was misguided in my anger at\nsomeone/some people trying to run a business in a recession. It sounds quite\nsilly in hindsight but, there you have it.</p>\n<p>At that point I also understood that web design and development is not\nsomething easily done <em>correctly</em>. Doesn't it make sense why someone would\ncharge to do it for you? Armed with this newfound knowledge I dove into the\nInternet head first and scoured it for web development tips. Often, these tips\ncame from horribly designed websites 🥴. Indeed there was a time before Envato\nand their Tuts+ tutorial sites burst onto the scene.</p>\n<h3>I Made It</h3>\n<p>Sometime in 2012 I was working retail and applying for web design/development\nroles I was <em>definitely</em> not suited for but YOLO (pretty sure YOLO wasn't said\nthen but y'know, same energy)! Just fire and forget, leave for work, come back\nhome and check email. One day I got a response back from thoughtbot<a href=\"https://thoughtbot.com\">4</a>, a\ndesign/development agency in Downtown Crossing (Boston)! One of the\nco-founders wanted me to come in and interview for their apprenticeship\nprogram. Elated, I made the trek downtown with my heavy laptop and couldn't\nwait to show off my work.</p>\n<p>My elation disappated when Chad Mazolla<a href=\"https://chad.is\">5</a> said (paraphrasing, too long ago):</p>\n<blockquote>\n<p>Your code is terrible…but your design is good. Great, even! We need more\nstuff like this on the Internet.</p>\n</blockquote>\n<p>And with that, I was in! The program lasted a few short months and while I was\nthe only one who wasn't offered a job through thoughtbot or their partner\ncompanies afterward, I will say that it was the best experience I could have\nhad at that point in my life. If nothing else, I finally had something I could\nput on my non-retail resume!</p>\n<p>Over the next couple years I would go on to do contract jobs and later work\nfor startup after startup after startup. I've worked for a \"regular\" company\nhere and there but end up going back to startups. Even though they come with\nuncertainty[FOOT2], they are often working on challenging ideas and projects\nthat can change some aspect of the world in interesting ways. I'm drawn to\nthat. I also love learning how to do things I either don't feel like learning\non my own time or never thought about learning. <em>The best teacher is\nexperience so why not <em>get paid</em> to do it?</em> This allows you to initiate\nambitious side projects solo instead of waiting/relying on someone else to get\nan MVP running.</p>\n<p>Perhaps more important than the technical skills acquired, I learned how <em>not</em>\nto treat people. Sometimes this was an analysis<a href=\"https://2016.dsgn.io/thoughts/post/the-importance-of-process\">6</a> of <em>my own behavior</em> but\nmore often than not the actions of <em>leadership</em> exemplified this.</p>\n<h3>Scenarios</h3>\n<p>The following scenarios are situations I've been on the receiving end of.</p>\n<ul>\n<li><p>You're an apprentice and a developer mentoring someone else in the program\nregularly talks over you and pumps up his apprentice whenever he can. Maybe\nhis disdain for you is because you're self-taught or was personally invited\nby the co-CEO to join the program. Or maybe the developer didn't like you\nhaving regular conversation with the (female) office manager. You're new,\nyou just want to absorb information from everywhere.</p>\n<ul>\n<li>You learn many years later that this same developer also treated\nprospective clients quite rudely.</li>\n</ul>\n</li>\n<li><p>CEO picks his nose and makes eye contact with you. This happens enough that\nyou learn how to have a blind spot whenever you turn your head and see him\nin your peripheral vision.</p>\n</li>\n<li><p>As a contractor, you end up doing the job of the guy you're reporting under\nwhile he browses Joystiq<a href=\"https://en.wikipedia.org/wiki/Joystiq\">7</a> for gaming news. You are later fired and realize\nhe threw you under the bus for his work not getting done. <em>Many</em> years later\nyou see him in a Target department store and after recognizing you he\ndiscovers a sudden interest in ceiling architecture.</p>\n</li>\n<li><p>As you're dealing with the excrutiating sorrow of miscarriage, the CEO puts\nyou on a dubious \"project\" for his father's company. A week or two later\nyou're in a firing meeting, sans CEO. In the minutes following the firing\nyou look around for the CEO to have a conversation with him but he's nowhere\nto be found, even though you just saw him five minutes prior.</p>\n</li>\n<li><p>CEO constantly lies to you and your coworkers about the health of the\ncompany and surprises y'all a week or so from Christmas <em>on pay day</em> with\n\"Hey, sorry, we can't pay you\" phone call. Money eventually shows up but\nthis happens at least once more before the company folds.</p>\n</li>\n<li><p>CEO loves your work and mindset and tasks you with unleashing your\ncreativity on core properties. Then come caveats. You create something cool,\nyou guess, with caveats because core users would be \"confused\" by drastic\nchanges. A month or so later, CEO okays a developer <em>not</em> hired for their\ndesign sensibilities to drastically redesign the core product. CEO\nreiterates your importance while restricting your expression.</p>\n</li>\n<li><p>You notice there's someone on the platform you are helping develop who has\nadvocated for harm and negative energy towards people who share your\ncreed/likeness/ethnicity. You get on a call with the CEO and he not only\ndownplays the matter but he disregards how you feel about it. He also claims\norganizations like <a href=\"https://www.splcenter.org\">SPLC</a> are disengenous and\nblow things out of proportion.</p>\n</li>\n</ul>\n<p>These scenarios are situations I've witnessed and/or stepped in to\ndefend/protect.</p>\n<ul>\n<li><p>Designers wrack their brains over new features and present to UX lead for\nher expert opinion. Idea gets shut down due to claim by lead over\n\"impossible\"[FOOT3] claims.</p>\n<ul>\n<li>I walk by and overhear the designers speaking amongst themselves, bummed\nabout yet another idea that <em>seems</em> feasible but apparently \"isn't\".</li>\n<li>I create a branch and implement their idea in ~10 minutes. Designers are\nhappy, UX lead is not.</li>\n<li>To be clear, this doesn't add extra work for anyone but me.</li>\n</ul>\n</li>\n<li><p>Back-end engineers who want something done on the front-end approach UX\nlead. \"Too much work\", \"not worth it\", \"impossible\", and so on is claimed.</p>\n<ul>\n<li>I'm present during this conversation and rattle off similar experiences\nI've had in my personal projects that relate.</li>\n<li>Developers are happy, UX lead is not.</li>\n<li>No extra work for anyone but me and it's not an obscene amount.</li>\n</ul>\n</li>\n<li><p>At an annual all-hands event, CTO speaks about how he learned the importance\nof listening from a leadership course he's been taking. 10 minutes later,\nCEO blames entire company (and himself but not really) for our lack of\ninnovation leading to the then-(still?)negative status of the company while\nthe CTO stares at the ground in deep thought.</p>\n<ul>\n<li>A developer protests accusation and mentions several instances where he\ntried to provide input, only to be shut down by CEO.</li>\n<li>Conversation turns into a shouting match.</li>\n<li>Other developers jump in to co-sign the initial protest.</li>\n<li>You later learn that some developers at the company ignore the CEO and\npursue things <em>they</em> know they need to work on.</li>\n</ul>\n</li>\n<li><p>Marketing team repeatedly express frustration with lack of\nnon-developer-friendly tooling for things like updating the company blog,\nsending email blasts, and so on. CEO is a technical developer and regularly\ndismisses them, starting sentences with things like \"It's so easy\" and \"All\nyou have to do is…c'mon, it's not so bad.\"</p>\n<ul>\n<li>I don't have much to do so I offer to improve some aspects of their job.\nAfter initial pushback I'm begrungingly allowed to do so.</li>\n<li>Two days later, I'm tasked with going about this process with caveats (and\nthrowing away substantial work in the process).</li>\n</ul>\n</li>\n<li><p>CEO has something negative to say about anyone who quits. \"He wasn't that\ngreat anyway\" and things like that, often on conference calls.</p>\n</li>\n</ul>\n<p>These are all the scenarios I could list off the top of my head. I'm a\npositive person by nature so this was an uncomfortable walk down Memory Lane.</p>\n<p>For people in the web/tech space, the aforementioned scenarios are quite\ncommon. Heck, I'm quite sure they echo what happened <em>today</em> somewhere…and you\nwitnessed it. A common thread that links the leadership mentioned (aside from\nthe CTO) is apathy; a complete lack of empathy, social\nunderstanding/awareness, or just <em>care</em>. In the comment about my self analysis\nearlier, I linked a blog post where I realized I put my ego before the team I\nwas hired to work with. I was, quite frankly, a jackass[FOOT4] and there's no\nroom for one unless you work at a zoo. Self-reflection is a useful tool you\nshould pull out every now and then and as you can probably tell, most people\ndon't utilize it.</p>\n<h3>Software is hard, relationships are easy</h3>\n<blockquote>\n<p>If you don't build your dream, someone will hire you to help build theirs.\n— Tony Gaskin</p>\n</blockquote>\n<p>I reflect upon this quote often as I help people build their dreams (startups)\nwhile also building <a href=\"https://socii.network\">my own</a>. I do believe there's been\na sea change in the industry around employee happiness and retention. Have a\nlook at job postings and you will see work satisfaction and happiness as\na perk.</p>\n<p>No one wants to work in a hostile environment and after a while, people\nrealize they don't have to put up with bullshit and they quit (or are fired\nbefore they get the chance, lol). To echo the tone of Gaskin's quote but\nmodified for business leadership:</p>\n<blockquote>\n<p>In order to build your dream, hire the best people and treat them\nlike family.</p>\n</blockquote>\n<p>Assuming you have a great family or a close cadre of friends you regard as\nfamily, would you treat them like the aforementioned leaders have? Probably\nnot. It's really not that difficult to be a decent person.</p>\n<p>One of my closest friends is in a coding bootcamp and shares his works in\nprogress with me and another close friend on a regular basis. I'm the most\ntechnical of us but what sense would it make for me to downplay his efforts?\nWhat would I gain from that? It's my responsibility to assist in his\nprofessional development because I have the means to and I consider\nhim family.</p>\n<p>A decade is a long time and software and startups come and go. Even people do.\nMemories, do not (I mean, aside from cognitive disorders).</p>\n<p>You remember the developer that treated me like shit during my apprenticeship?\nHis name came up in an interview I had two years ago via my interviewer, half\na decade later! Therefore, it is <em>imperitive</em> that you treat people how you\nwould like to be treated, your reputation could precede you whether it's\npositive or not.</p>\n<p>No matter what life-changing product you embark on or assist with creating,\nyou will get there a helluva lot faster surrounded by people who respect you\nand vice-versa. If you've forgotten about the Golden Rule, here's a\nhandy refresher<a href=\"https://en.wikipedia.org/wiki/Golden_Rule\">8</a>. 🕸</p>\n<hr />\n<p>[FOOT1]: My first domain name was <code>pw-software.com</code> (it now redirects to\n<code>webb.page</code>). Back in the early 2010s, I blogged about design and redesigned\nmy site at least three times a year. It was the <em>hottest</em> of messes. Back then\nI used Google and regularly searched for \"PW Software\" to check my search\nranking. For a while, a company called \"P+W Software\" was the first result.\nThe constant linking of my website to Facebook and deviantART improved SEO so\nmuch that I soon took the number one spot. P+W Software was later acquired<a href=\"https://www.healthcarefinancenews.com/press-release/consumer-health-technologies-inc-acquires-pw-software\">9</a>\nby another company. When ICANN released the <code>.page</code> TLD I was absolutely\n<em>required</em> to obtain what's probably the nicest domain on the planet and make\nit my new default home on the Internet.</p>\n<p>[FOOT2]: All but two startups I've worked for no longer exist. The first one\nwas acquired but I was seasonal help and thus was too far gone to delight in\ntheir success. The second one seems like it's not doing too well behind\nthe scenes.</p>\n<p>[FOOT3]: A word I hate more than almost anything (the taste of asparagus will\nbe difficult to unseat) is \"impossible\" and to hear professionals in the\nweb/tech space use this word so casually is <em>frustrating</em>. We literally have\nsupercomputers in our pockets to share <em>memes</em> but it's \"impossible\" to make\ntext with a drop shadow expand across the screen before flipping into an\nexplosion of color with emoji rain. <em>Impossible is not a word, it's\nan excuse.</em></p>\n<p>[FOOT4]: I really wanted to underscore how much of a jackass I was prior to\nthat post being published but was advised against it by leadership. This most\nlikely had something to do with editorial voice of the company but few words\nexist to exemplify negative behavior with such conciseness.</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"db49d44b16a20faa4fb8237df8784b293705b7ee958de71f67596fb58ce6b775","category":"Sites"}