{"title":"Imitate. We are imperfect mirrors.","link":"https://sive.rs/mirror","date":1391299200000,"content":"<p>\nYou know that song you love that you wish you’d written?\nCopy it.\n</p><p>\nYou know that existing business that you wish you had thought of?\nCopy it.\n</p><p>\nWhy?\nBecause we’re imperfect mirrors.\n</p><p>\n<strong>\nLike a funhouse mirror that distorts what it reflects, your imitation will turn out much different from the original.\n</strong>\nMaybe even better.\n</p><p>\nWhen a musician covers someone else’s song, they reveal their own warped perspective, since we know what the original sounds like.\nBecause of this, performing a cover song is actually a great way to define who you are as an artist.\n</p><p>\nWhen a musician writes a new song that imitates someone else’s song, almost nobody notices the similarity.\nPeople don’t make the connection unless you tell them the source of its inspiration.\n</p><p>\nSo an entrepreneur can imitate someone else’s business, and still be adding a great service to the world.\n</p><p>\nI used to believe that everything I did had to be 100 percent original.\nMy old company had a competitor that offered credit card machines to musicians.\nCustomers would tell me how much they loved that service, and even told me they wished we had it, too.\nBut copying the competitor seemed out of the question.\nIt took me a long time to swallow my pride and realize that I’d be doing my clients a favor if I imitated that idea.\nSo I copied it, and it was one of the most successful things I ever did.\nThose little credit card machines made over $8 million for thousands of musicians.\n</p><p>\nSo look around at those existing ideas in the world.\nYou can imitate them and still be offering something valuable and unique.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"db65d9c4ac180f954eaff6f61a1c328762934f2ece57bee9b1370f1d2652a500","category":"default"}