{"title":"nownownow.com","link":"https://sive.rs/now3","date":1447977600000,"content":"<p>\nA month ago I announced <a href=\"https://sive.rs/nowff\">the /now page movement</a>, where many personal websites are adding a “/now” page to answer the question, “What are you focused on now?”\n</p><p>\nAt the time, only ten websites had a /now page.\nNow there are over 280.\n</p><p>\nIt’s incredible.\nPeople are saying it helps them prioritize and focus.\n</p><p>\n<a href=\"http://gregalbritton.com/now\">Greg Albritton</a> emailed to say he made a list of everyone with a /now page.\nSo I turned that into its own website: <strong><a href=\"http://nownownow.com/\">nownownow.com</a></strong>.\n</p><p>\nIt’s been a fun programming project.\nI’ve been doing it full-time for the past month.\n(Thanks to <a href=\"https://github.com/SaschaKrause\">Sascha Krause</a> in Berlin for contributing a better design.)\n</p><p>\nThen Greg wanted to do feature profiles, so he came up with six questions that I asked everyone.\nNow if you click the (+) by any link on <a href=\"http://nownownow.com/\">nownownow.com</a>, it will bring you to a page where you can get to know the person behind the site.\n</p><p>\nIt’s addicting and inspiring to browse these profiles, and visit their sites.\nThere’s a Twitter account — <a href=\"https://twitter.com/NowNowNow\">@NowNowNow</a> — that tweets out a link to a new profile every hour.\n</p><p>\nPeople have told me they are getting a good amount of traffic to their site from people browsing <a href=\"http://nownownow.com/\">nownownow.com</a>, so…\n</p>\n<h3>\nHow to add yours?\n</h3>\n<p>\n<strong>If you already have a website</strong>, just add a new page.\nIf you’re using WordPress, look for “Pages” on the left, and choose “Add New”.\nGive it a “permalink” of /now.\n(Sorry I can’t help with tech support.)\n</p><p>\nWrite something about what you’re doing now, and publish.\n<strong>Once it’s online, <a href=\"https://sive.rs/contact\">email me the link</a>, and I’ll add it to nownownow.com.</strong>\nAfter it’s up, I’ll ask you the questions for a profile page.\n</p><p>\n<strong>If you don’t have a website</strong>, but have been meaning to get one, create a free one at <a href=\"https://bearblog.dev/\">Bear</a>.\nBefore you announce it, I highly recommend getting your own domain name at <a href=\"https://porkbun.com/\">Porkbun</a>.\nPoint your domain to your Bear blog, and use that.\n(Again, sorry I can’t help with tech support, but this is very common stuff, so anyone else can.)\n</p>\n<h3>\nWhat now?\n</h3>\n<p>\nSomeone asked me what my vision is for the /now page movement.\nBut I’ve never had one.\nI just enjoy being of service.\n<strong>\nPeople tell me what they want, and if it’s something I can do, I do.\n</strong>\n</p><p>\nSo if you have a good idea for what this could use or could be, please leave a comment here, or <a href=\"https://sive.rs/contact\">email me</a>.\n</p>\n<a href=\"http://nownownow.com/\"><img src=\"/images/nowclock.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"db69f1dd1c9acd9ae249dedaddca40852e63aae8a6b0c4ad1c2f6afb05295428","category":"Sites"}