{"title":"Information and Knowledge Yield Loss Across Transcoding Eras","link":"https://ghuneim.com/2024/08/10/information-yield-loss-across-transcoding-eras/","date":1723289089000,"content":"<p>As someone who’s lived through the dizzying pace of technological change, I’ve been fascinated by how we’ve transformed the way we store, share, and understand information.</p>\n<p>However this aspect really haunts me:  With each leap forward, we are leaving something important behind.</p>\n<p>Through each “transcoding era”,  aggregate intelligence information loss.  At least three major ones, each has brought incredible advancements, but also introduced “yield loss” – a concept borrowed from manufacturing that I think applies perfectly to our data-driven world.</p>\n<p>From Physical to Digital</p>\n<p>The first era was all about turning physical stuff into digital format. Books became e-books, vinyl records turned into MP3s, and film reels transformed into digital video files. It was mind-blowing at the time. Suddenly, we could carry entire libraries in our pockets!</p>\n<p>Many things were lost in translation. Remember the warmth of vinyl records? Or the smell of old books? Early digital tech couldn’t capture those sensory experiences. We gained convenience, sure, but at the cost of some of the richness that made those physical mediums special.</p>\n<p>I sit now in a massive room filled with legacy media that i can pick up and touch, regard, play and read that did not make this first leap and likely never will.</p>\n<p> </p>\n<p>The Internet Age</p>\n<p>Cue:  internet,  Information at our fingertips, instant communication across the globe. But in our rush to make everything faster and more accessible, we started cutting corners.</p>\n<p>To squeeze data through limited bandwidth, we compressed files until videos looked like pixelated messes and music lost its depth. We chopped up long-form content into bite-sized chunks for quick consumption – micro chunking it as we called it at the turn of the century.   Further reduction.</p>\n<p>At each turn, loss of information that did not make the cut for whatever reason, and a lessening and reduction in cases that did make it.</p>\n<p>RIP Newsgroups, a valued shared source of organized information lost.  (Forget about the Archie and Gopher and all the BBS’s)</p>\n<p>Web 2.o emerged and in the M&amp;A of that decade valuable two dot o companies and information  was  lost including, del.icio.us,  o.g. services like Flickr, Tumblr et al.  So past information that did not make the leap – there is a giant digital gap of aggregate knowledge sources</p>\n<p> </p>\n<p>AI Takes the Wheel</p>\n<p>Now we’re entering a new era, Artificial Intelligence is starting to infer, interpret, analyze, synthesize and even create information on its own.</p>\n<p>Andrew Gray, a librarian at University College London, trawled through millions of papers searching for the overuse of words such as meticulous, intricate or commendable.</p>\n<p><a href=\"https://arxiv.org/abs/2403.16887v1\">He determined that at least 60,000 papers involved the use of AI in</a> 2023 — over one percent of the annual total. “For 2024 we are going to see very significantly increased numbers,” Gray told AFP.</p>\n<p>Another reduction of source material, further loss of context and over all diminishment.</p>\n<p> </p>\n<p>Perspective</p>\n<p>I am of the singular generation who grew up BC (before computers) but thrived as an adult in the computational era (AC).  We are the only humans who have this perspective and time is eroding our information and knowledge and digital is decaying it.</p>\n<p> </p>\n<p>So, What Can We Do About It?</p>\n<p>How do we develop systems that preserve the richness of human experience and does not leave off the long tail and expressly look for it to be included? How do we find ways to keep the convenience of digital formats without sacrificing quality? How do we include the most robust set of information that carries forward.  What are we leaving behind?</p>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"db9342a8b573a831e46c2b7bb0f4e0d1d9a4afff5faeb9c759b094db21a171b0","category":"default"}