{"title":"Want anonymity? Make a persona not a mystery.","link":"https://sive.rs/anon","date":1675296000000,"content":"<p>\nBecause of my <a href=\"https://sive.rs/contact\">open inbox</a>, I meet a lot of strangers.\nI love it.\nAlmost everyone tells me who and where they are in the world.\n<strong>\nIf they don’t, I wonder.\n</strong>\n</p><p>\nAm I talking with someone from Australia? Philippines? Brazil?\nAre they 20 or 60?\nMale or female?\nIt doesn’t really matter, but the brain can’t help wondering.\nIt’s human nature to want to know who’s speaking.\n<strong>\nIf they don’t say, it creates a mystery.\n</strong>\n</p><p>\nFilms do that to deliberately engage curiosity.\nA voiceover on a black screen says, “It took me a long time to get here.”\nYou immediately wonder, “Who is ‘me’? Get where? What happened?”\n</p><p>\nOnce people start wondering, they need to know.\n<a href=\"https://sive.rs/mystery\">\nMysteries are intriguing.\n</a>\nThey’re unsettling.\n</p><p>\n<strong>\nThat’s a problem if you really want to be anonymous.\n</strong>\nIf you defiantly refuse to say who you are, it can make people angry that you’re upsetting social reciprocity.\nYou know who they are, but they don’t know who you are.\nIt feels rude.\nAn obsessive personality might make it their damn mission to figure out who you are!\nYou don’t want that.\n</p><p>\nSo for real anonymity, don’t create a mystery.\n<strong>\nCreate a believable persona.\n</strong>\nThen nobody will wonder.\n</p><p>\nIf you don’t want any attention, just pick a <a href=\"https://www.verymanynames.com/which-name-is-most-common-in-the-world/\">very common name</a> like <a href=\"https://www.facebook.com/public/Mary-Kim\">Mary Kim</a> or <a href=\"https://www.facebook.com/public/Adam-Johnson\">Adam Johnson</a>.\n</p><p>\nUse an <a href=\"https://duckduckgo.com/?q=this+person+does+not+exist\">AI face generator</a> to create a completely believable face to match your new name.\nDownload it once and use it everywhere.\nRun it through <a href=\"https://duckduckgo.com/?q=ai+face+aging\">face aging software</a> to use this same persona for the rest of your life.\n</p><p>\nPick a city and say it’s your location, to avoid that question too.\n</p><p>\nFor email, <a href=\"https://mailbox.org/\">Mailbox.org</a> is great, and doesn’t care who you are.\n</p><p>\nCreate social media profiles with your new name, email, city, and face.\n</p><p>\n<strong>\nNobody will wonder who you are if you answer that question.\n</strong>\nInstead of block and battle, deflect and settle.\nThat’s better anonymity.\n</p><p>\nBut <strong>if you want to be both anonymous and <a href=\"https://sive.rs/publicu\">famous</a></strong>, pick a name that is rare but believable.\nCool but not too cool.\nTom Kahlo.\nKeaton Carolina.\nMiles Wenley.\nPick a name that has <a href=\"https://porkbun.com/products/domains\">the .com domain</a> available, so you can really brand it.\n</p><p>\nNow you can create anything online freely, and nobody will doubt your identity.\nCreate and post a back-story to answer (instead of avoid) the frequently asked questions.\nThen, instead of wondering who you really are, they can focus on what you’re really saying.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"dc1ad94e22f5e1495407644495cbb7405107a327fe87de85a2a606d954dd8f68","category":"Sites"}