{"title":"The Meaning of Life","link":"https://sive.rs/ml","date":1399248000000,"content":"<p>\nLet’s just figure out the meaning of life, once and for all, in under 20 minutes, OK?\n</p><p>\nThis is a 19-minute talk I’ve given at four conferences in Ireland, Taiwan, India, and New Zealand.\nI’ve improved it after each, and finally consider it done, so this is now the best and final recording of it.\n</p><p>\nThe video doesn’t add much, so if you would rather just listen, <a href=\"https://sivers.b-cdn.net/DerekSivers-MeaningOfLife.mp3\">download the MP3</a>.\n</p><p>\nThe video should be visible below, but if not, <a href=\"https://sivers.b-cdn.net/DerekSivers-MeaningOfLife.mp4\">download the MP4 video</a>.\n</p>\n\n<p>\nHuge thanks to some friends who suggested great improvements:\n<a href=\"https://www.michellewelsch.com/\">Michelle Welsch</a>,\n<a href=\"https://tynan.com/\">Tynan</a>,\n<a href=\"https://alytadros.com/\">Aly Tadros</a>, and\n<a href=\"https://en.wikipedia.org/wiki/Jeff_Marx\">Jeff Marx</a>.\n</p><p>\nAlso thanks to a hundred drunk programmers in Ireland who shouted and sang their way through my first performance of it, standing on chairs at the end of a Saturday night.\n</p><p>\nIf you would like to make a better video for this talk, please do.\n<a href=\"https://sivers.b-cdn.net/DerekSivers-MeaningOfLife.wav\">Download the master WAV audio</a>, and let me know when it’s done.\nAssuming I like it, I’ll be happy to link to it here.\n</p><p>\nHere’s the full transcript, if you hate surprises and my charming voice:\n</p>\n<hr />\n<h3>\nTranscript:\n</h3>\n<p>\nThere’s a true story about the student who showed up late to math class.\nHe copied the problem that was already written on the board, assuming it was homework, and solved it that week.\nOnly afterwards did he find out the teacher put it on the board as an example of an unsolvable problem.\n</p><p>\nThis question — “What is the meaning of life?” — is the classic unsolvable problem.\nFor thousands of years, people have been trying to figure it out.\nIt’s the punchline cliché of unanswerable questions.\n</p><p>\nBut right now, let’s be the naive ones that don’t know it’s considered unsolvable, and just figure out the meaning of life in under 20 minutes.  OK?\n</p>\n<h4>\nLIFE IS __________\n</h4>\n<p>\nWhat word do you think goes in that blank?\nLife is what?\nAny ideas?\n</p><p>\nLet’s look at some of the different options that philosophers and smarties have said.\n</p>\n<h4>\nLIFE IS TIME\n</h4>\n<p>\nSome say life is time.\nLife is all about time.\nThe definition of life is the time between when you’re born and when you die.\nSo the literal meaning of life is time.\n</p><p>\nSo if life is time, the way to have a good life is to use time wisely.\n</p><p>\nHow can you use time wisely?\nFive ways.\n</p>\n<ol>\n<li>\nRemember it’s limited\n<p>\nIf you find out tonight that you’ve only got one year left to live, you’ll make the most of this next year.\nIf you act like life is infinite, you won’t.\n</p><p>\nTo achieve great things, two things are needed: a plan, and not quite enough time.\n</p><p>\nGive yourself tight deadlines.\nRemember you could die at any time.\nDon’t delay.\n</p><p>\nHow can you use time wisely?\n</p></li><li>\nBe mostly future-focused\n<p>\nMake most of your current actions serve your future self.\nLearn, practice, exercise, delay gratification, save and invest your money, and build towards your ideal future.\nPeople who do this are more successful and even happier.\n</p><p>\nBut too much future focus leads to being a successful person on your 4th marriage, with no true friends.\nToo much future focus can take time away from important things that need you to be in the moment.\n</p><p>\nHow can you use time wisely?\n</p></li><li>\nBe somewhat present-focused\n<p>\nSometimes, pull your head out of the future, and give your full attention to the present.\nRelationships, communication, and sex require this.\n</p><p>\nBut too much present focus is hedonism: living only for immediate gratification with as much excitement and novelty as possible.\n</p><p>\nToo much present focus leads to an empty bank account and no impulse control.\n</p><p>\nToo much present focus robs you of the deeper happiness of delayed gratification, achieving long-term goals, and developing valuable expertise.\n</p><p>\nHow can you use time wisely?\n</p></li><li>\nBe somewhat past-focused\n<p>\nTo remember your past is to live twice.\n</p><p>\nKeep your life in the context of the past, to see how far you’ve come.\n</p><p>\nPut aside time to re-interpret your past events, as a powerful reminder that you can re-interpret your present and future, too.\n</p><p>\nHow can you use time wisely?\n</p></li><li>\nGet in the zone\n<p>\nYou know the feeling of flow — where you’re focused on work that’s not too easy and not too hard — where the work itself has clear goals and is its own reward.\n</p><p>\nPeople at the end of their life who claimed to be the happiest with their life were the ones who had spent the most time in this state of flow.\n</p><p>\nFor a good life, pursue the work that puts you in this state, and avoid the things that pull you from this state.\n</p>\n</li>\n</ol>\n<p>\nLet’s say life is time.  What do you think?  Pretty good argument?\n</p><p>\nLet’s look at another perspective.\n</p>\n<h4>\nLIFE IS CHOICE\n</h4>\n<p>\nSome say life is choice.\nLife is all about choice.\nYou make a hundred little choices a day, and a hundred big choices in your life.\nThese choices change your entire life.\nYour life is created by your choices.\nTherefore life IS choice.\n</p><p>\nSo if life is choice, the way to have a good life is to make good choices.\n</p><p>\nHow can you make good choices?  Four ways.\n</p>\n<ol>\n<li>\nLet instinct trump logic\n<p>\nThe different parts of your brain started developing at different periods in evolution.\nThe oldest part of your brain, the one that’s been evolving since we were fish, deals with instincts, fears, and gut feelings.\nThe newest part of your brain, the one that’s pretty uniquely human, deals with logic, language, and predictions.\n</p><p>\nThis newest part is still in beta.\nA $5 calculator can beat it at math.\nBut this oldest part was launched a billion years ago, and has been in production and development ever since.\n</p><p>\nEverything you observe and learn is first processed by your logical brain, but then the results are permanently stored as instincts, fears, and gut feelings.\nYour instincts and emotions hold the culmination of everything you’ve ever observed and learned.\nSo you’ll make better choices if you listen your instincts, instead of relying too much on your $5 calculator beta brain.\n</p><p>\nHow can you make good choices?  \n</p></li><li>\nStop at good enough\n<p>\nYou now have more options than ever.\nYou try to choose the best option, the best career, the best school, and the best boyfriend/girlfriend/partner/spouse.\n</p><p>\nBut thinking this way makes you feel worse about the choices you’ve made.\nYou’re more aware than ever of all the options you didn’t choose, and the benefits of each.\n</p><p>\nSo don’t seek the absolute best. Stop when you find an option that is good enough.\nYou’ll make an equally good choice, but more importantly, you’ll feel much better about it.\nHappiness counts.\n</p><p>\nHow can you make good choices?\n</p></li><li>\nSet limits\n<p>\nEvery choice you have to make causes a little bit of pain.\nHaving choice in life is good, but having more choice is not always better.\n</p><p>\nYou’re happier when you let other people make some choices for you.\nIf you’re very sick, you want your doctor to choose what’s best, not say, \"There are dozens of good options. What do you want to do?\"\nThis is the appeal of religion.\nIt gives you rules.\nIt makes many of the choices for you.\n</p><p>\nSo set limits to your choices in life.\nCut off some options.\nGive yourself rules.\n</p><p>\nHow can you make good choices?\n</p></li><li>\nChoose important not urgent\n<p>\nYou know the difference between what’s long-term important versus short-term urgent.\n</p><p>\nWhat’s urgent are emails, texts, tweets, calls, and news.\n</p><p>\nWhat’s important is spending a thousand hours to learn a new skill that will really help you in your life or work.\nWhat’s important is giving your full undistracted attention to the important people in your life.\nWhat’s important is taking time to get exercise, or to collect and share what you’ve learned.\n</p><p>\nBut none of these things will ever be urgent.\n</p><p>\nSo you have to ignore the tempting cries of the urgent, and deliberately choose what you know is important.\n</p>\n</li>\n</ol>\n<p>\nSo life is choice?\nWhat do you think?\nPretty good argument?\nLet’s try another.\n</p>\n<h4>\nLIFE IS MEMORY\n</h4>\n<p>\nSome say life is memory.\nThe future doesn’t exist.\nIt’s something we imagine.\nThe present is gone in a millisecond, so everything we experience in life is a memory.\nYou could live a long life, but without a lot of memories, you only experienced a short life.\nIf you don’t remember your life, it’s like it never happened.\nSo life is memory.\n</p><p>\nSo if life is memory, the way to have a good life is to make more memories.\n</p><p>\nHow can you make memories?\n</p><p>\nChange routines.\nBreak monotony.\nMove.\nMake a major change whenever you can.\nThese are your chronological landmarks.\nThese are the hooks where you’ll hang your memories.\n</p><p>\nDocument it.\nBlog it.\nNot in a company’s walled garden, but in a format you can archive and look through in 50 years, or your grandkids can look through in 100 years.\nKeep a private blog for your future self, and tell the tales of where you’ve been, what you did, and the quirky people you’ve met along the way.\nYou’ll be surprised how much you forget if you don’t record it.\n</p><p>\nSocrates said the unexamined life is not worth living.\nWhat about the forgotten life?\n</p><p>\nSo life is memory?\nWhat do you think?\nWant to do another?\n</p>\n<h4>\nLIFE IS LEARNING\n</h4>\n<p>\nBoth my smart friends and my spiritual friends insist that the meaning of life is learning — that the reason you’re here is to learn.\nNot just for your own sake, but for everyone alive, and future generations, the meaning of your life is to learn.\n</p><p>\nSo if life is learning, the way to have a good life is to learn a lot.\n</p><p>\nHow can you learn a lot?\n</p><p>\nInstead of talking about learning techniques, let’s talk about getting the right mindset, so you can learn more than you realize.\n</p><p>\nYou’ve probably heard about the Fixed mindset and the Growth mindset.\n</p><p>\nThe Fixed mindset says, \"I am good at this\" or \"I am bad at this\".\nThis starts in childhood when your parents say, \"You’re so good at math!\"\nYou think, \"I’m good at math!\"\nBut then when you do poorly on one test, you think, \"They were wrong.  I’m not good at math.”\nMost people think this way.\nYou can hear it when they say, “She’s a great singer” or “I’m just no good at dancing.”\n</p><p>\nThe Growth mindset says, \"Anyone can be good at anything. Skill comes only from practice.\"\n</p><p>\nTwo impossibly hard tests were given to hundreds of children.\nAfter the first test, all of the students were praised, but half of the students were privately told these 6 words: \"You must be good at this.\"\nThe other half were privately told these 6 words: \"You must have worked really hard.\"\n</p><p>\nWhen they were given the second test, the students who were told, \"You must be good at this\", did 20% worse on the 2nd test.\nThose 6 words encouraged a fixed mindset that made them feel there was no point in trying.\nYou either are or you aren’t.\n</p><p>\nThe students who were told \"You must have worked really hard\", did 30% better on the 2nd test.\nThose 6 words encouraged a growth mindset that made them feel that working harder made all the difference.\n</p><p>\nSo that’s a +-50% difference in performance because of 6 quick words by one teacher.\n</p><p>\nMultiply that by all the people in your life, all the days you hear feedback, and all the things you tell yourself, and you can see how this simple difference in mindset can make or break a life of learning.\n</p><p>\nParents, pay attention to this.\nYou may be harming your kids when you tell them they’re good at things.\n</p><p>\nSuccessful people, pay attention to this.\nYou may be harming yourself if you believe the praise that people give you.\nPeople tell you you’re great at what you do, never just that you must have worked hard.\n</p><p>\nSo... life is learning?\nWhat do you think?\n</p>\n<h4>\nSomething else?\n</h4>\n<ul>\n<li>\nShould we look at the Buddhist idea that life is SUFFERING?\nNah, that’s no fun.\n</li><li>\nLife is LOVE?\nToo ambiguous.\n</li><li>\nLife is NOTHING BUT REPLICATING DNA?\nToo accurate.\n</li></ul>\n<p>\nLet’s change the subject.\n</p>\n<h4>\nChinese\n</h4>\n<p>\nA few years ago, I started learning Chinese.\nI’m fascinated with the writing.\nI’m trying to memorize how to write these characters.\n</p><p>\nChinese characters look complicated, but they’re mostly made up of smaller simpler characters, the way that English words are made up of Latin roots and such.\nSo you can remember the meaning of each character by knowing the meaning of its ingredients.\nFor example:\n</p><p>\n语 language = words 讠+ five 五+ mouth 口\n</p><p>\nSo... Language is words that at least five mouths speak? Brilliant!\n</p><p>\n谢 thank you = words 讠+ body 身+ inch 寸\n</p><p>\nHmmm... This one is not so obvious.\nMaybe the idea is that when you say thanks, you speak words that give a body an inch of respectful space?\nThat’s interesting.\n</p><p>\n名 name = evening 夕 + mouth 口\n</p><p>\nSo your real name is what’s spoken by a mouth in the evening?\nThat’s kind of romantic.\n</p><p>\nI get so curious about the historical or cultural meaning behind each one.\n</p><p>\nLet’s change the subject.\n</p>\n<h4>\nTalking Heads\n</h4>\n<p>\nTalking Heads were a great band from the late-70s to mid-80s.\nTheir lyrics were really evocative and mysterious.\nThey made you wonder what they were really about. \n</p><p>\nThen I read an interview with the Talking Heads where they said that many of their lyrics were just random.\nThey would write evocative phrases onto little pieces of paper, then throw them into a bowl, and shuffle them up.\nThen they’d pull them out, and put them into the song in that order.\nThey did this because they liked how the listener creates meaning that wasn’t intended.\n</p><p>\nWe assume that if someone writes a song, then sings it on stage into a microphone, that it must have meaning to them.\n</p><p>\nBut nope.\nIt was just random.\nAny meaning you think it contains was put there by you, the listener, not the writer.\nLike a Rorschach test.\n</p>\n<h4>\nBack to Chinese\n</h4>\n<p>\nI got so curious about the historical meaning of these Chinese characters that I got a Chinese etymological dictionary that tells the full history behind every one.\n</p><p>\nI looked up the examples I gave here, and found out those characters were just phonetic!\nThose composite character bits were NOT chosen for their meaning at all, just their sound!\n</p><p>\nSo it seems I’ve just been putting the meanings into them, myself.\nThey actually had no meaning at all!\n</p><p>\nIt blew my mind.\nI had been memorizing hundreds of characters for months, reading all kinds of meaning into the ingredients of each one.\n</p><p>\nAfter recovering from that, I thought:\nHow many other things in life really have no meaning?\nWhat else have I been putting my own meaning into, thinking it was true?\n</p>\n<h4>\nWired\n</h4>\n<p>\nI know that we’re wired to do it.\nI know we survived on the savannah for eons because we evolved to look for patterns.\nOur ancestors are the ones who noticed the patterns of the tiger stripes or the lion face in the grass.\n</p><p>\n<strong>A moth is so deeply wired to fly towards the light that it may never accept that your light bulb is not the moon.</strong>\n</p><p>\n<strong>We are so deeply wired to find patterns that we may never accept that many things are just random.</strong>\n</p><p>\nWe should have the same sympathy for our faulty wiring as we do for the moth.\nEvolution taught us to do this thing, but didn’t teach us to stop.\n</p><p>\nGive us some dots and a line, and we’ll see a face.\nBurn some toast and we’ll find Elvis in it.\n</p><p>\nA carrot from my garden looks like Jesus.\nWhat does it mean?\n</p><p>\nA black cat crossed my path as I walked under a ladder on Friday the 13th.\nWhat does it mean?\n</p><p>\nAn old friend calls just a minute after I was thinking about them.\nWhat does it mean?\n</p><p>\nWhat does it mean that you went to a prestigious well-known school? \nWhat does it mean that you didn’t?\n</p><p>\nWhat does it mean that your good friend died? \nWhat does it mean that you’re tall?\n</p><p>\nWhat does it mean that you have a lot of followers online?\nWhat does it mean that you don’t?\n</p><p>\nWhat does it mean that you’re female?\nWhat does it mean that you’re male?\n</p><p>\nWhat does it mean that you’re an entrepreneur?\nWhat does it mean that you’re not?\n</p><p>\nWhat does it mean that all of your previous attempts at something have failed?\n</p><p>\nNothing!  Nothing at all.\n</p><p>\nNothing has inherent meaning.\nEverything is only what it is and that’s it.\n</p><p>\nSo let’s get back to our original question and wrap this up.\n</p>\n<h4>\nLife Is _____\n</h4>\n<p>\nWhat is the meaning of life?  LIFE IS ______\n<br />\nTIME?\n<br />\nCHOICE?\n<br />\nMEMORY?\n<br />\nLEARNING?\n<br />\nSUFFERING?\n<br />\nLOVE?\n<br />\nREPLICATING DNA?\n</p><p>\nYou can tell by the variety of answers that they are just projected meanings.\n</p><p>\nYou can choose to project one of these meanings onto your life, if it makes you feel good, or improves your current actions.\n</p><p>\nBut you know the real answer is clear and obvious now.\n</p><p>\nLife is (just) life.\nIt doesn’t <strong>mean</strong> anything.\n</p><p>\nErase any meaning you put into past events.\nErase any meaning that’s holding you back.\nErase those times where people said that this means that.\nNone of it is real.\n</p><p>\nLife has no inherent meaning.\nNothing has inherent meaning.\n</p><p>\nLife is a blank slate.\n</p><p>\nYou’re free to project any meaning that serves you.\n</p><p>\nYou’re free to do with it, anything you want.\n</p><p>\nThank you.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"dc21d16f9c00f3aaf170651858d0e30c35ed9e8224db5bed6f7277d81c9a47f2","category":"default"}