{"title":"Kafka’s Creative Block and the Four Psychological Hindrances That Keep the Talented from Manifesting Their Talent","link":"https://www.themarginalian.org/2024/10/20/kafka-diaries-self-doubt/","date":1729452220000,"content":"<p><a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"494\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?fit=320%2C494&amp;ssl=1\" alt=\"Kafka’s Creative Block and the Four Psychological Hindrances That Keep the Talented from Manifesting Their Talent\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?w=777&amp;ssl=1 777w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=320%2C494&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=600%2C927&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/kafka_diaries.jpg?resize=768%2C1186&amp;ssl=1 768w\" /></a></p><p>The most paradoxical thing about creative work is that it is both a way in and a way out, that it plunges you into the depths of your being and at the same time takes you out of yourself. Writing is the best instrument I have for metabolizing my experience and clarifying my own mind in such a way that I am no longer captive to it. All creative work is at bottom a means of self-liberation and a coping mechanism — for the loneliness, the despair, the chaos and contradiction within. It is the best means we have of transmuting that which gnaws at us into something that nourishes, and yet how little of that private ferment is visible in the finished work. </p>\n<p>This is why I <a href=\"https://themarginalian.org/tag/diaries\">love diaries</a>, with their rare glimpse of the inner worlds that lavish our own with beauty and truth, with nourishment of substance and sweetness that endures for epochs after the lives that made it are no more. </p>\n<p>Of all the writers and artists who have kept a journal as <a href=\"https://www.themarginalian.org/2014/09/04/famous-writers-on-keeping-a-diary/\">a means of creative catalysis</a> and <a href=\"https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/\">a salve for self-doubt</a>, no one has confronted the internal saboteur of creativity — those psychic hindrances that stand between the talented and the fruition of their talent — more pointedly than <strong>Franz Kafka</strong> (July 3, 1883–June 3, 1924). </p>\n<figure><a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2014/06/franzkafka1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Franz Kafka</figcaption></figure>\n<p>“I won’t give up the diary again. I must hold on here, it is the only place I can,” he vows at the outset of his <a href=\"https://www.amazon.com/Diaries-Franz-1910-1923-Schocken-Library/dp/0805209069/?tag=braipick-20\" target=\"_blank\"><strong><em>Diaries: 1910–1923</em></strong></a> (<a href=\"https://search.worldcat.org/title/183927241\" target=\"_blank\"><em>public library</em></a>) — the journal that became part creative sandbox, part metronome of discipline, part exorcism for self-doubt as Kafka was trying to live into his creative calling while working as an insurance salesman. “I want to write, with a constant trembling on my forehead,” he declares, and yet over and over he indicts himself for falling short of his desire, for thwarting his talent with insecurity and lack of discipline. “Wrote nothing,” he laments in entry after entry. “Have written nothing for three days,” he sulks as his creative block consumes him. “Bad,” he declares a perfect spring day for having produced no writing. By early summer, he is in despair:</p>\n<blockquote><p>Nothing written for so long. Begin tomorrow. Otherwise I shall again get into a prolonged, irresistible dissatisfaction; I am really in it already. The nervous states are beginning. But if I can do something, then I can do it without superstitious precautions.</p></blockquote>\n<p>The reasons for Kafka’s creative block are various: By turns he finds himself drowning in loneliness, enraged by distraction, physically fatigued and pained by the tuberculosis that would soon take his life, tortured by his era’s version of an overflowing inbox: heaps of unanswered letters. He feels his powers being wasted, feels himself “wretched, wretched, and yet with good intentions,” feels the “absolute despair” of trying and failing to write. The diary itself becomes his watering hole through the dry spells:</p>\n<blockquote><p>Hold fast to the diary from today on! Write regularly! Don’t surrender! Even if no salvation should come, I want to be worthy of it at every moment.</p></blockquote>\n<p>On its pages, universal patterns emerge: In his private and particular turmoils, Kafka touches again and again on what I consider the four great perils standing between us and our gifts — those psychic hindrances of which we may not always be consciously aware, but we which experience palpably and painfully as creative block. </p>\n<figure><a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=680%2C728&amp;ssl=1\" width=\"680\" height=\"728\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=320%2C342&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=600%2C642&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=240%2C257&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/07/DiscusChronologicus_small.jpg?resize=768%2C822&amp;ssl=1 768w\" /></a><figcaption><em>Discus chronologicus</em> — a German depiction of time from the early 1720s, included in <a href=\"https://www.themarginalian.org/2012/02/07/cartographies-of-time/\"><em>Cartographies of Time</em></a>. (Available as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/discus-chronologicus-german-time-model-from-the-1720s_wall-clock?curator=brainpicker\" target=\"_blank\">a wall clock</a>.)</figcaption></figure>\n<h5>4. TIME-ANXIETY</h5>\n<p>Savaged by shame at his writing, Kafka regularly winces at his sentences, then reasons:</p>\n<blockquote><p>I explain it to myself by saying that I have too little time and quiet to draw out of me all the possibilities of my talent.</p></blockquote>\n<p>Baldwin would have had <a href=\"https://www.themarginalian.org/2016/02/08/james-baldwin-advice-on-writing/\">something to say about that excuse</a>, which Kafka himself sees crumble: During a rare respite from his ordinary time-lament — that his day job at the insurance company is taking too much energy away from writing — he finds himself not using the windfall gain to write:</p>\n<blockquote><p>This month, which, because of the absence of the boss, could have been put to exceptionally good use, I have wasted and slept away without much excuse… Even this afternoon I stretched out on the bed for three hours with dreamy.</p></blockquote>\n<p>Such is the bi-polar nature of time-anxiety in creative work: Alongside the feeling of not having enough time is also the time-dilating experience of procrastination — the paradoxical paralysis many gifted people feel at the prospect of living up to and into their gifts. Kafka writes:</p>\n<blockquote><p>Idled away the morning with sleeping and reading newspapers. Afraid to finish a review for the <em>Prager Tagblatt</em>. Such fear of writing always expresses itself by my occasionally making up, away from my desk, initial sentences for what I am to write, which immediately prove unusable, dry, broken off long before their end, and pointing with their towering fragments to a sad future.</p></blockquote>\n<p>“Wasted day,” he groans in another entry. And yet he has the wisdom to recognize that procrastination — “the shameful lowlands of writing” — has a purpose:</p>\n<blockquote><p>Stretching in the presence of the maid and saying, ‘I’ve been writing until now.’ The appearance of the undisturbed bed, as though it had just been brought in… I am in the shameful lowlands of writing. Only in this way can writing be done, only with such coherence, with such a complete opening out of the body and the soul.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2012/03/15/the-three-astronauts-umberto-eco/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2012/03/threeastronauts12.jpg\" /></a><figcaption>Art from <a href=\"https://www.themarginalian.org/2012/03/15/the-three-astronauts-umberto-eco/\"><em>The Three Astronauts</em></a> — Umberto Eco’s vintage semiotic children’s book about world peace</figcaption></figure>\n<h5>3. WORLD-ANXIETY</h5>\n<p>To be an artist is to feel life deeply, to tremble with the terrors of everything that trembles. As the first global war is painting the world around him black, Kafka sinks into an inner darkness, his anxiety rising to untenable heights:</p>\n<blockquote><p>The thoughts provoked in me by the war… devour me from every direction. I can’t endure worry, and perhaps have been created expressly in order to die of it.</p></blockquote>\n<p>The writing stalls again as he sorrows with the world’s sorrow: </p>\n<blockquote><p>Again barely two pages. At first I thought my sorrow over the Austrian defeats and my anxiety for the future (anxiety that appears ridiculous to me at bottom, and base too) would prevent me from doing any writing. But that wasn’t it, it was only an apathy that forever comes back and forever has to be put down again. There is time enough for sorrow when I am not writing.</p></blockquote>\n<p>Kafka would die of tuberculosis while the war is still raging.</p>\n<figure><a href=\"https://www.themarginalian.org/2015/10/19/harry-clarke-faust/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/10/harryclarke_faust24.jpg\" /></a><figcaption>One of Harry Clarke’s haunting 1925 <a href=\"https://www.themarginalian.org/2015/10/19/harry-clarke-faust/\">illustrations for Goethe’s <em>Faust</em></a></figcaption></figure>\n<h5>2. SELF-COMPARISON</h5>\n<p>Few things maim an artist’s confidence more savagely than self-comparison, which breeds the two most pernicious species of despair in creative work: insecurity and envy, always entwined in a singularly damaging form of learned helplessness. While working on what would become his first published short story, Kafka acquires a volume of <a href=\"https://www.themarginalian.org/2015/08/28/conversations-of-goethe-eckermann-creativity/\">Goethe’s conversations</a> and finds himself completely blocked:</p>\n<blockquote><p>So passes my rainy, quiet Sunday, I sit in my bedroom and am at peace, but instead of making up my mind to do some writing, into which I could have poured my whole being the day before yesterday, I have been staring at my fingers for quite a while. This week I think I have been completely influenced by Goethe, have really exhausted the strength of this influence and have therefore become useless.</p></blockquote>\n<p>Nearly a month later, he is still immersed in and paralyzed by Goethe. After yet another “wrote nothing,” he records:</p>\n<blockquote><p>The zeal, permeating every part of me, with which I read about Goethe (Goethe’s conversations, student days, hours with Goethe, a visit of Goethe’s to Frankfort) and which keeps me from all writing.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/11/atthedropofacat1.jpg\" /></a><figcaption>Art by Violeta Lópiz for <a href=\"https://www.themarginalian.org/2023/11/16/at-the-drop-of-a-cat/\"><em>At the Drop of a Cat</em></a></figcaption></figure>\n<h5>1. SELF-DOUBT</h5>\n<p>“I cannot believe that I shall really write something good tomorrow,” Kafka forebodes in one entry. In another, he declares himself “an almost complete failure in writing.” He is torn between determination and despair:</p>\n<blockquote><p>I will write again, but how many doubts have I meanwhile had about my writing? At bottom I am an incapable, ignorant person who, if he had not been compelled — without any effort on his own part and scarcely aware of the compulsion — to go to school, would be fit only to crouch in a kennel, to leap out when food is offered him, and to leap back when he has swallowed it.</p></blockquote>\n<p>With his characteristic drama for metaphor, he writes in the winter of his twenty-eighth year:</p>\n<blockquote><p>It is as if I were made of stone, as if I were my own tombstone, there is no loophole for doubt or for faith, for love or repugnance, for courage or anxiety, in particular or in general, only a vague hope lives on, but no better than the inscriptions on tombstones. Almost every word I write jars against the next, I hear the consonants rub leadenly against each other… My doubts stand in a circle around every word, I see them before I see the word, but what then! I do not see the word at all, I invent it. Of course, that wouldn’t be the greatest misfortune, only I ought to be able to invent words capable of blowing the odour of corpses in a direction other than straight into mine and the reader’s face.</p></blockquote>\n<figure><a href=\"https://society6.com/product/bird-divinations-toupet-tit-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ToupetTit_doubt.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Toupet tit / Gould. (Available as <a href=\"https://society6.com/product/bird-divinations-toupet-tit-about-almanacofbirdsorg_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/bird-divinations-toupet-tit-about-almanacofbirdsorg_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>Like <a href=\"https://www.themarginalian.org/2024/09/25/audubon-hardship/\">Audubon did with his bird paintings</a>, Kafka regularly destroyed writing that dissatisfied him. With an eye to all he disavowed one particular year — a great deal more writing than he kept — he is suddenly seized by anxious self-doubt:</p>\n<blockquote><p>That hinders me a great deal in writing. It is indeed a mountain, it is five times as much as I have in general ever written, and by its mass alone it draws everything that I write away from under my pen to itself.</p></blockquote>\n<p>Preparing to visit his siblings and parents, and heavy with shame for having written nothing, he consoles himself grimly:</p>\n<blockquote><p>I shall, since I have written nothing that I could enjoy, not appear stranger, more despicable, more useless to them than I do to myself.</p></blockquote>\n<p>When his best friend does a reading of one of Kafka’s stories at a salon, Kafka finds himself feeling bitterly “isolated from everyone,” chin down in shame at the “disordered sentences” of his “story with holes into which one could stick both hands.” He agonizes:</p>\n<blockquote><p>If I were ever able to write something large and whole, well shaped from beginning to end, then in the end the story would never be able to detach itself from me and it would be possible for me calmly and with open eyes, as a blood relation of a healthy story, to hear it read, but as it is every little piece of the story runs around homeless and drives me away from it in the opposite direction.</p></blockquote>\n<p>He feels unable to write, and the little he does write feels “wrong.” In yet another dramatic metaphor — “metaphors are one among many things which make me despair of writing,” he would later rue — he reflects:</p>\n<blockquote><p>My feeling when I write something that is wrong might be depicted as follows: In front of two holes in the ground a man is waiting for something to appear that can rise up only out of the hole on his right. But while this hole remains covered over by a dimly visible lid, one thing after another rises up out of the hole on his left, keeps trying to attract his attention, and in the end succeeds in doing this without any difficulty because of its swelling size, which, much as the man may try to prevent it, finally covers up even the right hole. But the man — he does not want to leave this place, and indeed refuses to at any price — has nothing but these appearances, and although — fleeting as they are, their strength is used up by their merely appearing — they cannot satisfy him, he still strives, whenever out of weakness they are arrested in their rising up, to drive them up and scatter them into the air if only he can thus bring up others; for the permanent sight of one is unbearable, and moreover he continues to hope that after the false appearances have been exhausted, the true will finally appear.</p></blockquote>\n<p>And then, swift as a whip, his self-doubt meta-flagellates the metaphor itself:</p>\n<blockquote><p>How weak this picture is. An incoherent assumption is thrust like a board between the actual feeling and the metaphor of the description.</p></blockquote>\n<p>He doubts not only his talent but his motivation to manifest it:</p>\n<blockquote><p>I can’t write any more. I’ve come up against the last boundary, before which I shall in all likelihood again sit down for years, and then in all likelihood begin another story all over again that will again remain unfinished. This fate pursues me.</p></blockquote>\n<p>Within months, he had published <em>The Metamorphosis</em>. And this indeed is the great consolation of his diaries: Over and over, Kafka discovers — as every artist eventually must — that the remedy for writer’s block is writing. A generation before Steinbeck observed in <a href=\"https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/\">his own diary of self-doubt</a> that “just a stint every day does it,” Kafka writes with an eye to the 1911 comet visible in the night sky above him:</p>\n<blockquote><p>Every day at least one line should be trained on me, as they now train telescopes on comets… Then I should appear before that sentence once, lured by that sentence.</p></blockquote>\n<p>Over and over, he discovers that he writes to save himself:</p>\n<blockquote><p>I feel helpless and an outsider. The firmness, however, which the most insignificant writing brings about in me is beyond doubt and wonderful.</p></blockquote>\n<p>He discovers that writing, for him, is not a matter of art but of survival:</p>\n<blockquote><p>I have now… a great yearning to write all my anxiety entirely out of me, write it into the depths of the paper just as it comes out of the depths of me, or write it down in such a way that I could draw what I had written into me completely. This is no artistic yearning.</p></blockquote>\n<p>At its best, it is not merely survival, not salvation, but self-transcendence:</p>\n<blockquote><p>Without weight, without bones, without body, walked through the streets for two hours considering what I overcame this afternoon while writing.</p>\n<p>[…]</p>\n<p>I will write in spite of everything, absolutely; it is my struggle for self-preservation.</p></blockquote>\n<p>He relishes “the strange, mysterious, perhaps dangerous, perhaps saving comfort that there is in writing… a seeing of what is really taking place.” What buoys him through all the doubt and despair is the deeper knowledge — a kind of profound self-trust — that writing is his calling, the great spiritual reward for which he would give up — and did give up — every earthly pleasure:</p>\n<blockquote><p>When it became clear in my organism that writing was the most productive direction for my being to take, everything rushed in that direction and left empty all those abilities which were directed towards the joys of sex, eating, drinking, philosophical reflection, and above all music. I atrophied in all these directions. This was necessary because the totality of my strengths was so slight that only collectively could they even half-way serve the purpose of my writing. Naturally, I did not find this purpose independently and consciously, it found itself, and is now interfered with only by the office, but that interferes with it completely. In any case I shouldn’t complain that I can’t put up with a sweetheart, that I understand almost exactly as much of love as I do of music.</p>\n<p>[…]</p>\n<p>My development is now complete and, so far as I can see, there is nothing left to sacrifice; I need only throw my work in the office out of this complex in order to begin my real life in which, with the progress of my work, my face will finally be able to age in a natural way.</p></blockquote>\n<p>Complement with Bob Dylan on <a href=\"https://www.themarginalian.org/2014/05/21/bob-dylan-songwriters-on-songwriting-interview/\">sacrifice</a>, neuroscience founding father Santiago Ramón y Cajal on the <a href=\"https://www.themarginalian.org/2017/03/17/diseases-of-the-will-cajal-advice-for-a-young-investigator/\">six “diseases of the will” that keep the talented from reaching greatness</a>, and the story of <a href=\"https://www.themarginalian.org/2015/03/02/john-steinbeck-working-days/\">how Steinbeck used his diary as a tool of discipline and a hedge against self-doubt</a> (that eventually won him the Pulitzer and paved the way for his Nobel), then revisit Kafka on <a href=\"https://www.themarginalian.org/2016/04/18/conversations-with-kafka-taoism-truth/\">the nature of reality</a>, <a href=\"https://www.themarginalian.org/2015/10/22/conversations-with-kafka-love-patience/\">the power of patience</a>, and his <a href=\"https://www.themarginalian.org/2015/03/05/franz-kafka-letter-father/\">remarkable letter to his narcissistic father</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"dc66b0ee1c0acec4e8bff6955107e79d70e5c334f35663f25c9d4ea27af48e5c","category":"Sites"}