{"title":"Rock stars have a boss?","link":"https://sive.rs/noboss","date":1518912000000,"content":"<p>\nI was 20 years old.\nI had just moved to New York City.\nAnd I was working inside the music industry.\n</p><p>\nI ran the music library at <a href=\"http://www.warnerchappell.com/\">Warner/Chappell</a>.\nIt was a huge room, near the executives’ offices, and I had it all to myself.\n</p><p>\nRock stars would come into my room before or after their meetings, to wait or relax.\nBecause I was just some nobody working in the library, they would often speak candidly.\n</p><p>\nWhat surprised me was this:\n<strong>\nThese rock stars’ biggest complaints were about the things they were forced to do, or not allowed to do!\n</strong>\nThings like, “I think the album is perfect and finished, but the label says they don’t hear a hit, so they’re making me co-write.”\nOr, “I wanted to make a video with this director I admire, but the label won’t let me.”\n</p><p>\nI had always assumed that rock stars were the top of the food chain.\nIt was weird to realize they have a boss!\n<strong>\nBut that’s the trade-off when you sign away your rights.\n</strong>\n</p><p>\nThe independent music revolution was so exciting because thousands of musicians were realizing that they didn’t need to sign these kinds of deals anymore.\nThey didn’t need labels, distributors, publishers, or anything else to get their music to the public.\n</p><p>\nBut years later, I still hear people making that trade-off.\nGiving up their rights and serving a company, in hopes of a greater reward.\n</p><ul><li>\nauthors who act like Amazon is the boss\n</li><li>\nweb designers who act like Google is the boss\n</li><li>\npromoters who act like Facebook is the boss\n</li></ul><p>\n<strong>\nBut you only have a boss if you choose to!\n</strong>\nNobody is making you serve these masters.\n</p><p>\nOf course, if you don’t want a boss, then everything is up to you.\nLess promotion, but more freedom.\nLess help, but keeping all your rights.\nRiding the back roads, not the highway.\nServing no one but yourself.\n</p><p>\nNever forget you have the choice.\n</p>\n<img src=\"/images/creative-business.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"dc7a05abf1ed35993634e21656f720e9353bb35eb28315fb6521529f11bd5ba9","category":"default"}