{"title":"Why you need a database","link":"https://sive.rs/dbt","date":1518134400000,"content":"<p>\nA database is just an organized collection of information.\nYou could have a database of your music or your books.\nBut I’m going to talk about a database of all the people you know.\n</p><p>\nYour email app is a kind of database.\nIt has an address book of everyone you’ve emailed, and a history of your emails with each person.\nSo you’ve already done half of what I’m going to describe here.\n</p><p>\nBut I’m going to recommend you go further than that, and also keep track of:\n</p><ul><li>\nyour private notes about people (“served in the army, loves talking politics”)\n</li><li>\ntags to help you find people (“drummer, programmer, agent”)\n</li><li>\nphysical location (“London, England”)\n</li><li>\nwhen you should contact this person next (“3 weeks from today”)\n</li></ul><p>\nOnce you have this information, you can easily find every agent you know in London, and email them about a gig.\n</p><p>\nBecause the other best feature of a database is that it can personalize your communication.\nInstead of blasting out a message like “Hey everyone. How are you?”, your database will send out personalized emails like, “Hey James. How are you?” — “Hey Sarah. How are you?”.\nNot only does it get their attention better, but it’s just more polite.\n</p><p>\nIt will keep a history of your communication with everyone.\nThis helps when you hear from someone for the first time in years.\nIt can remind you who they are, and show you the last time you spoke.\nIt also helps you do things like find just the people you haven’t heard from in over a year.\nYou can set calendar reminders, so it can remind you to follow-up with someone later. \n</p><p>\nAs for which database to use, I have three recommendations:\n</p><ol><li>\n<a href=\"https://www.cloze.com/\">Cloze</a>.\nGo to <a href=\"https://www.cloze.com/\">Cloze.com</a>.\nLink it with your existing inboxes and social media accounts, and it will pull in the information of everyone you’ve got in there already.\nIt’s brilliant and full of features.\n</li><li>\n<a href=\"https://www.monicahq.com/\">Monica</a>.\nGo to <a href=\"https://www.monicahq.com/\">MonicaHQ.com</a>.\nIt’s the most personal and people-focused, encouraging you to keep track of everything you know about everyone.\nIt’s also open source and free to install on your own server.\n</li><li>\nI ended up programming my own database software, which I plan to share for free some day.\nMaybe by the time you read this, it will be ready.\nJust email me to ask.\n</li></ol><p>\n<strong>\nUsing a database is one of the most powerful things you can do for your career.\nPlease don’t put it off.\n</strong>\nIt’s not as complicated as it sounds.\nThe sooner you begin, the better.\n</p>\n<img src=\"/images/database-quantity.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"dc7cb95228f7e3b15025a84c0a41cf53718cf4674ba9f17285e7bf244d8ac621","category":"default"}