{"title":"FCC (Finally) Has a Good Idea","link":"https://om.co/2024/07/01/fcc-finally-has-a-good-idea/","date":1719855388000,"content":"<blockquote>\n<p>FCC Chairwoman Jessica Rosenworcel proposed that the agency require mobile providers to unlock customers’ mobile phones within 60 days of activation. New unlocking rules would allow consumers the freedom to take their existing phones and switch from one mobile wireless service provider to another more easily, as long as the consumer’s phone is compatible with the new provider’s wireless network. “Real competition benefits from transparency and consistency,” said Chairwoman Rosenworcel. “That is why we are proposing clear, nationwide mobile phone unlocking rules. When you buy a phone, you should have the freedom to decide when to change service to the carrier you want and not have the device you own stuck by practices that prevent you from making that choice.” [<a href=\"https://docs.fcc.gov/public/attachments/DOC-403520A1.txt\">FCC</a>]</p>\n</blockquote>\n\n\n\n<p>The vote is likely to happen at the FCC’s July 18 open meeting. I, for one, am all for it. That said, we live in a world of comfortable oligopoly — all three networks: AT&amp;T, T-Mobile, and Verizon are selling a similar product, at pretty much the same price. Their prices are in equilibrium, and none of them will do anything to upset the apple cart. They are focused on milking their businesses for profit.</p>\n\n\n\n<p>The only way they will do something new and fresh is if they are forced by rivals from the technology community. Take, for example, Apple’s introduction of a (for now) free satellite-based emergency messaging service for its customers. Pushed by Apple, the three carriers are also launching their satellite messaging services. T-Mobile is partnering with Starlink/SpaceX, while AT&amp;T and Verizon are collaborating with AST Space Mobile. They will likely charge for these services. AST’s CEO <a href=\"https://www.businesswire.com/news/home/20240701476388/en/\">indicated as much</a> in a recent company update. In the future, the FCC must ensure that the carriers don’t create more “walled gardens” around their networks.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"dc97c88baa7dc711a62fbef1d4f7f6d5d394860d43dcfc948e3d44573aebbe9d","category":"default"}