{"title":"Understanding Japan","link":"https://sive.rs/jp14","date":1390089600000,"content":"<p><em>\nThis essay is adapted from an excerpt of the great book “<a href=\"http://www.kirainet.com/english/a-geek-in-japan-the-book/#author\">A Geek in Japan</a>” by <a href=\"http://www.kirainet.com/english/\">Héctor Garcia</a>.\nIt is the first chapter of my new <a href=\"https://woodegg.com/jp\">Japan 2014 book</a>.\n</em></p>\n<hr />\n<p>\nIf three Japanese people are talking together, and a fourth one joins the conversation, he will apologize upon approach for breaking the harmony of the group.\nWhy?\n</p><p>\nIn Japan, everything looks like it works to perfection.\nPeople do what they’re supposed to.\nTrains run well.\nEverybody has a job.\nEverybody has money to live.\nIt has one of the lowest crime rates in the world.\nChildren study well and are some of the best in the world.\nTokyo is one of the cleanest cities you’ll ever see despite being the largest urban area in the world.\nIt seems to be a perfect place.\nHow have they achieved this?\n</p><p>\nTo understand the Japanese way, you must understand a few concepts that are deeply rooted into the culture.\n</p>\n<h4>\nSamurai role model\n</h4>\n<p>\nThe samurai adhered to a way of life, ethics, rules, and a code that spread to all branches of society, and even today affects the way Japanese think.\n</p><ul>\n<li>\nBuddhism taught them to stay calm and patient.\n</li>\n<li>\nConfucianism taught them that relationships between people are the basis of society — to respect our ancestors, relatives, and superiors.\n</li>\n<li>\nLoyalty, justice, and honor are central.\n</li>\n<li>\nSincerity, compassion, courtesy, and honesty are important key values.\n</li>\n</ul><p>\nThough the samurai no longer exist, this way of viewing life is ever-present in society.\nStudents are loyal to their teachers.\nWorkers are loyal to their companies, putting in long overtime hours.\nJapanese are loyal, honest, sincere, and disciplined at work.\nThey follow rules and try to improve themselves every day, just as the samurai did in their time.\n</p><p>\nA high compliment is the word “iki” (粋).\nYou say a person is iki if they are original, calm, refined, and sophisticated, without being too perfect, complicated, or self-conscious.\nIt’s similar to the word “elegant” or “graceful”.\n</p>\n<h4>\n“Honne”, “tatemae”, and no “no”\n</h4>\n<p>\nHonne (本音) refers to the opinions and true feelings that everybody has.\n</p><p>\nTatemae (建前) refers to social obligations, and opinions that have been adjusted to be socially acceptable — when words and true intentions don’t fully coincide.\n</p><p>\nWhat someone really thinks is “honne”, but what they actually express is “tatemae”.\nIn Western countries we could call it hypocrisy, but in Japan knowing how to express tatemae and honne at the right time is considered a virtue.\n</p><p>\nFrom the Western point of view, concealing the truth may be looked on with disfavor, but in Japan, preserving harmony is more important.\nThat’s why true thoughts (honne) are not expressed in a straightforward way, for fear of hurting people’s feelings.\nIt’s used to ease relationships and business, where established conventions have to be followed.\n</p><p>\nJapanese hardly ever use the word “no”.\nUsing it is considered very curt.\nInstead, there are many ways to say “no” delicately, such as, “A little bit…,” or “This is very interesting,” or “We will study your proposal,” or “This is complicated but…”\nWhen someone says these things, they are very politely but clearly telling you “no”.\n</p><p>\nAn example: Imagine you want to buy a ticket and there are no seats left.\nThe ticket salesperson won’t give you a straight answer like, “There are no tickets left.”\nInstead he will probably keep you waiting, pretending he is looking into something on his computer, make weird faces, and say something like, “Finding seats can be difficult.”\nThis is tatemae at its best.\n</p>\n<h4>\nModesty and humility\n</h4>\n<p>\nNo matter what their social class, talent, studies, or job, Japanese people are expected to behave with modesty.\n</p><p>\nThe most typical way to show our humility is by diminishing our own achievements while praising those of others.\nIf someone tells you that your recent work has been great, you must answer that the credit is not yours, that the latest successes have been achieved thanks to what your boss and company have taught you.\n</p><p>\nIf someone is too ambitious or flaunts their power too much, he ends up being ostracized by his company and society.\nThere are many cases where a person of great promise was too ambitious, and his/her superiors reassigned him/her to tasks such as serving tea in meetings or even cleaning the company bathrooms.\nThe Japanese see ambition as a threat to the inner balance of the system, which might bring them down in the future.\n</p>\n<h4>\nThe way of elegance and perfection\n</h4>\n<p>\nA deep-rooted Japanese concept is “do” (道), which means “the way”.\nLook at many of the Japanese words we use in English.\n“Judo” is the gentle way.\n“Aikido” is the way of the union of spirit and mind.\n“Dojo” is the place of the way.\nThere are hundreds of words with the character “do”, so it’s not merely a character but a whole philosophical concept and a way of life that has been deeply rooted in Japanese thinking for centuries.\n</p><p>\nHere is one important application of this concept:\nIt is very common to seek perfection in some tasks as a means to acquire spiritual satisfaction.\nEducation is repetition, following the set path, “the way”.\nThrough repetition of certain patterns, they get to be very good at what they do.\nBut this also makes it very difficult for them to depart from their routine.\nNow you can see why Japanese companies have a reputation for being slow to change and avoiding innovation.\n</p><p>\nIn individualistic societies (America, Europe, Australia, etc.), the common belief is that if you pursue your own self-interest this will automatically help with the interests of your society.\nIn Japan, the belief is reversed.\nIf you give your utmost in your work to serve your company, customers, and society, then this will automatically serve your own self-interest.\nThis is why Japanese companies are known for having such incredible customer service.\nThis helps you have a better life, and in turn you help others have a better life, while benefitting companies and the Japanese economy in general.\n</p>\n<a href=\"https://woodegg.com/jp\"><img src=\"https://woodegg.com/images/we14/we14cover-JP-200.jpg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"dcc2e2b78bcf5b52521f80ccc2b1427401eb974ee39137f281479d58bbba4abf","category":"default"}