{"title":"Election","link":"https://blog.webb.page/2024-11-06-election.txt","date":1730851200000,"content":"<p>When people show you who they are, you should believe them. Maybe you'll want to\ngive them a chance because you feel in your heart that everyone is a good person.</p>\n<p>Commendable, respectable even.</p>\n<p>However, consider the winning candiate:</p>\n<ul>\n<li>2 impeachments</li>\n<li>34 felony convictions</li>\n<li>literal threat to democracy (Jan 6th)</li>\n<li>his former VP advised folks not to vote for him</li>\n<li>his current VP called him \"America's Hitler\"</li>\n<li>litany of other disgusting actions, do your research for more</li>\n</ul>\n<p>There's plenty to blame for the outcome. From what I've seen online: Latinx, (due\nto culture, perceived approximation to whiteness, and not wanting to be led by a\nBlack woman), white people (overwhelming number of white women, apparently), and\nself-hating gays and Black people. Even I blamed 3rd party voters but apparently,\nthey wouldn't have tipped the scale in Harris' favor anyway (but still, writing\nin video game characters is dumb af).</p>\n<p>The main culprit, for me, is the Democrats. If Bernie Sanders wasn't snubbed in\n2016, I truly believe we wouldn't be in this mess. Sanders' message was, \"keep\nBig Business money out of politics.\" Guess who truly won the election? Wall\nStreet is ecstatic. The stock market was hella positive this morning. Money money\nmoney. That's all these fucks care about.</p>\n<p>I live in California and I work for a Silicon Valley corporation worth trillions.\nThere's a good chance I'll make millions over the next four years and thanks to\nTrump's economic policy (help the rich), there's a damn good chance I'll benefit\nmore from his policy than the majority of people who voted for him. That's nuts.</p>\n<p>The rest of his voters will have their families ripped apart under the guise of\n\"keeping America safe\" (abortion, womens' rights, immigration, &amp;c). Talk about\nvoting <em>against</em> your interests. WTF!!</p>\n<p>My frustration is self-inflicted; it comes from me thinking my ideals match those\nof others. When I vote, I don't think of just me; I think of my community. On my\nballot this year was a proposal to END legalized slavery in prisons...and most\nCalifornians voted against it. Mindblowing. Maybe marginalized groups have more\nempathy overall? Idk. I'm a Black man and have spent my life keeping my head on a\nswivel. Every day I am not dead or imprisioned is a blessing. I spent my morning\narguing with folks online, I'm not going to frustrate myself further pondering\nthe thought-process of single-issue voters.</p>\n<p>It's been interesting to see folks like DHH<a href=\"https://world.hey.com/dhh/the-spells-are-spent-beaa675b\">1</a> and the CEO of Vercel<a href=\"https://x.com/rauchg/status/1854206133776388461\">2</a> feel\nemboldened to congratulate their president though. DHH railed against DEI and\n\"free speech\" with Rauch echoing the latter sentiment. Tapping the sign once\nagain: Freedom of speech is NOT freedom of <strong>reach</strong>. Who cares though, just keep\npumping your bags.<a href=\"https://x.com/coinbase/status/1854192162360942702\">3</a></p>\n<p>America is a hard-headed child.<a href=\"https://social.coop/@netopwibby/113434965265995420\">4</a> At some point you just gotta let them learn on\ntheir own. Just because your freedoms were never threatened doesn't mean they\nnever will. Good luck.</p>\n<p>🕸</p>\n<p>P.S. Now is as good a time as any to delete your X account(s). I've resisted\ncalling Twitter \"X\" for so long but it's quite clear at this point that Twitter\nis but a memory.</p>\n<p>P.P.S: Tech CEOs congratulating Trump. Yuck.<a href=\"https://jacky.wtf/links/2024/Nov/maga-tech-ceo/\">5</a></p>\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"de57b6f9d924318ec94e5a6cf16a1323fcd1cd14c691eb28b7af03f3ab6eec01","category":"Sites"}