{"title":"50 Bits of Wisdom","link":"https://bradbarrish.com/2024/06/12/50-bits-of-wisdom/","date":1718175600000,"content":"<p>There are not many people I can honestly call a hero, but <a href=\"https://kk.org/\">Kevin Kelly</a> is one of those people. His idea of <a href=\"https://kk.org/thetechnium/protopia/\">protopia</a> has been particularly influential on my outlook on life and especially when it comes to technological advancements. When Kevin turned 68, he posted 68 bits of wisdom, written for his children, on his blog. Years later he turned the post into a book called Excellent Advice For Living (get it on <a href=\"https://bookshop.org/a/9430/9780593654521\">Bookshop</a> or <a href=\"https://amzn.to/3V41Mmr\">Amazon</a>), which I highly recommend. Inspired by Kevin, here are 50 bits of wisdom on my 50th birthday. Above all, don’t be an asshole. Be curious. Be honest. </p>\n\n\n\n<ol>\n<li>You will be remembered for how you make people feel, perhaps more than anything else. This can either open doors or close them.</li>\n\n\n\n<li>There is so much in the world we cannot explain. And just because something is inexplicable, does not make it untrue. It’s also worth mentioning that sometimes, especially when it comes to science and medicine, the explanation for things can change. Truth can and should be revised as new information becomes available. Assume that at least some of what we accept to be true now, might not be in fifty years.</li>\n\n\n\n<li>Luxury used to be measured in dollars. It is now measured in time. We mistakenly believed for a period of time that being tethered to devices and inboxes was an indication of importance. The opposite is now true. The ability to truly disconnect – to be untethered, is a luxury. This shift happened exceptionally fast. </li>\n\n\n\n<li>Learn to embrace and even welcome constant change.  </li>\n\n\n\n<li>No matter what’s happening in your life, no matter what you are struggling with, music has the power to change your mindset. It’s worth keeping track of songs that lift you up. Create a playlist or simply write them down. When you need them, they will be there for you. </li>\n\n\n\n<li>Don’t be late. If you plan to be on-time, there’s a decent chance you’ll be late. At the very least you’ll be rushed. If you plan to be early, you are much more likely to be on-time. The only exception is social gatherings or parties. No one wants to be the first one at a party.</li>\n\n\n\n<li>Do not fall into the trap of letting someone else decide what it means for you to be productive.  </li>\n\n\n\n<li>Cynicism is born from the death of curiosity. Maintain a child-like curiosity and spend your life attempting to satisfy it.</li>\n\n\n\n<li>You are destroying or creating at every moment.</li>\n\n\n\n<li>Find things you enjoy reading. If you’re reading a book that you don’t like after really giving it a try, don’t feel bad about putting it down and not finishing it. But if you’re thinking about putting it down because it’s challenging you in some way, keep reading it, especially if it’s widely regarded as a classic.</li>\n\n\n\n<li>Developing the ability to read signals and patterns is an underrated skill.</li>\n\n\n\n<li>Everyone likes talking about themselves, often even those that deny it. Ask deep questions that avoid discussing what someone does for a living, at least until the very end of your conversation. Making friends is easier when you’re curious and vulnerable. Human connection is the most important thing in life.</li>\n\n\n\n<li>Act like you belong. You’ll be surprised by how little other people care that you’re acting. </li>\n\n\n\n<li>Wear sunscreen, or better yet wear UV protective clothing, but only after you’ve gotten some morning sun.</li>\n\n\n\n<li>Practice gratitude every day you wake up. Your time is finite and you probably won’t know just how finite it is until you do. Don’t wait to start living.</li>\n\n\n\n<li>Life isn’t about happiness, it’s about love.</li>\n\n\n\n<li>Remain curious about the world around you. Visit places and do things that make you feel small and insignificant.</li>\n\n\n\n<li>Cynicism is another word for cancer.</li>\n\n\n\n<li>Challenge yourself to use positive, affirmative language, even when you are feeling negative.</li>\n\n\n\n<li>Cultivate deep self-awareness to know when you are being dishonest with yourself. As Richard Feynman once <a href=\"https://calteches.library.caltech.edu/51/2/CargoCult.htm\">said</a>, “You must not fool yourself—and you are the easiest person to fool.”</li>\n\n\n\n<li>Life begins where your comfort zone ends. Living a life worth living means you will experience discomfort.</li>\n\n\n\n<li>Touch grass, especially when you are feeling disconnected from yourself or the world. Nature reveals what matters and heals us.</li>\n\n\n\n<li>Most people don’t ask. You will set yourself apart by asking. </li>\n\n\n\n<li>Every decision you make, every action you take, is out of love or fear. </li>\n\n\n\n<li>Make plans with people you love. Extra points for doing it in advance. </li>\n\n\n\n<li>Collecting experiences is better than collecting things.</li>\n\n\n\n<li>Relearning how to play as adults requires a willingness to unlearn. Play is innate in all of us, not just children.</li>\n\n\n\n<li>Anger and outrage are synonymous with fear. When you feel it rising in you, and especially when you feel it come on suddenly, especially after hearing someone speak or seeing something that offends you, take a few deep breaths and challenge the feeling. Search for a reason as to why you might be feeling the way you do. Is it because of something you believe to be true? How have you come to believe it to be true? Especially now, we are taught and conditioned to be outraged when we don’t agree with something. Being able to remain calm, even when something offends, disturbs or frightens us is a superpower. Being able to regulate our emotions and have a conversation about a thing we disagree with is a skill worth practicing throughout life.</li>\n\n\n\n<li>When people show you who they are, take their word for it.</li>\n\n\n\n<li>There’s no such thing as free. You’re paying with something.</li>\n\n\n\n<li>Everyone is born a creator. Consumption is the antithesis of creation. Passive consumption amounts to junk food for our brains and robs us of time that we could be spending actively creating and living fulfilling lives.</li>\n\n\n\n<li>Giving up your attention should be something that you do deliberately and in moderation. Every device and app in our lives is competing for our every waking moment. </li>\n\n\n\n<li>Read a little bit of something long like a novel, a long-form essay or a book of poetry. You will be amazed at the number of things you can read when you build a habit of reading a little every day.</li>\n\n\n\n<li>When you’re young, make friends with people older than you. When you’re older, make friends with people younger than you. There’s so much to learn, no matter what your age. Develop a love of having deep conversations with other people.</li>\n\n\n\n<li>Take care to notice small details in things. Notice the color of soil, the shape of rocks, the creases in someone’s face, the shadows cast by the sun, the smell of the air. Use all of your senses to notice. Practice capturing those details in some form.</li>\n\n\n\n<li>It’s worth paying extra for higher quality things that are made to last, especially when they are made by expert craftspeople or small companies that focus on doing a few things better than everyone else. If possible, buy it directly from the maker.</li>\n\n\n\n<li>Avoid plastic whenever possible, especially when it touches things that go in your body.</li>\n\n\n\n<li>Sleep outside at least a few times per year. A great tent and sleeping bag will last you a lifetime or more if you take good care of it.</li>\n\n\n\n<li>Decorate physical spaces where you spend any amount of time with plants and art that make you happy.</li>\n\n\n\n<li>Call your parents. They love you and you will want desperately to hear their voices when they are gone.</li>\n\n\n\n<li>Interview your family members and friends. Record it, if they allow it.</li>\n\n\n\n<li>Keep a journal and build a habit of writing in it. Writing is thinking on paper.</li>\n\n\n\n<li>Spend time by yourself every once in a while. Eat alone in a restaurant. Don’t look at your phone. Notice people. Eavesdrop. Think.</li>\n\n\n\n<li>Society rewards conformity. There is no prestige in being just like everyone else. Embrace your weirdness, whatever that may be. It doesn’t need to make you stand out, but sometimes it’s nice when it does.</li>\n\n\n\n<li>Stand up for what you believe in. When you’re vocal about it, be prepared for people to disagree with you.</li>\n\n\n\n<li>Study history. It will give you amazing context and insight into the present and future.</li>\n\n\n\n<li>Get comfortable with death. It is unavoidable. Become aware of your mortality and the mortality of those you love in order to live better. </li>\n\n\n\n<li>Practice self-compassion and acceptance. The more you are able to love and accept yourself, even when you mess up, the more capable and better you will be at developing deep and meaningful relationships with others.</li>\n\n\n\n<li>Consider the source and investigate incentives. Do the work to find great sources of truth and remember that you are easily fooled.</li>\n\n\n\n<li>Two seemingly opposing truths can both be true. Do not let others convince you that the world is black and white.</li>\n</ol>\n\n\n\n<p>1 0 1 1 0 0 1 0 1 0 1 1 0 0 1 0 1 0 1 1 0 0 1 0 1 0 1 1 0 1 0 1 0 1 0 1 0 1 0 1 1 0 1 0 1 0 1 0 1 1</p>","author":"bradbarrish","siteTitle":"Brad Barrish","siteHash":"91e49f51884b2947fac16e947ba7e59fe5a24800befb4760d388da1b057f4f23","entryHash":"dea0b0e73b3e2bc7e6292d43e4712fa2a15ec850065ba4914571c293a579c4c0","category":"Sites"}