{"title":"Feathers Are One of Evolution&#8217;s Best Inventions","link":"https://kottke.org/24/04/feathers-are-one-of-evolutions-best-inventions","date":1713540381000,"content":"\n        <p>Really fascinating piece by Michael Habib in Scientific American about <a href=\"https://www.scientificamerican.com/article/why-feathers-are-one-of-evolutions-cleverest-inventions/\">how amazing feathers are</a>: they come in so many different shapes and sizes and do so many things (insulate, keep dry, flying, noise dampening, etc. etc. etc.) And I loved the opening anecdote:</p>\n\n<blockquote><p>In October 2022 a bird with the code name B6 set a new world record that few people outside the field of ornithology noticed. Over the course of 11 days, B6, a young Bar-tailed Godwit, flew from its hatching ground in Alaska to its wintering ground in Tasmania, covering 8,425 miles without taking a single break. For comparison, there is only one commercial aircraft that can fly that far nonstop, a Boeing 777 with a 213-foot wingspan and one of the most powerful jet engines in the world. During its journey, B6-an animal that could perch comfortably on your shoulder-did not land, did not eat, did not drink and did not stop flapping, sustaining an average ground speed of 30 miles per hour 24 hours a day as it winged its way to the other end of the world.</p>\n\n<p>Many factors contributed to this astonishing feat of athleticism-muscle power, a high metabolic rate and a physiological tolerance for elevated cortisol levels, among other things. B6’s odyssey is also a triumph of the remarkable mechanical properties of some of the most easily recognized yet enigmatic structures in the biological world: feathers. Feathers kept B6 warm overnight while it flew above the Pacific Ocean. Feathers repelled rain along the way. Feathers formed the flight surfaces of the wings that kept B6 aloft and drove the bird forward for nearly 250 hours without failing.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/birds\">birds</a> · <a href=\"https://kottke.org/tag/flying\">flying</a> · <a href=\"https://kottke.org/tag/Michael%20Habib\">Michael Habib</a> · <a href=\"https://kottke.org/tag/science\">science</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/04/feathers-are-one-of-evolutions-best-inventions\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"dee370f8d2b4bf30ddc556c885a4d9e3c7ed97c0d48f14981d25f9d5e7882aa3","category":"default"}