{"title":"Beatles","link":"http://scripting.com/2024/02/17/210823.html?title=beatles","date":1708204103000,"content":"<p>My #1 Beatles song these days is Day Tripper. </p>\n<p>Most of my listening has been to John Lennon, and more reading.  </p>\n<p>A lot of his lyrics intentionally mean nothing. </p>\n<p>My current infatuation is <a href=\"https://en.wikipedia.org/wiki/Gimme_Some_Truth\">Gimme Some Truth</a> from Imagine is pretty great because the lyrics are super clear, and quite forceful and beautiful. Of course we want the truth, some of us at least, and you can't tiptoe around that. Most people have arranged their lives so they avoid the truth at all costs. In the end the truth prevails for everyone no matter how hard you try.</p>\n<p>Then I saw a quick interview with Ringo and Paul, current day, and Ringo is being kind of a bitch saying that Paul was a workaholic, and he's standing right there, but he isn't disagreeing in fact he's nodding his head, basically saying he likes to do things. </p>\n<p>I always wish as a child of their breakup that they had found a way to work together, and for John and George to have their independence from Paul. He definitely took the brunt, but it looks to me like he was desperate to keep the Beatles from breaking up and that brought out his powerful control freak side.</p>\n<p>Thing is to people my age, these were our uncles. But maybe there was nothing after <a href=\"https://www.youtube.com/watch?v=12R4FzIhdoQ\">The End</a>? Maybe they really were done. We like to believe there was more, but maybe there wasn't.  </p>\n<p>And of course the people who were Beatles were just people, strangers to us really, we were just projecting our dreams on them. Until the <a href=\"https://en.wikipedia.org/wiki/The_Beatles:_Get_Back\">Get Back</a> show, which answered so many of our questions were answered and got us thinking and dreaming again. </p>\n<p><a href=\"https://en.wikipedia.org/wiki/Peter_Jackson\">Peter Jackson</a> changed the world of 20s as much imho as the Beatles did in the 60s. He did a great thing. </p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"def37bc9a1a3e897ed64057a85f7f25b2952a6687979606a03b15a3f43d0ac42","category":"default"}