{"title":"make art for no audience","link":"https://keningzhu.com/journal/make-art-for-no-audience","date":1721376848000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/08-make-art-for-no-audience/id1731169431?i=1000662630060\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/4em0lCpDrr00wr3HJHX39N?si=24cd9a9358e04b62\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>this episode is all about deconstructing and letting go of the pressure to “build an audience.” I’ll disentangle the practice of <em>being</em> an artist — from the byproduct of <em>having</em> an audience — and share how finding freedom from that pressure creates a well of personal power (and paradoxically, will magnetize your audience). we'll explore:</p><p>three sources of pressure: (1) artist recognition as legitimacy (2) the digital age of visibility (3) the inner artist child</p><p>a core guiding question to distill your commitment to your art</p><p>the practice of power as seeing yourself — and the other</p><p>reframing the audience as witness &amp; travel companion to your journey</p><p><br /><strong>additional resources:</strong> </p><p><a href=\"https://keningzhu.com/journal/build-a-world-not-an-audience\" target=\"_blank\">build a world, not an audience</a></p><p><a href=\"https://keningzhu.com/journal/the-obscurus-as-a-wounded-artist-child\" target=\"_blank\">the obscurus as a wounded artist child</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/8ed30be6-cded-4543-8d51-f2396d4e78b4/make_art_for_no_audience-7%3A18.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction</h1><p>Hi friends, this is Botanical Studies of Internet Magic, a podcast on the alchemy of creative power through the vessel and portal of the internet.</p><p>My name is Kening and I'll be your guide.</p><p>This week, I will share another one of my core guiding principles, and that is: make art without an audience.</p><p>This is not an episode about rejecting the audience or saying that we should all be hermits and never share our work, but instead I want to take this episode to really <strong>disentangle the process of making art from the byproduct of having an audience.</strong></p><p>What I wanna propose is another paradox, that is: </p><p><strong>the way to nurture an audience is to have no need for an audience.</strong></p><p>The audience arrives to witness your relationship to inspiration, to your art, and to yourself.</p><p>The audience comes as a result of you being in your full flow.</p><p>It happens naturally, organically, and effortlessly if you are in your own integrity as an artist.</p><p>In this episode, I wanna unpack where the pressure comes from for artists and our need to build an audience, and I can identify three sources.</p><ol><li><p>Number one is the artist's status as inextricably tied to recognition and social validation.</p></li><li><p>The second is living in a age where metrics make measuring visibility a knee-jerk addictive reaction of how much we are seen or unseen.</p></li><li><p>And the third is our inner artist child with their desire for recognition.</p></li></ol><p>So in this episode, I will share my own story of my changing relationship around building an audience and our core guiding question to help you distill your motivation for making art.</p><p>And then lastly, propose a new alternative for what it feels like to make art from the place of personal power, independent of an audience.</p><p></p><h1>my personal journey </h1><p>So let me share my story.</p><p>The first time I tentatively decided to tell myself and the world that I was an artist, I started sharing my work on my website and then sharing those posts on Facebook and Instagram.</p><p>The way you're taught to do, to promote yourself as an artist.</p><p>And each post, each essay, each drawing, each piece of art that I shared, it honestly felt like walking in the streets naked with all of my secrets, all of my wounds, all of my innermost self showing in such a public crowded platform.</p><p>And each like that I received, each comment, each new follow, it felt like a boost of ego validation.</p><p>And there were comments that meant so much for me that felt really deeply sustaining in those days, but I couldn't really control how I felt about each share.</p><p>And it was at worst, such an emotional rollercoaster.</p><p>Sometimes I got the validation that I craved, sometimes I didn't.</p><p>In those days, I was not fully confident in my own identity as an artist.</p><p>And so part of me was outsourcing that from receiving validation.</p><p>And over time, this really war on my soul, sharing my work took so much energy, infinitely more energy, filled me with anxiety, completely different than actually creating the work.</p><p>Making art is one very internal process, but building an audience is the thing that made me feel insecure and doubt myself.</p><p>Over the course of a year or two, I gave myself permission to just stop thinking about it all together, to stop, to let go of the pressure to quote unquote, build an audience.</p><p>It took me several years after that of retreat and hermiting to really distill down my own process around sharing my work, which is build a world, not an audience.</p><p>And I wrote a post about this that I'll link in the show notes.</p><p>These days, as an artist, I never really think about my audience or who's going to look at my work.</p><p>I create only what I want to create and only what I want to see manifested in my chosen form.</p><p>My primary relationship is not with my audience, but with my own creative spirit.</p><p>But in business, I will say I do think about my audience, but not as an abstract entity.</p><p>I'm making this podcast for you to listen to.</p><p>But when I think about you, I don't think about my \"audience.\"</p><p>I think about creating literally for one person.</p><p>I think about one kindred spirit that I want to connect with, to help to serve in some way, or, and perhaps at the same time, I think about creating for my past self.</p><p>I think about making guides for the version of me that was really lost and wandering and confused.</p><p>And I think focusing on the personal is really what's helped me resonate and connect with so many people operating on a similar wavelength.</p><p>It's the connection between the personal, that which is the universal.</p><p>I'm at a place in my art and my business where my creative flow feels entirely self-sustaining.</p><p>There's nothing outside of me that needs to happen in order for me to create my best work.</p><p>I create from a place of deep freedom and power.</p><p>And I want to share the journey and the thinking behind how I got here.</p><p>So first things first, let's deconstruct the three sources that I mentioned about where the pressure for building an audience comes from.</p><p></p><h1>pressure no. 1 - artist legitimacy dependent on recognition</h1><p>The first is the sense of one's own legitimacy as an artist as tied to recognition and therefore social status.</p><p>And of course, I want to preface everything I'm about to say with an acknowledgement that there's so many positive desires for building an audience.</p><p>The desire for connection, for community, for feedback, for understanding.</p><p>But I think the pressure that comes from our society is more about permission to exist.</p><p>It's much more of an existential thing.</p><p>As in, if you don't have an audience, you're not a real artist.</p><p>Whether this audience is your peers or the media or a panel of judges, without their approval, your art has no value.</p><p>And I think we don't consciously think this, but it's at the background frequency.</p><p>It's the background conditioning.</p><p>To claim that you're an artist in normal everyday society, you can see the kind of expressions and reactions that people get when they hear that.</p><p>Oh, well, oh, you're a writer.</p><p>Have you published any books that I've heard of or that I've read?</p><p>If you're an artist, how come I haven't heard of you?</p><p>It's like to be an artist and have legitimacy, you have to be famous or to be known.</p><p>And I think it's because being an artist already sounds to the average person so fanciful and unrealistic that to have any sort of weight behind when you claim your identity as an artist, you feel the pressure, the social pressure to back it up with a signal of legitimacy, whether that's being backed by an institution that people know of or prizes or famous brands or prestigious places.</p><p>And if you look at the bios of many artists or creative people, what they put on their about page or their byline is not who they are as an artist, it's who backs them up, who gives them legitimacy.</p><p>Therefore, to be socially validated is the way in our cultural conditioning that you're judged and crowned a real artist.</p><p>Otherwise, anybody can call themselves an artist, right?</p><p>And yes, I believe that anyone can call themselves an artist because being an artist is your relationship to creativity.</p><p>In the past, we depended on critics or curators because we as an audience, as individuals, had no way of connecting with the artists that most spoke to us.</p><p>And for the artist, it was natural to be in your own high tower or to toil away in obscurity until you're being recognized and lifted up by an agent or by an institution.</p><p>I think it's so easy to say, I'll be a real writer once I've published a book by a legitimate publishing house or one XYZ award, or I'll be a real painter once I've insert milestone or awards or residency or fellowship, but those social markers of success, they're like a specific game.</p><p>And if your goal is to express yourself and your artistic potential, that might help you on the goal, that might help you on the journey, but it is not the journey itself.</p><p>And I think getting those two confused, accomplishments confused with process is such an easy thing.</p><p>It's one thing to be concerned with craft.</p><p>It's another thing to be concerned with recognition.</p><p>And I think the concern for recognition can keep us trapped in a feeling of not enoughness, in a feeling of constantly needing to prove ourselves, which is the way to block creative flow.</p><p>You don't need an audience to legitimize you.</p><p>You only need your art, unhindered and un-selfconsciously expressed.</p><p></p><h1>pressure no. 2 - digital age of visibility addiction  </h1><p>So source number two, the digital dopamine feedback loop.</p><p>In our social media and sub-stack age, I think it's easy to derive legitimacy from the number of followers that we have.</p><p>And whenever I hear someone say, I have a tiny audience, I'm trying to understand what exactly that means.</p><p>Does it mean what I say doesn't have enough impact or projection yet?</p><p>Does it mean I'm not legitimate yet?</p><p>I think what you say should be the same thing, regardless if you're talking to an audience of 10 people or 10,000 or 100,000 people.</p><p>In this day and age, you get sucked in so easily into the numbers, into how many people follow me or open my emails or click my links or sign up for my newsletter.</p><p>And I wanna reiterate that your art exists even if no one sees it.</p><p>I think this way of defining value really takes the power away from the intuitive self, being dependent on metrics and the feedback loop is a recipe for self-doubt, insecurity and unworthiness.</p><p>There are some businesses that operate very well on numbers and the click rate, the conversion rate, but I think to obsess over that as an artist is another recipe for paralysis.</p><p>The question I wanna pose for you is, what if you were to give yourself permission to let go of any need for metrics?</p><p>The number of followers, subscribers, the amount of page views and traffic, all the things that we use to legitimize our art, consciously or subconsciously, what would happen if you let that go?</p><p></p><h1>pressure no. 3 - the inner artist child</h1><p>The third source of pressure is the inner artist child.</p><p>If you've chosen this creative path after any amount of existential struggle, which I feel like unless you're very, very lucky and born into a very supportive or a very creative family, existential struggle is the majority of us, then we've probably grappled with our inner artist child.</p><p>I'm talking about the voice inside of you that after you create something, you draw something or write something, you wanna show, you wanna say, look, mom, like look, look what I made.</p><p>And it's that desire to be seen for all of our imaginative creativity, a need to be validated, a need to exist, a need to say, I am here and I have an imagination and I have things I want to say and express to the world that you may or may not understand.</p><p>When I think about not fitting in to the boxes and the templates that I was given by my family or cultural conditioning, and I think about being an outsider, being different, I think about how bad it felt to not express my truth and how bad it felt not to be recognized for who I am.</p><p>It felt like living a lie.</p><p>It felt like constantly swimming upstream.</p><p>It felt like going the wrong direction, when in fact it is the right direction for me.</p><p>The inner artist child within me desperately wants to be seen.</p><p>And I think part of the process of holding space for them is to be the adult in relationship with our inner artist child, to make space for your inner artist child and say, your mission in this life is full expression and I'm here to see you, I'm here to hold you.</p><p>It's the outsourcing of validation, the outsourcing of recognition that puts our artist child in a really precarious place of feeling unseen, the potentiality of feeling unseen and rejected the way that it felt as children growing up in households that may or may not have been very supportive to choosing the artist's life as equaling choosing poverty.</p><p>So that desire to be seen, to have people see you comes from such a legitimate true place.</p><p>And I think my practice here is to say, I will take responsibility.</p><p>I will create space for my inner artist child to fully express herself in her wild unbridled creativity.</p><p>If you've ever experienced the feeling of repressing your inner artist child, maybe you would recognize what I mean when I compare the Obscurial as in from Fantastic Beasts and where to find them, that dark parasitic force of a magic being to the inner artist child that's been shamed and minimized and diminished.</p><p>Sometimes when we finally give space for them to express themselves, it can feel scary.</p><p>It can feel deeply triggering and explosive like there's a volcano inside that wants to be heard and seen.</p><p>And in those moments, I would say, how can you create practices to make her feel seen and feel safe?</p><p>And in the process of distilling your motivation for art, why choose to be an artist when you can choose so many other things in this life?</p><p></p><h1>the core guiding question</h1><p>I want to ask you a core guiding question.</p><p>And this is a question that I've asked myself many times during my most inward hermit phases of my journey.</p><p>And it's inspired by the question, the philosophical question, if a tree falls in a forest and no one was there to hear it, does it make a sound?</p><p>This question is essentially about the observed versus the unobserved world, what we perceive or can't perceive, does it actually exist?</p><p>So the question I'd ask you is, if no one in the world ever saw your art, would you still make it?</p><p>And what is the art that you would make even if no one ever saw it?</p><p>When you distill down your answer to this question, you'll get to the heart of the work within you that must be born independent of all else, independent of anyone who sees it or doesn't see it.</p><p>Art must feel necessary.</p><p>If no one in the world ever saw your art, would you still make it?</p><p>And I think the answer to this question really helps you distill down your own commitment to making art.</p><p>Do you source your motivation from somewhere beyond, from somewhere within yourself?</p><p>It's when the answer to this question is yes, that you have found the art that needs to exist, that must exist, and you can allow yourself to just become a channel, a vessel, the process of creativity that flows through me is unshakable.</p><p>And I think that gets the heart and soul of this podcast and much of my work, which is about personal empowerment.</p><p>And part of personal empowerment comes from first deconstructing the places that we've given away or outsourced our power.</p><p></p><h1>making art feels like breathing</h1><p>I think that once you've distilled down your motivation to that core essential necessity of making art, the process of making art will feel like breathing.</p><p>For me, if I don't make art, then I don't know how to be, how to live in this world.</p><p>I can feel the walls of my psyche becoming too translucent, too overwhelmed, too oversaturated, and making art is a way of creating a world beautiful enough for me to be able to live in.</p><p>The art that I make has nothing to do with my audience.</p><p>It's more about my relationship to my own psychic metabolism, my relationship to life itself.</p><p>That process of making art becomes its own motivation.</p><p>The process becomes the fuel, and any validation, any audience, anyone who witnesses that, is just a bonus byproduct.</p><p></p><h1>your art fills your world</h1><p>I think to follow your own motivation to that extreme individuality can be such a lonely path.</p><p>In many times, in many cultures, in many worlds, it definitely feels like swimming upstream, swimming against the culture, against our families, against our communities with normal nine to five jobs, with a sense of legibility that other people can understand and recognize.</p><p>But when you make art, your art becomes your world.</p><p>Your art builds your world piece by piece, brick by brick.</p><p>And you become a channel for something greater, something more universal, something divine.</p><p>It becomes a conversation with your own creative spirit, with inspiration, with something otherworldly.</p><p>You become a source of light, and people will be magnetized to your light.</p><p>Those people who might become your community, might become your audience, they are magnetized to you without you focusing necessarily on your relationship to them.</p><p>What they'll see instead is your relationship to your own creativity, to inspiration, to the divine.</p><p>Your audience will become your witness, a companion on that journey.</p><p>When you're in that place, you won't need to find them, they will find you.</p><p>When you are that source of light, when you can radiate your own light, you're in your personal power.</p><p>Power is having everything to give, your creativity, your perspective, your imagination, your sense of beauty and truth, and needing nothing from your audience in return, expecting nothing from them in return.</p><p>The end result is that you disentangle being an artist from building an audience.</p><p>Instead of needing to be seen, you are the one who does the seeing.</p><p>You're the one that makes other people feel seen by the truth of your work.</p><p>When you focus on expressing your truth, your audience will recognize themselves in you, in the universality of your work.</p><p>This is about embracing how it feels to make art in the dark, to make art in the void, but also within the light and inside the crowd, no matter the environment, no matter who's around you.</p><p></p><h1>the audience as witness to your journey</h1><p>I'll close this episode by saying that whether or not you have an audience of 10 people or 10 million, consider them witness to you being witness to this life.</p><p>Consider them travel companions on the journey alongside you as you are circling deeper into manifesting your own creative visions.</p><p>I think whenever we are in the creative process, in the act of making, there is an abstracted other who will see the work that we create, but who that other is, not measurable by numbers or email addresses, but instead as a relationship of witnessing and seeing a relationship that begins with speaking to the other as if we are speaking to ourselves.</p><p>Thank you friends for being here and for listening.</p><p>You can find more of my work and writings on my website world, keningzhu.com.</p><p>I also send a weekly newsletter on creative alchemy called Guide Notes.</p><p>I look forward to speaking to you soon.</p><p></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"dfabebb93f622115acde929ea1298cf0692b6679a4fc34a8338bee305cb6a284","category":"Sites"}