{"title":"The business of scanning kids faces is booming","link":"https://www.usermag.co/p/the-business-of-scanning-kids-faces","date":1727089390000,"content":"<div><div></div></div><p>I’m on the last week of my multi week vacation, so no link lists in today’s newsletter! But I did want to send through <a href=\"https://open.spotify.com/episode/2vCRjyFP3pZXJ7WRgY35vM\">the latest episode</a> of my podcast, <em>Power User</em>, which just dropped.</p><p>My colleague at <em>The Washington Post</em>, Drew Harwell, joined me to discuss the rise in age verification technology. He wrote <a href=\"https://www.washingtonpost.com/technology/2024/08/07/face-scanning-kids-online-privacy/\">a great piece</a> recently about why every app suddenly wants to scan your face, whether a face scan can even pin point your age, and how this technology is veering into a privacy nightmare. </p><p>Most American’s don’t look their age! And people age at different rates, especially based on demographic factors, lifestyle differences, and more. Also, tying your government ID and other personal details to your activity online would come with some scary downsides. Drew writes:</p><blockquote><p>With promises of protecting children, a little-known group of companies in an experimental corner of the tech industry known as “age assurance” has begun engaging in a massive collection of faces, opening the door to privacy risks for anyone who uses the web.</p><p>The companies say their age-check tools could give parents a better sense of control and peace of mind. But <strong>by scanning tens of millions of faces a year, the tools could also subject children — and everyone else — to a level of inspection rarely seen on the open internet and boost the chances their personal data could be hacked, leaked or misused.</strong></p><p>Companies such as Yoti, Incode and VerifyMyAge increasingly work as digital gatekeepers, asking users to record a live “video selfie” on their phone or webcam, often while holding up a government ID, so the AI can assess whether they’re old enough to enter.</p><p>Some of the biggest social networks, such as Facebook, Instagram and TikTok, now use age-check tools to detect and restrict their youngest users. OpenAI uses them for its ChatGPT chatbot; so, too, do a number of online gaming and adult-content sites, including Pornhub and OnlyFans.</p><p>Nineteen states, home to <strong>almost 140 million Americans, have passed or enacted laws requiring online age checks since the beginning of last year</strong>, including Virginia, Texas and Florida. For the companies, that’s created a gold mine: Employees at Incode, a San Francisco firm that runs more than 100 million verifications a year, now internally track state bills and contact local officials to, as senior director of strategy Fernanda Sottil said, “understand where … our tech fits in.”</p><p>But while the systems are promoted for safeguarding kids, <strong>they can only work by inspecting everyone — surveying faces, driver’s licenses and other sensitive data in vast quantities.</strong> </p><p>Alex Stamos, the former security chief of Facebook, which uses Yoti, <a href=\"https://archive.ph/o/7FVWs/https://www.threads.net/@alex.stamos/post/C9CnpY9uWbO/?xmt=AQGzyoatPhG9zw4v5QhLOmk9aTm7_Gw15tW4gc4IV6Q1ww\">said</a> “most age verification systems range from ‘somewhat privacy violating’ to ‘authoritarian nightmare.’”</p></blockquote><p><strong>LISTEN:</strong> <a href=\"https://open.spotify.com/episode/2vCRjyFP3pZXJ7WRgY35vM\">The Problem With Age Verification Online</a></p><div><div><div><p>Thanks for reading! Subscribe for free to receive new posts and support my work.</p></div><div><div></div><div></div></div></div></div><p>What do you want to see more of from this newsletter? Let me know!</p><p><strong>For more great content <a href=\"https://www.instagram.com/taylorlorenz3.0/\">follow my meme page</a>, subscribe to <a href=\"https://www.youtube.com/taylorlorenz\">my YouTube channel</a>, and <a href=\"https://www.instagram.com/channel/AbZQPs8zLytuVxvh/\">join my Instagram broadcast channel</a> where I share links all week long.</strong></p><p><strong>Listen to my podcast Power User on Apple Podcasts:</strong></p><div></div>","author":"Taylor Lorenz","siteTitle":"usermag.co","siteHash":"95f273abc07d53f60c12a9877d5e701fc5d46103659afbdcd53f0429eec6280d","entryHash":"dfd2e965cf6e769ddee5dec0b4502d861daba9b5bbf3e90c2ad8d954ab05c123","category":"Sites"}