{"title":"Baker&#8217;s Chocolate Wasn&#8217;t Made For Bakers","link":"https://kottke.org/24/11/bakers-chocolate-wasnt-made-for-bakers","date":1732221386000,"content":"\n        <p>I hope this doesn’t ruin your day, but <a href=\"https://en.wikipedia.org/wiki/Baker%27s_Chocolate\">Baker’s Chocolate wasn’t created for bakers</a>, it’s chocolate originally produced in Dorchester, MA by John Hannon with his partner Dr. James Baker. Hannon sailed to the West Indies in 1779 and never came back, so Dr. Baker changed the name to the Baker Chocolate Company.</p>\n\n<p>Additionally, German Chocolate Cake isn’t German. <a href=\"https://en.wikipedia.org/wiki/German_chocolate_cake\">A homemaker from Dallas sent the Dallas Morning News a recipe for German’s Chocolate Cake</a> made with a sweet baking chocolate invented by Samuel German in 1853. (I’m not including the name of the homemaker because she’s listed everywhere as Mrs. Husband’s Name and YOU KNOW that guy never picked up a sifter to help.) I personally don’t believe coconut or nuts belong in dessert so I don’t fw German Chocolate Cake if I can help it. </p>\n\n<p>Here’s where you’re about to get really mad. Here’s where you’re about to blow a gasket. Here’s the thing what will make you absolutely furious like me. Guess which company’s sales increased 73% after the popularization of German Chocolate Cake as a thing Americans were making regularly? That’s right, it’s Baker’s Chocolate Company, Samuel German’s employer in 1853 when he invented the chocolate. (via <a href=\"https://bsky.app/profile/parsnip.bsky.social\">@parsnip.bsky.social</a>)</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/chocolate\">chocolate</a> · <a href=\"https://kottke.org/tag/cooking\">cooking</a> · <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/language\">language</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/11/bakers-chocolate-wasnt-made-for-bakers\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"dfd48039d7671b1babee2cb7bae86840fc00aace7c003be81b777d0e461ca4bf","category":"Sites"}