{"title":"On Offensive Questions","link":"https://www.usv.com/writing/2024/10/on-offensive-questions/","date":1728911096000,"content":"<p>On Friday night I went to Kol Nidre services for Yom Kippur, which is the holiest of Jewish holidays. When services concluded, a Palestinian, Aziz, and an Israeli, Maoz, came onstage to talk about their thoughts and feelings about war in the Middle East and whether they believed a resolution to the conflict was possible. Both of the Maoz’s parents were murdered in the October 7 attack, and Aziz’s brother was killed by the IDF when he was 10.  Both are committed to finding peace.</p>\n<p>Aziz told the audience a story that I found deeply moving and important. This is a paraphrased recap. He invited his father to one of his presentations on creating a bridge between Israelis and Palestinians. There were many Israelis and Palestinians in attendance. His father raised his hand and stood up to ask a question: “Do you actually believe the Holocaust happened?” And then there was silence. Aziz was embarrassed by what he perceived to be a deliberately offensive question.</p>\n<p>But then something happened. A famous rabbi stood up and said: “How can I possibly be offended by that question? If you have never been taught about the history of the Holocaust, how can I expect you to understand its history and significance?” He went on to share that his father was a holocaust survivor, and then he invited Aziz’s father to the Holocaust Museum and a tour of concentration camps to share what had happened. His father agreed to visit with him.</p>\n<p>Then, another surprising thing happened. Over seventy Palestinians in attendance also asked if they could attend. They said they all wanted to ask the same question, but didn’t because they thought it would be offensive and cause more harm and animosity. But the spirit of the question was genuine – they really wanted to know whether Israelis believed the Holocaust actually happened. They all went on the tour with Aziz’s father.</p>\n<p>The ideas behind this story were eye-opening to me. We have become so scared to ask questions that we think may offend people or rub them the wrong way, even when they come from a place of genuine kindness and inquisitiveness. Will they think I’m insensitive? Am I not supposed to say this word or phrase? Am I allowed to ask this? Will there be backlash? The past decade has been marked by this fear.</p>\n<p>A big piece of this is because people are quick to react when they hear something offensive. We assume the worst: malice and ignorance and deliberate offense. We are looking for a fight and are becoming increasingly conditioned to do so. We are polarized with no regard for the infinite grey areas that surround us. We seldom provide the benefit of the doubt or put ourselves in the shoes of the perceived offender. As the rabbi said, “How can one be offended if the question asker knows not of what they ask?”</p>\n<p>I have always thought of first-principles thinking as asking “Why? Why? Why? Why? Why?” until one reaches the root of something. It reminds me of how children navigate the world, fearlessly asking Why? until they get to some semblance of a satisfactory answer they can comprehend. We lose this fearlessness overtime. It becomes stifled by vanity and concern of what others may think. But it’s the only way to truly understand something – asking someone questions eye to eye, face to face.</p>\n<p>As the Jewish New Year commences, I hope to have the courage to ask the questions that I genuinely want to understand the answers to, even when it requires an uncomfortable conversation or even may offend. And I hope to have the awareness and peace of mind to provide those doing the hard question-asking the benefit of the doubt and assume the best in them.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/10/on-offensive-questions/\">On Offensive Questions</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"dfea6b534c877506a0df3e91213045be6c735cf7a385d4472e6a0fd3a08d127e","category":"Sites"}