{"title":"Startup Mortality Rates","link":"https://www.usv.com/writing/2024/09/startup-mortality-rates/","date":1726059482000,"content":"<p>A friend of mine stopped by the USV office the other morning and asked me about startup mortality rates. Her business sells to startups and big companies in roughly equal measure and she told me they were seeing a rising rate of startups closing up (and thus churning as customers). While churn is never good, you really can’t beat yourself up too much about your customers going out of business. She wanted to know what we are seeing.</p>\n<p>Our portfolio has been relatively free of startup mortality in the last couple of years but it is something we expect for, plan for, and underwrite for.</p>\n<p>I have always said this, on my blog and in person, about what we have seen at USV and what I have seen in other early stage venture funds I’ve worked on and invested in:</p>\n<p>1/3 are good investments</p>\n<p>1/3 turn into something but you wish you hadn’t made the investment</p>\n<p>1/3 are zeros</p>\n<p>Another friend of mine asked me a similar question via email this week and pointed me to something out of Nate Silver’s book, On the Edge .  Nate breaks down risk in data driven ways and uses as examples poker, venture capital, crypto, etc.  The book quotes some figures from Marc Andreessen wherein he outlines that a16z’s funds perform as follows (note: he also broadly says these are ‘top decile’ fund performance numbers, too):</p>\n<p>25% of investments make zero return (i.e. 100% write offs)</p>\n<p>25% produce a return greater than zero but less than 1x (i.e. are losses)</p>\n<p>25% produce a return between 1x-3x</p>\n<p>15% produce a return between 3x-10x</p>\n<p>10% produce a return of 10x or greater</p>\n<p>If you bucket the first two as “zeros” or near zeros, the third one as “something you wish you hadn’t invested in” and the last two as good investments, you get to roughly the same 1/3, 1/3, 1/3 that I like to use.</p>\n<p>Of course, these are numbers over a very long period of time. Startup mortality rates rise and fall based on the vibrancy of the overall fundraising market and at times will be higher and at times will be lower.</p>\n<p>But if you look at the data over a very long periods of time, you see that a small percentage of investments produce all of the returns. And that has always been the case for the fortyish years I have been in early stage venture capital.</p>\n<p>Maybe that will change but it hasn’t yet.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/startup-mortality-rates/\">Startup Mortality Rates</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Fred Wilson","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"e088454b687920e1b42e1ce8a8f1155e70d7cd97b3624b29590e00cbd605a4a9","category":"Sites"}