{"title":"Anti-chameleon","link":"https://sive.rs/antic","date":1570752000000,"content":"<p>\nI don’t know why I have this rebellious nature.\nI tend to want to be the opposite of my surroundings.\n</p><p>\nAt serious formal events, I can’t stop laughing inside.\nAt crazy festivals, I want to hide and read a book.\n</p><p>\nMy ambitious friends bring out the slacker in me.\nMy lethargic friends make me feel like superman.\n</p><p>\nWhen I moved to Boston, as a teen, and everyone was wearing black, I dressed in only white.\nI remind new-agey people of the scientific method.\n</p><p>\nIs it a desire for balance?\nTo represent what seems under-represented in this situation?\nIs it my love of seeing the other side?\n</p><p>\nI hear I’m not supposed to react like this.\nI’m supposed to be the same, no matter what’s around.\n</p><p>\nBut I’m not the same from day to day, even when alone.\nI rebel against myself, too.\nIf I’ve been thinking or acting one way for too long, I try another way.\n</p><p>\nIt’s worked pretty well for me so far.\n<strong>\nI’m super-motivated by the horror of seeing the opposite of what I want.\n</strong>\n</p>\n<ul><li>\nSeeing someone waste their talent motivates me to get back to practicing and creating.\n</li><li>\nSeeing a person in horrible health motivates me to be healthy.\n</li><li>\nSeeing someone freaking out motivates me to be calm.\n</li><li>\nSeeing someone being selfish motivates me to be generous.\n</li></ul>\n<p>\nThe list goes on.\nIt’s been net positive.\nSo, I’m not fighting it for now.\n</p><p>\n(P.S. I’ll never argue against preserving nature.)\n</p>\n<a href=\"http://www.marcinryczek.com/sales-photo/a-man-feeding-swans-in-the-snow.html\"><img src=\"/images/swans.jpg\" /></a>\n<div>“A Man Feeding Swans in the Snow” photo © <a href=\"http://www.marcinryczek.com/sales-photo/a-man-feeding-swans-in-the-snow.html\">Marcin Ryczek</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e091dc00b6f1e5a7f2f2c6fe2a2b832643e6f2dc024b81ccdb92bbee365022c3","category":"default"}