{"title":"Daydreaming the downside, for once","link":"https://sive.rs/ddown","date":1569974400000,"content":"<p>\nA few years ago, I thought it would be fun to get into camping.\n</p><p>\nI live in New Zealand!\nHow can I not?\nI daydreamed about it, picturing how much fun it could be.\nI read a book about it.\n</p><p>\nI carefully picked out then bought some highly-recommended gear: a tent, two sleeping bags, two air mattresses, and a light backpack.\n</p><p>\nWe used it once.\nIt’s still in my garage.\n</p>\n…\n<p>\nLast year, I thought it would be fun to get a <a href=\"https://www.native-instruments.com/en/products/maschine/production-systems/maschine/\">Maschine</a>.\n</p><p>\nA new way of making music!\nI daydreamed about it, picturing how much fun it could be.\nI read about it and watched videos about it.\n</p><p>\nAfter a few weeks of this, I felt the time was right.\nI bought one.\nI played with it a while for the first day, then got back to my normal life, intending to spend more time with it.\nBut I never did.\n</p><p>\nEvery day I would look at it, thinking I should use it.\nAfter half a year, I gave up, and gave it to a friend.\n</p>\n…\n<p>\nLast week, I thought it would be fun to get a new bicycle.\n</p><p>\nI’ve never tried a carbon frame, <a href=\"https://www.sram.com/en/sram/road/collections/etap-axs\">modern gearing</a>, or any of the cool new developments in bicycle tech.\nI live in <a href=\"https://www.oxfordtimes.co.uk/resources/images/9486391.jpg\">Oxford, a cycling city</a>!\nHow can I not?\n</p><p>\nI’ve been daydreaming about it, picturing how much fun it could be.\n</p><p>\n<strong>\nWait!\n</strong>\nHold on.\nHave I learned nothing?\n</p><p>\n<strong>\nSo I tried picturing the downside, instead.\n</strong>\n</p><p>\nI pictured myself not using it, like the camping gear, Maschine, and <a href=\"https://en.wikipedia.org/wiki/Motorhome\">other things</a> I didn’t mention here.\n<strong>\nI remembered the pain of guilt, regret, and waste.\n</strong>\nThe conflicted feelings of wanting this thing, but not quite enough.\n</p><p>\nAnd I decided against it.\n</p>\n…\n<p>\nThat said, I’m not sure what to conclude.\n</p>\n<ul><li>\nThe only mistake was buying instead of renting?\n</li><li>\nGive up on trying new things, and just amplify my current focus?\n</li><li>\nDaydream and learn all about new things, but stop thinking I need to own them?\n(Awareness is enough for me?)\n</li><li>\nOr maybe the mistake was giving up?\n<a href=\"https://sive.rs/book/AtomicHabits\">Building new habits takes time</a> and effort.\nAfter that initial challenge, my life could be richer by the expanded activities in my repertoire.\n</li><li>\nSomething else?\n</li></ul>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e0c5566fc1d8116b934989607ada13daf594d2bc617fbb3d3be67bd9980ec459","category":"default"}