{"title":"What Birds Dream About: The Evolution of REM and How We Practice the Possible in Our Sleep","link":"https://www.themarginalian.org/2024/07/02/birds-dream-rem/","date":1719951837000,"content":"<h3>“It may be that in REM, this gloaming between waking consciousness and the unconscious, we practice the possible into the real… It may be that we evolved to dream ourselves into reality — a laboratory of consciousness that began in the bird brain.”</h3>\n<hr />\n<p><em>This essay originally appeared in <a href=\"https://www.nytimes.com/2024/03/26/science/birds-dreaming-rem-sleep.html\" target=\"_blank\">The New York Times</a></em></p>\n<p>I once dreamed a kiss that hadn’t yet happened. I dreamed the angle at which our heads tilted, the fit of my fingers behind her ear, the exact pressure exerted on the lips by this transfer of trust and tenderness.</p>\n<p>Freud, who catalyzed the study of dreams with <a href=\"https://www.themarginalian.org/2016/02/09/freud-the-interpretation-of-dreams/\">his foundational 1899 treatise</a>, would have discounted this as a mere chimera of the wishful unconscious. But <a href=\"https://www.themarginalian.org/2012/08/13/the-twenty-four-hour-mind-rosalind-cartwright/\">what we have since discovered</a> about the mind — particularly about the dream-rich sleep state of rapid-eye movement, or REM, unknown in Freud’s day — suggests another possibility for the adaptive function of these parallel lives in the night.</p>\n<figure><a href=\"https://society6.com/product/yellow-crowned-night-heron-by-john-hames-audubon-1840-benefitting-the-audubon-society_print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=680%2C1209&amp;ssl=1\" width=\"680\" height=\"1209\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=320%2C569&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=600%2C1067&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=240%2C427&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=768%2C1366&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=864%2C1536&amp;ssl=1 864w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_Audubon_TheMarginalian.jpg?resize=1152%2C2048&amp;ssl=1 1152w\" /></a><figcaption>Yellow-crowned night heron by John James Audubon, 1840. (Available as <a href=\"https://society6.com/product/yellow-crowned-night-heron-by-john-hames-audubon-1840-benefitting-the-audubon-society_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/yellow-crowned-night-heron-by-john-hames-audubon-1840-benefitting-the-audubon-society_cards?curator=brainpicker\">stationery cards</a>, benefitting The Audubon Society.)</figcaption></figure>\n<p>One cold morning not long after the kiss dream, I watched a young night heron sleep on a naked branch over the pond in Brooklyn Bridge Park, head folded into chest, and found myself wondering whether birds dream.</p>\n<p>The recognition that nonhuman animals dream dates at least as far back as the days of Aristotle, who watched a sleeping dog bark and deemed it unambiguous evidence of mental life. But by the time Descartes catalyzed the Enlightenment in the 17th century, he had reduced other animals to mere automatons, tainting centuries of science with the assumption that anything unlike us is inherently inferior.</p>\n<p>In the 19th century, when the German naturalist Ludwig Edinger performed the first anatomical studies of the bird brain and discovered the absence of a neocortex — the more evolutionarily nascent outer layer of the brain, responsible for complex cognition and creative problem-solving — he dismissed birds as little more than Cartesian puppets of reflex. This view was reinforced in the 20th century by the deviation, led by B.F. Skinner and his pigeons, into behaviorism — a school of thought that considered behavior a Rube Goldberg machine of stimulus and response governed by reflex, disregarding interior mental states and emotional response.</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=680%2C919&amp;ssl=1\" width=\"680\" height=\"919\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?w=1888&amp;ssl=1 1888w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=320%2C433&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=600%2C811&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=240%2C324&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=768%2C1038&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=1136%2C1536&amp;ssl=1 1136w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?resize=1515%2C2048&amp;ssl=1 1515w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/Archaeopteryx_lithographica.jpg?w=1360&amp;ssl=1 1360w\" /><figcaption><em>Archaeopteryx</em> specimen, Natural History Museum, Berlin. (Photograph: H. Raab)</figcaption></figure>\n<p>In 1861, just two years after Darwin’s publication of <em>On the Origin of Species</em>, a fossil was discovered in Germany with the tail and jaws of a reptile and the wings and wishbone of a bird, sparking the revelation that birds had evolved from dinosaurs. We have since learned that, although birds and humans haven’t shared a common ancestor in more than 300 million years, a bird’s brain is much more similar to ours than to a reptile’s. The neuron density of its forebrain — the region engaged with planning, sensory processing, and emotional responses, and on which REM sleep is largely dependent — is comparable to that of primates. At the cellular level, a songbird’s brain has a structure, the dorsal ventricular ridge, similar to the mammalian neocortex in function if not shape. (In pigeons and barn owls, the DVR is structured like the human neocortex, with both horizontal and vertical neural circuitry.)</p>\n<figure><a href=\"https://www.themarginalian.org/2020/11/21/the-lost-spells-macfarlane-morris/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2020/11/owl-closeup.jpg?w=1200&amp;ssl=1\" /></a><figcaption>Art by Jackie Morris from <a href=\"https://www.themarginalian.org/2020/11/21/the-lost-spells-macfarlane-morris/\"><em>The Lost Spells</em></a></figcaption></figure>\n<p>Still, avian brains are also profoundly other, capable of feats unimaginable to us, especially during sleep: Many birds sleep with one eye open, even during flight. Migrating species that traverse immense distances at night, like the bar-tailed godwit, which covers the 7,000 miles between Alaska and New Zealand in eight days of continuous flight, engage in unihemispheric sleep, blurring the line between our standard categories of sleep and wakefulness.</p>\n<p>But while sleep is an outwardly observable physical behavior, dreaming is an invisible interior experience as mysterious as love — a mystery to which science has brought brain imaging technology to illuminate the inner landscape of the sleeping bird’s mind.</p>\n<p>The first electroencephalogram of electrical activity in the human brain was recorded in 1924, but EEG was not applied to the study of avian sleep until the 21st century, aided by the even more nascent functional magnetic resonance imaging, developed in the 1990s. The two technologies complement each other. In recording the electrical activity of large populations of neurons near the cortical surface, EEG tracks what neurons do more directly. But fMRI. can pinpoint the location of brain activity more precisely through oxygen levels in the blood. Scientists have used these technologies together to study the firing patterns of cells during REM sleep in an effort to deduce the content of dreams.</p>\n<figure><a href=\"https://society6.com/product/zebra-finch-by-f-w-frohawk-1899-benefitting-the-audubon-society_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=680%2C1031&amp;ssl=1\" width=\"680\" height=\"1031\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=320%2C485&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=600%2C910&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=240%2C364&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=768%2C1164&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/ZebraFinch_TheMarginalian.jpg?resize=1013%2C1536&amp;ssl=1 1013w\" /></a><figcaption>Zebra finch by F. W. Frohawk, 1899. (Available as <a href=\"https://society6.com/product/zebra-finch-by-f-w-frohawk-1899-benefitting-the-audubon-society_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/zebra-finch-by-f-w-frohawk-1899-benefitting-the-audubon-society_cards?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Audubon Society)</figcaption></figure>\n<p>A study of zebra finches — songbirds whose repertoire is learned, not hard-wired — mapped particular notes of melodies sung in the daytime to neurons firing in the forebrain. Then, during REM, the neurons fired in a similar order: The birds appeared to be rehearsing the songs in their dreams.</p>\n<p>An fMRI study of pigeons found that brain regions tasked with visual processing and spatial navigation were active during REM, as were regions responsible for wing action, even though the birds were stilled with sleep: They appeared to be dreaming of flying. The amygdala — a cluster of nuclei responsible for emotional regulation — was also active during REM, hinting at dreams laced with feeling. My night heron was probably dreaming, too — the folded neck is a classic marker of atonia, the loss of muscle tone characteristic of the REM state.</p>\n<p>But the most haunting intimation of the research on avian sleep is that without the dreams of birds, we too might be dreamless. No heron, no kiss.</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=680%2C1095&amp;ssl=1\" width=\"680\" height=\"1095\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=320%2C515&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=600%2C967&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=240%2C387&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=768%2C1237&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=954%2C1536&amp;ssl=1 954w\" /><figcaption>The <a href=\"https://www.themarginalian.org/2024/05/28/passenger-pigeon/\">passenger pigeon</a> by John James Audubon, 1842. (Available as <a href=\"https://society6.com/product/passenger-pigeon-by-john-james-audubon-1842-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/passenger-pigeon-by-john-james-audubon-1842-benefitting-the-nature-conservancy_cards?curator=brainpicker\">stationery cards</a>, benefitting The Audubon Society.)</figcaption></figure>\n<p>There are two primary groups of living birds: the flightless Palaeognathae, including the ostrich and the kiwi, which have retained certain ancestral reptilian traits, and Neognathae, comprising all other birds. EEG studies of sleeping ostriches have found REM-like activity in the brainstem — a more ancient part of the brain — while in modern birds, as in mammals, this REM-like activity takes place primarily in the more recently developed forebrain.</p>\n<p>Several studies of sleeping monotremes — egg-laying mammals like the platypus and the echidna, the evolutionary link between us and birds — also reveal REM-like activity in the brainstem, suggesting that this was the ancestral crucible of REM before it slowly migrated toward the forebrain.</p>\n<p>If so, the bird brain might be where evolution designed dreams — that secret chamber adjacent to our waking consciousness where we continue to work on the problems that occupy our days. Dmitri Mendeleev, after puzzling long and hard over the arrangement of atomic weights in his waking state, <a href=\"https://www.themarginalian.org/2016/02/08/mendeleev-periodic-table-dream/\">arrived at his periodic table in a dream</a>. “All the elements fell into place as required,” he recounted in his diary. “Awakening, I immediately wrote it down on a piece of paper.” Cosmologist Stephon Alexander <a href=\"https://www.themarginalian.org/2021/12/13/stephon-alexander-fear-of-a-black-universe/\">dreamed his way</a> to a groundbreaking insight about the role of symmetry in cosmic inflation that earned him a national award from the American Physics Society. For Einstein, the central revelation of relativity took shape in a dream of cows simultaneously jumping up and moving in wavelike motion.</p>\n<figure><a href=\"https://www.themarginalian.org/2015/03/04/david-the-dreamer-bergengren-freud/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/02/davidthedreamer7.jpg\" width=\"600\" /></a><figcaption>Art by Tom Seidmann-Freud — Sigmund Freud’s niece — for the philosophical 1922 children’s book <a href=\"https://www.themarginalian.org/2015/03/04/david-the-dreamer-bergengren-freud/\" target=\"_blank\"><em>David the Dreamer</em></a></figcaption></figure>\n<p>As with the mind, so with the body. Studies have shown that people learning new motor tasks “practice” them in sleep, then perform better while awake. This line of research has also shown how mental visualization helps athletes improve performance. Renata Adler touches on this in her novel <em>Speedboat</em>: “That was a dream,” she writes, “but many of the most important things, I find, are the ones learned in your sleep. Speech, tennis, music, skiing, manners, love — you try them waking and perhaps balk at the jump, and then you’re over. You’ve caught the rhythm of them once and for all, in your sleep at night.”</p>\n<p>It may be that in REM, this gloaming between waking consciousness and the unconscious, we practice the possible into the real. It may be that the kiss in my dream was not nocturnal fantasy but, like the heron’s dreams of flying, the practice of possibility. It may be that we evolved to dream ourselves into reality — a laboratory of consciousness that began in the bird brain.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"e0d1bfb2469b8b62194b94115b50750d66b44abdb19ceac89a7b8d60b217caef","category":"default"}