{"title":"How we got here","link":"https://www.garbageday.email/p/got","date":1711389983000,"content":"<div><div><p><i>(Today’s Garbage Day is a little different than usual. We’ll be back Wednesday with the normal garbage.)</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/83449363-cd17-4e34-a437-4a7f357adaa0/Screenshot_2024-03-25_at_1.44.26_PM.png?t=1711388682\" /><div><a href=\"https://twitter.com/KensingtonRoyal?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\"><span><p>(X.com/KensingtonRoyal)</p></span></a></div></div><p>On Friday, Kate Middleton, or Catherine, the Princess of Wales, revealed that she has cancer. This very briefly sent the internet <a href=\"https://www.nbcnews.com/news/world/princess-kates-cancer-treatment-news-sparks-remorse-people-spread-cons-rcna144684?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">into free fall</a>, with many users admitting they feel more than a little gross about all the memes and conspiracy theories they've been sharing about her for the last two months. I say \"brief\" because many users have since pivoted and are now <a href=\"https://twitter.com/cbouzy/status/1771241672178803026?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">just sharing</a> <i>different</i> conspiracy theories about Kate.</p><p>This has also led to a very vigorous round of tut-tutting from the respectable class, with <i>The Atlantic</i> going so far as to publish a piece titled, \"<a href=\"https://www.theatlantic.com/ideas/archive/2024/03/kate-middleton-cancer-announcement/677863/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">I Hope You All Feel Terrible Now</a>\". Also, the UK government told the media they now think Russia and China <a href=\"https://www.telegraph.co.uk/news/2024/03/24/china-russia-fuelling-attacks-princess-wales-after-cancer/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">were behind</a> the viral chatter. C'mon, man.</p><p>My researcher Adam and I put together a timeline of how the viral frenzy started and can definitively say that it was not foreign bad actors tricking Western internet users into being mean and weird about a member of the royal family taking a suspiciously long time to post a proof of life update. Instead, it was a combination of factors — and factions — who were amplified by poorly moderated and badly incentivized social platforms and egged on by truly one of the worst PR blunders in recent memory. Here's how #WhereIsKate swallowed the web.</p><p>On January 17th, Kensington Palace <a href=\"https://twitter.com/KensingtonRoyal/status/1747620432390299850?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">announced</a> that Kate was in the hospital and would be there for 10-14 days recovering from “planned abdominal surgery” and wouldn’t be doing any public events until “after Easter.” About a week later, the #WhereIsKate hashtag first appeared on X. </p><p>A user named @Ilovelouchie <a href=\"https://twitter.com/Ilovelouchie/status/1751062689202196806?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">wrote</a> on January 26th, \"Fingers in faces, shoving, incandescent rage, screaming matches, a sudden hospitalization, a disappearance for months. #Bulliam did something and like Harry, Kate was told to shut up or else. She doesn’t even have custody of her kids, Charles does. #WhatWilldid?#WhereisKate.\"</p><p>The #bulliam hashtag in the post is a portmanteau of \"bully\" and \"William\" and it's popular with the Sussex Squad, a largely US-based pro-Prince Harry and Meghan Markle fandom that, due to passages from Harry's memoir <i>Spare</i>, tend to believe Prince William is abusive. An hour after @Ilovelouchie's post, a slightly larger Sussex Squad account named @KandiceDean1 <a href=\"https://twitter.com/KandiceDean1/status/1751081154256437608?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">picked up</a> the hashtag, adding another, #IsKateAlive.</p><p>And for the next few days, the hashtag was used almost exclusively by Sussex Squad members. On January 29th, the day Kate was released by the hospital, though, the hashtag began to <a href=\"https://twitter.com/MrsEricaGarza/status/1751993339702903228?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">trend</a> in the US on X. This also led to a small uptick in attention <a href=\"https://www.tiktok.com/@matta_of_fact/video/7330014504551501099?_r=1&amp;_t=8jV7oXkER1C&amp;social_sharing=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">on TikTok</a>. But for the next month, the hashtag didn't spread very far. In fact, if the Palace had handled this correctly, it's likely the whole thing would have quickly receded into the background radiation of internet discourse and vanished. But, of course, they didn't handle this properly.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/29f855b7-d40d-4904-9014-0700bd29c8f5/Screenshot_2024-03-25_at_1.53.41_PM.png?t=1711389236\" /><div><span><p>(<a href=\"https://twitter.com/Ilovelouchie/status/1751062689202196806?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">X.com/Ilovelouchie</a>)</p></span></div></div><p>On February 5th, Buckingham Palace <a href=\"https://www.bbc.com/news/uk-68208157?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">announced</a> that King Charles had been diagnosed with cancer. Which pointed a massive spotlight on the royal family. Social media is too big to have a real cultural memory anymore, but it does tend to have a muscle memory of sorts now and when things go viral they don't so much die out, as much as they mutate into a quiet, but pervasive fandom or meme template. And after Queen Elizabeth's funeral in 2022, there are now a lot of users who now seem to be in a permanent state of excited anticipation for another royal funeral. Especially <a href=\"https://www.tumblr.com/search/king%20charles?src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">on Tumblr</a>.</p><p>The moment #WhereIsKate broke containment, as <i>Embedded</i> <a href=\"https://embedded.substack.com/p/the-great-kate-middleton-backtracking?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">phrased it</a>, was most likely February 27th. That's when Prince William <a href=\"https://www.bbc.com/news/uk-68413542?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">pulled out</a> of attending his godfather's memorial service due to what the Palace called a \"personal matter\". Though they said that the \"personal matter\" wasn't related to Kate (which was a lie) and said that Kate was \"doing well,\" which caught the attention of a big <a href=\"https://twitter.com/JessieBlueAZ/status/1762708039914992047?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">#resistance account</a> that then shared the #WhereIsKate hashtag. Which is when X user @roastmalone_ posted a joke about Kate recovering from a Brazilian butt lift (the user has, probably smartly, <a href=\"https://twitter.com/roastmalone_/status/1762586081814544434?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">deleted</a> the post now).</p><p>The BBL post cleaved the trend in two, giving non-royal watchers a way to interact with it via memes and giving diehards more space to start writing true crime fan fiction. This would also be when users started <a href=\"https://twitter.com/search?q=kate+middleton+the+unknown&amp;src=typed_query&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">joking</a> that Kate was working as The Unknown at the AI Willy Wonka event in Glasgow.</p><p>The next day, Kensington Palace went into overdrive, suddenly deciding that now was the right time to refute what they were <a href=\"https://www.thesun.co.uk/royals/26254336/prince-william-return-work-thanksgiving-service/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">calling</a> \"wild conspiracy theories,\" and, once again, said that Kate was \"doing well\". Which only made the interest in her whereabouts more rabid. My \"Kate Middleton is doing well\" T-shirt has people asking a lot of questions already answered by my shirt, etc. A <i>Page Six</i> article about Kate \"doing well\" was <a href=\"https://twitter.com/PopCrave/status/1763187972059418774?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">then aggregated</a> by Pop Crave, the most important news outlet of our time, which turned a weird story happening on the periphery of culture into the biggest topic in the world.</p><p>On March 4th, TMZ <a href=\"https://www.tmz.com/2024/03/18/kate-middleton-seen-new-video-windsor-farm-shop-prince-william/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">published</a> a paparazzi photo of Kate driving in a car, which users were quick to claim was a body double. Because that's just what people do now. The body double conspiracy <a href=\"https://twitter.com/ZandiSussex/status/1764735462244311086?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">was popularized</a>, once again, by the Sussex Squad. But other royal fandom factions were engaging, as well, with genuine concern for Kate spreading across social media. And, once again, this could have lost steam here. This is likely the last chance we had to get off the disinfo freeway. Instead, however, the Palace decided to publish an Instagram post.</p><p>This is a good moment to pause and explain, generally, how the royals interact with the media. As my friend, and very excellent royal reporter, Ellie Hall (who helped read over this story) <a href=\"https://www.niemanlab.org/2024/03/this-is-just-weird-buzzfeed-news-former-royals-reporter-on-kate-middleton-palace-press-and-distrust-in-the-media/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">told Nieman Lab</a>, there is not a singular press apparatus for the royals. Each family unit has their own very small, siloed team. And these teams tend to leak information about <i>other</i> members of the royal family, rather than, you know, do their jobs like normal PR people. They also, as a matter of course, do not respond to internet discourse — and never on the record, like they did many times on February 28th.</p><p>They also have a very unique relationship with UK media, providing them anonymous quotes and approved photos and videos in exchange for continued \"access\". And many UK tabloids are happy to play ball. If you see a UK newspaper aggressively going after a member of the royal family it's likely because other members of the royal family want them to. The fact no one serious in UK media was engaging with this was my first hint that something was going on behind the scenes. British media runs on an upper-middle-class garden party whisper network and by late February, it seemed clear to me that London media's various WhatsApp groups were struggling with how to approach this. It's worth noting that no British news outlet published the photo of Kate in the car.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/68e0131e-c606-4f16-a538-714dfcfaf68b/Screenshot_2024-03-25_at_1.54.38_PM.png?t=1711389294\" /><div><span><p>(<a href=\"https://twitter.com/rubynaldrett/status/1767184942859997400?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">X.com/rubynaldrett</a>)</p></span></div></div><p>On March 10th, British Mother's Day, Kate's Instagram page published the now-infamous Photoshop. This is when TikTok truly entered the picture. The #WhereIsKate hashtag spiked on the app according to TikTok's metrics and users began dissecting its many bizarre visual inconsistencies. </p><p>A TikTok user named Allyn Aston <a href=\"https://www.tiktok.com/@allynaston/video/7344921409816251678?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">posted a video</a> that was viewed over a million times, claiming the photo was originally from November (<a href=\"https://www.thecut.com/article/kate-middleton-theory-edited-photo-november-fall.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">possible</a>). And, on X, a social media manager for UK paper <i>The Daily Mirror </i><a href=\"https://twitter.com/rubynaldrett/status/1767184942859997400?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">claimed</a> that Kate's face in the photo was ripped directly from a <i>Vogue</i> cover (almost impossible, not how faces or Photoshop works). Major news agencies quickly placed a kill order on the photo, saying that it was heavily altered. And even Instagram would later put a warning on the post.</p><p>UK media, likely embarrassed by the Instagram debacle, decided to fire what is best understood as a warning shot at the Palace. The same day the Photoshop went live, <i>The Independent</i> published a story that went very viral <a href=\"https://twitter.com/Independent/status/1766834273888162074?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">on X</a>, titled, \"Lady Rose Hanbury: Who is the Marchioness of Cholmondeley?\" <i>Tatler</i> also <a href=\"https://twitter.com/TheDuchessZone/status/1767239845724966912?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">promoted</a> an old story about Hanbury, but then deleted the post on X. Which only added fuel to the fire.</p><p>Hanbury has long been alleged to be Prince William's mistress, which the Palace has denied time and time again. But royal watchers believed the Palace was \"soft launching\" her to the public. I saw more than a few users claim that Prince William had to divorce Kate before he took the throne. Which is funny because the entire Church Of England was essentially invented to make it easier for kings to divorce their wives. <i>The Late Show with Stephen Colbert</i> <a href=\"https://www.youtube.com/watch?v=c1ZmbRXTKAs&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">picked up</a> the story about Hanbury on March 12th, though, and now her legal team <a href=\"https://www.vanityfair.com/style/rose-hanbury-sends-legal-notice-to-stephen-colbert-after-his-prince-william-affair-joke?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">has sent him</a> a notice demanding a retraction. UK libel laws! Thanks to the internet, they can follow you anywhere now. The funniest subplot of this entire thing, if you ask me, is that the attention on Hanbury led to Chinese internet users discovering that her manor house appears to be full of <a href=\"https://www.tiktok.com/@cathychen95/video/7347579297277807890?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">stolen Chinese relics</a>.</p><p>Kate, via posts on X and Instagram, <a href=\"https://pagesix.com/2024/03/11/royal-family/kate-middleton-apologizes-for-heavily-edited-post-surgery-family-photo/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">quickly apologized</a> for the photoshop, claiming she edited it herself, which I highly doubt. But the damage was done. TMZ <a href=\"https://www.tmz.com/2024/03/18/kate-middleton-seen-new-video-windsor-farm-shop-prince-william/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">published</a> another round of paparazzi photos, this time of Kate and Prince William at a farm in Windsor, which set off another round of body double conspiracies.</p><p>In terms of conspiracy theories that were circulating, many of them were centered on secret pregnancies. Also, lizard people, obviously. One TikTok account said that Kate was <a href=\"https://www.tiktok.com/@joysparkleshine/video/7345895459879161131?q=thomas+kingston&amp;t=1710947661557&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">secretly pregnant</a> with the baby of a man that people think was secretly murdered by the royal family — you can do your own googling there — and another now-deleted TikTok video claimed that Hanbury was <a href=\"https://www.tiktok.com/@aichareports/video/7346359043134344490?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">secretly pregnant</a>. And after the botched Instagram post, many newly-restored QAnon influencers on X started <a href=\"https://twitter.com/stephanegaddis/status/1771529575492727248?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">engaging</a> with the conspiracy theories, as well. When former President Obama was spotted at Downing Street last week, many users <a href=\"https://www.theroot.com/is-barack-obama-on-downing-street-to-solve-the-kate-mid-1851346249?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">claimed</a> he had been sent to the UK to find Kate. Sure, why not.</p><p>And that brings us to Friday, when Kate revealed that she was diagnosed with cancer and is seeking treatment. As Charlie Warzel <a href=\"https://www.theatlantic.com/technology/archive/2024/03/kate-middleton-cancer-memes/677868/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">wrote</a>, \"It was always going to end this way. The truth about Kate Middleton’s absence is far less funny, whimsical, or salacious than the endless memes and conspiracy theories suggested.\" But this also wasn't a simple case of the unruly masses being Bad Online. </p><p>Yes, the #WhereIsKate hashtag was initially spread by the Sussex Squad, a royal fandom subculture that hates Prince William and believes Kate is, at best, sort of racist. And a lot of the early gossip was motivated by an impulse to give Kate a taste of what Meghan Markle is <a href=\"https://twitter.com/mediumsizemeech/status/1771252978168528981?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">still experiencing</a> at the hands of the UK media. But if you're looking for someone to blame all of this on, it's clearly Kate's press team and, by extension, everyone in her life that supposedly cares about her. There were countless moments where her press team could have squashed all this, but they didn't. Instead, they let a woman who had just discovered she has cancer become a global laughing stock and, at one point, made her apologize for it! Absolute sicko shit. </p><p>But this is also just how our various institutions work — or more accurately do not work — now. Over the last 25 years we have slowly uploaded every part of our lives to a system of platforms run by algorithms that make money off our worst impulses. Well, the ones brands are comfortable advertising around. And for years we have wondered what the world might look like when we crossed the threshold into a fully online world. Well, we did. We crossed it. This is what it looks like. And it is already too vast and complicated and all-encompassing to blame any one individual for how it functions. If we want something new, we'd have to smash the whole thing and I don't think that's going to happen. So let's hope PR people, at the very least, can figure out how to deal with it going forward.</p><p><b><i>Adam Bumas contributed reporting and research to this story.</i></b></p><p><b><i>Ellie Hall contributed reporting to this piece.</i></b></p><hr /><div><h2><span><b>Think About Supporting Garbage Day!</b></span></h2><p><span>Garbage Day is largely supported by wonderful readers like you. And if you buy a subscription you get a bunch of fun stuff, like Discord access and the coveted weekend issue. It’s $5 a month or $45 a year, which is less than the cost of two Dunkin Donuts iced coffees a month. Wow what a steal! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\"><span> Upgrade </span></a></div><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.forbes.com/sites/thomasbrewster/2024/03/22/feds-ordered-google-to-unmask-certain-youtube-users-critics-say-its-terrifying/?sh=6ce29c101ca7&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">“Feds Ordered Google To Unmask Certain YouTube Users. Critics Say It’s ‘Terrifying.’”</a></p></li><li><p><a href=\"https://kevinmunger.substack.com/p/what-was-drake?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">“What was Drake?”</a></p></li><li><p><a href=\"https://slate.com/culture/2024/03/pitchfork-oral-history-music-festival-conde-nast-review.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">“The Oral History of Pitchfork”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://twitter.com/rb17460/status/1766120895200809432?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=how-we-got-here\" target=\"_blank\">some good Reddit action</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=166b10af-c3c7-4524-9fe0-dd8174ce458f&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"e1be0e7540311cea0020022db56407b0728813f78b2289bc942e94aec354a301","category":"default"}