{"title":"What CrowdStrike teaches us about risks & resilience","link":"https://om.co/2024/07/20/what-crowdstrike-crisis-teaches-us-about-risks-resilience/","date":1721530758000,"content":"<figure><img width=\"1024\" height=\"585\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-1024x585.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-1024x585.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-300x171.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-768x439.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-1536x878.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-192x110.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-1100x629.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything-560x320.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/07/InterconnectedEverything.jpg 1792w\" /></figure>\n\n\n\n<p>I had to bite my tongue and not comment on <a href=\"https://x.com/linakhanFTC/status/1814395610788929649\" target=\"_blank\">this tweet from</a> FTC Chair Lina Khan, who tried to make the current CrowdStrike situation a crisis because of “big tech” and “consolidation.”</p>\n\n\n\n<p></p><p>“How is it that you don’t understand systems, or their inherent complexity?”, I <a href=\"https://x.com/om/status/1814416890187657511\" target=\"_blank\">wanted to scream</a>.</p><p></p>\n\n\n\n<p>Well, if you give someone a hammer, everything looks like a nail. This lack of understanding of the complexity of our modern technology-reliant, digital-first world is why I believe we really need the Federal Trade Commission (and other regulators) <a target=\"_blank\" href=\"https://om.co/2024/07/16/why-ftc-needs-to-rethink-tech-regulation/\">to rethink regulation and regulatory frameworks</a>.</p>\n\n\n\n<p>CrowdStrike doesn’t quite fit the definition of a classic monopoly, but its impact, as shown by the widespread system failure, suggests otherwise. It isn’t the only service that helps guide the world in an invisible fashion. We need to rethink not only how we regulate but also what we regulate.</p>\n\n\n\n<p>Khan’s tweet, like many others I’ve seen in the wake of this week’s CrowdStrike crisis, only reinforces my hypothesis that with the abstraction of core technologies into buzzwords, most people involved in the technology ecosystem don’t quite understand the complexity of digital systems.</p>\n\n\n\n<p>I can certainly understand that a layperson doesn’t comprehend the complexity of technologies that touch their daily lives, but this lack of comprehension is widespread and deep among those who are important part of the technology ecosystem. Technical ineptitude afflicts everyone — from politicians and bureaucrats to company leaders and media (including the media covering technology).</p>\n\n\n\n<p>Five years ago, in <a target=\"_blank\" href=\"http://www.brokennature.org/redesigning-the-system/\">his essay about the need for systems thinking</a>, Adam Bly, founder of System (a True Ventures-backed company), pointed out that complexity is “an impossibly large network of interacting components, without central control, whose emergent behavior is much more elaborate than the sum of the behaviors of its individual parts.” He argued that we are “nearly at, the point where every world problem is intractable in isolation.”</p>\n\n\n\n<p>With technology, you could see it coming. A decade and a half ago, I bemoaned that Facebook Login could become a single point of failure for many internet services. I wasn’t trying to be <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Cassandra\">Cassandra</a> — instead, I was just highlighting the ever-increasing risk in the system. Facebook’s login failures have disrupted the internet on multiple occasions. With increasing frequency, we are reminded of this interconnected complexity and the growing magnitude of risk and failure.</p>\n\n\n\n<p>Fat fingers or a single line of errant code can bring down a telecom network. A misconfigured address on routers can bring the entire internet to a halt. When Amazon’s cloud goes offline, almost half the world’s internet offerings go on the blink. It seems that the timeless <a target=\"_blank\" href=\"https://en.wikipedia.org/wiki/Six_degrees_of_separation\">“six degrees of separation”</a> adage applies to machines and software as well.</p>\n\n\n\n<p>We are living with an interconnected digital nervous system. The big question to ask (and answer): How do we think of risk and resilience in our highly connected society? Perhaps we should start by ensuring everyone from regulators to media to technology buyers becomes well-versed in understanding the underlying technologies. Otherwise, we will have more CrowdStrikes, ensuing faux outrage and jingoism.</p>\n\n\n\n<p><strong>July 20, 2024. San Francisco</strong></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"e26e0d8949ad72e484f39e433708ead5481a2efcef941cccb54bdf58af5433bc","category":"default"}