{"title":"making a home on the internet","link":"https://keningzhu.com/journal/making-a-home-on-the-internet","date":1726061690000,"content":" \n\n\n  <a href=\"https://podcasts.apple.com/us/podcast/14-making-a-home-on-the-internet/id1731169431?i=1000669148626\" target=\"_blank\">\n    listen on apple\n  </a>\n\n\n\n\n  <a href=\"https://open.spotify.com/episode/7DYWZRYRhIhcKe9EuCLstI?si=ispk4zKaQwSPLLJyYUU7VA\" target=\"_blank\">\n    listen on spotify\n  </a>\n\n<hr />\n\n\n  <p>inhabiting a home on the internet is really about making space to be yourself, in public. you resist the digital flattening of the self and, instead, grow a wild ecosystem. how? first, through committing to your creative practice. in this episode, we’ll explore: </p><ul><li><p>what it means to inhabit a space</p></li><li><p>my three step, cyclical processes for growing a digital home -- create, curate, carve paths.</p></li><li><p>why focus on creation first, before structuring</p></li><li><p>Q&amp;A: how often do you need to maintain a website?</p></li><li><p>Q&amp;A: will things look jarring side by side?</p></li><li><p>and more…</p></li></ul><p><br />I hope this episode gives you a sense of permission and possibility for growing and tending to a creative world of your own. </p><p></p><p><strong>additional resources</strong><br /><a href=\"https://keningzhu.notion.site/House-on-the-Webs-Introduction-5c22f966677342b7b7250848a463cb03?pvs=4\" target=\"_blank\">house on the webs: introduction</a><br /><a href=\"https://keningzhu.notion.site/Day-0-Incubations-be27abc556164cd6b5399a44685cd99a?pvs=4\" target=\"_blank\">house on the webs: day 0 incubation work</a><strong><br /></strong><a href=\"https://keningzhu.com/journal/build-a-labyrinth-not-a-funnel\" target=\"_blank\">build a labyrinth, not a funnel</a><br /><a href=\"https://keningzhu.com/journal/build-a-world-not-an-audience\" target=\"_blank\">build a world, not an audience</a> <br /></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=1000w\" width=\"3000\" height=\"3000\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/207b6b07-3f85-4315-af38-9ff1736c67c6/ep14-9-11.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n<hr />\n\n\n  <h1>introduction </h1><p>In the last episode, I deconstructed the anatomy of a digital world, starting from the big picture of vision or intention.</p><p>In today's episode, we'll do the opposite.</p><p>We're going to start from the raw material, that is, your ongoing creative practice.</p><p>I will walk you through my process for when you already have a website, but want to make it feel less like a brochure and more like a world that you inhabit, a digital ecosystem.</p><p>This is really the question of how to make yourself at home on the internet, how to tend to your home and allow it to hold the multidimensionality of you rather than what usually happens, which is you flattening yourself to fit the digital space.</p><p>I believe that a digital space can be dimensional and deep and multifaceted, like entering a universe, a storybook, a movie.</p><p>So today I'll talk about what it means to inhabit digital space with your creative practice.</p><p>I'll share my simple process broken down into three steps.</p><p>One, creation.</p><p>Two, curation.</p><p>And three, carving paths.</p><p>Then I'll address a couple of common questions like, how often do I need to update it?</p><p>Or how do I make paid offerings?</p><p>Or what if I change my mind?</p><p>Before we dive into the episode, I've just opened registration for my seven-day worldbuilding course House on the Webs, where I'll guide you step by step to build or iterate your own website world.</p><p>You can explore the introduction in day zero for free linked in the show notes.</p><p>So let's begin with part one.</p><p>We'll explore what it means to inhabit a place.</p><p></p><h1>what does it mean to inhabit a place? </h1><p>To give a little bit of personal background.</p><p>For me, as someone who's an immigrant child of diaspora and having lived in a lot of different places, I've always had trouble feeling a sense of belonging to wherever I was.</p><p>So belonging to my own world was of primary survival importance for my psyche.</p><p>Like, if I don't build my own world, if I don't express my creativity, I can literally feel the boundaries of myself disintegrating.</p><p>If I didn't create, I would feel less like myself.</p><p>My head gets very buggy.</p><p>I get very anxious.</p><p>And it took me some time to realize this, that for me, worldbuilding is about inhabiting who I am in a world which always told me to conform and be someone else.</p><p>My website stopped being a brochure that performed ideas of legitimacy.</p><p>It became a home for me to process the world through art and to be in continual inhale and exhale with it.</p><p>And so when I think about inhabiting a place, I think about the word habitat.</p><p>How if you don't feel that you easily fit in, then you don't really have a sense of natural habitat.</p><p>It takes effort.</p><p>And a website, a digital world, is the public space to inhabit ourselves.</p><p>Public is important here because to do that while being seen is about allowing all parts of ourselves to take up space.</p><p>It's releasing our work to the world without needing to perform our worthiness.</p><p>I think in order to build a digital world, the active creation itself must feel nourishing and generative for you because otherwise you won't keep doing it.</p><p>If inhabiting and creating a world feels psychically nourishing, that's the only way you'll come back to this practice.</p><p>And the practice, the work, is to be yourself in public.</p><p>To be yourself on your own terms in a public space where others can see you.</p><p>This sounds so simple, but it's hard.</p><p>And I believe, I know, that there is so much magnetism and power to that practice.</p><p>So how?</p><p>Well, let's talk about process.</p><p>I will share my three-step process for doing this work.</p><p>Number one is plant the garden.</p><p>Number two is collect and curate spaces.</p><p>And number three is carve the paths.</p><p></p><h1>process 1 — creation </h1><p>The first question to ask is, what am I making space for?</p><p>What am I planting and growing in this public garden of my psyche?</p><p>What parts of me do I want to explore?</p><p>What experiments do I want to try?</p><p>What do I want to collect, curate, or deepen?</p><p>For example, this year I started deepening and exploring my practices in tarot and human design and in watching films.</p><p>And these topics don't necessarily have anything to do with my \"work,\" but I've made space in my psyche and space on my website for them.</p><p>I'm collecting tarot or film or human design-related writings as they come, as I feel inspired to write about them.</p><p>And so the question here is, what parts of you, what creative longings, what topics of fascination, what themes, what forms, what seeds want to be planted here?</p><p>And you never know because over time the things that I create space for will probably definitely integrate and merge with what work already exists here.</p><p>And to think about this question, remember that it's not a question that you have to commit to indefinitely.</p><p>This question is always in the present moment.</p><p>What do you feel inspired to plant now?</p><p>And how can you ride the seasons of your interests and urges?</p><p>So in technical terms, this vessel is your blog CMS.</p><p>I talked about this in the previous episode, how I think you really only need one blog CMS or content management system to hold your creative flow.</p><p>And so the flow can be varied and spontaneous.</p><p>I find that when I'm too specific about the parameters or the container or what types of posts I need to write, sometimes having too much criteria can really stifle and kill the creativity.</p><p>So the process always begins with the questions, what am I feeling inspired by?</p><p>What am I interested in exploring?</p><p>What are the urges that I want to tug on and pull the thread of?</p><p>A thought or a theme and how can I express it in a creative form?</p><p>I started my own website in 2015 and I went through seasons of writing mostly about wellbeing and then about the creative process and then about my emotional landscape and my travels, about spirituality and intuition.</p><p>And then only in the last year or two, I started writing about business and digital ecosystems and world building and tarot.</p><p>And I expect that I'll write about so many more new topics because otherwise I'd get bored.</p><p>And that is part of the secret to inhabiting and building a world, write about things that make you want to keep writing or whatever form it is that you do, it doesn't have to be writing.</p><p>It could be drawing or audio or video.</p><p>Remember that there are no limitations.</p><p>There are no rules.</p><p>You get to make your own rules because this is your world.</p><p>The only rule here, if there is any rule, is to continually plant the seeds of your inspiration and be open to whatever wants to come.</p><p>So in process one, planting the garden, the whole point is to focus on creation without trying to decide where it goes or how it fits.</p><p>This is the whole point of a website as world because unlike in say, content marketing, in world building, we don't need to cut ourselves up into compartmentalized pieces and put ourselves into a filing cabinet.</p><p>We don't need to feel the pressure to fill each box with our expertise.</p><p>Instead we can just grow and exist in a jungle of our creative biodiversity.</p><p>Our forms can be evolving, shifting and fluid.</p><p>And what this means practically is that instead of feeling the pressure to create a top down master page structure, start bottom up, start with the garden, start with creation, and then you can build little greenhouses around each collection or theme as you go.</p><p>Which brings me to process two, curate spaces.</p><p></p><h1>process 2 — curate spaces  </h1><p>And the guiding question here is how can I organize my creative seeds or creations into meaningful collections?</p><p>And here you become your own collector and curator.</p><p>You can decide how you want to organize things.</p><p>The way to do this technically is to use categories and tags for every post in your blog CMS that is your garden.</p><p>And keep in mind that this is an ongoing messy process of pulling the organizing principles of your work.</p><p>For me, categories are typically overarching themes or distinct forms, whereas tags are more specific topics, bookmarked collections.</p><p>I try to keep my categories relatively minimalist, whereas tags can be a bit more expansive.</p><p>If you think about the metaphor of a tree, each post or thing that you create on your website are seeds which turn into leaves, even though I know that that's not really how trees work.</p><p>Then the branches that hold different leaves will emerge on its own over time.</p><p>It will form big main branches, in this case categories, and sub branches, and tiny little branches which represent tags.</p><p>And of course, because this is a digital space, a single leaf or a single post can be on multiple branches simultaneously.</p><p>So if the garden or the blog CMS holds your ongoing flow of leaves or creations, then in process two of curation and collection, you would use the emergent branches and sub branches to create new spaces on your website world, new pages.</p><p>In review, we have process one, planting the garden is focusing on creation.</p><p>Process two, curating the spaces is to focus on curation and collection.</p><p>And then process three is carving the path.</p><p></p><h1>process 3 — carve the paths </h1><p>Carving the path is to think about the experience, the journey, and the movement through your world as well as the overarching organizational structure.</p><p>Process three focuses first and foremost on ease of navigation.</p><p>How do I travel between the spaces?</p><p>How do I create interlinks?</p><p>These are the threads that make up your web.</p><p>And how do I want others to move through what I've created and curated?</p><p>How does one theme or creation or form connect to another?</p><p>The way we travel through the internet is very different than the way we travel through a book.</p><p>Maybe it's a bit more like traveling through a physical space because your awareness expands and collects information without your body actually being there.</p><p>You're not required to experience the digital world in a linear way and few of us ever do.</p><p>We scan and then we read.</p><p>And probably we don't experience a page from top to bottom like a computer.</p><p>But instead in layers of hierarchy, what's most important on the page jumps out at us first.</p><p>What catches our eye jumps out at first.</p><p>And you can also press a secret button somewhere and end up somewhere completely surprising.</p><p>As I spoke about in the last episode, there are four main ways of traveling through a website.</p><p>There's a top and bottom navigation.</p><p>There's the on page visual objects.</p><p>And then there's the on page body text hyperlinks.</p><p>When you've gone through enough creation and curation processes, you start to see the skeletal structure of your ecosystem emerge.</p><p>This is like seeing the spine of your work, the themes that you write about again and again.</p><p>And then you can make decisions about evolving your site organizational structure and building main pathways.</p><p>But today, let me tell you my process not for building the main pathways, but for the tiny alleyway side doors and more in an ongoing way.</p><p>The simple practice that I do is as I'm completing and publishing each new post, I will look through my archives and think about how this new thing I'm writing about relates to something I've created in the past.</p><p>And oftentimes I forget what I created in the past.</p><p>This is part of the beauty and joy of going through this process because then as you're creating, you can see how a single thread of thought has evolved over time and you connect one thread to another thread, not just for your visitors, but also for yourself.</p><p>I do this by creating links in the body text and or I'll handpicked some links and put it also at the bottom of the post.</p><p>This way I'm recommending my guests deeper journeys and rabbit holes into this topic to continue traveling.</p><p>Over time, the more that you create, then collect, the more that your website ecosystem structure will feel both clear and more complexly, richly layered.</p><p>When you zoom out of your world, you'll see this glorious web of threads emerging from your ecosystem.</p><p>Whereas we're normally taught to structure and then create, my recommendation is to first create then structure.</p><p>I'll remind you that what's absolutely essential here is extreme patience.</p><p>To think about this as tending to something living and going through continual rebirths and evolutions, to not need to have everything completed at once, but instead to work in seasons, maybe you'd focus some seasons only on planting, like a farmer or botanist of the creative psyche, and then some seasons mostly on curating and collecting or restructuring, doing renovation work, building the pathways between themes or collections.</p><p>Now that I've gone through my three step process, for the remainder of the episode, I will address some common questions.</p><p></p><h1>question 1 - how often do I need to update and maintain my world? </h1><p>One, how often do I need to update and maintain my world?</p><p>My answer to this won't surprise you.</p><p>I'd say it's totally up to you.</p><p>Do it however and whenever it feels nourishing.</p><p>And again, world building is only a practice that I would suggest committing to if it feels generative and inspiring and energy giving for you.</p><p>For me, it most absolutely is the thing that connects my inner world to the outer world and keeps me from feeling creatively constipated and stuck.</p><p>But when I travel or have client deadlines or when life happens, I might be silent on my world for weeks or months.</p><p>And the act, the practice of returning to it on a regular rhythm is what keeps me feeling and flow.</p><p>The right rhythm for you will change.</p><p>I've had seasons where I write almost daily.</p><p>Other times I write in post maybe once or twice a week or a few times a month.</p><p>I think the key here is really to find a rhythm that feels good for this season and then try to commit to it and see how you feel.</p><p>You could also do this in a sort of seasonal sprint cycle.</p><p>For example, if you feel inspired to explore a topic for a month, then you would just ride the flow and once you feel it dwindle, give yourself a break.</p><p>Wait until the inspiration builds up again.</p><p>There are no hard and fast rules, only what feels good to you.</p><p>You could also have worlds that are purely one-off projects and maybe you tend to it for a couple of weeks and then you let it incubate and sit there and don't return to it for another year or two.</p><p>It's entirely up to you.</p><p></p><h1>question 2 - how do I make paid offerings in a digital world? </h1><p>Question two, how do I make paid offerings in a digital world?</p><p>I will say that after sitting with this question for as long as I've had a website, the answer is actually very simple.</p><p>You would repeat the same process that I described for creating your public garden for your private garden.</p><p>That is creation, curation, and carving pathways.</p><p>Because an offering, a paid offering, is just a gated private garden with more concentrated energy or power or guidance, I write about this philosophy in my post, \"Build a labyrinth, not a marketing funnel.\"</p><p>Maybe you could think of paid offerings as like powerful medicinal plants, herbal plants with transformative hallucinogenic alchemical powers, plants that require more energy and time and work from you to keep alive and to share.</p><p>You still must plant them, your offering.</p><p>You must curate them into collections, that is your business containers and systems, and then carve the paths that lead to them from the rest of your public garden.</p><p>One of the most powerful things that I've discovered about building and growing a world is that this practice dismantles the dichotomy between art and business.</p><p>Your world can hold all of your creative offerings, whether or not money is involved.</p><p>Because ultimately, work is about the exchange of energy and resources.</p><p>These resources also include time and attention and emotional energetic investment and trust.</p><p>Money is only one resource, it's a byproduct of the others.</p><p>And so the process of making paid offerings is an iteration of sharing your creative work, but this time going even deeper.<br /></p><h1>Question three: will things look jarring side by side?</h1><p>So let's say I'm a multidimensional, multi-form creator, which I believe we all are.</p><p>How can I share my work in a way that doesn't look jarring side by side?</p><p>First I'll say that in my three step, three process structure, you'll have a space, which is your blog CMS, to hold all the creative biodiversity sort of wild side by side way.</p><p>And as you have emergent topics or collections or themes, you would create new pages for those curated collections organized in a meaningful way.</p><p>In this process, you can satisfy both needs to be expressive and diverse and to dive deeper in a more focused way into a subject.</p><p>Okay, design structure aside, let's peel back the layers on this question.</p><p>Will my work look jarring side by side?</p><p>I've struggled with this personally for a while.</p><p>And at the end of all the struggle, my personal approach is to give myself wild permission to not need to be consistent or cohesive, to give myself permission to completely experiment and share and create whatever I want.</p><p>I think that we feel the pressure to be more niche or monotone because we've ingested this belief that expansiveness and intellectual diversity and curiosity will detract from our professional legitimacy or expertise.</p><p>As if we won't be taken seriously if we offer services on one thing but write about something completely different.</p><p>But I think the kinds of people I want to work with as clients or students are people who resonate and align with my energy.</p><p>Energy is a far more specific niche than subject or topic.</p><p>And energy is something you can't really put your finger on, but you can feel.</p><p>Most likely those people who resonate with my energy also have wide-ranging interests and they would feel inspired by my creative biodiversity not turned off by it.</p><p>Those people are also not hiring me as just a service provider to \"solve a problem.\"</p><p>Of course I will solve a problem, but they also want to work with me because of my spirit, my ethos, and my approach.</p><p>So allow yourself to experiment and expand and play on your website knowing that the organizing principle is going to be energy and spirit.</p><p>Instead of focusing on homogeneity or niching down, focus on creative expansion.</p><p>Focus on the process that will clarify your vision, your values, your ethos, your approach.</p><p>And from that creative process, the spirit, the energy that fuels your work will speak for itself.</p><p>Last question.<br /></p><h1>Question 4 - What if I change my mind?</h1><p>What if you change your mind about structure or page design or hierarchy or anything on your website?</p><p>My answer to this is also quite simple.</p><p>If you change your mind, great.</p><p>The magic of a digital world is that you can shift and evolve it however and whenever you'd like.</p><p>However, I'll add a caveat.</p><p>When you're ready to change something in your world, make sure that this change comes from a grounded place.</p><p>Make sure that it's not a fear reaction, like a knee-jerk instinct that you're doing something out of self-doubt or uncertainty.</p><p>Sometimes you want to make a change because it is a crucial step in the process of evolving into who we are.</p><p>Other times, it's a form of running away from ourselves by feeling distracted, by distracting ourselves.</p><p>So before you decide to change anything structural or radical on your website, tune into yourself and to see if that change comes from a grounded place.</p><p>Does it feel good when you work on it?</p><p>Or do you feel resistance?</p><p>Do you feel the weight of shoulds and pressure?</p><p>All of these feelings are clues.</p><p>And you can always work on something but give yourself a cap, like a couple of hours or one hour, and then allow yourself to change your mind and take it all down a few weeks later.</p><p>This is the process of evolution.</p><p></p><h1>closing thoughts </h1><p>In closing this episode, I'll give you a summary distillation of how to grow and inhabit your website as a wild, digital ecosystem.</p><p>Step 1.</p><p>Focus on creation, gardening.</p><p>Use one blog CMS as a clear vessel for channeling your creative flow in all of its forms.</p><p>Decide what creative rhythm feels nourishing for this particular season of your life and commit to it.</p><p>As you write, organize with tags and categories.</p><p>Know that this step will be messy and you'll probably have to edit these tags and categories later and that's okay.</p><p>As you're posting, build the habit of connecting your new posts with previous posts with in-text, in-body hyperlinks.</p><p>This is you creating tiny pathways and threads on your web.</p><p>Step 2.</p><p>Curate and create new pages by looking at the tags and categories that emerge from your garden as distinct branches or collections of themes, topics, or forms.</p><p>Step 3.</p><p>Evolve the skeletal structure and navigation of your world over time.</p><p>You're probably bored of me saying this by now, but remember to let this be ongoing.</p><p>To surrender to this process, let it be a practice that fuels and intertwines with your creative life.</p><p>Something that feels deeply generative.</p><p>Practice releasing the pressure and expectations for where this will lead.</p><p>Let this be a rhythm that you cultivate as a practice of being and inhabiting who you are in public and allowing yourself to be seen.</p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><a href=\"https://keningzhu.com/podcast\">return to podcast home</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n \n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy &amp; world-building called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"e274cc1d30f0a77f2f2661e9eb72b3f81320a8cefbf393a1a97af7f2c8a65144","category":"Sites"}