{"title":"Write plain text files","link":"https://sive.rs/plaintext","date":1646179200000,"content":"<p>\nI write almost everything important in my life: thoughts, plans, notes, diaries, correspondence, code, articles, and entire books.\n</p><p>\nThey are my extended memory — my noted self — my organized thoughts.\nI refer to them often.\nI search them, update them, and learn from them.\nI convert them into HTML to make websites, or LaTeX to make books.\n</p><p>\nMy written words are my most precious asset.\nThey are also a history of my life.\n<strong>\nThat’s why I only use plain text files.\n</strong>\nThey are the most reliable, flexible, and long-lasting option.\nHere’s why.\n</p><h2>\nPORTABLE\n</h2><p>\nI’ve brought my text files with me since 1990, from Mac to Windows to Linux to BSD, from PCs to laptops to tablets to Android to iOS to a tiny device the size of my thumb, and back again.\n</p><p>\n<strong>\nEvery device, including ones long gone, and ones not invented yet, can read and edit plain text.\n</strong>\nWhether future virtual reality, or a chip you can implant in your earlobe, plain text will be there.\nWill Microsoft Word?\nEvernote?\nNotion?\nMaybe.\nMaybe not.\n</p><p>\nBut plain text?\nAlways.\nEverywhere.\n</p><h2>\nUN-COMMERCIAL\n</h2><p>\nEvery few years a new company says you should use their special format.\nYou have to pay them a monthly fee to use it — or keep all of your documents in their care.\nThey offer some convenience or features, but at the cost of flexibility, portability, and independence.\n</p><p>\nWhen you store your writing in one company’s unique format, then you need that program to access it.\nThen the economy takes a turn, they go out of business, and your work is trapped in an unusable format.\n</p><p>\n<strong>\nYou will outlive these companies.\n</strong>\nYour writing should outlive you.\nDepending on companies is not an option.\n</p><p>\nPlain text is un-commercial.\nIt removes you from the world of subscriptions and hype.\nThere will always be plenty of free, non-commercial software in the public domain for reading and editing text files.\n</p><h2>\nOFFLINE\n</h2><p>\nThere are places and times when you can’t get online.\nDon’t depend on any tool that needs an internet connection.\n</p><p>\n<strong>\nThere are great benefits to being intentionally offline and unreachable, to focus.\n</strong>\nIt’s a super productivity boost.\nYou need to be able to write, and have access to all your writing, during these times.\n</p><h2>\nNO DEPENDENCIES\n</h2><p>\nIf you rely on Word, Evernote or Notion, for example, then you can’t work unless you have Word, Evernote, or Notion.\n<strong>\nYou are helpless without them.\n</strong>\nYou are dependent.\n</p><p>\nPeople tell me about more tools I could use in addition to my text files.\nBut I don’t need or want anything else.\n<strong>\nPlain text files and a basic text editor are enough.\nThis is everything you need for great thinking and writing.\n</strong>\n(A paper notebook and pencil are enough, too.)\n</p><p>\nIf you only use plain text, you can work on any device, forever.\nThe less you depend on, the better.\nPeace and focus come when you stop looking for more.\n</p><h2>\nEASIEST TO CONVERT\n</h2><p>\nPlain text can be converted into anything else.\n</p><p>\nHTML, Markdown, JSON, LaTeX, and many other standard formats, are just plain text.\nI’ve written four books and four hundred blog posts in plain text.\n</p><p>\nYou can make your own personal formats in your plain text files.\nMaybe in each diary entry, the first two lines are like:\n</p><pre>\ndate: 2022-02-28\ntags: where-to-live, kids, dog, anxious\n</pre><p>\nThen it’s easy to use any little scripting language like Ruby, Python, or JavaScript to grab the date and tags, and use them for categorizing, sorting, renaming, archiving, or exporting.\n</p><p>\nOr if you don’t want to do it yourself, then it’s easy to find someone who can.\nAnyone who’s been programming for more than a week should be able to do it easily.\n</p><h2>\nNEED HIERARCHY?\n</h2><p>\nUse directories — also known as folders.\nThese are also good for keeping your text together with other files like images and audio.\n</p><pre>\nDocuments/\nDocuments/Diary/\nDocuments/Diary/2022/\nDocuments/Diary/2022/2022-02-28.txt\nDocuments/Thoughts/\nDocuments/Thoughts/WhereToLive/\nDocuments/Thoughts/WhereToLive/2019-06-30.txt\nDocuments/Thoughts/WhereToLive/2020-01-18.txt\nDocuments/Ideas/\nDocuments/Ideas/MusicalChairs.txt\nDocuments/Ideas/NewHouse/\nDocuments/Ideas/NewHouse/Design/\nDocuments/Ideas/NewHouse/Design/entryway.jpg\nDocuments/Ideas/NewHouse/Design/roof.jpg\nDocuments/Ideas/NewHouse/Architect/\nDocuments/Ideas/NewHouse/Architect/JM_Lim.txt\nDocuments/Ideas/NewHouse/Architect/TPS_Inc.txt\n</pre><h2>\nNEED VISUALS OR GRAPHICS?\n</h2><p>\nNeed visual mind-mapping with circles and lines?\nMaybe you do.\n<strong>\nBut maybe you don’t.\n</strong>\nMaybe it’s just another distraction, focusing on the tools instead of your thinking.\n</p><p>\nI love that plain text files have no formatting to tinker with.\nA tab key, SHIFT KEY, and vertical line breaks can go a long way, keeping you writing instead of formatting.\n</p><p>\nIf you really need graphics, do your drawing using something else.\nDigital drawing into SVG files.\nPaper drawing, scanned into JPGs.\nFormats that aren’t owned by any company.\nFormats that will outlast you.\n</p><p>\nKeep your graphics files alongside your text files.\nBut keep your text as plain text.\n</p><h2>\nCONCLUSION\n</h2><p>\nReliable, flexible, portable, independent, and long-lasting.\nPlain text files will be readable by future generations, hundreds of years from now.\n</p><p>\nI especially enjoy the tranquility of their offline, non-commercial nature.\nThey’re quiet.\nThey’re focused.\n(As I aim to be.)\n</p>\n<img src=\"/images/plaintext.png\" alt=\"screen shot of the text of this post\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e2a6ed382e014ee68017dfedb7321746b537e60e24d3d91bb24c96c4a400c645","category":"Sites"}