{"title":"Mediaeater Digest Vol.30, No. 151","link":"https://ghuneim.com/2024/05/31/mediaeater-digest-vol-30-no-151/","date":1717153733000,"content":"<p><a href=\"https://x.com/fablesimulation/status/1796245808066740274\"><span>Announcing Showrunner</span></a><span>  (The Simulation) We believe the future is a mix of game &amp; movie. Simulations powering 1000s of Truman Shows populated by interactive AI characters. Welcome to Sim Francisco &amp; Showrunner! With Showrunner, you’ll be able to WATCH and DIRECT stories from Simulations like Sim Francisco or Neo-Tokyo or Fallen London. Run out of episodes of your favorite AI show?  Generate another! Or let a simulation generate it for you based on its understanding of the characters.</span></p>\n<p>Related : <a href=\"https://www.hollywoodreporter.com/business/business-news/fables-streamer-ai-generated-content-showcases-hollywood-fear-around-tech-1235911861/\"><span>(HR Story – Hollywood Nightmare? New Streaming Service Lets Viewers Create Their Own Shows Using AI)</span></a></p>\n<p><a href=\"https://x.com/quasimondo/status/1796493105916699004\"><span>I could drag this out infinitely, </span></a><span>  (Mario Klingemann ) but I think 9:24 is torture enough. New song “On and On”, celebrating  @suno_ai_ ‘s 3.5 model’s unrelenting will to keep the music going whatever it takes.</span></p>\n<p><a href=\"https://www.washingtonpost.com/technology/2024/05/30/openai-disinfo-influence-operations-china-russia/\">OpenAI finds Russian and Chinese groups used its tech for propaganda campaigns</a> “We’ve seen them generating text at a higher volume and with fewer errors than these operations have traditionally managed,” Nimmo, who previously worked at Meta tracking influence operations, said in a briefing with reporters. Nimmo said it’s possible that other groups may still be using OpenAI’s tools without the company’s knowledge.</p>\n<p><a href=\"https://stratechery.com/2024/ai-integration-and-modularization/\">AI Integration and Modularization</a> (Stratechery) Google – The first takeaway from this analysis is that Google’s strategy truly is unique: they are, as Nadella noted, the Apple of AI. The bigger question is if this matters: as I noted above, integration has proven to be a sustainable differentiation in (1) the consumer market, where the buyer is the user, and thus values the user experience benefits th</p>\n<p><a href=\"https://newrepublic.com/article/180487/balaji-srinivasan-network-state-plutocrat\"><span>The Tech Baron Seeking to Purge San Francisco of “Blues”</span></a><span> Still, his appetite for autocracy is bottomless. Last October, Balaji hosted the first-ever Network State Conference. Garry Tan—the current Y Combinator CEO who’s attempting to spearhead a political takeover of San Francisco—participated in an interview with Balaji and cast the effort as part of the Network State movement. Tan, who made headlines in January after tweeting “die slow motherfuckers” at local progressive politicians, frames his campaign as an experiment in “moderate” politics. But in a podcast interview one month before the conference, Balaji laid out a more disturbing and extreme vision.  (you can take the kid out of Long Island but not the LI out of the kid -ed ) </span></p>\n<p> </p>\n<ul>\n<li><a href=\"https://cybersectools.com/\">Curated directory of cybersecurity tools and resources</a></li>\n<li><a href=\"https://docs.llamaindex.ai/en/stable/getting_started/starter_tools/rag_cli/\">RAG CLI</a></li>\n<li><a href=\"https://spectrum.ieee.org/1-bit-llm\">1-bit LLMs Could Solve AI’s Energy Demands “Imprecise” language models are smaller, speedier—and nearly as accurate </a></li>\n</ul>","author":"MDG","siteTitle":"Mark Ghuneim","siteHash":"fbdbfb355dab5247b3a3d9c04401313e99252873a1ae0fb1ea729c2e5736c6f3","entryHash":"e2e2d10bbeb9c5b88460009c55b5542298cf89c343cd5efa7d688b63be46c538","category":"default"}