{"title":"The Three Kinds of “Deep Tech” Companies","link":"https://www.usv.com/writing/2024/07/the-three-kinds-of-deep-tech-companies/","date":1721953616000,"content":"<p>Something that’s frustrating about investing in non-purely-software companies is the poverty of vocabulary. People talk about “deep tech”, “hard tech”, “frontier tech”, “atoms”, and so on. Sometimes they just mean to distinguish hardware from software companies, sometimes to distinguish technical moonshots from more commercially-oriented ventures. The only consistent pattern in how people talk about these kinds of companies is the total lack of consistent terminology.</p>\n<p>Despite the linguistic fuzziness, I’ve found myself mentally bucketing companies into a few different categories. I think these kinds of categorizations are most helpful when they illuminate how venture capital fits into what a company is trying to do. With that framework in hand, I see three primary types of “deep tech” (or whatever) startups: hardware device, infrastructure, and frontier.</p>\n<p>Hardware device companies (or “Hardware as a Product”?) develop and sell hardware. That hardware could be anything from a battery to a sensor or a chip. These companies commercialize fairly quickly, using early stage venture capital to get to market and improve and expand their product offerings. Although they might eventually vertically integrate, hardware device companies can use contract manufacturers because their innovation is more in the design of their hardware than its production. In the earliest days, these companies need technical leaders to build their products, but then they pretty quickly have to build a sales organization to get their products into customers’ hands. Like software businesses, hardware device companies have the ability to iterate on their products based on market feedback and can also take more market risk. They might benefit from grants early on if they’re aligned with DOE or DOD objectives, and they can use factoring to manage the time gap between incoming cash from customers and outgoing cash to their manufacturers. Novel hardware devices can also anchor new software networks based in physical data and actuation, giving them greater defensibility.</p>\n<p>USV Portfolio Examples: Blixt, Unigrid</p>\n<p>Other Examples: Enphase, Samsara</p>\n<p>(there are other kinds of startups that also fit in here that don’t usually get lumped into “deep tech”: Square, Toast, Oura, etc)</p>\n<p>Infrastructure companies develop new hardware with the goal of using that hardware to produce and sell some commodity. These companies typically use early rounds of venture capital to scale and de-risk a process and then eventually raise a mid-stage round to build a commercial-scale facility. Successfully constructing a first commercial-scale facility creates value for the company in two ways: it offers a step-change increase in revenue and also proves out the viability of a project model that can be replicated with lower risk. In addition to hiring great engineers to develop their novel process, infrastructure companies have to excel at project development. Although all infrastructure companies make money through the operation of their process, they can take different approaches to standing up a facility (eg licensing, joint venture, co-location, etc), each with its own capital requirements, financial upside, and level of execution risk. Infrastructure startups might have access to grants to supercharge venture capital for funding bench-scale work and can sometimes bring non-dilutive financing to their first commercial facility instead of funding it entirely with TopCo equity.</p>\n<p>USV Portfolio Examples: Molten, Lydian</p>\n<p>Other Examples: Solugen, Charm</p>\n<p>Unlike hardware device companies, which use venture capital to scale device sales, or infrastructure companies, which use venture capital to physically scale up a process, frontier companies don’t use venture capital to scale existing tech but to develop technology at the limits of what is currently feasible. Although they might make money by licensing intermediate technologies on their path to developing some breakthrough, they’re fundamentally in the business of reaching successive technical and regulatory milestones to justify further venture investment and government support. They take the longest to get to market, often not fully commercializing until after a successful exit. But, once they do commercialize, they grow very quickly, gaining a large, defensible share of a massive market through capital, IP, and regulatory moats. These businesses are similar to biotech startups in that both use venture capital purely for R&amp;D and create value through technical de-risking. One interesting difference from biotech, however, is that frontier tech companies are usually less dependent on M&amp;A for distribution.</p>\n<p>USV Portfolio Examples: Transmutex, Radiant</p>\n<p>Other Examples: Commonwealth Fusion, Boom Supersonic</p>\n<p>To summarize:</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/07/the-three-kinds-of-deep-tech-companies/\">The Three Kinds of “Deep Tech” Companies</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Zapier Bot","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"e35b77c75c9b547018e788e815858deb842f729a75823ef2b949860a247b2cad","category":"default"}