{"title":"Make believe","link":"https://sive.rs/mb","date":1667088000000,"content":"<p>\nKids scream, “Monster in the hallway!”, and hide behind the couch.\nThey stack up cushions for protection, and plan their defense.\nThey know it’s not <em>true</em> — there’s not <em>really</em> a monster in the hallway — but it’s exciting to feel the adrenaline of panic, then make a shelter and feel safe.\n</p><p>\nOne kid yells, “The floor is hot lava!”\nThe familiar room transforms into islands among danger.\nLeaping between furniture is a fun physical challenge.\n</p><p>\nOne slips and wails, “Help! I’m falling! Save me! Save me!”\nThis new scenario lets one kid feel cared for and protected, while the other kid gets to be the rescuing hero.\n</p><p>\nMom calls, “pancakes are ready!”, and all stories stop when the kids run into the kitchen.\n</p><p>\nKids believe anything fun for a while.\nIt’s called “make believe” because they’re making up beliefs.\nEach belief gives them a new situation, and lets them adopt a new role like protector or inventor.\n“Make believe” has a purpose.\n</p><p>\nBut when people grow up, they won’t believe anything unless they’re convinced that it’s true.\n(Or they insist that it’s true <em>because</em> they believe it.)\n</p><ul><li>\n“The world is going to hell so I need to prepare my bunker to survive.”\n</li><li>\n“I would be creatively prolific and super-productive if I could quit my job.”\n</li><li>\n“My evil ex dumped me even though I was perfect so that’s why I can never love again.”\n</li></ul><p>\nNone of these statements are true.\nBut we like the way they <em>feel</em> to believe.\nWe can be the hero of an exciting or romantic story.\n</p><p>\nFollowing a religion improves your daily actions, feels wonderful, and connects you to a worldwide community.\nThese are better reasons than insisting it’s absolutely true.\n</p><p>\nSame with philosophies, nationalities, norms, and concepts like loyalty, destiny, and identity.\nNone of these are true.\nBut they <em>are</em> useful.\n</p><p>\nAdopt them for their purpose, while knowing they are make believe.\n</p>\n<figure><img src=\"/images/couchjump.jpg\" alt=\"kids jumping on couch\" /><figcaption>photo © <a href=\"https://www.flickr.com/photos/donnieray/19938005828/\">Donnie Ray Jones</a></figcaption></figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e371f42fe68168ab1fb713615f87d24fd720f318b1326f7773e957dd51e9c9f6","category":"Sites"}