{"title":"Why IoT Failed & Can AI Fix It?","link":"https://om.co/2024/11/24/why-iot-failed-can-ai-fix-it/","date":1732462658000,"content":"<p>Pete Warden is the kind of fellow you would run into at the old eTech conference or at Foo Camp—an old-school engineer who is equally at home hacking hardware and writing code in the latest languages. It was at an eTech conference that I first met Warden. We often swapped emails about the rise of cheap-and-cheerful chips such as the Arduino. We marveled at the potential of the Internet of Things. He eventually sold his first startup to Google and went to work there. .<a href=\"https://petewarden.com/?utm_source=CrazyStupidTech&amp;utm_medium=email&amp;utm_campaign=why-iot-failed-what-pete-warden-is-doing-about-it\" target=\"_blank\"> His writing</a> about technical issues, however, has been a big influence on how I think about connected devices and their utility. He is a man who knows the Internet of Things and its foibles quite well.</p>\n\n\n\n<p>After a seven-and-a-half-year stint at Google and working on TensorFlow, he left to start a new company, cleverly named<a href=\"https://www.usefulsensors.com/?utm_source=CrazyStupidTech&amp;utm_medium=email&amp;utm_campaign=why-iot-failed-what-pete-warden-is-doing-about-it\" target=\"_blank\"> Useful Sensors</a>. This is Warden’s fourth startup. Useful has created a new speech-to-text model called<a href=\"https://github.com/usefulsensors/moonshine?utm_source=CrazyStupidTech&amp;utm_medium=email&amp;utm_campaign=why-iot-failed-what-pete-warden-is-doing-about-it\" target=\"_blank\"> Moonshine</a>. It is five times faster than Whisper, the current darling of voice-to-text models. They recently launched<a href=\"https://petewarden.com/2024/10/11/introducing-torre-a-new-way-to-translate/?utm_source=CrazyStupidTech&amp;utm_medium=email&amp;utm_campaign=why-iot-failed-what-pete-warden-is-doing-about-it\" target=\"_blank\"> Torre</a>, an instant language translator that runs entirely locally, for speed and privacy. This makes it very useful in scenarios that are pretty low-tech. </p>\n\n\n\n<p>I recently caught up with Pete to talk about Useful (and Moonshine). We discussed the aging Siri, Alexa, and Hey Google. During our conversation, he talked about the reasons why IoT failed, and how AI and small language models (like his Moonshine) could actually create a world of intelligent devices.</p>\n\n\n\n<p>Honestly, he had me at “toaster” and a perfect grilled sandwich, but you should read on to learn how Pete is thinking about the connected future. He knows what he’s talking about.</p>\n\n\n\n<p>Continue reading my conversation with Warden <a href=\"https://crazystupidtech.com/archive/why-iot-failed-what-pete-warden-is-doing-about-it/\">over on CrazyStupidTech</a>.</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"e3e1ca51e97d03334e75b15fc5105ec8ac465d9491e6e2f7e962c58d1921e2c5","category":"Sites"}