{"title":"Ancestors, Luck, and Descendants","link":"https://sive.rs/ald","date":1648080000000,"content":"<p>\nMy Sivers ancestors came from Grantham, Lincolnshire, England on a boat to America in 1849.\nThe boat crashed on rocks in the Irish sea, caught fire in the Atlantic Ocean, got pushed off course repeatedly by storms, and finally landed in New Orleans after two months.\nNew Orleans was overcome with cholera, so they hopped a steam boat up the Mississippi River to St. Louis.\nCholera killed nine passengers and the pilot of the boat.\nDays after they arrived in St. Louis, the city caught fire so they escaped in a covered wagon to Glenwood Iowa, finally arriving after three more months.\nIn 1890, one of their sons ventured to the wild west of Colorado to pursue an opportunity.\n</p><p>\nFour of my great-grandparents came separately from Sweden to America around 1910.\nTwo were poor farmers, two were middle-class urbanites, but all four were ambitious for prosperity abroad.\nThey met in Colorado and Oregon, where my grandparents were born.\nAfter serving in World War Two, my grandparents moved to Portland to pursue an opportunity, with $25 to their name.\n</p><p>\nMy parents met in high school in Portland in the 1960s.\nMy dad is a particle physicist, but wanted to be more outgoing.\nMy mom was homecoming queen, but wanted to be more intellectual.\nI was born in California in 1969, with a temperament somewhere in between.\n</p><p>\nForty years later, <a href=\"https://sive.rs/book/Ikigai\">a friend</a> asked why I’ve been successful in life.\nI said I’ve just been ridiculously lucky.\n</p><p>\nHe said, “No. Your success has come from choices, not luck.”\n</p><p>\nI said, “I disagree! What about being born in America? That wasn’t a choice! That’s luck.”\n</p><p>\nHe said, “No!\nYour ancestors left a comfortable place to move to a scary unknown place because they felt it would lead to a better life for their descendants.\nTo call your birth place luck is to disregard their foresight and sacrifice.\nSame with their choice of a spouse, how they raised their kids, and whether they saved for their kids’ future, or squandered it on themselves.\nNone of that was luck.”\n</p><p>\nOK.\nGood point.\n<strong>\nIt’s wrong to say our outcomes are <em>all</em> luck or <em>no</em> luck.\n</strong>\n</p><p>\nI still think most of my success was just luck.\nBut it’s nice to acknowledge that <strong>the choices of your ancestors led to the circumstances of your life.</strong>\n</p><p>\nAnd the choices you make will affect the lives of your descendants for many generations to come.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e4a1ce002d1e5a8ee840389023202f14218e82a1d5b8eb40ceea499d6f339862","category":"Sites"}