{"title":"Kind of Bloop 15th Anniversary Vinyl","link":"https://waxy.org/2024/08/kind-of-bloop-15th-anniversary-vinyl/","date":1723735740000,"content":"<figure><a href=\"https://manawave.co/products/kind-of-bloop-lp\"><img width=\"1024\" height=\"725\" src=\"https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-1024x725.jpg\" alt=\"Mockup of the Kind of Bloop album with moody blue pixel art of a man playing trumpet in silhouette and the blue vinyl album halfway out of sleeve\" srcset=\"https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-1024x725.jpg 1024w, https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-300x213.jpg 300w, https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-768x544.jpg 768w, https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-1536x1088.jpg 1536w, https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup-800x567.jpg 800w, https://waxy.org/wp-content/uploads/2024/08/Bloop-Mockup.jpg 1800w\" /></a></figure>\n\n\n\n<p>15 years ago this week, <a href=\"https://kindofbloop.com/\">Kind of Bloop: An 8-Bit Tribute to Miles Davis</a> came out on the 50th anniversary of the release of <em>Kind of Blue</em>, the bestselling jazz album of all time.</p>\n\n\n\n<p>I started the project as a bit of a goof, <a href=\"https://www.kickstarter.com/projects/waxpancake/kind-of-bloop-an-8-bit-tribute-to-miles-davis/\">launching on Kickstarter</a> on May 12, 2009, only 14 days after Kickstarter itself launched. I wanted to test out the platform I’d helped to build, to see what the experience was like as a creator. For years, I’d also wondered what “chiptune jazz” might sound like, and figured this was a good way to do both.</p>\n\n\n\n<p>The Kickstarter hit the goal in a day, the musicians absolutely killed it, and I’m still really proud of the final result, which you can <a href=\"https://kindofbloop.com/\">download and listen</a> to for free.</p>\n\n\n\n<p>It also, as you probably know, led to a painful legal battle over the cover art that cost me tens of thousands of dollars. The night that I published my <a href=\"https://waxy.org/2011/06/kind_of_screwed/\">viral blog post</a> about the legal settlement, I posted on Twitter that I needed a beer, inviting anyone to join me at Bailey’s Tap Room in downtown Portland.</p>\n\n\n\n<p>My friend Frank Chimero brought along his friend, Andy McMillan, who was in town from Belfast, where he ran a popular design festival called <a href=\"https://2012.buildconf.com/\">Build</a> and a design journal called <a href=\"https://alwaysreadthemanual.com/\">The Manual</a>.</p>\n\n\n\n<p>That chance meeting eventually led to starting <a href=\"https://xoxofest.com/\">XOXO</a> with Andy, which concludes next week with our final festival after 12 years working together.</p>\n\n\n\n<p>That dark and stressful day inadvertently led to some of the most meaningful work I’ve ever done, countless new friendships, and the start of a new community.</p>\n\n\n\n<h2>15th Anniversary Vinyl</h2>\n\n\n\n<p>Earlier this year, <a href=\"https://manawave.co/\">Mana Wave Media</a>, a small record label focused on beautiful vinyl editions of video game soundtracks, reached out to see if I’d ever consider a vinyl edition of Kind of Bloop, which has been out of print since the legal settlement.</p>\n\n\n\n<p>I’ve always wanted to do a vinyl run, but never had the time or energy to take it on. Mana Wave agreed to handle all the licensing, remastering, and production. They commissioned new album art by a talented pixel artist named <a href=\"https://tofupixel.carrd.co/\">Tofu</a>. I’m writing new liner notes for it.</p>\n\n\n\n<p>You can <a href=\"https://manawave.co/products/kind-of-bloop-lp\">preorder the album</a> (also with distribution in <a href=\"https://www.veryokvinyl.com/products/kind-of-bloop\">Canada</a> and <a href=\"https://blackscreenrecords.com/products/kind-of-bloop?variant=49768605516042\">Europe</a>) starting on Saturday 9am PT/12pm ET, the 15th anniversary of Kind of Bloop and the 65th anniversary of Kind of Blue.</p>\n\n\n\n<p>The <a href=\"https://xoxofest.com/2024/schedule/\">last XOXO</a> starts one week from today and this is the busiest, most chaotic time of my life. Announcing anything new seems absolutely ridiculous right now, but it’s also kind of perfect: a full circle moment to honor the weird little chiptune album that changed my life for the better.</p>","author":"Andy Baio","siteTitle":"Waxy","siteHash":"35dc61c1bf207cf54e8192cba7836943b040f7b7156ad278540ab82731504f3e","entryHash":"e50bc8b6f82dda05202f24d410c7a62fe7616ebdba75c2507bd56d7a7a99fd3e","category":"Sites"}