{"title":"Any similarity to actual persons living or dead is purely coincidental","link":"https://interconnected.org/home/2024/11/22/rasputin","date":1732270620000,"content":"<div>\n<p>I don’t see the end of the end credits of movies as much as I used to because</p>\n<ul>\n<li>they get squashed into a tiny box on Netflix while it begs you to watch something else; and</li>\n<li>honestly (this is the real reason) I barely watch movies.</li>\n</ul>\n<p>However I remember the words they <em>used</em> to end with, and I just went and checked a relatively modern movie - <em>Top Gun: Maverick</em> if you want to know - and you know what, the words are still there, right before the credits stop:</p>\n<p><em>\"The persons and events in this motion picture are fictitious. Any similarity to actual persons or events is unintentional.\"</em></p>\n<p>That legal boilerplate, present for almost 100 years, is there because of Rasputin.</p>\n<hr />\n<p>Ra-ra-Rasputin, lover of the Russian queen, was murdered in 1916 by Prince Felix Yusupov using cyanide cakes and then being shot.</p>\n<p>MGM produced a film based on these events… and Yusupov sued them in 1933 for defamation.</p>\n<p>MGM had made up some plot for dramatic effect, knew what they were doing, and therefore lost the case massively.</p>\n<blockquote>\n<p>An MGM researcher had pointed out this factual discrepancy to the studio during production and warned that the Yusupovs could sue; the studio fired her.</p>\n<footer>– Slate, <cite><a href=\"https://slate.com/culture/2016/08/the-bizarre-true-story-behind-the-this-is-a-work-of-fiction-disclaimer.html\">The Strange Reason Nearly Every Film Ends by Saying It’s Fiction (2016)</a></cite></footer>\n</blockquote>\n<p>They also stated at the beginning of the film that it was true (more or less).</p>\n<p>Then, during the case:</p>\n<blockquote>\n<p>A justice in the case told MGM that the studio might have stood a better chance had they incorporated a disclaimer stating the exact <em>opposite:</em> that the film was not intended as an accurate portrayal of real people or events.</p>\n</blockquote>\n<p>I find it baffling that including this statement like a magic spell at the end of every movie for a century is any kind of effective legal shield against <em>anything</em> – but I guess, who wants to be the lawyer who says <em>Yeah you can get rid of that.</em></p>\n<hr />\n<p>Speaking of magical legal disclaimers, I had a moment earlier this year <a href=\"https://interconnected.org/home/2024/04/19/mechanism\">complaining about automated tannoy announcements in train stations</a>.</p>\n<p>In particular: <em>\"Due to weather conditions the surfaces around the station may be slippery.\"</em></p>\n<p>Like. HELLO. Of course! Why warn me?? Automated announcements mean I tune out and don’t hear anything, vital or otherwise.</p>\n<p>Besides, if you can’t figure out that rain means you should be more careful about slipping and breaking a leg then let’s let Darwin thin the herd.</p>\n<p>Is what I thought <em>then.</em></p>\n<p>What I discovered after writing that post is that railway station operators in the UK have been saving money by laying off the people who used to be paid to keep the stations clean, and replacing these waged humans by putting down “self-cleaning” paving slabs.</p>\n<p>And, it turns out, “self-cleaning” paving slabs are unbelievably slippery when they get wet. Like, way more than normal paving slabs, unexpectedly so. And now they’re in the exact locations where people will be rushing so they don’t miss their train!</p>\n<p>So the operators have saved money for themselves by pushing the cost onto the public in the form of injury risk.</p>\n<p>They absolutely deserve to be liable for that negligent externality! An automated tannoy announcement should absolutely not be a legal shield! It layers insult on injury!</p>\n<p>But as least I now know why that announcement is there.</p>\n<hr />\n<p>I mentioned the other day <a href=\"https://interconnected.org/home/2024/11/08/scraps\">contents may settle in transit</a> and <a href=\"https://russelldavies.typepad.com/planning/2024/11/wherever-you-get-your-podcasts.html\">Russell Davies said on his blog</a>:</p>\n<blockquote>\n<p>It made me wonder about all the other ubiquitous but unnoticed phrases that will probably fade in time.</p>\n</blockquote>\n<p>He noted <em>\"wherever you get your podcasts\"</em> which is a great one.</p>\n<p>So I hereby submit the <a href=\"https://en.wikipedia.org/wiki/Fictitious_persons_disclaimer\">fictitious persons disclaimer</a> <em>(Wikipedia)</em> from the bottom of movie credits – although it doesn’t have the same wording each time, so maybe it doesn’t count.</p>\n<hr />\n<p>Kurt Vonnegut, <a href=\"https://www.avclub.com/15-things-kurt-vonnegut-said-better-than-anyone-else-ev-1798211255\">famous for his quotes</a>, has a variation of this: <em>\"All persons, living and dead, are purely coincidental.\"</em></p>\n<hr />\n<p>The wording at the end of <a href=\"https://en.wikipedia.org/wiki/Sunshine_(2007_film)\">Sunshine (2007)</a> <em>(Wikipedia)</em> is:</p>\n<blockquote>\n<p>The events, characters and firms depicted in this photoplay are fictitious. Any similarity to actual persons living or dead, or to events or firms is purely coincidental.</p>\n</blockquote>\n<p>Can I just say: <em>photoplay!</em></p>\n<p>Danny Boyle’s movie is GORGEOUS. The spaceship has a viewing window where the crew can stare at the Sun as they approach, and it has the exact dimensions of a cinema screen. The soundtrack by <em>Underworld</em> is perfection.</p>\n<p>(The premise - which you get in the first 30 seconds - is that the Sun has gone out and they’re sending a spaceship to reboot it. Drama ensues.)</p>\n<p>I saw the movie when it came out and re-watched it the other night using my favourite method of watching TV with high efficiency, which is to watch the first 10 minutes to pick up the vibe then read the plot on Wikipedia.</p>\n<p>The fictitious persons disclaimer in this case is absurdly false because Cillian Murphy’s  character is doing Professor Brian Cox cosplay, who was science advisor on the movie and they clearly just saw his 90s-synth-pop-boyband-turned-physicist look and couldn’t let it go. “Purely coincidental” indeed. Still a good movie though.</p>\n<p>Although. If I were sending a spaceship on a mission to the Sun vital for the continued existence of humanity, I would simply not name it Icarus.</p>\n\n</div>","author":"","siteTitle":"Interconnected","siteHash":"269d6ef55e9210ed7020a5cf94844e701732680dca5ee668ef60325f1061f627","entryHash":"e69372836dbee3399cee05a238d5f87b2ca3ccfe3ea3f3c709ac6deca7d8fa9e","category":"Sites"}