{"title":"The CNN, MTV, and Disney of the future","link":"https://www.garbageday.email/p/cnn-mtv-disney-future","date":1708371462000,"content":"<div><div><h2>The End Of Everything And What’s Next (If Anything)</h2><p>Way back in the Halcyon Days of digital media (2011-2013, or Nyan Cat to Justine Sacco’s tweet), there was a new company popping up every week, fueled by La Croix seltzer, Six Point IPAs, and Dos Toros catering, that promised to harness virality and become the CNN or MTV or Disney of the future. Of course, none of them did and it’s genuinely embarrassing that anyone could have ever thought that free, ad-supported, and, also, Facebook-and-Google-traffic-supported websites that contained… words… that you… just read… could have swallowed Hollywood. But, also, CNN, MTV, and Disney have also struggled to be the CNN, MTV, and Disney of the future.</p><p>CNN’s streaming service, CNN+ crashed and burned <a href=\"https://www.garbageday.email/p/cnn-is-worth-0143-of-a-quibi?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">in 2022</a>, after the network’s “stars” failed to convert their passive audiences in doctor’s office waiting rooms, airport lounges, and senior citizen homes into active paying subscribers. It has since tried to find a place inside of the Max streaming service, but Max, as it currently exists, might not be long for this world, either, considering it’s currently talking to a bunch of other corporate streamers about rebuilding the multi-studio cable bundle <a href=\"https://fortune.com/2024/02/07/espn-fox-warner-brothers-discovery-sports-streaming-joint-venture-hulu/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">as a web portal</a>. </p><p>Meanwhile, MTV and its family of spin-off channels are mostly just a distribution service for <i>Ridiculousness </i>re-runs now. Which is fitting. The network’s prime demo of tweens, teens, and 20-somethings are all on YouTube, Instagram, and TikTok, watching what will eventually become <i>Ridiculousness</i> clips get uploaded in real-time. And Disney doesn’t seem to realize this generational shift is also affecting them, as well. </p><p>Disney lost a billion dollars <a href=\"https://edition.cnn.com/2023/11/08/media/disney-iger-uncertainty-earnings-preview/index.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">last year</a>, and I would argue that wasn’t because they’ve bungled their digital distribution strategy (though, they have). It’s actually because they’re losing — or already lost — a much more existential war over where childhood nostalgia is born. It doesn’t come from <i>The Lion King</i> and <i>Pocahontas </i>— or even Marvel or <i>Star Wars </i>movies — anymore, but games like <i>Fortnite</i>, <i>Minecraft,</i> and <i>Five Nights At Freddy’s</i> and platform-native creators like Pewdiepie and MrBeast.</p><p>We could keep running through examples of Hollywood’s post-COVID digital crash landing, but we all know how grim it is. Sure, there are small momentary victories here and there, like Barbenheimer or <i>Godzilla Minus One</i> or the occasional multiversal <i>Spider-Man </i>crossover<i> </i>film, but if you zoom out enough, it’s clear that movies are not, in fact, back. Hollywood, after years of trying to fight it, is finally feeling the downward pull of the internet and anyone who knows what the pre-internet world felt like is beginning to get real nervous while they watch the last big ship sink.</p><p>In his very good “<a href=\"https://www.honest-broker.com/p/the-state-of-the-culture-2024?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">The State of the Culture, 2024</a>” essay, published over the weekend, cultural critic Ted Gioia worked through this feeling of dread, describing a transition across media from art to entertainment to distraction to, soon, addiction. As Gioia sees it, distraction-based digital feeds are morphing into digital casinos that run on dopamine-producing engagement loops. And he uses online gambling, rage bait, and dating apps as his examples.</p><p>I agree with Gioia here to a point. Namely that, yes, we are heading towards a “post-entertainment society,” or at least one where “entertainment” has transformed into something we no longer recognize. But I think he’s diagnosing these content casinos as the main cause of the problem, when they’re actually just a symptom. </p><p>The last 25 years of the internet have been defined by the unbundling of what came before, reducing everything to smaller and more personalized atomic units of content. Newspapers and magazines became posts. Albums became singles, only to compress further into “audios”. Radio stations were cleaved in half, becoming playlists and podcasts. Linear TV shows, freed from linearity, now resemble single season-long mega-movies. Movies, freed from theaters, now feel like, well, shorter seasons of TV. And, both, are typically consumed as 90-second clips. But three other things arrived as this was happening, though. New “amateur” creators operating on much smaller margins suddenly gained bigger audiences. Spam and low-effort garbage filled in the vacuum left by previously healthy industries. And, counter-intuitively, a handful of institutional powerhouses from the previous age consolidated influence and got even bigger — <i>The New York Times</i>, Christopher Nolan, Taylor Swift. And I’m pretty sure that all of this is happening again, only this time, it’s to the internet itself. </p><p>In fact, the shared online spaces that unbundled the analog era have already unbundled themselves. We have three versions of Twitter, which support different algorithms and media formats, even though people mostly post the same stuff on them. We have four versions of TikTok, with different filters and recommendation systems, that all show the the same content that we’re also seeing on 2/3rds of the Twitters. And all of them are filling up with AI junk. Which advertisers won’t care about until it’s already too late because Number Go Up.</p><p>All the pieces everyone’s writing right now (including me lol) about the end of the internet are really describing this meta unbundling of the internet itself. Every app or feed is also its own community, platform, information ecosystem, movie theater, newsstand, while also not quite functioning well as any of those things.</p><p>And just like listicle factories of the early-2010s, with their big dreams of converting open-floor-plan offices full of non-unionized millennial labor into globally relevant IP, and the post-COVID Hollywood streamers that accidentally re-invented cable, the <a href=\"https://twitter.com/mrsambarlow/status/1758871168616903075?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">“prompt my own personal AI TV show” guys</a> are making a similarly short-sighted mistake about what’s happening. Things don’t unbundle halfway. Studios won’t be making a “TV show” with AI because by the time AI is good enough to make one they won’t exist anymore. </p><p>Things will probably contract again, sure. They usually do. But not for a long time. And if the last 30 years are anything to go on, it’ll all rebundle back up on something that, once again, doesn’t look like anything we have now. There’s a real possibility that “entertainment” will be something you experience largely alone, maybe inside of a game like <i>Fortnite </i>or <i>Roblox</i> while wearing a headset like the Vision Pro. Though, I doubt that will happen in the timeframe that Apple hopes it will. </p><p>But as some have <a href=\"https://twitter.com/_lucasrizzotto/status/1758482741404868892?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">already pointed out</a>, the Vision Pro isn’t a computer killer, it’s a TV killer. And eventually it won’t feel strange to not own a TV and only own a wearable of some kind because eventually there won’t be any communal content left to watch with other people.</p><blockquote><p></p><p>You think you’re lonely now, wait until your only point of reference are the tv shows you had made bespoke for yourself by AI, that no one else will ever see.</p><p></p><a href=\"https://twitter.com/manmademoon/status/1758689903708426258?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"><p> — Duncan Jones (@ManMadeMoon) <br /> Feb 17, 2024 </p></a></blockquote><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access and paid weekend issues, which are very good. Think about upgrading! It helps keep Garbage Day running smoothly. Hit the green button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"><span> Upgrade </span></a></div><hr /></div><h2>Jordan B. Peterson Thought A Bollywood Film Was AI-Generated</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/af79fdb5-5696-4095-bb60-682d45bcd45c/Screenshot_2024-02-19_at_2.52.45_PM.png?t=1708365198\" /><div><span><p>(x.com/jordanbpeterson)</p></span></div></div><p>OpenAI’s new video AI tool, Sora, isn’t even open to the public yet and it’s already a major source of misinformation, though probably not in the way you imagine. Users on X are posting clips from real movies and claiming they were generated by Sora. Most of these are very obvious because AI video from Sora is almost exclusively just <a href=\"https://twitter.com/garymarcus/status/1758931644780892667?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">slow-motion pans</a> without any real camera angles. </p><p>Right-wing pundit Jordan B. Peterson, however, does not seem to realize that, seeing as how he posted and then deleted a clip from the 2011 Indian action film <i>Singham</i>, which someone posted as a fake Sora clip. </p><p>As funny as this is — and it’s really, really funny — ElevenLabs, an audio AI tool, <a href=\"https://twitter.com/elevenlabsio/status/1759240084342059260?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">posted an example</a> of an upcoming feature they’re building that generates foley sound that when coupled with AI videos, makes them feel a lot more convincing. Which I’m sure will probably make things a lot worse, but oh well.</p><hr /><h2>A TikToker And Her Bitcoin-Loving Breakdancer Dad Are Having A Vlog Off</h2><blockquote><p></p><p>I wake up at 6 a.m. to find that my daughter has posted a TikTok video trashing me. <br />She's a big social media influencer with millions of followers. Here it is . . . <span>twitter.com/i/web/status/1…</span></p><p></p><a href=\"https://twitter.com/BenHart_Freedom/status/1759203169773506693?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"><p> — Ben &amp; Wanda Hart (@BenHart_Freedom) <br /> Feb 18, 2024 </p></a></blockquote><p>There’s a lot to unpack here. It all started when comedian Mandi Hart posted a <a href=\"https://www.tiktok.com/@madihart_soccer/video/7335234407734807851?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">funny video</a> about how her dad became a professional breakdancer after her parents got divorced. Hart <a href=\"https://www.tiktok.com/@madihart_soccer/video/7320778932180045098?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">went viral</a> a few weeks ago, as well, after right-wing media became obsessed with her sharing a funny story about a date she went on recently. Her video about her dad, which she posted last week, has about five million views.</p><p>Yesterday, her dad, who apparently loves Bitcoin, posted his version of events, embedded above, which all sounds sort of reasonable, but he’s also like a weird anti-woke podcast guy, so, you know, take everything he says with a grain of salt. Also, Hart then <a href=\"https://www.tiktok.com/@madihart_soccer/video/7337175288566074666?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">responded</a> to her dad’s response, saying that a lot of what he put in his video was a lie.</p><p>Look, this seems like a very weird and personal matter the Hart family is working through, and, normally, I’d say this shouldn’t be happening out in public for everyone to weigh in on. Elon Musk even responded to her dad’s video. But, also, maybe turning fairly low-stakes family drama into internet discourse is actually healthy and we should all start doing call out posts for our parents or children. </p><hr /><h2>Excited That I Can Finally Admit I Do Not Know How GitHub Works</h2><blockquote><p></p><p>very correct take, developers take note</p><p></p><a href=\"https://twitter.com/liz_love_lace/status/1759276265906061616?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"><p> — Liz Lovelace! 🇹🇭 (@liz_love_lace) <br /> Feb 18, 2024 </p></a></blockquote><p>Until this post, I assumed I was alone in not understanding how to download and install projects from GitHub. I have never admitted I can’t do this because I write about the internet for a living and that involves computers and I just figured everyone else did know how to do this. But it turns out I’m not the only one.</p><p>I feel like I can finally exhale and admit that, yes, I simply do not understand how GitHub works. I don’t know what I’m supposed to do with those folders and pieces of code. What I do I put the code in? Is that what a compiler does? I don’t know how to make that into the program that I need. Please, just give me an EXE or DMG file.</p><p>Man, that felt good to get out there.</p><hr /><h2>There Is A 52-Video TikTok Playlist That Is Going Very Viral Right Now</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@reesamteesa?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"> @reesamteesa </a><p>Who TF Did I Marry- Introduction #reesateesa #fyp #series </p></section></blockquote><p>Wow! A lot of drama happening on TikTok right now! A TikTok user going by @reesamteesa posted a 52-video playlist titled, “<a href=\"https://www.tiktok.com/@reesamteesa/playlist/Who%20TF%20Did%20I%20Marry%3F!%3F-7335374888247118622?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">Who TF Did I Marry?!?</a>” It easily clocks in at close to five hours long, documenting an extremely bad man she was married to, who she refers to as Legion throughout.</p><p>I have not watched the entire thing because it is incredibly long and TikTok’s browser app doesn’t let videos keep playing in a tab when you click away and I just cannot, in the year 2024, sit and watch five hours of content without doing other things on my computer at the same time.</p><p>But I did watch this <a href=\"https://www.tiktok.com/@katierosepope/video/7337147413108509995?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">four-minute video summary</a> and skimmed this written summary <a href=\"https://www.reddit.com/r/popculturechat/comments/1au5nls/a_tiktok_story_time_is_going_viral_about_a/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">from Reddit</a>. Basically, TL;DR, Legion was committing several kinds of identity fraud and was possibly making up entire phone conversations with non-existent family members, among other very, very bizarre and like illegal behavior.</p><p>@reesamteesa’s story is truly wild and she is an incredibly talented and insightful narrator of the whole thing, which I think is why this has gone so viral. But I also don’t think it’s an accident that a literal hours-long story time playlist has blown up only a few weeks after TikTok <a href=\"https://edition.cnn.com/2023/12/16/tech/tiktok-pushing-longer-videos-creators-app-change/index.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">announced</a> it was pivoting to long-form content.</p><hr /><h2>The Final Boss Of The Crappy MRA Podcast</h2><blockquote><p></p><p>she’s like kryptonite for sexist podcast bros</p><p></p><a href=\"https://twitter.com/abbygov/status/1758713452107854090?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"><p> — abby govindan (@abbygov) <br /> Feb 17, 2024 </p></a></blockquote><p><i>Whatever</i> is a horrible show produced by literal demons, where young women, usually OnlyFans models or other niche influencers, “debate” the lowest dregs of humanity, which are usually pickup artists and Christian hustle bros who dress like the Boss Baby.</p><p>Recently, an influencer and OnlyFans model named Khalidi Farha went on the show and absolutely trounced the male hosts. One of the clips is embedded above, but she’s shared more <a href=\"https://twitter.com/KhalidiFarha?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">on her X account</a>.</p><p>The <i>Whatever</i> podcast is rancid, but takes up an interesting space in the <a href=\"https://www.youtube.com/watch?v=dh5G2-8O0Vw&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">Dunking On Women Content Economy</a>, because it seems like most of the young women that go on do tend to come away with a lot more than the weird, insane men that go on. Probably because OnlyFans models have a much more direct path to monetization than a real estate guru hawking his looksmaxxing guides on Gumroad.</p><hr /><h2><i>*Unramens Your Ramen*</i></h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@anxkmt?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\"> @anxkmt </a><p>#idontlikeyou #ramen #fyp </p></section></blockquote><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://checkmyads.org/branded/jezebel-paste-advertising-blocklist/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">“Jezebel’s new owner has a request for advertisers: Please stop hurting journalism”</a></p></li><li><p><a href=\"https://www.techdirt.com/2024/02/15/has-wired-given-up-on-fact-checking-publishes-facts-optional-screed-against-section-230-that-gets-almost-everything-wrong/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">“Has Wired Given Up On Fact Checking? Publishes Facts-Optional Screed Against Section 230 That Gets Almost Everything Wrong”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://twitter.com/LaughterHaver/status/1757063611610996811?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-cnn-mtv-and-disney-of-the-future\" target=\"_blank\">good post</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=d92913e7-4ff3-4fa3-94af-956b816d9dcc&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"e6a3fe1f984a719cc7086bec469fa9b03404042841ee1becb2b9507d19fbeefd","category":"default"}