{"title":"Will Trump Appoint a Great FDA Commissioner?","link":"https://feeds.feedblitz.com/~/907930655/0/marginalrevolution~Will-Trump-Appoint-a-Great-FDA-Commissioner.html","date":1731673091000,"content":"<p>A German newspaper asked for my take on the nomination of RFK Jr. to head HHS. Here’s what I said:</p>\r\n<blockquote><p>Operation Warp Speed stands as the crowning achievement of the first Trump administration, exemplifying the impact of a bold public-private partnership. OWS accelerated vaccine development, production, and distribution beyond what most experts thought possible, saving hundreds of thousands of American lives and demonstrating the power of American ingenuity in a time of crisis.</p>\r\n<p>By nominating Robert F. Kennedy Jr., a prominent anti-vaccine activist, President Trump undermines his own legacy, and casts doubt on his administration’s commitment to protecting American lives through science-driven health policy.</p></blockquote>\r\n<p>Many better choices are available. Here is my <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2017/01/will-trump-appoint-great-fda-commissioner.html\">2017 post</a> on potential people to head the FDA, many of which would also be great at HHS. No indent. Key points remain true.</p>\r\n<p>As someone who has written about <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~www.fdareview.org/\">FDA reform</a> for many years it’s gratifying that all of the people whose names have been floated for FDA Commissioner would be excellent, including <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://balajis.com/about/\">Balaji Srinivasan</a>, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.bloomberg.com/politics/articles/2016-12-07/trump-team-is-said-to-consider-thiel-associate-o-neill-for-fda\">Jim O’Neill</a>, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~www.josephgulfo.com/\">Joseph Gulfo</a>, and <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://en.wikipedia.org/wiki/Scott_Gottlieb\">Scott Gottlieb</a>. Each of these candidates understands two important facts about the FDA. First, that there is fundamental tradeoff–longer and larger clinical trials mean that the drugs that are approved are safer but at the price of increased drug lag and drug loss. Unsafe drugs create concrete deaths and palpable fear but drug lag and drug loss fill <em>invisible graveyards. </em>We need an FDA commissioner who sees the invisible graveyard.</p>\r\n<p>Each of the leading candidates also understands that we are entering a new world of personalized medicine that will require changes in how the FDA approves medical devices and drugs. Today almost everyone carries in their pocket the processing power of a 1990s supercomputer. Smartphones equipped with sensors can monitor blood pressure, perform ECGs and even <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://nanoporetech.com/products/smidgion\">analyze DNA</a>. Other devices being developed or available include contact lens that can track glucose levels and eye pressure, devices for monitoring and analyzing gait in real time and head bands that monitor and even adjust your brain waves.</p>\r\n<p>The FDA has an inconsistent even schizophrenic attitude towards these new devices—some have been approved and yet at the same time the FDA has banned 23andMe and other direct-to-consumer genetic testing companies from offering some DNA tests because of “the risk that a test result may be used by a patient to self-manage”. To be sure, the FDA and other agencies have a role in ensuring that a device or test does what it says it does (the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~www.wsj.com/articles/second-theranos-lab-failed-u-s-inspection-1484708428\">Theranos</a> debacle shows the utility of that oversight). But the FDA should not be limiting the information that patients may discover about their own bodies or the advice that may be given based on that information. Interference of this kind violates the first amendment and the long-standing doctrine that the FDA does not control the practice of medicine.</p>\r\n<p>Srinivisan is a computer scientist and electrical engineer who has also published in the New England Journal of Medicine, Nature Biotechnology, and Nature Reviews Genetics. He’s a co-founder of <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.counsyl.com/\" target=\"_blank\">Counsyl</a>, a genetic testing firm that now tests ~4% of all US births, so he understands the importance of the new world of personalized medicine.</p>\r\n<p>The world of personalized medicine also impacts how new drugs and devices should be evaluated. The more we look at people and diseases the more we learn that both are radically heterogeneous. In the past, patients have been classified and drugs prescribed according to a handful of phenomenological characteristics such as age and gender and occasionally race or ethnic background. Today, however, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.ncbi.nlm.nih.gov/pubmed/22424236\">genetic testing and on-the-fly examination of RNA transcripts, proteins, antibodies and metabolites</a> can provide a more precise guide to the effect of pharmaceuticals in a particular person at a particular time.</p>\r\n<p>Greater targeting is beneficial but as Peter Huber <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~www.manhattan-institute.org/pdf/fda_06.pdf\">has emphasized</a> it means that drug development becomes much less a question of does this drug work for the average patient and much more about, can we identify in this large group of people the subset who will benefit from the drug? If we stick to standard methods that means even larger and more expensive clinical trials and more drug lag and drug delay. Instead, personalized medicine suggests that we allow for more liberal approval decisions and improve our techniques for monitoring individual patients so that physicians can adjust prescribing in response to the body’s reaction. Give physicians a larger armory and let them decide which weapon is best for the task.</p>\r\n<p>I also <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.mercatus.org/system/files/Gulfo-Proper-Role-FDA-v1.pdf\">agree with Joseph Gulfo</a> (writing with Briggeman and Roberts) that in an effort to be scientific the FDA has sometimes fallen victim to the fatal conceit. In particular, the ultimate goal of medical knowledge is increased life expectancy (and reducing morbidity) but that doesn’t mean that every drug should be evaluated on this basis. If a drug or device is safe and it shows activity against the disease as measured by symptoms, surrogate endpoints, biomarkers and so forth then it ought to be approved. It often happens, for example, that no single drug is a silver bullet but that combination therapies work well. But you don’t really discover combination therapies in FDA approved clinical trials–this requires the discovery process of medical practice. This is why Vincent DeVita, former director of the National Cancer Institute, writes in his excellent book, <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.amazon.com/Death-Cancer-Pioneering-Oncologist-Winnable/dp/0374536481/ref=sr_1_2?ie=UTF8&amp;qid=1484861233&amp;sr=8-2&amp;keywords=devita+cancer\">The Death of Cancer</a>:</p>\r\n<blockquote><p>When you combine multidrug resistance and the <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://linus.nci.nih.gov/techreport/Norton-Simon-NCPO.pdf\">Norton-Simon effect</a> , the deck is stacked against any new drug. If the crude end point we look for is survival, it is not surprising that many new drugs seem ineffective. We need new ways to test new drugs in cancer patients, ways that allow testing at earlier stages of disease….</p></blockquote>\r\n<p>DeVita is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.aeaweb.org/articles?id=10.1257/aer.20131176\">correct</a>. One of the reasons we see lots of trials for end-stage cancer, for example, is that you don’t have to wait long to count the dead. But no drug has ever been approved to <em>prevent</em> lung cancer (and only six have ever been approved to prevent any cancer) because the costs of running a clinical trial for long enough to count the dead are just too high to justify the expense. Preventing cancer would be better than trying to deal with it when it’s ravaging a body but we won’t get prevention trials without changing our standards of evaluation.</p>\r\n<p>Jim O’Neill, managing director at Mithril Capital Management and a former HHS official, is an interesting candidate precisely because he also has <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://futurism.com/the-next-head-of-the-fda-may-be-a-man-who-is-fighting-a-war-against-aging/\">an interest in regenerative medicine</a>. With a greater understanding of how the body works we should be able to improve health and avoid disease rather than just treating disease but this will require new ways of thinking about drugs and evaluating them. A new and non-traditional head of the FDA could be just the thing to bring about the necessary change in mindset.</p>\r\n<p>In addition, to these big ticket items there’s also a lot of simple changes that could be made at the FDA. Scott Alexander at Slate Star Codex has a <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~slatestarcodex.com/2017/01/18/watch-new-health-picks/\">superb post</a> discussing reciprocity with Europe and Canada so we can get (at the very least) <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2014/03/still-burned-by-the-fda.html\">decent sunscreen</a> and medicine for <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2017/01/fda-fails-prevent-travelers-diarhea.html\">traveler’s diarrhea</a>. Also, allowing any major pharmaceutical firm to produce any generic drug without going through a expensive approval process would be a relatively simply change that would shut down people like Martin Shkreli who exploit the regulatory morass for private gain.</p>\r\n<p>The head of the FDA has tremendous power, literally the power of life and death. It’s exciting that we may get a new head of the FDA who understands both the peril and the promise of the position.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html\">Will Trump Appoint a Great FDA Commissioner?</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/907930655/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/907930655/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/907930655/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/907930655/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/907930655/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/907930655/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comment-160836046\">In reply to Northerner.   Vaccines for human use are never ...</a> <i>by Marian Kechlibar</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comment-160835983\">Alex is wrong, Covid vaccines didn't save hundreds of thousands ...</a> <i>by Mark Brophy</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comment-160835928\">In reply to steve.   In context, the FDA already has a lot of ...</a> <i>by steve</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comment-160835680\">In reply to Hmm.   Greasemonkey</a> <i>by Komori</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comment-160835677\">Around 80% of all cancer approvals are based on studies with ...</a> <i>by Mike</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/will-trump-appoint-a-great-fda-commissioner.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/broad-tariffs-can-be-worse-than-targeted-tariffs.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=broad-tariffs-can-be-worse-than-targeted-tariffs\">Broad tariffs can be worse than targeted tariffs</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/science-of-science.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=science-of-science\">*Science of Science*</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/11/kaput-the-end-of-the-german-miracle.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=kaput-the-end-of-the-german-miracle\">*Kaput: The End of the German Miracle*</a></li></ul> </div>","author":"Alex Tabarrok","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"e6ac61bf3420190e08d2873a0bbc8065c96ce347a849096f836079e87a3fe408","category":"Sites"}