{"title":"Users and AI","link":"http://scripting.com/2024/05/23/123526.html?title=usersAndAi","date":1716467726000,"content":"<p>We hear about what the companies are doing, mostly very serious bullshit. As always the most interesting stuff is done by the users, especially at such an early stage in a technology. In the past, when blogging was booting up, we had blogging itself to share information about what we were learning. Podcasting grew much more quickly because we already had blogging. You can see all of it in the archives of Scripting News. I was really liberal about what I pointed to, because sharing the ideas was more important than any one person's ideas, including my own. The downside is that it made it easy for people to claim credit for things they didn't contribute. </p>\n<p>Anyway, I'm just using the stuff, not developing with. I wouldn't know where to begin. but I'm discovering all kinds of applications every day, and writing about them on my blog, but I know there are many others doing the same, and I want to read all of it and want them to ready my stuff. no way to find each other right now.</p>\n<p>It would be very interesting to have an AI server that was ingesting RSS feeds all the time. Then a community of bloggers, if it should develop</p>\n<p>In the meantime, when I discover a blogger who is writing about AI stuff that could make sense to users, I add it to my blogroll, which is visible on the blogroll.social main page, and on my blog. If you have such a blog, or know of a really good one, send me a link, and I'll add it to the blogroll. Once there are enough, I'll start a public timeline for it in FeedLand, so everyone can benefit. </p>\n<p>Let's use our technology to track the most exciting tech development in a very long time. </p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"e73be26c7e06cd3fdcbb79c3699c37429c8dbeeafa53553673cc39c1abfe171f","category":"default"}