{"title":"You don’t have to be local","link":"https://sive.rs/local","date":1354406400000,"content":"<p>\nYou can focus your time locally or globally.\n</p><p>\nIf you’re local, you focus on your community, doing things in-person.\nBut this means you have less time to focus on the rest of the world.\n</p><p>\nIf you’re global, you make things for the whole world.\nBut this means you have less time to be part of your local community.\n</p><p>\nNeither approach is right or wrong, but you need to be aware of the trade-off.\n</p><p>\nI lived in Woodstock, New York for three years.\nThere I started my company, entirely online.\nI never met anyone in Woodstock.\nI just lived there, but didn’t socialize there.\nMy attention was focused globally, which helped my business grow quickly.\n</p><p>\nThen I lived in Portland, Oregon for three years.\nI worked every waking hour — super productive.\nI made great friends worldwide, but I never hung out in Portland.\nIt was just my place to work and sleep.\nMy attention was still focused globally.\n</p><p>\nThen I lived in Singapore for three years and decided to do the opposite — to get fully involved in my local community.\nI had an open door, said yes to every request, met with hundreds of people, and went to every event possible.\nI spent most of my time talking with people, and really got to know the Singapore community.\n</p><p>\nBut something felt wrong.\nAfter a day of talking, I was often exhausted and unfulfilled.\nTwo hours spent with one person who wants to “pick my brain” is two hours I could have spent making something that could be useful to the whole world, including that one person.\n</p><p>\nThen people in America started emailing to ask why I’d been so silent.\nNo new articles?\nNo new projects?\nNothing?\n</p><p>\nSo there’s the trade-off.\nWhen I’m local-focused, I may be useful to my community, but I’m not being as useful to the rest of the world.\n</p><p>\nSo I’m finally admitting:\nI’m not local.\n</p><p>\nI feel equally connected to many places.\nJust because I live in one place now, that doesn’t mean I should ignore the others.\nTo me, the emphasis on local stuff never felt right.\nWhen I lived in Woodstock and Portland, people asked what I was doing to promote the local music scene.\nI argued that I shouldn’t favor Woodstock or Portland any more than Wellington or Prague.\nBut that’s just me.\n</p><p>\nSome people feel a strong separation between insiders and outsiders.\nIf you’re a part of their family, neighborhood, organization, or circle of friends, then you’re an insider.\nEveryone else is an outsider.\n</p><p>\nOther people feel no separation.\nYou’re treated equally, no matter where you’re from or who you know.\nThere are no outsiders.\nYou make connections based on who you are now, not where you’ve been.\n</p><p>\nLike your tendency to be introverted or extroverted, or conservative or liberal, these fundamental world views shape your approach to life and work.\n</p><p>\nA business can focus on growing their local market or on internationalizing.\nA musician can focus on doing local gigs or on reaching fans online.\nVery different approaches.\nBoth are necessary.\nNeither is right or wrong.\nJust be aware that you can choose the local or global balance that works best for you.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"e7aec4f7214ed1d82ab6116415f9a7a41d41706adb1d7348013e6b72fb1f005b","category":"default"}