{"title":"Taxing unrealized capital gains is a terrible idea","link":"https://feeds.feedblitz.com/~/903889157/0/marginalrevolution~Taxing-unrealized-capital-gains-is-a-terrible-idea.html","date":1725252782000,"content":"<p>Sadly, Jason Furman has been endorsing one of the very worst economic ideas of our generation.  Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://x.com/jasonfurman/status/1829943351795155056\" target=\"_blank\">Jason’s Twitter take</a>, here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.wsj.com/articles/bidens-better-plan-to-tax-the-rich-unrealized-capital-gains-assets-treasury-distortion-11648497984\" target=\"_blank\">his earlier WSJ piece</a>.</p>\r\n<p>Let me start with his quick summary:</p>\r\n<blockquote><p>I like the Biden-Harris proposal to tax unrealized capital gains. For any given level of capital taxation it’s more efficient &amp; fair to tax unrealized gains, reduces lock in &amp; tax planning.</p></blockquote>\r\n<p>Read through Jason’s own words in the WSJ — do you really think a system that complicated is going to<em> reduce</em> tax planning?  How about figuring out what percentage of liquid vs. illiquid assets to hold?  Whether to finance ventures through private equity vs. public markets?  Which risky assets to buy and sell before December 31?  How much to put into your foundation, so as to adjust your net wealth status?  Might there not be other “tricks” to adjust your tax eligibility as well?  What about those “live in Puerto Rico” decisions?</p>\r\n<p>When it comes to your assets, how is “tradeable” defined?  (<strong>Narrator</strong>: It isn’t)</p>\r\n<p><a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://home.treasury.gov/system/files/131/General-Explanations-FY2025.pdf\" target=\"_blank\">How about the</a> “…rules to prevent taxpayers from inappropriately [sic] converting tradeable assets to non-tradeable assets”?  Those are going to go down nice and smooth, right?  And imagine the legal squabbles over what “tradeable” and “non-tradeable” mean.  How about bundling assets and deliberately making them less tradeable?  How does that count?  Chopping up assets to make them less tradeable?  Do we have to measure the intent of the investor?  And doesn’t this make it much harder to invest in your own start-up?  (As we will see below, Jason and others cite “capital flowing freely” as a supposed benefit of this plan — but their plan harms capital flows a great deal.)</p>\r\n<p>How does <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://home.treasury.gov/system/files/131/General-Explanations-FY2025.pdf\" target=\"_blank\">this paragraph</a>, with multiple points of tax planning ouch, make you feel?:</p>\r\n<blockquote><p>Taxpayers with wealth greater than the threshold would be required to report to the Internal Revenue Service (IRS) on an annual basis, separately by asset class, the total basis and total estimated value (as of December 31 of the taxable year) of their assets in each specified asset class, and the total amount of their liabilities. Tradable assets (for example, publicly traded stock) would be valued using end-of-year market prices. Taxpayers would not have to obtain annual, market valuations of non-tradable assets. Instead, non-tradable assets would be valued using the greater of the original or adjusted cost basis, the last valuation event from investment, borrowing, or financial statements, or other methods approved by the Secretary. Valuations of non-tradable assets would not be required annually and would instead increase by a conservative floating annual return (the five-year Treasury rate plus two percentage points) in between valuations. The IRS may offer avenues for taxpayers to appeal valuations, such as through appraisal.</p></blockquote>\r\n<p>Or if you wish to consider another random complication, and I am quite sure there are many others I have not thought of, how about this one? — <span>what about restricted stock or stock grants that vest over time? Are you only paying taxes on the unrestricted/vested part, or the whole thing?  Is this going to be so simple?</span></p>\r\n<p>I have great respect for Jason, whom I consider to be one of the very smartest policy economists, but I genuinely do not see how he can believe tax planning will become easier and less costly under this proposal.  Furthermore, one has to consider the tax complications of the act Congress actually will pass, after lots of political horse-trading, rather than the ideal Jason Furman plan.  We all know how previous tax plans have fared when they go through the legislative process.</p>\r\n<p>As for lock in, here is Jason from the WSJ:</p>\r\n<blockquote><p>…linking taxation to realization encourages people to hold on to assets. These gains escape taxation at death, which turbocharges the incentive not to sell and prevents capital from flowing freely to those who can make the best use of it.</p></blockquote>\r\n<p>I don’t understand the worry here, much less why it is a significant worry.  I don’t hear Democratic economists complain about the insufficient liquidity of the wealthy in any other contexts.  To put this point in an example, let’s say someone founds a company, and years later that company is worth $200 billion.  Under current tax law, Mr. Billionaire arguably will be too late in selling his shares and too late in becoming more liquid, relative to an optimum.  Just how big of a distortion is that?  Who, on the left side of the politcal spectrum, ever said: “My goodness, I’m worried, Mark Zuckerberg isn’t liquid enough!”  And then…we are supposed to help make him more optimally liquid by taking away a decent share of his wealth?  In a world with reasonable capital markets, the best way to protect the liquidity of the wealthy is to maintain or boost their net wealth.</p>\r\n<p>Given the ability of private equity to “think about” valuations <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.institutionalinvestor.com/article/2bstqfcskz9o72ospzlds/opinion/why-does-private-equity-get-to-play-make-believe-with-prices\" target=\"_blank\">creatively</a>, the plan offers a huge relative subsidy to that way of doing business.  I think that sector is on average more Democratic-friendly than would be public equity holdings?  And why introduce this additional distortion?  Weren’t we supposed to be worried about the growth of private equity?  (What was it they said about Mitt Romney, way back when?)</p>\r\n<p>Alex T., in an email to me, makes a general point very effectively:</p>\r\n<blockquote><p>What’s really going on is that you are divorcing the entrepreneur from their capital at precisely the moment that the team is likely most productive. Separation of capital from entrepreneur could negatively impact the company’s growth or the entrepreneur’s ability to manage effectively. The entrepreneur could lose control, for example. If you wait until the entrepreneur realizes the gain that’s the time that the entrepreneur wants out and is ready to consume so it’s closer to taxing consumption and better timed in the entrepreneurial growth process.</p></blockquote>\r\n<p>I agree with Jason (and many others) that revaluing the capital gains step-up basis at death is a bad idea. We all know that is easy enough to fix by other means, as public finance economists have long proposed.  And if need be, we could tax the ability of wealthy people to borrow, using their stock as collateral.  I don’t favor this, but it would be way better than the proposal under consideration.</p>\r\n<p>Let’s consider another Jason point:</p>\r\n<blockquote><p>…taxing gains when they are realized is unfair because it allows two people with similar income or wealth to be taxed at different rates for arbitrary reasons. For example, if you hold stocks that appreciate, they will be taxed less than similar stocks that do not appreciate but do pay a dividend.</p></blockquote>\r\n<p>Keep in mind the Biden-Harris plan is supposed to apply only to the very wealthy (and let us hope it stays that way over time, just like…um…the AMT did).  I should be worried about fairness issues because two different individuals with say $300 million in net wealth are paying different tax rates based on their capital gains vs. dividend profiles?  I just don’t get it.  Is it such a big problem that we don’t end up with “enough dividends”?  And this worry of Jason’s comes very early in his piece, with prominence, it is not an aside buried on p.137 of a long proposal.  From my point of view, it is simply an idle search for not very relevant distortions.</p>\r\n<p>Here is one very simple way to see the distortions embodied in the new plan.  The plan attempts to enforce a minimum tax rate of twenty-five percent.  Say you have a start-up, and it becomes valued at $10 billion after a quick growth spurt.  But still you aren’t making money yet, but nonetheless your overall portfolio is reasonably liquid because your last company did well and you sold it.  So, if I follow Jason and the plan document correctly, in the year after that valuation you have to pay one-fifth of the tax liability on that gain, or say one-fifth of one-fourth of the $10 billion, or $500 million (you don’t have to pay the whole gain, because that would be “too much” a penalty, since the start-up may not in fact pan out.  So it is just one-fifth of the 25% rate you pay up front.  Obviously you can vary these exact numbers, but the general point remains.  Do note that in varying expositions you can see the core rate reported as either 25% or 20%).</p>\r\n<p>That just seems like a bad investment to me!  And let’s say the next year the company valuation goes up to $20 billion.  You have to pay another $500 million on the new gains, and also (on <em>this</em> point I am not sure I grasp the plan), you have to pay yet another fifth on the gains that have persisted for yet another year, or in other words yet another $500 million (and please do correct me if I am misunderstanding that).  Then suppose that, the year after, the start-up crashes and has to be liquidated at a very low value.  <em>There isn’t any refund from the tax man</em>. So you have lost not only your investment but also at least $1 billion more, again noting the exact numbers can vary a bit here.</p>\r\n<p>Ex ante, why would you enter into deals like this?  But of course a lot of start-up sectors have return structures very much like that, namely some high initial valuations but with reasonably high percentages of a later crash.</p>\r\n<p>Venture capital drives so much of the most productive sectors of our economy, so why are we whacking it like this?  When so many promising developments in biotech and green energy seem to be on the way?  Why should we want to crush venture capital like this?</p>\r\n<p>By the way, this plan doesn’t seem to be indexing gains for inflation, at least I could not find talk of that in the core document.  That introduces a whole new set of distortions — why push more of our taxing capacity into a non-inflation-indexed system?  (And please readers, if any advocates of this tax are calling for concomitant inflation indexation,  please do leave those links in the comments.  I haven’t seen that myself.)</p>\r\n<p>As a result of the policy, doesn’t more asset ownership end up in the hands of foreigners?  Once the policy is on the way, American capital owners will be selling at discounts.  That is another distortion, and the resulting capital inflow likely would not help U.S. exports (it is a bit complicated because not all ceteris are paribus).  Foreigners will end up “owning more of America,” and yes that includes Chinese.  That alone seems like reason to reject this plan, yet you won’t find these issues discussed.</p>\r\n<p>If this is supposed to be a major revenue source for our government, why make the budget so dependent on capital gains, realized or otherwise?  How has that dependence worked out for the state of California?  What happens to the broader budget during recessions and asset price crashes?</p>\r\n<p>Or just try the very simplest of “small c conservative” questions — how many countries have ever made a system like this work?  None, and yes I do know about the much smaller, more limited, and also abandoned French wealth tax.</p>\r\n<p>Overall, this is a terrible policy, and we need the real Jason Furman back!</p>\r\n<p><strong>Addendum</strong>: Here is <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://x.com/jasonfurman/status/1830625149608960125\" target=\"_blank\">a Jason Furman Twitter response</a>, and my response back to him at the end of that.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html\">Taxing unrealized capital gains is a terrible idea</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/903889157/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/903889157/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/903889157/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/903889157/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/903889157/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/903889157/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comment-160807380\">In reply to Mm.   Agree wigh Mm. Ownership structures may also ...</a> <i>by C</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comment-160807364\">In reply to rsm.   I will be dead within 25 years. However, my ...</a> <i>by Jack Towarnicky</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comment-160807356\">In reply to Skythe.   Can’t handle the truth about Harris? ...</a> <i>by Global Guru</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comment-160807354\">In reply to liberalarts.   And this is why we need to ...</a> <i>by Global Guru</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comment-160807336\">In reply to Ska.   So more startups will be wholly owned by the ...</a> <i>by Mm</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-is-a-terrible-idea.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/taxing-unrealized-capital-gains-and-interest-rate-policy.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=taxing-unrealized-capital-gains-and-interest-rate-policy\">Taxing Unrealized Capital Gains and Interest Rate Policy</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/the-new-jerusalem-demsas-book.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=the-new-jerusalem-demsas-book\">The new Jerusalem Demsas book</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/09/crypto-is-the-money-for-ais.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=crypto-is-the-money-for-ais\">Crypto is the Money for AIs</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"e83419e0d5950c80d9e0ea5081ec9d5f637c46f9b3eb1eb764ba59ac9806763b","category":"Sites"}