{"title":"Brian Eno and Generative Film","link":"https://www.usv.com/writing/2024/08/brian-eno-and-generative-film/","date":1722619785000,"content":"<p>This week my wife Carrie, a documentary film producer , took me to see Eno . The director of the film is Gary Hustwit , who previously made the film Helvetica . Eno is a spectacular film and I encourage everyone to see it. I never realized how profoundly special Brian Eno is. He is a true artist-philosopher, the perfect personification of what we may envision to be a master of a craft.</p>\n<p>What was most exciting to me is that Eno is a generative film . No two screenings of the film are the same. You will never see the same film I watched the other evening in a sold-out theater, and that is by design. The director, Gary, started building software more than 5 years ago that would enable him to feed footage into a system and for that system to create different permutations of the film, indefinitely.</p>\n<p>The resulting films, while similar in length, are always different. New footage can be added or removed whenever the director wants and the underlying system can be altered in any way. I didn’t realize it, but Brian Eno produced and pioneered generative music in the same way, so it makes sense that this new film format mimics its subject’s unique style.</p>\n<p>After the film Gary stayed back for an interview onstage. I asked him if he planned to let other filmmakers use the software, and he said yes. He made it because he grew disenchanted with the linear format of films. It’s the same thing every time, and that constraint was a relic of the past and never adequately challenged. Why shouldn’t a film be a different experience for every view and viewer? Why should its mood not be different in the evening than the daytime, or be influenced by the weather or current events? These ideas are now possible to achieve, generatively.</p>\n<p>Gary talked about how there may be novel ways to stream the film. Perhaps it can be customized to a streamer’s environment. It’s unclear how this would work, but everyone can watch Eno while nobody sees the same film twice is powerful. This is the type of idea that drives people to see bands like the Grateful Dead and Phish hundreds of times. You never know what you’re going to get on any given night.</p>\n<p>I’m a believer that AI-powered tools will lead to the creation of new media formats and change the way entertainment is created , but this film showed me that generative media doesn’t need AI to create content or art. I’m looking forward to seeing what Gary does with this platform. One could experiment with film length, styles, and more. A piece of media that “feels” the same to everyone but never truly is is a new form of art in my book, and I’d love to see what happens when it’s unleashed for the world to experience.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/brian-eno-and-generative-film/\">Brian Eno and Generative Film</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"e87d7c1bba546801036e5ba433e36fc12edb659d23ebc4cfe151ee87ff766bfe","category":"default"}