{"title":"Winnicott on the Psychology of Democracy, the Most Dangerous Type of Person, and the Unconscious Root of Resisting Women Leaders","link":"https://www.themarginalian.org/2024/09/22/winnicott-democracy/","date":1727037469000,"content":"<p><a href=\"https://www.amazon.com/Home-Where-We-Start-Psychoanalyst/dp/0393018660/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"488\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?fit=320%2C488&amp;ssl=1\" alt=\"Winnicott on the Psychology of Democracy, the Most Dangerous Type of Person, and the Unconscious Root of Resisting Women Leaders\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?w=984&amp;ssl=1 984w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?resize=320%2C488&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?resize=600%2C915&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?resize=240%2C366&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/winnicott_home.jpg?resize=768%2C1171&amp;ssl=1 768w\" /></a></p><p>In the late morning of the first day of August in 2023, exactly twenty summers after I arrived in Philadelphia as a lone teenager from a country thirteen centuries America’s senior, I experienced that wonderful capacity for self-surprise as tears came streaming down my face in a windowless government office. I had taken the naturalization ceremony to be just the final checklist item on a long and tedious bureaucratic process. But standing there between an Ethiopian family holding a newborn and a beautiful Burmese woman older than my grandmother, born just after women became citizens of mankind, I found myself profoundly moved, a shaky voice in the chorus reciting the Oath of Allegiance — all these beautiful people from every corner of the world, who had left behind everything they knew of home to partake of this imaginative experiment in freedom, flourishing, and dignity for all. </p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=680%2C401&amp;ssl=1\" width=\"680\" height=\"401\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?w=1905&amp;ssl=1 1905w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=320%2C189&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=600%2C354&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=240%2C142&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=768%2C453&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?resize=1536%2C906&amp;ssl=1 1536w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/CuevaDeLasManos_TheMarginalian.jpg?w=1360&amp;ssl=1 1360w\" /><figcaption>Detail from the art in Cueva de las Manos, Argentina, created between 7,300 BC and 700 AD.</figcaption></figure>\n<p>In preparing for my first election — an election so historic it may be the litmus test for the experiment’s success or failure — I was reminded of an uncommonly insightful investigation of democracy not as a political but as a psychological phenomenon by the reliably revelatory pediatrician turned psychiatrist <a href=\"https://www.themarginalian.org/tag/donald-winnicott/\">Donald Winnicott</a> (April 7, 1896–January 28, 1971).</p>\n<p>In a 1958 essay found in his posthumous essay collection <a href=\"https://www.amazon.com/Home-Where-We-Start-Psychoanalyst/dp/0393018660/?tag=braipick-20\" target=\"_blank\"><strong><em>Home Is Where We Start from</em></strong></a> (<a href=\"https://search.worldcat.org/title/10072848\" target=\"_blank\"><em>public library</em></a>), Winnicott examines the meaning of democracy in a way that may “give unconscious emotional factors their full import.” He writes:</p>\n<blockquote><p>An important latent meaning [is] that a democratic society is “mature,” that is to say, that it has a quality that is allied to the quality of individual maturity which characterizes its healthy members.</p>\n<p>[…]</p>\n<p>In psychiatric terms, the normal or healthy individual can be said to be one who is mature; according to his or her chronological age and social setting there is an appropriate degree of emotional development… Psychiatric health is therefore a term without fixed meaning. In the same way the term “democratic” need not have a fixed meaning… In this way one would expect the frozen meaning of the word to be different in Great Britain, the United States and the Soviet Union, and yet to find that the term retains value because of its implying the recognition of maturity as health.</p></blockquote>\n<p>The full realization of democracy, Winnicott argues, requires the study of society’s emotional development beneath the political machinery of democratic election, which is itself rooted in a fundament of our psychological experience as persons:</p>\n<blockquote><p>The essence of democratic machinery is the free vote (secret ballot). The point of this is that it ensures the freedom of the people to express deep feelings, apart from conscious thoughts. In the exercise of the secret vote, the whole responsibility for action is taken by the individual, if he is healthy enough to take it. The vote expresses the outcome of the struggle within himself, the external scene having been internalized and so brought into association with the interplay of forces in his own personal inner world. That is to say, the decision as to which way to vote is the expression of a solution of a struggle within himself. The process seems to be somewhat as follows. The external scene, with its many social and political aspects, is made personal for him in the sense that he gradually identifies himself with all the parties to the struggle. This means that he perceives the external scene in terms of his own internal struggle, and he temporarily allows his internal struggle to be waged in terms of the external political scene. This to-and-fro process involves work and takes time, and it is part of democratic machinery to arrange for a period of preparation. A sudden election would produce an acute sense of frustration in the electorate. Each voter’s inner world has to be turned into a political arena over a limited period.</p></blockquote>\n<p>In a sentiment evocative of Toni Morrison’s <a href=\"https://www.themarginalian.org/2015/07/21/toni-morrison-wellesley-commencement/\">magnificent 2004 commencement address</a>, in which she celebrates true maturity an achievement that is “a difficult beauty, an intensely hard won glory,” Winnicott offers a perspectival definition:</p>\n<blockquote><p>A democracy is an achievement, at a point of time, of a limited society, i.e. of a society that has some natural boundary. Of a true democracy (as the term is used today) one can say: In this society at this time there is sufficient maturity in the emotional development of a sufficient proportion of the individuals that comprise it for there to exist an innate tendency towards the creation and re-creation and maintenance of the democratic machinery.</p></blockquote>\n<p>Out of this insight can arise a kind of formula for predicting the fate of a society:</p>\n<blockquote><p>It would be important to know what proportion of mature individuals is necessary if there is to be an innate democratic tendency. In another way of expressing this, what proportion of antisocial individuals can a society contain without submergence of innate democratic tendency?</p></blockquote>\n<p>The danger of that proportion is what Whitman contoured a century before Winnicott in <a href=\"https://www.themarginalian.org/2016/02/24/walt-whitman-democratic-vistas/\">his own reckoning with democracy</a>, admonishing that “America, if eligible at all to downfall and ruin, is eligible within herself, not without.”</p>\n<figure><a href=\"https://society6.com/product/i-see-great-cloud-masses-with-at-times-half-dimmd-saddend-far-off-star_framed-print?sku=s6-8967899p21a12v52a13v54?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?resize=680%2C864&amp;ssl=1\" width=\"680\" height=\"864\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?resize=240%2C305&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?resize=320%2C407&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?resize=768%2C976&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/04/margaretcook_leavesofgrass23.jpg?resize=600%2C763&amp;ssl=1 600w\" /></a><figcaption>Artist Margaret C. Cook’s illustration for <a href=\"https://www.themarginalian.org/2018/04/11/leaves-of-grass-margaret-cook/\">a rare 1913 edition</a> of Walt Whitman’s <em>Leaves of Grass</em>. (Available <a href=\"https://society6.com/product/i-see-great-cloud-masses-with-at-times-half-dimmd-saddend-far-off-star_framed-print?sku=s6-8967899p21a12v52a13v54?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>The antisocial, Winnicott observes, come in three main psychological varieties: the overt kind, who “show their lack of sense of society by developing an antisocial tendency”; those “reacting to inner insecurity by the alternative tendency — identification with authority,” whom he calls “hidden antisocials”; and “indeterminates who would be drawn by weakness or fear into association with [the antisocials].” Of these, he highlights the hidden antisocials as the most dangerous, for their motives are most unconscious. (In every region of life, down to our most intimate relationships, the most unsafe people are those most lacking in self-awareness, most governed by unconscious complexes.) </p>\n<p>He considers the psychological peril of the hidden antisocials:</p>\n<blockquote><p>This is unhealthy, immature, because it is not an identification with authority that arises out of self-discovery. It is a sense of frame without sense of picture, a sense of form without retention of spontaneity… Hidden antisocials are not “whole persons” any more than are manifest antisocials, since each needs to find and to control the conflicting force in the external world outside the self. By contrast, the healthy person, who is capable of becoming depressed, is able to find the whole conflict within the self as well as being able to see the whole conflict outside the self, in external (shared) reality. When healthy persons come together, they each contribute a whole world, because each brings a whole person.</p></blockquote>\n<p>In an insight of staggering pertinence to our present political climate, not just in America but throughout the so-called democratic world courting totalitarianism under the guise of individualism, he adds:</p>\n<blockquote><p>Hidden antisocials provide material for a type of leadership which is sociologically immature. Moreover, this element in a society greatly strengthens the danger that derives from its frank antisocial elements, especially since ordinary people so easily let those with an urge to lead get into key positions. Once in such positions, these immature leaders immediately gather to themselves the obvious antisocials, who welcome them (the immature anti-individual leaders) as their natural masters.</p></blockquote>\n<p>In the remainder of the essay, Winnicott goes on to explore the creation of that necessary “innate democratic factor,” which begins with “the ordinary man and woman, and the ordinary, common-place home” — the work of parenting. (The morning after the 2016 presidential election, fearing my new home might come to resemble the dictatorship I was born into, I reached out to the wisest elder I knew — a <a href=\"https://www.themarginalian.org/2018/12/18/a-velocity-of-being-helen-fagin/\">100-year-old Holocaust survivor</a> — for perspective and consolation. Reminding me that the grimmest crime against humanity began with a legal election, she insisted that abating the unconscionable cannot be done purely on the level of politics — it must begin, she said, deeper and earlier: by laying the moral foundation of the young.)</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?resize=680%2C850&amp;ssl=1\" width=\"680\" height=\"850\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?resize=320%2C400&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?resize=600%2C750&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?resize=240%2C300&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/09/father_daughter_MariaPopova.jpg?resize=768%2C960&amp;ssl=1 768w\" /><figcaption>Sign in an Italian mountain village. (Available <a href=\"https://society6.com/product/father-and-daughter-sign-in-italian-mountain-town_print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>In a passage of astonishing prescience, Winnicott considers the staggering gender disparity in political leadership over history and its root in our developmental psychology:</p>\n<blockquote><p>In psychoanalytical and allied work it is found that all individuals (men and women) have in reserve a certain fear of WOMAN. Some individuals have this fear to a greater extent than others, but it can be said to be universal. This is quite different from saying that an individual fears a particular woman. This fear of WOMAN is a powerful agent in society structure, and it is responsible for the fact that in very few societies does a woman hold the political reins. It is also responsible for the immense amount of cruelty to women, which can be found in customs that are accepted by almost all civilizations. </p>\n<p>The root of this fear of WOMAN is known. It is related to the fact that in the early history of every individual who develops well, and who is sane, and who has been able to find himself, there is a debt to a woman — the woman who was devoted to that individual as an infant, and whose devotion was absolutely essential for that individual’s healthy development. The original dependence is not remembered, and therefore the debt is not acknowledged, except in so far as the fear of WOMAN represents the first stage of this acknowledgement.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2019/03/20/crescendo-quintavalle-sanna/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/03/crescendo010.jpg\" /></a><figcaption>Art by Alessandro Sanna from <a href=\"https://www.themarginalian.org/2019/03/20/crescendo-quintavalle-sanna/\"><em>Crescendo</em></a>.</figcaption></figure>\n<p>With haunting foresight into both the fault lines and the opportunities of our time, he adds:</p>\n<blockquote><p>As an offshoot of this consideration, one can consider the psychology of the dictator, who is at the opposite pole to anything that the word “democracy” can mean. One of the roots of the need to be a dictator can be a compulsion to deal with this fear of woman by encompassing her and acting for her. The dictator’s curious habit of demanding not only absolute obedience and absolute dependence but also “love” can be derived from this source.</p></blockquote>\n<p>Complement these fragments of Winnicott’s prophetic essay with Octavia Butler on <a href=\"https://www.themarginalian.org/2020/08/23/octavia-butler-parable-leaders/\">how (not) to choose our leaders</a>, Hannah Arendt on <a href=\"https://www.themarginalian.org/2016/12/20/hannah-arendt-origins-of-totalitarianism-loneliness-isolation/\">how dictators prey on loneliness</a>, and Winnicott’s contemporary Erich Fromm on <a href=\"https://www.themarginalian.org/2017/03/23/the-sane-society-erich-fromm/\">self-love as the root of a sane society</a>, then revisit Winnicott on <a href=\"https://www.themarginalian.org/2024/08/19/winnicott-care-cure/\">the qualities of a healthy mind</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"e98148bea1116595b35ce1109da49dec8661a4514974a1a9abee915e67798d74","category":"Sites"}