{"title":"Thunder, Bells, and Silence: The Eclipse that Went Extinct","link":"https://www.themarginalian.org/2024/05/28/passenger-pigeon/","date":1716945902000,"content":"<p><a href=\"https://www.amazon.com/Feathered-River-Across-Sky-Extinction/dp/1620405342/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"486\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?fit=320%2C486&amp;ssl=1\" alt=\"Thunder, Bells, and Silence: The Eclipse that Went Extinct\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?w=987&amp;ssl=1 987w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?resize=320%2C486&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?resize=600%2C912&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?resize=240%2C365&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/featheredriver_passenger.jpg?resize=768%2C1167&amp;ssl=1 768w\" /></a></p><p>What was it like for Martha, the <a href=\"https://www.themarginalian.org/2024/02/16/endling/\">endling</a> of her species, to die alone at the Cincinnati Zoo that late-summer day in 1914, all the other passenger pigeons gone from the face of the Earth, having once filled its skies with an immensity of beating wings, so many that John James Audubon likened their migration to an eclipse? And what made the difference between the people who killed them with glee — like the man in Austin who bragged about slaying 475 birds with a single stick — and those who reverenced their beauty, their majesty, their symphonic expression of life itself? A mere generation before Martha was born in captivity, <a href=\"https://www.themarginalian.org/2021/12/26/margaret-fuller-the-all/\">Margaret Fuller</a> had exulted:</p>\n<blockquote><p>Every afternoon [the pigeons] came sweeping across the lawn, positively in clouds, and with a swiftness and softness of winged motion, more beautiful than anything of the kind I ever knew. Had I been a musician, such as Mendelssohn, I felt that I could have improvised a music quite peculiar, from the sound they made, which should have indicated all the beauty over which their wings bore them.</p></blockquote>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=680%2C1095&amp;ssl=1\" width=\"680\" height=\"1095\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=320%2C515&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=600%2C967&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=240%2C387&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=768%2C1237&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/PassengerPigeon_Audubon_1842.jpg?resize=954%2C1536&amp;ssl=1 954w\" /><figcaption>Male and female passenger pigeons by John James Audubon, 1842. (Available as <a href=\"https://society6.com/product/passenger-pigeon-by-john-james-audubon-1842-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/passenger-pigeon-by-john-james-audubon-1842-benefitting-the-nature-conservancy_cards?curator=brainpicker\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>They were emissaries of the sublime, migrating by the millions, appearing like an immense blue wave rolling toward you, sounding like thunder — an experience we shall never know first-hand. One of the most vivid and poetic accounts of it, found in Joel Greenberg’s altogether fascinating and bittersweet book <a href=\"https://www.amazon.com/Feathered-River-Across-Sky-Extinction/dp/1620405342/?tag=braipick-20\" target=\"_blank\"><strong><em>A Feathered River Across the Sky: The Passenger Pigeon’s Flight to Extinction</em></strong></a> (<a href=\"https://search.worldcat.org/title/849210339\" target=\"_blank\"><em>public library</em></a>), comes from the Potawatomi Chief Pokagon, who wrote with such touching tenderness in May 1850, as all over America the birds were being killed for food and for pleasure:</p>\n<blockquote><p>One morning on leaving my wigwam I was startled by hearing a gurgling, rumbling sound, as though an army of horses laden with sleigh bells was advancing through the deep forests towards me. As I listened more intently I concluded that instead of the tramping of horses it was distant thunder; and yet the morning was clear, calm and beautiful. Nearer and nearer came the strange comingling sounds of sleigh bells, mixed with the rumbling of an approaching storm. While I gazed in wonder and astonishment, I beheld moving towards me in an unbroken front millions of pigeons, the first I had seen that season. They passed like a cloud through the branches of the big trees, through the underbrush and over the ground… Statue-like I stood, half-concealed by cedar boughs. They fluttered all about me, lighting on my head and shoulders; gently I caught two in my hands and carefully concealed them under my blanket. I now began to realize they were mating, preparatory to nesting. It was an event which I had long hoped to witness; so I sat down and carefully watched their movements, amid the greatest tumult. I tried to understand their strange language, and why they all chatted in concert… The trees were still filled with them sitting in pairs in convenient crotches of the limbs, now and then gently fluttering their half-spread wings and uttering to their mates those strange, bell-like wooing notes which I had mistaken for the ringing of bells in the distance.</p></blockquote>\n<p>Within two generations, the bells had fallen silent. </p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?resize=680%2C347&amp;ssl=1\" width=\"680\" height=\"347\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?w=1206&amp;ssl=1 1206w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?resize=320%2C163&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?resize=600%2C306&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?resize=240%2C122&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_song.jpg?resize=768%2C392&amp;ssl=1 768w\" /><figcaption>Vocalization of male passenger pigeon recorded by Wallace Craig, 1911. (Library of Congress)</figcaption></figure>\n<p>Because the world is a kaleidoscope of qualia, because each creature has a singular sensorium not shared and never fully comprehended by creatures shaped by a different biology, with the loss of any species a particular way of seeing and a particular way of being is lost, a verse redacted from the poetry of the universe. </p>\n<p>The fate of the passenger pigeon stands as a haunting monument to the deadliest defect of human nature — the hubris of seeing ourselves not as fractals of nature but as its overlords, the same hubris that gave us the atomic bomb. It is more than a cautionary tale to be heard in the mind — it is a mirror, harsh and clear, held up to the soul of humanity, a stark and sobering incantation to recover our reverence for life in all its myriad manifestations. </p>\n<figure><a href=\"https://society6.com/product/passenger-pigeon-by-mark-catesby-1731-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?resize=680%2C521&amp;ssl=1\" width=\"680\" height=\"521\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?resize=320%2C245&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?resize=600%2C460&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?resize=240%2C184&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passengerpigeon_1754.jpg?resize=768%2C588&amp;ssl=1 768w\" /></a><figcaption>Passenger pigeon by Mark Catesby, 1731. (Available as <a href=\"https://society6.com/product/passenger-pigeon-by-mark-catesby-1731-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/passenger-pigeon-by-mark-catesby-1731-benefitting-the-nature-conservancy_cards?curator=brainpicker\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>The erasure of the passenger pigeon by the human hand comes alive with disquieting poignancy in this 1935 poem by <a href=\"https://www.themarginalian.org/tag/robinson-jeffers/\">Robinson Jeffers</a>, part indictment and part invitation to revise our regard for the rest of nature:</p>\n<blockquote><p><strong>PASSENGER PIGEONS</strong><br />\n<em>by Robinson Jeffers</em></p>\n<p>Slowly the passenger pigeons increased, then suddenly their numbers<br />\nBecame enormous, they would flatten ten miles of forest<br />\nWhen they flew down to roost, and the cloud of their rising<br />\nEclipsed the dawns. They became too many, they are all dead<br />\nNot one remains.<br />\n                          And the American bison: their hordes<br />\nWould hide a prairie from horizon to horizon, great heads and storm-cloud shoulders, a torrent of life —<br />\nHow many are left? For a time, for a few years, their bones<br />\nTurned the dark prairies white.<br />\n                          You, Death, you watch for these things.<br />\nThese explosions of life: they are your food.<br />\nThey make your feasts.<br />\n                          But turn your great rolling eyes<br />\n          away from humanity<br />\nThose grossly craving black eyes. It is true we increase.<br />\nA man from Britain landing in Gaul when Rome<br />\n          had fallen<br />\nHe journeyed fourteen days inland through that beautiful<br />\nRich land, the orchards and rivers and the looted villas: he reports he saw<br />\nNo living man. But now we fill the gaps.<br />\nIn spite of wars, famines and pestilences we are quite suddenly<br />\nThree billion people: our bones, ours too, would make<br />\nWide prairies white, a beautiful snow of unburied bones:<br />\nBones that have twitched and quivered in the nights of love,<br />\nBones that have shaken with laughter and hung slack<br />\n          in sorrow, coward bones<br />\nWorn out with trembling, strong bones broken on the rack,<br />\n     bones broken in battle,<br />\nBroad bones gnarled with hard labor, and the little bones<br />\n          of sweet young children, and the white empty skulls,<br />\nLittle carved ivory wine-jugs that used to contain<br />\nPassion and thought and love and insane delirium, where now<br />\nNot even worms live.<br />\n                          Respect humanity, Death, these<br />\n          shameless black eyes of yours,<br />\nIt is not necessary to take all at once — besides that,<br />\n          you cannot do it, we are too powerful,<br />\nWe are men, not pigeons; you may take the old, the useless<br />\n          and helpless, the cancer-bitten and the tender young,<br />\nBut the human race has still history to make. For look — look now<br />\nAt our achievements: we have bridled the cloud-leaper lightning,<br />\n           a lion whipped by a man, to carry our messages<br />\nAnd work our will, we have snatched the thunderbolt<br />\nOut of God’s hands. Ha? That was little and last year —<br />\n           for now we have taken<br />\nThe primal powers, creation and annihilation; we make<br />\n      new elements, such as God never saw,<br />\nWe can explode atoms and annul the fragments, nothing left<br />\n           but pure energy, we shall use it<br />\nIn peace and war — “Very clever,” he answered in his thin piping voice,<br />\nCruel and a eunuch.<br />\n                          Roll those idiot black eyes of yours<br />\nOn the field-beats, not on intelligent man,<br />\nWe are not in your order. You watched the dinosaurs<br />\nGrow into horror: they had been little elves in the ditches<br />\n   and presently became enormous with leaping flanks<br />\nAnd tearing teeth, plated with armor, nothing could<br />\n      stand against them, nothing but you,<br />\nDeath, and they died. You watched the sabre-tooth tigers<br />\nDevelop those huge fangs, unnecessary as our sciences,<br />\n      and presently they died. You have their bones<br />\nIn the oil-pits and layer rock, you will not have ours.<br />\n      With pain and wonder and labor we have bought intelligence.<br />\nWe have minds like the tusks of those forgotten tigers,<br />\n   hypertrophied and terrible,<br />\nWe have counted the stars and half-understood them,<br />\n      we have watched the farther galaxies fleeing away<br />\n      from us, wild herds<br />\nOf panic horses — or a trick of distance deceived by the prism —<br />\n  &amp;nbsp   ;we outfly falcons and eagles and meteors,<br />\nFaster than sound, higher than the nourishing air;<br />\n      we have enormous privilege, we do not fear you,<br />\nWe have invented the jet-plane and the death-bomb<br />\n      and the cross of Christ — “Oh,” he said, “surely<br />\nYou’ll live forever” — grinning like a skull, covering his mouth<br />\n      with his hand — “What could exterminate you?”</p></blockquote>\n<p>A decade later, the poetic conservationist Aldo Leopold memorialized the vanished bird in a moving speech delivered at the opening of a monument to the passenger pigeon erected at Wyalusing State Park by the Wisconsin Society for Ornithology. Lamenting that “for one species to mourn the death of another is a new thing under the sun,” he writes:</p>\n<blockquote><p>There will always be pigeons in books and in museums, but these are effigies and images, dead to all hardships and to all delights. Book-pigeons cannot dive out of a cloud to make the deer run for cover, nor clap their wings in thunderous applause of mast-laden woods. They know no urge of seasons; they feel no kiss of sun, no lash of wind and weather; they live forever by not living at all.</p>\n<p>[…]</p>\n<p>Man<a href=\"https://www.themarginalian.org/2014/10/17/ursula-k-le-guin-gender/\">*</a> is only a fellow-voyager with other creatures in the Odyssey of evolution… We should, in the century since Darwin, have achieved a sense of community with living things, and of wonder over the magnitude and duration of the biotic enterprise.</p></blockquote>\n<p>Reflecting on this “monument to a bird we have lost, and to a doubt we have gained,” he adds:</p>\n<blockquote><p>Our grandfathers, who did the actual killing, were our agents. They were our agents in the sense that they shared the conviction, which we have only now begun to doubt, that it is more important to multiply people and comforts than to cherish the beauty of the land in which they live. What we are doing here today is publicly to confess a doubt whether this is true.</p>\n<p>[…]</p>\n<p>Our grandfathers, who saw the glory of the fluttering hosts, were less well-housed, well-fed, well-clothed than we are. The strivings by which they bettered our lot are also those which deprived us of pigeons. Perhaps we now grieve because we are not sure, in our hearts, that we have gained by the exchange.</p></blockquote>\n<figure><a href=\"https://society6.com/product/the-later-flights-of-the-passenger-pigeon-by-frank-bond-1920-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?resize=680%2C394&amp;ssl=1\" width=\"680\" height=\"394\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?resize=320%2C185&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?resize=600%2C348&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?resize=240%2C139&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/passenger_1920.jpg?resize=768%2C445&amp;ssl=1 768w\" /></a><figcaption><em>The Later Flights of the Passenger Pigeon</em> by Frank Bond, 1920. (Available as <a href=\"https://society6.com/product/the-later-flights-of-the-passenger-pigeon-by-frank-bond-1920-benefitting-the-nature-conservancy_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/the-later-flights-of-the-passenger-pigeon-by-frank-bond-1920-benefitting-the-nature-conservancy_cards?curator=brainpicker\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>Couple with <a href=\"https://www.themarginalian.org/2024/02/16/endling/\">a poem inspired by the last <em>Moho braccatus</em></a>, which went extinct in our lifetime, then revisit Robinson Jeffers’s <a href=\"https://www.themarginalian.org/2022/06/14/the-beginning-and-the-end-robinson-jeffers/\">staggering poem about the interwoven mystery of mind and universe</a>. For a bright counterpoint of what human nature is also capable of, savor the story of <a href=\"https://www.themarginalian.org/2021/04/29/rosalie-edge/\">the woman who saved the hawks</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"e9af9fb5144fb4165d7b32200fee8f625d87c212693d4255de110ba7a565626e","category":"default"}