{"title":"Why Carnegie’s Rules Are Evergreen","link":"https://om.co/2024/11/05/why-carnegies-rules-are-evergreen/","date":1730823468000,"content":"<figure><img width=\"1024\" height=\"585\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-1024x585.webp\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-1024x585.webp 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-300x171.webp 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-768x439.webp 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-1536x878.webp 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-192x110.webp 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-1100x629.webp 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules-560x320.webp 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2024/11/CarnegiesRules.webp 1792w\" /></figure>\n\n\n\n<p>A few weeks ago, I went on a road trip to Montana with Rod Clark, a photographer friend. On the way back, we stopped in Wells, NV, to get food at Sher-E-Panjab Dhaba, a converted truck stop diner that serves good old-fashioned Punjabi food. When paying for our lunch, I got into a conversation with the guy behind the counter. </p>\n\n\n\n<p>I asked him where he was from, how long he had been in the country, if he had a family, and how he was settling in the US. You know, the usual conversation when you come across someone from your part of the world. Sure, it was a chance for me to practice my Punjabi speaking skills—they are hella rusty — but mostly, I just wanted to connect with himbecause he looked a little wistful. </p>\n\n\n\n<p>Watching our interaction, Rod (who doesn’t speak or understand Punjabi, but loves the food) remarked how much of that interaction reminded him of Dale Carnegie’s <strong>How to Win Friends &amp; Influence People</strong>. I have not read the book, and neither do I intend to. So, my friend, being the nice guy that he is, summed it up for me. Essentially, the book can be summed up into five simple steps.</p>\n\n\n\n<ol>\n<li>Pay someone a genuine compliment. It has to be sincere. It can’t be a fake compliment. </li>\n\n\n\n<li>Ask them a question about their favorite subject, which is typically something about themselves. And then just listen, listen, listen, and listen until they’re done talking. </li>\n\n\n\n<li>Try and quickly assess their needs.</li>\n\n\n\n<li>If you were trying to sell something or get something from someone, consider a trial close. Give the person a chance to either lean in or opt out. </li>\n\n\n\n<li>Close. The only difference between four and five is the word if in form. </li>\n</ol>\n\n\n\n<p>I couldn’t stop thinking about these five steps long after our road trip was over. I wondered if they were relevant in an age when we are always peering into our phones, oblivious of the world around us. We are now simply two tribes going to war. All the time, about everything. </p>\n\n\n\n<p>Instead of thinking about others, I tried to think about these in context of how I am currently living my life. And my conclusion is that with a little thoughtfulness, Carnegie’s rules can still help us through our increasingly anti-social times. <br /><br />It is really hard to say something genuinely nice or give a compliment. If I see someone wearing great pair of shoes, I don’t hesitate to let them know. Or if someone has a great outfit, I let them know. I mean, if someone put so much effort to look good, why not just affirm that? </p>\n\n\n\n<p>I love hearing people’s stories. I want to know who they are, where they are from, and why they do what they do. I mean, there is a reason that before I was a technology writer and an investor, I was a reporter. I genuinely believe the greatest wealth is banking people and relationships. <a target=\"_blank\" href=\"https://om.co/gigaom/do-what-you-love-and-rest-will-follow/\">As I have written in the past</a>:</p>\n\n\n\n<blockquote>\n<p>My grandfather, long departed, used to say, Son don’t bank money, bank people. If you do that, you are going to be much better off. He was so right. When leaving my job at Business 2.0 I was so scared of leaving the security of a paycheck. But then in the back of my mind were his words. The support of those people I banked has made loving what I love to do even more fun.</p>\n</blockquote>\n\n\n\n<p>The point number three is very important — it takes some effort (and a lot of listening) to assess someone’s needs. If they have to spell it out for you, then it feels like an ask, and no one wants to ask for anything. If you think of steps four and five not in terms of “selling or getting something,” you could give someone a chance to accept what you have assessed about their needs, but do so in a way that is more of a lean in. </p>\n\n\n\n<p>These days, I am not interested in selling or getting something. Maybe a smile, a good memory, and if I am lucky, a lasting friendship. Why? Because in this day and age of disconnect, I firmly believe little acts of humanity are importantand remind us that in the end, we are just here on the planet for such a short while. Why not make the most of it, without rancor, and hopefully make someone’s day just a little better? </p>\n\n\n\n<p>I suppose, 88 years later, Carnegie’s rules still work.</p>\n\n\n\n<p><em><strong>November 5, 2024. San Francisco</strong></em></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"e9e62ef57dd30dcce4a5405d57feaa89ff7fbb01ae8ff20c1e507cbcf5646bf4","category":"Sites"}