{"title":"Thich Nhat Hanh on True Love and the Five Rivers of Self-Knowledge","link":"https://www.themarginalian.org/2024/02/03/thich-nhat-hanh-love-rivers/","date":1706973832000,"content":"<p><a href=\"https://www.amazon.com/True-Love-Practice-Awakening-Heart/dp/1590309391/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/truelove_tnh.jpg?fit=320%2C480&amp;ssl=1\" alt=\"Thich Nhat Hanh on True Love and the Five Rivers of Self-Knowledge\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/truelove_tnh.jpg?w=667&amp;ssl=1 667w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/truelove_tnh.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/truelove_tnh.jpg?resize=600%2C900&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/02/truelove_tnh.jpg?resize=240%2C360&amp;ssl=1 240w\" /></a></p><p>“For one human being to love another: that is perhaps the most difficult of all our tasks… the work for which all other work is but preparation,” Rilke <a href=\"https://www.themarginalian.org/2015/01/29/rilke-on-love/\">wrote to his young correspondent</a>. </p>\n<p>The great difficulty of loving arises from the great difficulty of bridging the abyss between one consciousness and another in order to understand each other, to map the inner landscape of another’s territory of trust and vulnerability, to teach each other what we need of love. </p>\n<p>“Understanding and loving are inseparable,” the humanistic philosopher and psychologist Erich Fromm wrote in his wonderful field guide to <a href=\"https://www.themarginalian.org/2017/04/05/erich-fromm-the-art-of-listening/\">the six rules of listening</a>. Indeed, there is but one preparation for the task of loving: <a href=\"https://www.themarginalian.org/2021/10/10/thich-nhat-hanh-listening-love/\">deep listening</a> — the best tool we have for coaching each other in the agility and endurance necessary for sustaining a true and lasting love, the work of both passionate interest in the inner world of the other and profound self-knowledge. </p>\n<p>That is what the great Zen teacher and peace activist <strong>Thich Nhat Hanh</strong> (October 11, 1926–January 22, 2022) explores in his slender, simply worded, penetrating classic <a href=\"https://www.amazon.com/True-Love-Practice-Awakening-Heart/dp/1590309391/?tag=braipick-20\" target=\"_blank\"><strong><em>True Love: A Practice for Awakening the Heart</em></strong></a> (<a href=\"https://search.worldcat.org/title/227201546\" target=\"_blank\"><em>public library</em></a>).</p>\n<figure><a href=\"https://www.amazon.com/True-Love-Practice-Awakening-Heart/dp/1590309391/?tag=braipick-20\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2015/03/tnh1.jpg?w=680&amp;ssl=1\" /></a><figcaption>Thich Nhat Hanh</figcaption></figure>\n<p>He considers the first of the four Buddhist elements of true love — <em>maitri</em>, most closely translated as <em>loving-kindness</em>:</p>\n<blockquote><p>Loving-kindness is not only the desire to make someone happy, to bring joy to a beloved person; it is the <em>ability</em> to bring joy and happiness to the person you love, because even if your intention is to love this person, your love might make him or her suffer. </p>\n<p>Training is needed in order to love properly; and to be able to give happiness and joy, you must practice <em>deep looking</em> directed toward the person you love. Because if you do not understand this person, you cannot love properly. Understanding is the essence of love. If you cannot understand, you cannot love. That is the message of the Buddha.</p></blockquote>\n<p>And yet while mutual understanding is the wellspring of love, the turbid confusion of understanding ourselves often stands in its way. “It is a fault to wish to be understood before we have made ourselves clear to ourselves,” Simone Weil admonished in her <a href=\"https://www.themarginalian.org/2015/08/24/simone-weil-friendship-separation\">superb meditation on the paradoxes of friendship</a>. “If you don’t understand yourself you don’t understand anybody else,” the young Nikki Giovanni told James Baldwin in their <a href=\"https://www.themarginalian.org/2016/04/04/james-baldwin-nikki-giovannis-dialogue/\">forgotten conversation</a> about the language of love. Nothing does more damage in love than a paucity of self-knowledge. (<a href=\"https://www.themarginalian.org/2015/03/31/how-to-love-thich-nhat-hanh/\">“To love without knowing how to love wounds the person we love,”</a> Thich Hhat Hanh would later caution.) Without self-knowledge, so much of what we mistake for desire, for devotion, for understanding is mere projection, a chimera of our patterned past keeping us from true presence with the reality of the other. </p>\n<p>In Buddhist practice, nothing removes the screen of confusion and anneals the mind more effectively than meditation — the supreme instrument of self-understanding, out of which springs the unselfing necessary for true love. Thich Hhat Hanh writes:</p>\n<blockquote><p>Meditation is the practice of looking deeply into the nature of your suffering and your joy. Through the energy of mindfulness, through concentration, looking deeply into the nature of our suffering makes it possible for us to see the deep causes of that suffering. If you can keep mindfulness and concentration alive, then looking deeply will reveal to you the true nature of your pain. And freedom will arise as a result of your sustaining a deep vision into the nature of your pain. Solidity, freedom, calm, and joy are the fruits of meditation.</p></blockquote>\n<p>Twenty-five centuries before the Western canon of self-help cheapened and commodified the notion, the Buddha taught that “your love for the other, your ability to love another person, depends on your ability to love yourself” — which in turn depends on your degree of self-understanding. Thich Nhat Hanh points to the five <em>skandhas</em>, or aggregates, that constitute selfhood in Buddhist philosophy, depicted as five rivers: the body (“which we do not know well enough,” he rues); sensations (“Each sensation is a drop of water in the river,” he writes, and meditation is the practice of sitting on the banks of the river, observing the passing sensations); perceptions (“You must look deeply into their nature in order to understand.”); mental formations, of which Buddhism identifies fifty-two — feeling-states and faculties like happiness, hate, worry, distraction, appreciation, and faith; and consciousness, the last and deepest of the five rivers. (“Time is a river which sweeps me along, but I am the river,” Borges wrote in <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">his timeless reckoning with time and the nature of consciousness</a>, which inspired the title of one of Oliver Sacks’s finest essays, later the title of the posthumous collection of his writings: <a href=\"https://www.themarginalian.org/2017/11/09/oliver-sacks-the-river-of-consciousness-the-creative-self/\"><em>The River of Consciousness</em></a>.)</p>\n<figure><a href=\"https://www.themarginalian.org/2021/08/25/what-is-a-river-monika-vaicenaviciene/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/08/whatisariver6.jpg?w=1200&amp;ssl=1\" /></a><figcaption>Art by Monika Vaicenavičienė from <a href=\"https://www.themarginalian.org/2021/08/25/what-is-a-river-monika-vaicenaviciene/\"><em>What Is a River</em></a>.</figcaption></figure>\n<p>Without full and conscious immersion in the riverine mystery inside us, there can be no true love — that great miracle of transformation that alters the superstructure of the self and tilts the very axis of reality, inclining it wonderward. Thich Nhat Hanh puts it simply, poignantly:</p>\n<blockquote><p>It is necessary to come back to yourself in order to be able to achieve the transformation.</p></blockquote>\n<p>Complement with David Whyte’s stunning poem <a href=\"https://www.themarginalian.org/2021/07/26/david-whyte-the-truelove/\">“The Truelove”</a> and philosopher Martha Nussbaum on <a href=\"https://www.themarginalian.org/2017/01/16/martha-nussbaum-loves-knowledge/\">how you know whether you truly love a person</a>, then revisit Thich Nhat Hanh on <a href=\"https://www.themarginalian.org/2021/10/10/thich-nhat-hanh-listening-love/\">the art of deep listening</a> and <a href=\"https://www.themarginalian.org/2020/12/01/thich-nhat-hanh-fear-love/\">the four Buddhist mantras for transforming fear into love</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"ea477c00dc4749c0092852df953d7a4693976b6b2d22815f9fabf510a5caf9e5","category":"default"}