{"title":"Here’s how to live: Get rich.","link":"https://sive.rs/htl20","date":1639958400000,"content":"<p>\nSuspend judgment.\n<br />\nMaking money isn’t evil, greedy, shallow, or vain.\n<br />\nMoney isn’t your worth as a human being, or a substitute for love.\n<br />\nBut don’t pretend it doesn’t matter.\n</p><p>\nMoney can represent freedom, safety, experience, generosity, attractiveness, power, or whatever you want.\n<br />\nBut really, money is as neutral as math.\n<br />\nBecause it’s neutral, people have projected all kinds of meaning onto it.\n<br />\nYour biggest obstacle to getting rich is the harmful meaning you’ve attached to it.\n<br />\nYour biggest advantage can be projecting a helpful meaning onto it.\n<br />\nMake it mean you’re on the right path.\n<br />\nMake it a game.\n<br />\nMake it mean you’re free.\n</p><p>\nOr consider this:\n<br />\nMoney is nothing more than a neutral exchange of value.\n<br />\nMaking money is proof you’re adding value to people’s lives.\n<br />\nAiming to get rich is aiming to be useful to the world.\n<br />\nIt’s striving to do more for others.\n<br />\nServing more.\n<br />\nSharing more.\n<br />\nContributing more.\n<br />\nThe world rewards you for creating value.\n<br />\nPursue wealth because it’s moral, good, and unlimited.\n</p>\n<hr />\n<p>\nMoney is social.\n<br />\nIt was invented to transfer value between people.\n<br />\nOne job pays way more than another because it has more social value.\n<br />\nTo get rich, don’t think about what’s valuable to you.\n<br />\nThink about what’s valuable to others.\n<br />\nTo do the opposite is the cliché of the starving artist: creating something that’s valuable to you, but not to others.\n</p><p>\nMoney doesn’t care about your race, gender, education, physique, family, or nationality.\n<br />\nAnyone can be rich.\n<br />\nSomeone always will, so it might as well be you.\n<br />\nMaking money is a skill like any other.\n<br />\nLearn it and practice it as you would anything else.\n</p><p>\nMoney is a great motivator.\n<br />\nIt works better than force, rules, punishment, or appealing to generosity.\n<br />\nGreat art has been created in pursuit of profit.\n</p><p>\nNumbers reveal truth and opportunity.\n<br />\nWith every business idea you have or hear, do the math to run the projections and implications.\n<br />\nStudy profitable companies the way an artist studies great art.\n<br />\nApply their best techniques to your own pursuit.\n<br />\nDoing the math helps you think critically, be realistic, and make better decisions.\n</p><p>\nThe world is full of money.\n<br />\nThere’s no shortage.\n<br />\nSo capture the value you create.\n<br />\nCharge for what you do.\n<br />\nIt’s unsustainable to create value without asking anything in return.\n<br />\nRemember that many people like to pay.\n</p><p>\nThe more something costs, the more people value it.\n<br />\nBy charging more, you’re actually helping them use it and appreciate it.\n<br />\nCharge more than is comfortable to your current self-image.\n<br />\nValue yourself higher, then rise to fit this valuation.\n</p><p>\nBe fully committed to getting rich, or it won’t happen.\n<br />\nAdjust your self-image so that you congruently feel that you should and will be rich.\n<br />\nIf you subconsciously don’t feel you deserve it, you’ll sabotage your pursuit.\n<br />\nBut if you truly feel you deserve it, you’ll do whatever it takes.\n<br />\nSo adjust your self-image first.\n</p><p>\nDon’t aim to just be comfortable.\n<br />\nYou don’t make the world a better place by just getting by.\n<br />\nIf you aim to be comfortable, you won’t get rich.\n<br />\nBut if you aim to be rich, you’ll also be comfortable.\n<br />\nAiming to be rich makes you think bigger, which is more exciting, more fun, and less conventional since most people don’t think big.\n</p><p>\nThe world needs more boldness.\n<br />\nRefuse the comfortable addiction of a steady paycheck.\n<br />\nBoldly jump on opportunities.\n<br />\nTake risky action.\n</p><p>\nCreate your own business.\n<br />\nCome up with a brand name that can be attached to any business.\n<br />\n(Perhaps it’s your name.)\n<br />\nUse it for the rest of your life on everything of quality.\n<br />\nA recognized brand can charge a premium price, earning more than unrecognized names.\n<br />\nInstead of thinking of customers as leading to a sale, think of each sale as leading to a life-long relationship with a customer.\n</p><p>\nUse other people’s ideas.\n<br />\nIdeas are worth almost nothing.\n<br />\nExecution is everything.\n<br />\nThe world is filled with ideas, yet so few take action and make them happen.\n<br />\nBetter to be filled with action than ideas.\n<br />\nBest of all to be the owner.\n<br />\nOwn and control 100% of whatever you create.\n</p><p>\nBoring industries have little competition, since most people are seeking status in glamorous new fields.\n<br />\nFind an old industry and solve an old problem in a new way.\n<br />\nYour innovation might be behind the scenes, like owning the entire supply chain.\n</p><p>\nAvoid difficult business problems.\n<br />\nYour time is more profitably spent doing what comes easily to you.\n</p><p>\nAvoid competition.\n<br />\nNever be another contender in the crowd, fighting for scraps.\n<br />\nIt doesn’t pay to do something anyone can do.\n<br />\nBe separate — in a category of your own.\n<br />\nInvent something completely new.\n<br />\nInstead of fighting to split an existing dollar, inventing creates a dollar out of thin air.\n<br />\nInvent for a very small niche of people who need something that doesn’t exist.\n<br />\nInstead of making a key, then looking for a lock, find something locked, then make its key.\n</p><p>\nFollow the rising tides of where profits are going.\n<br />\nGet in early on an industry that’s developing quickly.\n<br />\nMore risk, more opportunity, more investors, more rewards.\n</p><p>\nOnce your business is successful, stay paranoid.\n<br />\nTechnology is improving faster, so a successful business model doesn’t last as long as it used to.\n<br />\nYou’ll be disrupted by others if you don’t keep improving or disrupting yourself.\n</p><p>\nSell your business before you have to.\n<br />\nSell before it peaks.\n<br />\nThe fun is in creating a business, not maintaining it.\n</p>\n<hr />\n<p>\nAs soon as you have extra money, invest it.\n</p><p>\nInvesting is counter-intuitive.\n<br />\nYou need to ignore your gut and heart.\n<br />\nFollow dispassionate reason.\n<br />\nBe disciplined, not clever.\n<br />\nIt’s a matter of math, not mood.\n<br />\nEmotions are the enemy of investing.\n</p><p>\nInvesting is easy unless you try to beat the market.\n<br />\nSettle for average.\n<br />\nBe happy with a good-enough return from passive index funds that represent the entire world economy.\n<br />\nJust take a few minutes per year to rebalance.\n<br />\nDon’t over-think it.\n<br />\nIt’s better to do nothing than something.\n<br />\nKeep it simple and manage it yourself.\n<br />\nAvoid exciting investments.\n</p><p>\nSpeculating is not investing.\n<br />\nNever speculate.\n<br />\nNever predict.\n<br />\nBe humble, not arrogant.\n<br />\nNever think for one second that you know the future.\n<br />\nRemind yourself over and over again that nobody knows the future.\n<br />\nIgnore anyone that says they do.\n</p>\n<hr />\n<p>\nMoney is your servant, not your master.\n<br />\nDon’t act rich.\n<br />\nDon’t lose touch with regular people.\n<br />\nStay frugal.\n<br />\nReducing your expenses is so much easier than increasing your income.\n</p><p>\nYou don’t need to tell anyone you have money.\n<br />\nYou don’t even need to spend it.\n<br />\nDon’t buy too many things, too big of a house, or hire too many people.\n<br />\nRich people who do this feel trapped and miserable.\n<br />\nThe less you buy, the more you’re in control.\n<br />\nForget lifestyle.\n<br />\nForget yourself.\n<br />\nStay 100% focused on creating value.\n<br />\nEverything else is a corrupting distraction.\n</p><p>\nNothing destroys money faster than seeking status.\n<br />\nDon’t show off.\n<br />\nDon’t invest in a business you don’t control.\n<br />\nDon’t loan money to a friend, or you’ll lose your money and your friend.\n<br />\nYou’d be better off just giving them the money.\n<br />\nThe return is the same ($0), but you’d skip the bad feelings.\n</p><p>\nDon’t convince yourself your home is an asset.\n<br />\nYour home is an expense, not an investment, because it doesn’t put money in your pocket each month.\n</p><p>\nWhen you’re rich, everything feels free.\n<br />\nA $5000 expense feels like it costs a dollar.\n<br />\nIt doesn’t dent your bank account.\n<br />\nMoney will be like tap water.\n<br />\nIt’s always there.\n<br />\nYou don’t need to think about it.\n</p><p>\nOne downside is you don’t get excited about money anymore.\n<br />\nIt used to feel so exciting to make $5000.\n<br />\nNow you don’t even notice it.\n<br />\nSomeone could give you another million dollars, and it wouldn’t change a thing.\n<br />\nYou don’t need it, since there’s nothing you want to buy.\n<br />\nThe extra millions won’t make you extra happy.\n<br />\nYou’ll work harder to keep your money than you will to make more.\n<br />\nAs with sex, the fascination fades when you have plenty.\n</p><p>\nSay no to more stuff.\n<br />\nSay yes to more choices.\n</p><p>\nThen you’ll get philosophical, since you’ll have all the options in the world.\n<br />\nYou’ll find your riches are worthless, and maybe even an obstacle, when it comes to friendship and love.\n<br />\nMoney makes problems go away, but amplifies personality traits.\n<br />\nMoney won’t change you, but it will amplify who you are.\n</p><p>\nYou only need to get rich once.\n<br />\nWhen you win a game, you stop playing.\n<br />\nDon’t be the dragon in the mountain, just sitting on your gold.\n<br />\nDon’t lose momentum in life.\n<br />\nOnce you’ve done it, take it with you and do something else.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ea7e0f9cf7cf442da14b12a6156c3d4d7feaca4330d2e7ac41721449647e1ae3","category":"Sites"}