{"title":"How I got rich on the other hand","link":"https://sive.rs/richand","date":1572393600000,"content":"<p>\nI don’t usually talk about money, but a friend asked me what it was like to get rich, and he wanted to know specifics, so I told him my story.\n</p><p>\nI had <a href=\"https://sive.rs/xn\">a day job</a> in midtown Manhattan paying $20K per year — about minimum wage.\nOn weekends I would earn $150 per day performing circus shows for kids, though I’d spend about $50 in bus fare to get to the gigs.\nI was sharing a three-bedroom apartment with two other roommates in Queens, so our rent was $333 per month each.\nI made peanut butter sandwiches for three meals a day, and at night maybe some eggs.\nI never ate out, and never took a taxi.\n<strong>\nMy cost of living was about $1000/month, and I was earning $1800/month.\nI did this for two years, and saved up $12,000.\n</strong>\nI was 22 years old.\n</p><p>\nOnce I had $12,000 I could quit my job and become a full-time musician.\nI knew I could get a few gigs per month to pay my cost of living.\nSo I was free.\n<a href=\"https://sive.rs/nq\">I quit my job</a> a month later, and never had a job again.\n</p><p>\nWhen I finished telling my friend this story, he asked for more.\nI said no, that was it.\nHe said, “No, what about when you sold your company?”\n</p><p>\nI said no, that didn’t make a big difference in my life.\nThat was just more money in the bank.\nThe difference happened when I was 22.\n</p><p>\nIt’s not how much you have.\n<strong>\nIt’s the difference between what you have and what you spend.\n</strong>\nIf you have more than you spend, you’re rich.\nIf you spend more than you have, you’re not.\nIf you live cheaply, it’s easy to be free.\n</p><p>\nMagicians wave one hand around to get your attention, while the other hand does the trick.\nTo be smart, watch the other hand.\n</p>\n<img src=\"/images/magichands.jpg\" alt=\"magic hands\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"eb4d8162b15fa560e2c30587ff8151f7afaf9cb02993742af5d8479e40ec79f1","category":"default"}