{"title":"Blogs for social web apps","link":"http://scripting.com/2024/03/01/145758.html?title=blogsForSocialWebApps","date":1709305078000,"content":"<p>In a new product I'm working on, I'm including links to the blogs of the social media apps I use. I notice that most of them have one. This is why:</p>\n<ol>\n<li>You can put a title on a post on a blog.</li>\n<li>You can include links (invariably announcements have links).</li>\n<li>You can edit posts.</li>\n<li>Simple text styling.</li>\n<li>Blogs have feeds.</li>\n</ol>\n<p>So I'm looking for the official blogs of the social apps I use -- Mastodon, Bluesky, Twitter, Threads. </p>\n<p>If so, what's the feed URL? </p>\n<p>Here's a <a href=\"https://github.com/scripting/Scripting-News/issues/294\">place</a> to comment.</p>\n<p>PS: It seems dumb to have two places for writing. <s>Also I bet Bluesky wrote their own blogging software, which is why there's no feed for their blog, which is awkward because Bluesky itself has feeds. As a programmer, I don't think I could maintain both codebases, and i'm pretty sure the blog is the one that'll get abandoned.</s> Update: they do <a href=\"https://github.com/scripting/Scripting-News/issues/294#issuecomment-1973571777\">have a feed</a> for their blog. At some point there won't be a distinction between blogging and social media-ing. Remember the <a href=\"http://scripting.com/2024/01/14/031201.html\">tiny little text boxes</a> have to go. <span>😄</span></p>\n<p>PPS: Twitter's blog has a <a href=\"https://blog.x.com/en_gb/blog.rss\">really shitty title</a>, it shows up in the list as English (UK). That should be fixed to something like Twitter Blog. I know how this happens, obviously they're maintaining more than one language, so the title is given from their point of view. As a reader, it has to make sense in a list of feeds from different publishers. Here's a <a href=\"https://imgs.scripting.com/2024/03/01/howCouldYouTellThatsTwitter.png\">screen shot</a> to illustrate. </p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"ebc6554345beab4b2a73517fac95fd5da55fa5c1aba5e351f4993c0af9fbe571","category":"default"}