{"title":"Are You a Local?","link":"https://kottke.org/24/08/are-you-a-local","date":1724163730000,"content":"\n        <p>In <a href=\"https://noahkalina.substack.com/p/newsletter-151-are-you-a-local\">a recent edition of his newsletter</a>, Noah Kalina highlights some responses he got to this question: <a href=\"https://www.threads.net/@noahkalina/post/C-aKtiGOyw9\">How many years do you need to live somewhere before you are considered a local?</a> Here’s a sampling of the answers:</p>\n\n<blockquote><p>My hot take as a military kid who has continued to move around is that I think it’s a little weird how people gatekeep being a “local.” If you’ve lived somewhere long enough that you know your way around, have connected yourself with other locals and the local culture, are invested in the community, &amp; see yourself continuing to stay there long term, I think you’re a local. Local to me is about the relationship to a place, not a chunk of time.</p></blockquote>\n\n<blockquote><p>I had a friend move from CA to PA. He told me that people move to CA and build new lives and new families, and generally people are accepting of transplants. Meanwhile, he has a hard time acclimating to PA bc people tend to stick in the area where they grew up - it’s hard to break into an area where everyone’s great grand parents knew everybody’s great grandparents.</p></blockquote>\n\n<p>I liked this distinction:</p>\n\n<blockquote><p>Depends on where your heart is. You can be local by proximity, but not necessarily culturally. Like, knowing the area and how to live there. But some of those folks move and want to change the culture of a place. Or they come in and simply don’t honor the history and memories of the place ..and tbh, if you don’t know and honor that, then you don’t actually know the people and therefore, you don’t really know the place….so you local, but not a local.</p></blockquote>\n\n<p>And I feel this one as someone who currently lives in VT:</p>\n\n<blockquote><p>In New England, the rule is simple. You are considered a local as soon as you have three grandparents who were born in the town where you live.</p></blockquote>\n \nI’ve lived here for 8 years now and I could live here for 8 more and not really feel like a local, nor be accepted by actual locals as one. For the first three years I lived in my small town, I felt like people were always looking at me when I went to the grocery store — like, “who’s this new guy in here on a random Tuesday in stick season?” They could smell the NYC on me. I don’t really mind though — I’m in a bit of a weird situation where I don’t actually want to be a local (or even really live here at all (long story)).\n\n<p>I lived in NYC for 13 years and 100% wanted to be there, to be involved, to feel like I had a tiny hand in making the city what it was. Calling yourself a New Yorker while not having grown up there is a bold move, but I dunno, I feel like I’d gotten there before I decided to leave.</p>\n\n<p>Anyway, <a href=\"https://www.threads.net/@noahkalina/post/C-aKtiGOyw9\">the full thread</a> is worth a read. See also a related question with many interesting replies: <a href=\"https://kottke.org/23/12/where-do-you-call-home\">Where Do You Call Home?</a> </p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Noah%20Kalina\">Noah Kalina</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/08/are-you-a-local\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"ec41aea1ff65b5dc346a80be7862606d288c85a19fabf2414e825efc100d9320","category":"Sites"}