{"title":"Count Zero review","link":"https://blog.webb.page/2017-02-07-count-zero-review.txt","date":1486425600000,"content":"<p>After reading William Gibson's <em>Neuromancer</em> I knew I had to read <em>Count Zero</em>.\nOnce it picked it up, it was difficult to put down.</p>\n<p>There are four different story arcs that eventually culminate in a satisfying\nclimax. What does a wannabe hotshot h̶a̶c̶k̶e̶r̶ cowboy, a disgraced historian,\nan <em>extremely</em> rich and dying man, and a hitman for hire all have in common?\nWell, you're gonna have to read <em>Count Zero</em> to figure out for yourself (I'm\n<em>assuming</em> you don't want spoilers). There is a lot to love about this sci-fi\nnovel and I hope it becomes a movie someday.</p>\n<p>Something that stood out to me was continued references to \"the matrix\".\n<em>Count Zero</em> was printed in 1986 (before I was alive!) and because this book is\n<em>so</em> inventive and fascinating, I wouldn't be surprised if the Wachowski\nsiblings point to it as inspiration for the Matrix film trilogy<a href=\"https://en.wikipedia.org/wiki/The_Matrix_(franchise)\">1</a>. There are\nalso references to \"decks\", which appear to be the interface through which\ncowboys access the matrix Ghost in the Shell<a href=\"https://en.wikipedia.org/wiki/Ghost_in_the_Shell\">2</a> style. I imagine they look like\nthe computer Sam Flynn used in Tron: Legacy<a href=\"https://en.wikipedia.org/wiki/Tron:_Legacy\">3</a> to access the Grid.</p>\n<p>📸<a href=\"https://%F0%9F%94%A5.pixels.wtf/blog/image/2017/count-zero-review-a.jpg\">Sam Flynn in Tron: Legacy</a></p>\n<p>Gibson has an interesting writing style that evokes a sense of longing for the\nfuture, which is bizarre considering the book is older than myself. However, as\nforward-thinking as most concepts are, some of his writing is dated. Not too\nmuch to take you out of his world, but just enough to make one think, \"Wow,\nthis would be incredible when updated for a film\".</p>\n<p>What I <em>didn't like</em> was his way of switching to another character's storyline\nat the beginning of most chapters and taking (what I felt was) far too long to\nlet you know who the new focus was on. This forced me to re-read the beginning\nof several chapters in order to get the characters' inner voices to make sense\nin their respective environments. I don't know about you, but I mentally create\nvoices for characters in novels based on their initial descriptions.</p>\n<p>Like many futuristic books, this one explores corporate espionage, suspect\nscientific morals, the disillusionment of the rich, &amp;c. Just fascinating stuff\nespecially as the world seems to go in this direction IRL.</p>\n<p>Count Zero<a href=\"https://amzn.to/2kBWrzZ\">4</a> is Paul-approved. 🕸</p>\n<hr />\n<hr />\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"ecfc05bd14d4ddab5061511b02534fe6be12e876207a77d5c040bd2ed70d3d6e","category":"Sites"}