{"title":"OpenBSD : why and how","link":"https://sive.rs/openbsd","date":1524182400000,"content":"<p>\nThe only operating system I use on my computers is <a href=\"https://sive.rs/itunes\">not Mac</a>, not Windows, and not even Linux.\nIt’s <a href=\"https://www.openbsd.org/\">OpenBSD</a>, and I love it so much.\nSo I figured I should say a little something about why, and how you can try it.\n</p>\n<h3>\nIt’s probably not for you.\n</h3>\n<p>\nIt’s not for beginners.\nMost people should use <a href=\"https://ubuntu.com/desktop\">Ubuntu</a>.\n</p><p>\nIt’s not for people who want to click a button and have the computer hide the details from you.\n</p><p>\nIf software bloat doesn’t bother you — if every new Mac/Windows/Linux release you say, “Bring on the features! The more the better!” — it’s not for you.\n</p><p>\nBut if you’re experienced, like to “look under the hood”, and prefer software that does the minimum necessary, OpenBSD is for you.\n</p>\n<h3>\nWhat is it?\n</h3>\n<p>\nIt’s like Linux, but has <a href=\"https://www.openbsd.org/goals.html\">different goals</a>.\n</p><p>\nIt’s known for its focus on security.\nBut, like a well-engineered house will also be earthquake-proof, you don’t have to be paranoid about earthquakes to appreciate great construction.\nTo me, the security features are just a side-effect of <a href=\"https://www.openbsd.org/security.html\">great coding</a>.\n</p><p>\nOpenBSD comes with a secure minimal <a href=\"https://www.nostarch.com/pf3\">firewall</a>, <a href=\"https://www.romanzolotarev.com/openbsd/httpd.html\">webserver</a>, <a href=\"https://www.opensmtpd.org/\">mailserver</a>, and an optional graphical <a href=\"http://www.xenocara.org/\">desktop</a>.\nSo if all you want is a few of those things, you do the default install, tweak one config file, and you’re done.\n</p>\n<h3>\nWhy OpenBSD instead of Linux?\n</h3>\n<p>\nIt’s <strong>uncompromising</strong>.\nIt’s not a people-pleaser or vendor-pleaser.\nLinux is in everything from Android phones to massive supercomputers, so has to include features for all of them.\nThe OpenBSD developers say no to most things.\nInstead of trying to make it do more, they keep it focused on doing what it does with more security and reliability.\n</p><p>\nThey <strong>review and remove</strong> code as often as they add.\nIf something is unused, unmaintained, or unnecessary, they’ll axe it.\nIf it’s unwieldy, they’ll make a <strong>small simple replacement</strong>.\nFor examples, see <a href=\"https://man.openbsd.org/doas.1\">doas</a>, <a href=\"https://www.opensmtpd.org/\">OpenSMTPD</a>, <a href=\"https://man.openbsd.org/httpd.8\">httpd</a>, and <a href=\"https://www.libressl.org/\">LibreSSL</a>.\nThis is great for security, too.\nThe more code, the more chance of a bug that could compromise your entire computer.\nThe less code, the better.\nEach new release seems to be getting <strong>leaner</strong> by removing old cruft.\nNo other operating system does that.\n</p><p>\nGreat <strong>documentation</strong> is a top priority.\nThe built-in <a href=\"https://en.wikipedia.org/wiki/Man_page\">man pages</a> are amazing.\nSo if you’re stuck on anything, <a href=\"http://man.openbsd.org/apropos.1\">searching</a> the man pages on your own computer is going to give you a better answer than searching Google.\n(This makes it nicer to work offline, too.)\n</p><p>\nThe <strong>installers</strong> are amazing.\nThe <a href=\"http://www.openbsd.org/faq/faq4.html\">initial installation</a> takes like five minutes.\nHit [Enter] to the defaults, make your username and password, and it’s ready to go.\nThen the <a href=\"http://www.openbsd.org/faq/faq15.html\">software installer</a> is ideal, too.\nJust <a href=\"https://man.openbsd.org/pkg_info.1\">pkg_info</a> to search for something and <a href=\"http://man.openbsd.org/pkg_add.1\">pkg_add</a> to install it in seconds.\n(Which also installs all of its documentation, too.)\n</p><p>\nEverything is rock-solid and <strong>just works</strong>.\nHardware I couldn’t get working in Linux just works on a first try with OpenBSD.\nAnd because they don’t stay cutting-edge, keeping a cautious pace, it keeps working and doesn’t break.\nThe whole system is carefully planned and consistent, instead of a hodge-podge of bits and pieces.\n</p><p>\nIt’s all free and run by helpful volunteers.\nIf you <a href=\"http://cvsweb.openbsd.org/cgi-bin/cvsweb/ports/\">searched ports</a>, but some application you need is missing or out of date, just contact the maintainer and offer some assistance or money to help get it updated or added.\nI’ve donated $3850 to the developers to help improve the OpenBSD port of <a href=\"https://nodejs.org/\">Node.js</a>, <a href=\"http://elixir-lang.org/\">Elixir</a>, <a href=\"http://www.erlang.org/\">Erlang</a>, <a href=\"https://apps.ankiweb.net/\">Anki</a>, <a href=\"http://www.ledger-cli.org/\">Ledger</a>, and <a href=\"http://www.qutebrowser.org/\">Qutebrowser</a>.\n</p><p>\nAlso see <a href=\"https://dataswamp.org/~solene/2022-06-22-openbsd-selling-arguments.html\">Solene’s list of selling points</a>.\nI agree with those.\n</p>\n<img src=\"/images/openbsd.gif\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ed3f41f4d18acbe5a924df12cf6e59eb627c3727f8c580753a1fc3081d4362c7","category":"default"}