{"title":"How “AI” is helping my writing process","link":"https://om.co/2024/05/01/how-ai-has-helped-my-writing-process/","date":1714600609000,"content":"<p>People often talk about how AI will kill us, and take our jobs. </p>\n\n\n\n<p>It may do all that, but for now, I think of it as technology that augments my capabilities, and I see this play out every day in my life as a writer. For instance, yesterday I interviewed Matthew Prince, co-founder of CloudFlare. The conversation ran for about an hour. I had an editable transcript in about three hours, ready for final finessing.</p>\n\n\n\n<p>In the past, when I interviewed someone for about an hour, it would take a day for a transcription service to turn around the interview. It would cost me about $150. Or I would use an early AI-like app called Rev. Then, I would spend three days editing the interview and incorporating it into the story. When I was on tight deadlines, that would mean a sleepless night or two. I hoped that an editor would shape it into publishable copy.</p>\n\n\n\n<p>Nowadays, the process is much faster because I use several AI tools. I can record my interview using a voice app on my iPhone, or use Zoom’s inbuilt feature. I import the audio file into <a href=\"https://om.co/2023/06/19/why-i-love-macwhisper/\">MacWhisper, a great application – the best $10 I spent</a>. ( I can do this with Descript, but I much prefer not paying for yet another AI software subscription, considering I already pay for Poe, Midjourney, and OpenAI.) </p>\n\n\n\n<p>It uses the open-source Whisper protocol to transcribe the entire voice file on my MacBook. I can save the transcript as a PDF and use Anthropic’s Claude Opus to clean it up. I have the right editing prompts to do the clean-up job fast. </p>\n\n\n\n<p>With the right prompts, I can get the interview to a place where I can start editing it manually. The entire process, which would have taken a few days in the past, now takes between two to three hours. To me, that is what this new augmented intelligence is all about helping me get the work done faster and more efficiently.</p>\n\n\n\n<p>I’m not too fond of sleepless nights. I will let others lose sleep over AGI — while I can get to sleep longer, by finishing my writing sooner. </p>\n\n\n\n<p><em>May 1, 2024. San Francisco</em></p>\n\n\n\n<h4>ALSO ABOUT AI &amp; ME</h4>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/09/24/chatgpt-friends-the-cool-kids-boosting-my-productivity/\">ChatGPT &amp; Friends: The Cool Kids boosting my productivity</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/03/19/ai-is-changing-writing-here-is-what-to-do-about-it/\">AI is changing writing</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/06/19/why-i-love-macwhisper/\">Why I love MacWhisper</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2024/03/12/my-most-used-apps-have-ai-inside/\">My most used apps have “AI” inside</a></blockquote>\n</div></figure>\n\n\n\n<figure><div>\n<blockquote><a href=\"https://om.co/2023/03/03/whats-about-ai/\">What about AI?</a></blockquote>\n</div></figure>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"ed71bb93f394c336e9ec0eeb93679ba0127ebbe3db1e1490643a9508c54aa115","category":"default"}