{"title":"Here’s how to live: Master something.","link":"https://sive.rs/htl08","date":1638921600000,"content":"<p>\nBe a monomaniac on a mission to be truly great at something difficult.\n</p><p>\nPick one thing and spend the rest of your life getting deeper into it.\n</p><p>\nMastery is the best goal because the rich can’t buy it, the impatient can’t rush it, the privileged can’t inherit it, and nobody can steal it.\n<br />\nYou can only earn it through hard work.\n<br />\nMastery is the ultimate status.\n</p><p>\nStriving makes you happy.\n<br />\nPursuit is the opposite of depression.\n<br />\nPeople at the end of their life, who said they were the happiest with their life, were the ones who had spent the most time in the flow of fascinating work.\n</p><p>\nConcentrating all of your life’s force on one thing gives you incredible power.\n<br />\nSunlight won’t catch a stick on fire.\n<br />\nBut if you use a magnifying glass to focus the sunlight on one spot, it will.\n<br />\nMastery needs your full focused attention.\n</p><p>\nThe more you learn about something, the more there is to learn.\n<br />\nYou see what normal people don’t see.\n<br />\nThe path gets more and more interesting as you go.\n</p><p>\nThe pursuit of mastery helps you think long-term.\n<br />\nIt keeps your eyes on the horizon.\n<br />\nYou resist the temptation of what you want now.\n<br />\nYou remember the importance of what you want most.\n<br />\nYou spend time intentionally.\n<br />\nEvery month has a milestone.\n<br />\nEvery day has a goal.\n<br />\nThe most rewarding things in life take years.\n<br />\nOnly bad things happen quickly.\n</p><p>\nDecisions are easy when you have only one priority.\n<br />\nYour destination is a huge mountain peak on the horizon.\n<br />\nYou can see it from everywhere.\n<br />\nYes to that mountain, and no to everything else.\n<br />\nYou’ll always know where you’re going, and what you’re doing next.\n<br />\nAll paths go either towards that mountain or away from it.\n</p><p>\nBecause of this perspective, problems won’t deter you.\n<br />\nMost people look down at the ground, upset by every obstacle.\n<br />\nWith your eyes on the horizon, you’ll step over obstacles, undeterred.\n</p><p>\nIf you haven’t decided what to master, pick anything that scares you, fascinates you, or infuriates you.\n<br />\nDon’t ask, “Is this the real me?” or “Is this my passion?”\n<br />\nThose questions lead to endless searching and disappointment.\n<br />\nPeople don’t fail by choosing the wrong path — they fail by not choosing.\n<br />\nMake your choice, then make a lifetime commitment to constant improvement.\n<br />\nThe passion comes after you start getting good.\n</p><p>\nDefine “success” for yourself.\n<br />\nDescribe the outcome you want.\n<br />\nYou can’t hit a target you can’t see.\n</p><p>\nYou need to understand something very counter-intuitive about goals.\n<br />\nGoals don’t improve your future.\n<br />\nGoals only improve your present actions.\n<br />\nA good goal makes you take action immediately.\n<br />\nA bad goal doesn’t.\n<br />\nA goal shows what’s right and wrong.\n<br />\nWhat moves you towards your goal is right.\n<br />\nWhat doesn’t is wrong.\n</p><p>\nWhen you first start learning, you improve massively every week.\n<br />\nBeginning is fun.\n<br />\nBut real expertise comes only after years of hard work.\n<br />\nThe challenge is staying on the path.\n</p><p>\nYou need ritual, not inspiration.\n<br />\nEvery day, no matter what, you must practice.\n<br />\nYour practice ritual is your highest priority — an unbreakable commitment.\n<br />\nStubbornly protect this time against the demands of the world.\n</p><p>\nOnce you get momentum, never stop.\n<br />\nIt’s easy to continue, but if you stop, it’s hard to start again.\n<br />\nNever miss a day.\n</p><p>\nWhen you’re not practicing, remember: someone somewhere is practicing.\n<br />\nWhen you meet them, they will win.\n</p><p>\nDuring your work time, do nothing but work.\n<br />\nKeep your hands on your work, and your mind will follow.\n<br />\nIf you get stuck, just stop and close your eyes.\n<br />\nThe vacuum will extract your actions again.\n</p><p>\nHow many push-ups could you do right now?\n<br />\nBut how many could you do if you took a ten-minute break between each set?\n<br />\nMany more.\n<br />\nThat’s the secret.\n<br />\nTake tiny breaks when working, to go longer than most.\n</p><p>\nFocus means head down.\n<br />\nBig picture means head up.\n<br />\nThe more you’re doing of one, the less you’re doing of the other.\n<br />\nIf you’ve been head-down on a task for too long, lift your head up to make sure you’re going the right way.\n<br />\nDon’t do well what you shouldn’t do at all.\n</p>\n<hr />\n<p>\nPursuing mastery is ambitious, which helps your chance of success.\n<br />\nMost people fail in life not by aiming too high, but by aiming too low.\n<br />\nIf you aim high and miss, you don’t actually fail.\n</p><p>\nMove to the most ambitious place in your field.\n<br />\n(Actor? Hollywood. Tech? Silicon Valley. Etc.)\n<br />\nExpectations there are so high that they’ll help push you to be the best.\n<br />\nYou want the pressure.\n<br />\nYou want the stress.\n</p><p>\nDon’t live somewhere pleasant surrounded by normal people.\n<br />\nLive among your fellow freaks, where obsession is normal and ambition is rewarded.\n</p><p>\nYou don’t get extreme results without extreme actions.\n<br />\nIf you do what most people do, you’ll get what most people get.\n<br />\nDon’t be normal.\n<br />\nSociety’s guidelines are for the lost — not for you.\n</p><p>\nYou don’t need a spouse or kids.\n<br />\nYou don’t need to hang out, make small talk, or join in common rituals.\n<br />\nYou don’t need to sleep at normal hours, keep a tidy home, or even relax.\n<br />\nBe sharply focused, not well-rounded.\n</p><p>\nThink of the legendary achievers: the geniuses, brilliant artists, record-breaking athletes, or self-made billionaires.\n<br />\nDo you think those people were well-balanced?\n<br />\nOf course not.\n<br />\nThey focused all their energy only on one thing.\n<br />\nThat’s why they were great.\n<br />\nPursue your mission at the expense of everything else.\n</p><p>\nNobody cares what you’re bad at, and neither should you.\n<br />\nAmplify your strengths.\n<br />\nNobody will see the rest.\n</p><p>\nKeep the rest of your life boring.\n<br />\nDrama is a distraction.\n<br />\nYour personal life and other concerns can shrink to almost nothing.\n<br />\nFocus everything on your work.\n</p><p>\nMastery is not about doing many things.\n<br />\nIt’s doing one thing insanely well.\n<br />\nThe more you take on, the less you’ll achieve.\n<br />\nSay no to everything but your mission.\n<br />\nThis is your one contribution to the world.\n</p><p>\nYou don’t need new ideas.\n<br />\nYou need to master the idea you’ve begun.\n<br />\nThat’s why you can ignore all distractions.\n<br />\nThe world has no information that you need.\n</p><p>\nResist the urge to branch out into something new.\n<br />\nYou can do anything, but not everything.\n<br />\nRemember the saying “jack of all trades, master of none”.\n<br />\nThat’s the opposite of you.\n<br />\nYou are master of one.\n</p><p>\nYour focus will almost certainly lead to success.\n<br />\nWhen you live, dream, and work with one single mission, you will achieve that mission.\n<br />\nBut beware of money and fame.\n<br />\nMoney can pull you towards your mountain, but sometimes it pulls you away.\n<br />\nFame tries to pull you out of the deep path of mastery into the shallow gutter of flattery.\n<br />\nThe best response to fame’s endless requests is a simple mantra: “No. No. No. No. No.”\n</p><p>\nHow long will it take you to become a master?\n<br />\nIt doesn’t matter.\n<br />\nImagine getting to a mountaintop after a long hike through a gorgeous forest.\n<br />\nAchieving your goal would feel like taking off your backpack.\n<br />\nThat’s all.\n<br />\nYou do it for the journey, not the destination.\n</p><p>\nPursuing mastery is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ed8994f665052892f4f189ab73392216081d050c9f4cfa6696d932db3aa6fe74","category":"default"}