{"title":"We Are the Music, We Are the Spark: Pioneering Biologist Ernest Everett Just on What Makes Life Alive","link":"https://www.themarginalian.org/2023/12/25/ernest-everett-just-life-time/","date":1703543161000,"content":"<h3>“Life is exquisitely a time-thing, like music.”</h3>\n<hr />\n<p>This is the great bewilderment: that out of a cold austere cosmos arose the roiling wonder of life, from the tiniest archaeans that have <a href=\"https://www.themarginalian.org/2017/12/12/jad-abumrad-the-universe-in-verse-pattiann-rogers/\">“confronted sulfuric boiling black sea bottoms and stayed”</a> to the cathedral of consciousness ringing with music and mathematics and poems about archaeans; that we are here trembling with all this love and all this suffering, all these vicissitudes of aliveness, and all the while each one of the atoms in our bodies can be traced back to the core of some particular star that died long ago, some insentient cauldron of chemistry and chance.</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?resize=680%2C357&amp;ssl=1\" width=\"680\" height=\"357\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?resize=320%2C168&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?resize=600%2C315&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?resize=240%2C126&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/12/pillarsofcreation_JWST.jpg?resize=768%2C403&amp;ssl=1 768w\" /><figcaption>The star-forming clouds of gas and dust known as Pillars of Creation. (James Webb Space Telescope / NASA)</figcaption></figure>\n<p>The question of what life is — how atoms and molecules become living cells, what differentiates a rock from the lichen on it and a robot from a human being — has shaped human thought for as long as we have been thinking. For a long time, it was believed that living beings are animated by some mysterious vital force beyond mere matter — a spark of life, hidden deep within. This view, known as vitalism, crumbled on the anatomy table of Romantic science when the scalpel found no mysterious soul-organ super-added by a divine hand. Everything we are, these heretical discoveries intimated, must be housed in the body, must arise from this mortal matter, must be the product of physical forces that “animate the lifeless clay,” as Mary Shelley (who frequented London’s science lectures) wrote in <em>Frankenstein</em> — that far-seeing reckoning with the mystery of life weighed against its materiality. </p>\n<p>Within a century, just before he sparked the dawn of artificial intelligence, the young Alan Turing was bending his pliant mind around the notion that we are built of <a href=\"https://www.themarginalian.org/2020/10/21/turing-natural-wonders/\">“living bricks set in dead mortar.”</a></p>\n<p>Few people have advanced our understanding of these living bricks and their bearing on the mystery of life more profoundly than the marine biologist <strong>Ernest Everett Just</strong> (August 14, 1883–October 27, 1941).</p>\n<figure><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=680%2C1114&amp;ssl=1\" width=\"680\" height=\"1114\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=320%2C524&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=600%2C983&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=240%2C393&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=768%2C1258&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust.jpg?resize=938%2C1536&amp;ssl=1 938w\" /><figcaption>Ernest Everett Just (Marine Biological Laboratory Archives)</figcaption></figure>\n<p>Born not long after the development of cell theory began revolutionizing our understanding of life, at a time when the cell was established as the basic biological unit but its inner workings remained an enigma, Just set out to understand how a cell becomes a living organism. Studying a sand dollar during fertilization, he made a landmark discovery of how the egg cell directs its own development — anathema to prior understanding of the inception of life. </p>\n<p>A few years before James Baldwin did the same for the same reasons, Just moved to Europe to live and work in self-elected exile freer, though never entirely free, from his homeland’s prejudices. As a world war was breaking out, he published his magnum opus — <a href=\"https://www.amazon.com/Biology-Cell-Surface-Ernest-Everett/dp/1296505863/?tag=braipick-20\" target=\"_blank\"><strong><em>The Biology of the Cell Surface</em></strong></a> (<a href=\"https://search.worldcat.org/title/809067\" target=\"_blank\"><em>public library</em></a>) — recounting his revelatory research in uncommonly poetic prose bridging the scientific and the existential. </p>\n<p>Half a century before the evolutionary biologist Lynn Margulis gave us her Gaia hypothesis of inter-relation, anchored in her view that <a href=\"https://www.themarginalian.org/2018/04/19/lynn-margulis-talking-on-the-water/\">“life is a unitary phenomenon, no matter how we express that fact,”</a> Just anticipates the <a href=\"https://www.themarginalian.org/2023/12/05/biology-of-wonder-weber/\">the new biology of poetic ecology</a> and writes:</p>\n<blockquote><p>We feel the beauty of Nature because we are part of Nature and because we know that however much in our separate domains we abstract from the unity of Nature, this unity remains.</p></blockquote>\n<p>This unity holds up at every scale, from the atoms to the stars:</p>\n<blockquote><p>Nature is both continuous and corpuscular. In the former sense, we pass from lower to higher revelations of organization almost insensibly and with scarcely a break. Every form of matter follows upon another. In the latter sense, we recognize breaks in natural states from electron to atom, from atom to molecule, from molecule to compound, and from compounds in association to living matter. But even conceived of as corpuscular, matter, as we know it, is never purely discrete and absolutely independent from the remainder of nature. Whether we study atoms or stars or that form of matter, known as living, always must we reckon with inter-relations. The universe, however much we fragment it, abstract it, ever retains its unity. </p>\n<p>The egg cell also is a universe. And if we could but know it we would feel in its minute confines the majesty and beauty which match the vast wonder of the world outside of us. In it march events that give us the story of all life from the first moment when somehow out of chaos came life and living.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2021/05/18/ernest-everett-just/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2021/05/ernesteverettjust3-scaled.jpg?w=1360&amp;ssl=1\" /></a><figcaption>Art by Luisa Uribe from <a href=\"https://www.themarginalian.org/2021/05/18/ernest-everett-just/\"><em>The Vast Wonder of the World</em></a> — a picture-book biography of Ernest Everett Just</figcaption></figure>\n<p>Adding to “the vast wonder of the world,” rather than subtracting from it, is the knowledge that all this ravishing complexity, all this breathtaking pulsating beauty, is made of the most elementary building blocks:</p>\n<blockquote><p>The realm of living things being a part of nature is contiguous to the non-living world. Living things have material composition, are made up finally of units, molecules, atoms, and electrons, as surely as any non-living matter. Like all forms in nature they have chemical structure and physical properties, are physico-chemical systems. As such they obey the laws of physics and chemistry. Would one deny this fact, one would thereby deny the possibility of any scientific investigation of living things. No matter what beliefs we entertain, the noblest and purest, concerning life as something apart from physical and chemical phenomena, we can not with the mental equipment which we now possess reach any estimate of living things as apart from the remainder of the physico-chemical world.</p></blockquote>\n<p>Living things, Just observes, are not made of some special stuff but of the commonest chemical elements, so the difference between life and non-life cannot be attributed to matter alone. The difference, he argues, is not one of composition but of organizing principle — a kind of choreography, orchestrating motion in time. A year before Borges insisted that <a href=\"https://www.themarginalian.org/2016/09/19/a-new-refutation-of-time-borges/\">time is the substance we are made of</a>, Just writes:</p>\n<blockquote><p>Living matter has an organization peculiar to itself. Nowhere except in the living world does matter exhibit this organization. Life, even in the simplest animal or plant, so far as we know, never exists apart from it. Resting above and conditioned by non-living matter, life perhaps arose through the chance combination of the compounds which compose it. But who knows? A living thing is not only structure but structure in motion. As static, it reveals the superlative combination of compounds of matter; as a moving event, it presents the most intricate time-pattern in nature. Life is exquisitely a time-thing, like music.</p></blockquote>\n<figure><a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=680%2C920&amp;ssl=1\" width=\"680\" height=\"920\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?w=733&amp;ssl=1 733w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=240%2C325&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=320%2C433&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2019/11/sougy_pigeon_s6.jpg?resize=600%2C812&amp;ssl=1 600w\" /></a><figcaption>Anatomy of a bird by French artist <a href=\"https://www.themarginalian.org/2019/11/29/paul-sougy/\">Paul Sougy</a>. (Available <a href=\"https://society6.com/product/paul-sougy-the-pigeon-1950s-proceeds-benefit-the-nature-conservancy2463644_print?curator=brainpicker\" target=\"_blank\">as a print</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>An epoch before Just, responding to the death of vitalism on the anatomy table, Emily Dickinson had captured the irreducibility of life, the way its dissection into parts will never account for the organizing principle that harmonizes the whole:</p>\n<blockquote><p>Split the Lark — and you’ll find the Music…<br />\nScarlet Experiment!…<br />\nNow, do you doubt that your Bird was true?</p></blockquote>\n<p>Couple with <a href=\"https://www.themarginalian.org/2021/05/18/ernest-everett-just/\">the illustrated story of Ernest Everett Just’s trailblazing life</a>, then revisit <a href=\"https://www.themarginalian.org/2020/10/21/turing-natural-wonders/\">the strange science of how alive you really are</a> and Alan Lightman on <a href=\"https://www.themarginalian.org/2022/01/10/alan-lightman-death/\">what happens when you die</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"edc0ee1f053bd202349190fa3a4ea5eaa0b38ea7a844f504aa21111893b7a376","category":"default"}