{"title":"NYC Biking","link":"https://www.usv.com/writing/2024/09/nyc-biking/","date":1725644536000,"content":"<p>My favorite mode of transportation in NYC is the electric citibike. I ride one every morning to and from the USV office. There’s a dock on my block in Brooklyn and a dock around the corner from our office. I love my route – it’s a straight shot across the Manhattan Bridge where I get to look at the water and feel the breeze in the morning and early evening, and then through the East Village where I spent years living during and after college.</p>\n<p>Yesterday, I was biking across the bridge in the morning and a woman in front of me had a terrible accident and flipped over her handlebars, scraped up her whole body, and was concussed. Thank god she was wearing her helmet, which split in half upon impact. We placed a bike horizontally across the bike lane so people wouldn’t run into us and called an ambulance so she could safely be taken off the bridge. Fortunately, she was okay, but it was very scary.</p>\n<p>A positive aspect about the experience was that many people slowed down to see if things were okay. But the disheartening thing was that almost everyone sped by and was super irritated if not downright angry that we were slowing down bike traffic to protect an injured person. I got yelled at and called names, and someone even hit my bike that we placed as a horizontal barricade with their bike. As my colleague Matt said, the one thing that pisses off New Yorkers more than anything else is if you slow down the pace of traffic. He’s right. The city has a deeply rooted pace that resists being slowed down, and I saw the dirty side of it yesterday.</p>\n<p>Bicycles are an important transportation feature of cities, and I am happy to see that NYC has added more bike lanes and widened them over time. But things are getting unruly and dangerous out there. Pedestrians are frequently struck by riders, and many different types of vehicles are riding in bike lanes at unacceptably high speeds. The city needs to tighten its rules around permissible use and rigorously enforce them to keep the streets safe for pedestrians and riders. Here are some ideas:</p>\n<p>If a bike moves fast and doesn’t require peddling, it doesn’t belong in a bike lane. I’ve seen mopeds, vespas and massive eBikes that are powered by throttle, not your feet, racing through bike lanes and wreaking havoc. These are effectively motorcycles and don’t belong in bike lanes. They also don’t belong on sidewalks. They belong in car lanes. I am fine with upright scooters which use a throttle to move so long as they go at a reasonable pace.</p>\n<p>To enforce this, police officers should be stationed at both ends of a bridge and confiscate these vehicles as they come off the bike lane. They should sell them at a discount on a marketplace and use the revenue to enhance bike lanes and make citibikes free or subsidized for those that can’t afford them. They should do the same thing whenever they see these vehicles in bike lanes or sidewalks on the city streets.</p>\n<p>Delivery workers should be permitted to use a throttled ebike, but one that is intended to be ridden on the road, not offroad, and is not a moped. There should be some speed cap on the throttle for these bikes. I do think some carveout for delivery workers is needed, but I am unsure of what it should be. This idea is one that’s just off the top of my head.</p>\n<p>Bikers who ignore traffic signs should be fined regularly. We need to find a way to disincentivize this behavior. I am guilty of it and cringe every time I do it and navigate around pedestrians who have the right of way.</p>\n<p>If you do not pick up and clean your dog’s shit off the sidewalk, you go to jail for life.</p>\n<p>There’s probably a long list of things I’m ignoring here that should be considered. But we need mopeds and super fast and dangerous bikes out of bike lanes and in the car lanes where they belong. Bikes are a blessing to cities, and we need to be explicit about what a bike is. It’s time for NYC to clean up its act here.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/09/nyc-biking/\">NYC Biking</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"edf8b711dffcf8a48bd1f5426cf087625bf01887554e529b8f09a8077b82b06d","category":"Sites"}