{"title":"Unlikely places and untangled goals","link":"https://sive.rs/unun","date":1512950400000,"content":"<p>\nI once went without food for ten days, and that was fine.\nBut the two things I can’t do without for long are solitude and silence.\n(Freedom from people and their noises.)\n</p><p>\nI was on a holiday in Ireland with seven members of my family, all packed into a van, exploring the country.\nA week after they left, I had to be at a conference in Dublin.\nSo in-between those two events, I wanted nothing but solitude and silence.\n</p><p>\nAn <a href=\"https://twitter.com/paulca\">Irish friend</a> suggested that I stay at <a href=\"https://mountmellerayabbey.org/guesthouse\">Mount Melleray Abbey</a>, home of the <a href=\"https://en.wikipedia.org/wiki/Cistercians\">Cistercian</a> Trappist monks, known for their silence.\nThey provide a guest room that’s free for whoever asks.\nThat sounded perfect, so I emailed and asked.\nThey said yes, so I prepared for a solid week of silence.\nI took my family to the airport, and drove to the abbey.\n</p><p>\nWhen a monk met me at the door and showed me the way to my room, I was surprised when he spoke.\nI thought we’d all just be silently gesturing.\nHe told me meals would be served twice a day down the hall.\n</p><p>\nAt dinner time, I went down the hall, again expecting silent gesturing.\nBut instead, there was a room full of thirty other guests from around the world, all chattering away.\nI tried to sit alone, but there was no way to do it.\n</p><p>\nOne loud American latched on to me and bombarded me with shallow questions.\nI gave vague one-word answers, but that wasn’t enough to stop him.\nI quickly ate and retreated to my room again.\nI thought about how I’d avoid this chatter for the next six days.\n</p><p>\nThe next morning, I tried to get to breakfast early, but I wasn’t early enough.\nThe loud American was there with follow-up questions about my religious beliefs.\nHe started to introduce me to everyone.\n</p><p>\nI guess they came here for different reasons than I did.\n</p><p>\nI went back to my room, packed up, and left a thank-you note for the monks, before driving off into the unknown.\n</p><p>\nI realized I could get more silence at a hotel, so I went to <a href=\"http://www.lyrath.com/\">Lyrath Estate</a> in Kilkenny.\nIt was off-season, half-price, spacious, and mostly empty.\nI hung around all their various sitting rooms and balconies, writing for six silent days, speaking only one sentence a day if I ordered dinner.\nIt was just what I wanted.\n</p><p>\nIt made me think about all the unlikely places we can get what we want.\n</p><p>\nSome people think they need to go all the way to Thailand to meditate, or to India to learn yoga.\nBut of course these are things they can do for free at home.\n</p><p>\nSome people think they need to travel to a country to learn its language.\nBut check out <a href=\"https://flrmethod.com/moses-mccormick/\">Moses McCormick learning more than a dozen languages from Ohio</a>, or <a href=\"https://www.fluentin3months.com/arabic-mission/\">Benny Lewis learning Arabic from Brazil</a>.\n</p><p>\nSome people think they need to pay a fortune to a university for a great education.\nBut the top schools have all their courses online for free.\n</p><p>\nAnd this idea isn’t just about locations.\nSome people think they need expensive equipment to start a new hobby, certain clothes to look the part, or for everything to be just right.\nBut resourceful people know they don’t.\n</p><p>\nIt’s so important to separate the real goal from the old mental associations.\n<strong>\nWe have old dreams.\nWe have images we want to re-create.\nThey’re hard to untangle from the result we really want.\n</strong>\nThey become excuses, and reasons to procrastinate.\n</p>\n<a href=\"https://www.flickr.com/photos/tinaleggio/15516383916\"><img src=\"/images/medskate.jpg\" /></a>\n<div>Meditation photo by <a href=\"https://www.flickr.com/photos/tinaleggio/\">Tina Leggio</a></div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"ee295c183900b5dadade116354f1946623ae86cfae2ea96da5e388efceb3671c","category":"default"}