{"title":"&#8220;The Kidnapping I Can&#8217;t Escape&#8221;","link":"https://kottke.org/24/09/the-kidnapping-i-cant-escape","date":1726754604000,"content":"\n        <p>From earlier this summer, <a href=\"https://www.nytimes.com/2024/07/07/magazine/kidnapping-long-island.html?unlocked_article_code=1.Lk4.3RMV.-GDGReKA1XZg\">The Kidnapping I Can’t Escape</a> is a great piece by Taffy Brodesser-Akner about the real-life kidnapping that inspired her recent novel, <a href=\"https://www.amazon.com/exec/obidos/ASIN/0593133498/ref=nosim/0sil8\">Long Island Compromise</a>.</p>\n\n<blockquote><p>Jack was home safe. He had survived his kidnapping. But the actual kidnapping is not what this story is about, if you can believe it. It’s about surviving what you survived, which is also known as the rest of your life.</p></blockquote>\n\n<p>It’s also about, spoiler alert, trauma.</p>\n\n<blockquote><p>Tolstoy tells us that all happy families are alike and that each unhappy family is unhappy in its own way. A few years ago, I wrote a different novel, my first novel, about divorce, which was inspired in part by the divorce stories of several people I know, and I came to the conclusion that, actually, all divorces are exactly alike. I tell you this because I’ve now come to understand the same thing about trauma: Happy, well-adjusted people are all different. The traumatized are exactly alike. I’m about to tell you a story that is nothing like a violent kidnapping — almost laughably so — but what I’ve learned over the years is that trauma is trauma. Something terrible happens, beyond what is in our own personal capacity to cope with, and the details don’t matter as much as the state we’re thrown into. Our bodies and brains have not evolved to reliably differentiate a rape at knife point from a job loss that threatens us with financial ruin or from the dismantling of our world by our parents’ divorce. It’s wrong, but explain that to your poor, battered autonomic nervous system.</p></blockquote>\n\n<p>Like I said, it’s a great piece and you should <a href=\"https://www.nytimes.com/2024/07/07/magazine/kidnapping-long-island.html?unlocked_article_code=1.Lk4.3RMV.-GDGReKA1XZg\">read the whole thing</a>. The piece is also available, with some additional author commentary, on <a href=\"https://www.nytimes.com/2024/07/28/podcasts/the-daily/jack-teich-kidnapping.html\">this episode of The Daily podcast</a>.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/books\">books</a> · <a href=\"https://kottke.org/tag/crime\">crime</a> · <a href=\"https://kottke.org/tag/kidnapping\">kidnapping</a> · <a href=\"https://kottke.org/tag/Long%20Island%20Compromise\">Long Island Compromise</a> · <a href=\"https://kottke.org/tag/Taffy%20Brodesser-Akner\">Taffy Brodesser-Akner</a></p>\n\n         <p>💬 <a href=\"https://kottke.org/24/09/the-kidnapping-i-cant-escape\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"ee807e28fbb039beaeebb3b0c50e136b1d942b0a69e96e6b7b511423e8a2b8f4","category":"Sites"}