{"title":"Wabi-Sabi of Vintage Digicams","link":"https://om.co/2024/11/30/wabi-sabi-of-vintage-digicams/","date":1732988167000,"content":"<p>When reading <a target=\"_blank\" href=\"https://www.wired.com/story/vintage-digicams-artistic-photos/\">this story</a> about the growing popularity of vintage digital cameras in Wired, I was reminded of this quote by Don Draper from the television series Mad Men:</p>\n\n\n\n<blockquote>\n<p>“Nostalgia – its delicate, but potent. Teddy told me that in Greek nostalgia literally means “the pain from an old wound.” It’s a twinge in your heart far more powerful than memory alone.”</p>\n</blockquote>\n\n\n\n<p>TLDR: Vintage digital cameras from the early 2000s are having a moment. They are being used as tools for artistic expression. Their “flaws” – low resolution, noise, and imperfect colors – are becoming prized features in an era of AI-perfect smartphone photos. It is funny that this story comes out when Sony launched its latest, most advanced camera, the new version of the A1 — and it makes photography feel almost like a video game.</p>\n\n\n\n<h4>Key Points:</h4>\n\n\n\n<ul>\n<li>Photographers are looking for older cameras with CCD sensors that produce distinctive noise patterns and contrast.</li>\n\n\n\n<li>A “true digicam” is a camera from 2000 to 2004.</li>\n\n\n\n<li>The enthusiasts of these old cameras are okay with limitations such as battery issues and obsolete memory card formats. The workarounds are part of the process. Some are using power banks and custom cables to keep vintage cameras operational.</li>\n\n\n\n<li>Wired points out that when it comes to digital preservation, we focus on saving digital files, but don’t think about the actual tools that created early digital culture. These vintage digital cameras aren’t just imaging devices; they’re artifacts that shaped how an entire generation viewed and documented its world.</li>\n</ul>\n\n\n\n<h4>Some Thoughts:</h4>\n\n\n\n<p>Two years ago, when my sister told me that my niece didn’t want a Fuji x100 (which is about a decade old) but instead an older Canon point-and-shoot camera, I was flabbergasted. Why would you spend so much money on something when you can have a better “vintage” camera? I should have paid more attention because now it is a full-on trend that is no different from the revival of cassette tapes, vinyl records, and film cameras.</p>\n\n\n\n<p>Just as vinyl returned when streaming made music “too perfect,” a growing number of photographers — mostly from Gen Z — are pushing back against computational photography’s clinical precision. A few months ago, The New Yorker wrote about an app that allowed you to remove Apple’s processing from your iPhone photos and make them look a bit more basic. Given my propensity for photo editing, I missed the point of the New Yorker story.</p>\n\n\n\n<p>I didn’t get the point that people don’t shoot in “RAW” and don’t like to “edit” like I do. As a result, I got into an argument with the writer, perhaps because the story didn’t focus on the “why” as much as it did on the tools and the impact. Eventually, I realized the error of my ways.</p>\n\n\n\n<p>Retromania? Not really. It feels more like a backlash against the excessive perfection of modern cameras, algorithms, and homogenized modern image-making. I don’t disagree — you don’t have to do much to come up with a great-looking photo these days.</p>\n\n\n\n<p>The camera — standalone or in the phone — does it all for you. It removes warts and all. Now some photographers are deliberately choosing imperfection, noise, and constraint. It’s reminiscent of how early web designers embraced the limitations of 8-bit graphics to create distinctive aesthetic styles. We have also seen a revival of the eighties-style design on the web. (Just look at the logo of the <a target=\"_blank\" href=\"http://crazystupidtech.com\">CrazyStupidTech</a> newsletter!)</p>\n\n\n\n<p>Creativity needs constraints. For example, I personally like to use a single manual lens for my photography. It slows everything down for me and helps me frame, compose, and imagine the final image, instead of hurriedly capturing a photo. If it is blurry — well, so are my eyes without glasses. By using a lens that mimics my field of view, I am able to truly capture what I see and then interpret it as an imagined artwork. If it is not sharp, neither is my vision.</p>\n\n\n\n<p>Sure, I edit my photos — but that is part of the “creation” process that I don’t want machines to do on my behalf. The retro cameras add a level of imperfection without needing to use computer editing software, so I totally understand more people want to use those kinds of cameras.</p>\n\n\n\n<p>Even I do that myself. I have an older Leica M9 camera that I use with a vintage 50mm Summitar lens. It is so hard to use, and that is the point. I use old 8 GB memory cards and carry two batteries with me when I take these oldies for a spin. If I take 100 photos in a day — or about three rolls of film — I am hoping for 5 good ones. And to get those five is a lot of hard work. I don’t really have to edit those photos, barring some tiny tweaks like brightness or contrast. They look great as they are.</p>\n\n\n\n<p><a target=\"_blank\" href=\"https://www.wired.com/story/vintage-digicams-artistic-photos/\">Read the story on Wired</a>.</p>\n\n\n\n<p><br /><em><strong>November 30, 2024. San Francisco</strong></em></p>\n\n\n\n<p>Footnotes:</p>\n\n\n\n<ul>\n<li>Wabi-sabi as an aesthetic concept is generally described as the beauty of things that are imperfect, impermanent, and incomplete.</li>\n\n\n\n<li>Anyone want a 50-megapixel PhaseOne CCD unit? Make me an offer.</li>\n\n\n\n<li>I have an old Panasonic micro four-thirds camera somewhere. Happy to sell it to anyone who is looking for one with some lenses.</li>\n</ul>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"eea1f71680ad1451349f33d00caa2813117712ac2ecee9e38ad3391e6078abf8","category":"Sites"}