{"title":"Here’s how to live: Learn.","link":"https://sive.rs/htl15","date":1639526400000,"content":"<p>\nLearning is underrated.\n<br />\nPeople wonder why they’re not living their ideal life.\n<br />\nMaybe they never learned how.\n</p><p>\nYou get healthy by learning healthy habits.\n<br />\nYou get wealthy by learning valuable skills.\n<br />\nYou build a great interpersonal life by learning people skills.\n<br />\nMost misery comes from not learning these things.\n</p><p>\nThe biggest obstacle to learning is assuming you already know.\n<br />\nConfidence is usually ignorance.\n</p><p>\nNever consider yourself an expert.\n<br />\nIt’s the strong swimmers who drown.\n</p><p>\nDon’t believe what you think.\n<br />\nHave questions, not answers.\n<br />\nDoubt everything.\n<br />\nThe easiest person to fool is yourself.\n</p><p>\nDon’t answer a hard question too quickly.\n<br />\nDon’t stop at the first answer.\n<br />\nIn mystery stories, the first suspect is not the culprit.\n</p><p>\nIf you’re not embarrassed by what you thought last year, you need to learn more and faster.\n<br />\nWhen you’re really learning, you’ll feel stupid and vulnerable — like a hermit crab between shells.\n</p><p>\nBe surprised by something every day.\n<br />\nFind that exciting moment when you get a completely new perspective.\n<br />\nLike a movie that reveals something at the end which changes the way you think of everything you’ve seen before.\n<br />\nIf you’re not having these moments often, find new inputs.\n</p><p>\nWhatever scares you, go do it.\n<br />\nThen it won’t scare you anymore.\n</p><p>\nWhatever you hate, get to know it.\n<br />\nThen you won’t hate it anymore.\n</p><p>\nTalk with people you usually avoid.\n<br />\nPursue subjects you know nothing about, and experiences unlike anything you’ve done before.\n<br />\nIf you’re not surprised — if you didn’t feel your brain changing — then you didn’t really learn.\n</p><p>\nDon’t be consistent with your past self.\n<br />\nOnly idiots never change their mind.\n</p><p>\nSacrifice the things you used to believe, and the ways you used to be.\n<br />\nLearning leaves a trail of little deaths.\n</p><p>\nRemember what you learn.\n<br />\nKnow why you’re learning.\n<br />\nInformation doesn’t stick without emotion.\n<br />\nYou learn better when you’re having fun.\n</p><p>\nTake notes.\n<br />\nReview them often.\n<br />\nMake flash cards to remind your future self what you learned today.\n<br />\nQuiz yourself with spaced repetition.\n<br />\nKnowledge fades and eventually disappears unless you keep it refreshed.\n</p><p>\nInternalize it.\n<br />\nDon’t expect to just look it up when you need it.\n<br />\nIntegrate it into how you think.\n</p><p>\nGet out of your room and try out a new skill in the real world.\n<br />\nGo to the physical place where it’s happening, and put your ass on the line with something to lose.\n<br />\nA vivid, visceral feeling of danger will teach you better than words.\n</p><p>\nKnowledge is often described simply — “in a nutshell”.\n<br />\nBut the inside of a nutshell is complex.\n<br />\nSo crack open nutshells to understand them better.\n<br />\nPut concepts in a nutshell to keep them in your pocket and pass them around.\n</p><p>\nCommunicate knowledge to others to make sure you understand.\n<br />\nDon’t quote.\n<br />\nPut it in your own words without looking up or referencing what others said.\n<br />\nIf you can’t explain it yourself, you don’t know it.\n</p><p>\nTo communicate clearly, you have to think clearly.\n<br />\nWriting is refined thinking.\n<br />\nPublic speaking tests your writing on a real audience.\n<br />\nGreat public speaking comes from great private thinking.\n</p><p>\nTeaching and learning are telepathy.\n<br />\nWe can connect across oceans and centuries.\n<br />\nWords written by someone long ago and far away can penetrate your mind.\n<br />\nShare what you learn so it can be received by others, even when you are long gone.\n</p><p>\nLearning makes you a better person and makes the world a better place.\n<br />\nLearning is a pursuit you can’t lose.\n<br />\nAs you age, you’ll lose muscle and beauty, but you won’t lose your wisdom.\n<br />\nLearning is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"eeaf3370797dd3b36cca5894a81372ac240ae4fce63698a2c07eb3f7cd92e398","category":"Sites"}