{"title":"Why are you doing?","link":"https://sive.rs/why","date":1473033600000,"content":"<p>\nIt’s crucial to know why you’re doing what you’re doing.\n</p><p>\nMost people don’t know.\nThey just go with the flow.\n</p><p>\nSocial norms are powerful.\nThe inputs that influence you are powerful.\nA great talk, book, or video can instantly change how you think.\n</p><p>\nBut on your death bed, you don’t want that horrible regret, feeling like you spent your life pursuing what someone said you should want, instead of what you actually wanted.\n</p><p>\nFor example, if you want to make a lot of money, you need to admit that.\nIf you want to be famous, you need to pursue that.\nIf you want freedom and no responsibilities, or want to learn as much as possible, or whatever else, you need to realize it and embrace it.\n</p><p>\n<strong>\nWhatever you decide, you need to optimize for that goal, and be willing to let go of the others.\n</strong>\n</p><p>\nYou can’t diffuse your energy, trying to do a little bit of everything, or you’ll always be in conflict with yourself.\n</p><p>\nFor example, one way to make money is to take on a lot of responsibility, which means letting go of some freedoms.\n</p><p>\nOne way to get famous is to let others make more money, while you take the spotlight.\nI learned this while living in Los Angeles, when I got to know some famous Hollywood actors and realized they’re not as rich as you’d think.\nThe richest people in Hollywood are the ones you’ve never heard of, because they’ve optimized their careers for money.\nThey know that others are willing to take less money in return for more fame, so they profit from the other side of that deal.\n</p><p>\nMaybe the most important thing to you is learning, or creating, or giving.\nMaybe it’s how many people’s lives you can influence.\nMaybe it’s how deeply you can influence just a few people’s lives.\n</p><p>\nOnce you realize what you really want and admit it, you need to pursue it.\n</p><p>\nIf you want freedom, then own a business but delegate all the work.\nYou won’t be learning or creating or giving as much as you could with a different strategy, but that’s OK.\nYou know freedom is what you’re after.\n</p><p>\nSometimes your best strategy is counter-intuitive.\nIf you have a high paying job, but realize that charitable giving is what matters most to you, then the best strategy is not to quit your job to go hang mosquito nets in Africa, but actually to keep your job and make as much money as you can, while funding organizations in Africa that hang thousands of mosquito nets.\n(Unless your goal is just to look charitable.  Then admit that to yourself, too.)\n</p><p>\nBut whatever you choose, brace yourself, because people are always going to tell you that you’re <a href=\"https://sive.rs/wrong\">wrong</a>.\n</p><p>\nThat’s why you need to know why you’re doing what you’re doing.\nKnow it in advance.\nUse it as your compass and optimize your life around it.\nLet the other goals be secondary so that when those decision moments come, you can choose the value that you already know matters most to you.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"eec43566c63f734ef7fa997d9562d50834752b6f441b8be12dd5b752e64a047f","category":"default"}