{"title":"The New Science of Plant Intelligence and the Mystery of What Makes a Mind","link":"https://www.themarginalian.org/2024/05/24/the-light-eaters/","date":1716570817000,"content":"<h3>“Every thought that has ever passed through your brain was made possible by plants.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Light-Eaters-Unseen-Intelligence-Understanding/dp/0063073854/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"486\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?fit=320%2C486&amp;ssl=1\" alt=\"The New Science of Plant Intelligence and the Mystery of What Makes a Mind\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?w=988&amp;ssl=1 988w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?resize=320%2C486&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?resize=600%2C911&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?resize=240%2C364&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/thelighteaters.jpg?resize=768%2C1166&amp;ssl=1 768w\" /></a></p><p>“A leaf of grass is no less than the journey work of the stars,” Walt Whitman <a href=\"https://www.themarginalian.org/2019/12/17/sarah-kay-astronaut-whitman/\">wrote</a> a decade before Darwin gasped at how incomprehensible “the marvelous complexity” of organic beings is, insisting that “each living creature must be looked at as a microcosm — a little universe, formed of a host of self-propagating organisms, inconceivably minute and as numerous as the stars in heaven.” </p>\n<p>And yet this view does not come naturally to us humans, sensemaking creatures compelled to order the universe into comprehensible categories and value ranks, compelled to rank ourselves at the top. Even Darwin had to continually calibrate that impulse. “Never say higher or lower,” he exhorted himself in his marginalia on a book he was reading while working out his evolutionary theory. “Say more complicated.” </p>\n<p>The crux of our difficulty is both profound and banal — to understand nature through degrees of complexity rather than levels of hierarchy scaffolded with self-reference is to find ourselves no longer the pinnacle of creation. We are only just beginning to <a href=\"https://www.themarginalian.org/2015/12/14/the-soul-of-an-octopus-sy-montgomery/\">comprehending non-human minds</a>, only just beginning to concede that there are infinitely many <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">other ways of seeing</a> and <a href=\"https://www.themarginalian.org/2024/05/09/baker-peregrine/\">other ways of being</a> within the same reality; we would <a href=\"https://www.themarginalian.org/2023/03/02/god-human-animal-machine/\">sooner grant consciousness to AI</a>, modeled on our own minds arising from nervous systems crowned with brains, than consider different forms of intelligence as portals to a wider conception of consciousness. </p>\n<figure><a href=\"https://society6.com/product/dragon-arum-arum-dracunculus-from-the-temple-of-flora-1812-benefitting-the-nature-conservancy_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=680%2C876&amp;ssl=1\" width=\"680\" height=\"876\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=320%2C412&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=600%2C773&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=240%2C309&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=768%2C989&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_DragonArum.jpg?resize=1193%2C1536&amp;ssl=1 1193w\" /></a><figcaption>Dragon arum (<em>Arum dracunculus</em>) from <a href=\"https://www.themarginalian.org/2022/11/07/the-temple-of-flora-thornton/\"><em>The Temple of Flora</em></a>, 1812. (Available as <a href=\"https://society6.com/product/dragon-arum-arum-dracunculus-from-the-temple-of-flora-1812-benefitting-the-nature-conservancy_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/cards?sort=new?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>In <a href=\"https://www.amazon.com/Light-Eaters-Unseen-Intelligence-Understanding/dp/0063073854/?tag=braipick-20\" target=\"_blank\"><strong><em>The Light Eaters: How the Unseen World of Plant Intelligence Offers a New Understanding of Life on Earth</em></strong></a> (<a href=\"https://search.worldcat.org/title/1421933387\" target=\"_blank\"><em>public library</em></a>), journalist Zoë Schlanger offers a mighty antidote to our tyranny of self-reference through the emerging science of organic beings we have long treated as stage decor for the drama of our earthly lives — a science rife with controversy and confusion, which is always the mark of a paradigm breaking down and breaking open, contouring a new way of thinking about questions of consciousness, communication, memory, gender, personality, interdependence, and agency. Rising from the pages is that rare achievement of meeting otherness on its own terms while broadening and deepening the terms on which we live our human lives. Schlanger draws from the world of plants “a masterclass in living to one’s fullest, weirdest, most resourceful potential,” and a counterpoint to the survival-of-the-fittest model of the natural world, intimating instead that the animating force of life may be not a combat for a kill but “an improvisation, or a collaboration, or something else entirely.”</p>\n<p>A quarter millennium after Darwin’s grandfather <a href=\"https://www.themarginalian.org/2023/12/24/owls-auditory-map/\">popularized the young science of botany through poetry</a>, and two centuries after Emily Dickinson wrote that <a href=\"https://www.themarginalian.org/2022/02/04/universe-in-verse-bloom/\">“to be a Flower is profound Responsibility,”</a> Schlanger writes:</p>\n<blockquote><p>A life spent constantly growing yet rooted in a single spot comes with tremendous challenges. To meet them, plants have come up with some of the most creative methods for surviving of any living thing, us included. Many are so ingenious that they seem nearly impossible for an order of life we’ve mostly relegated to the margins of our own lives, the decoration that frames the theatrics of being an animal. Yet there they are all the same, these unbelievable abilities of plants, defying our anemic expectations. Their way of life is so astonishing, I will soon learn, that no one yet really knows the limits of what a plant can do. In fact, it seemed that no one quite knows what a plant really is.</p></blockquote>\n<p>This perplexity, Schlanger observes, is one of the most exciting things to happen in our lifetime — “depending on how comfortable you feel with seismic shifts in what you once thought to be true.” Looking back on the past half-century of botany, she reflects on this generative discomfort: </p>\n<blockquote><p>Controversy in a scientific field tends to be a harbinger of something new, some new understanding of its subject… The more botanists uncovered the complexity of forms and behaviors of plants, the less the traditional assumptions about plant life seemed to apply.</p></blockquote>\n<figure><a href=\"https://society6.com/product/auriculas-from-the-temple-of-flora-1812-benefitting-the-nature-conservancy_framed-print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=680%2C908&amp;ssl=1\" width=\"680\" height=\"908\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=320%2C427&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=600%2C801&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=240%2C320&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=768%2C1025&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/11/thetempleofflora_auriculas-1.jpg?resize=1151%2C1536&amp;ssl=1 1151w\" /></a><figcaption>Auriculas from <a href=\"https://www.themarginalian.org/2022/11/07/the-temple-of-flora-thornton/\"><em>The Temple of Flora</em></a>, 1812. (Available as <a href=\"https://society6.com/product/auriculas-from-the-temple-of-flora-1812-benefitting-the-nature-conservancy_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/cards?sort=new?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting The Nature Conservancy.)</figcaption></figure>\n<p>One of those assumptions stems from our basic taxonomic model of life on Earth, separated into six kingdoms — as though plants, animals, fungi, and all the rest are separate and sovereign territories of being, bound by borders and occasionally at war for resources. This tendency to mistake our models of reality for reality itself, universal to the human animal and manifested across all cultures in different ways, and this particular blind spot of Western science, unshared by indigenous and Eastern traditions, have left our view of plants on par with Descartes’s view of non-human animals. An epoch after the poetic naturalist John Muir observed that <a href=\"https://www.themarginalian.org/2018/05/10/john-muir-nature-writings/\">“when we try to pick out anything by itself, we find it hitched to everything else in the universe,”</a> Schlanger writes:</p>\n<blockquote><p>For us to truly be part of this world, to be awake to its roiling aliveness, we need to understand plants. They suffuse our atmosphere with the oxygen we breathe, and they quite literally build our bodies out of sugars they spin from sunlight. They made the ingredients that first allowed our lives to blink into existence at all. Yet they are not merely utilitarian supply machines. They have complex, dynamic lives of their own.</p></blockquote>\n<p>Out of those lives arose an organizing principle for life on Earth. In a passage that contours the central question of the entire field of plant intelligence — how something without a brain can respond to its conditions in coordinated, adaptive ways that optimize its future — Schlanger writes:</p>\n<blockquote><p>When plants climbed out of the ocean some five hundred million years ago, they arrived in a terrestrial barrens enveloped in an inhospitable fog of carbon dioxide and hydrogen. Inhospitable, that is, to everything but plants. They had already learned to unlock oxygen from the carbon dioxide dissolved in the ocean. They adapted the technology to their new world. In a way, they brought the ocean up with them. By incessantly breathing out, those legions of early land plants tipped the balance of gases toward oxygenation. They created the atmosphere we now enjoy. It’s not a stretch to say they birthed the habitable world.</p></blockquote>\n<p>We know this — we know that <a href=\"https://www.themarginalian.org/2022/02/04/universe-in-verse-bloom/\">without the evolution of flowers, we wouldn’t exist</a>; we know that chlorophyll is <a href=\"https://www.themarginalian.org/2021/10/26/why-leaves-change-color/\">the crowning molecular miracle of nature</a>, the only thing we know that can convert the inanimate elements of air and light into sugar, that lifeblood of the living world. With an eye to our own embodiment as cathedrals of glucose, Schlanger puts this alchemy in sobering perspective:</p>\n<blockquote><p>We are made of glucose, too. Without a constant supply of the plant sugar, our vital functions would quickly cease. Think about it: every animal organ was built with sugar from plants. The meat of our bones and indeed the bones themselves carry the signature of their molecules. Our bodies are fabricated with the threads of material plants first spun. Likewise, every thought that has ever passed through your brain was made possible by plants.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2017/05/23/emily-dickinson-herbarium/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2017/05/emilydickinson_herbarium8.jpg\" /></a><figcaption>Page from <a href=\"https://www.themarginalian.org/2017/05/23/emily-dickinson-herbarium/\">Emily Dickinson’s herbarium</a></figcaption></figure>\n<p>Drawing on her personal obsession with plants — a portal of wonder and optimism she discovered while suffering the psychic toll of working as a climate journalist — Schlanger seeks out the pioneers of this changing paradigm. She meets a rare-plant botanist on the brink of seventy who climbs down immense volcanic cliffs to save endangered species and self-medicates for the grief of extinction by writing poetry; she chronicles the research that led to the first clear evidence of mechanosensitive ion channels in plants — those rudiments of nervous systems, enabling organisms to experience touch at the cellular level — sparked by botanist Barbara Pickard’s groundbreaking work on plant electricity; she visits with scientists who study the most controversial frontlines of plant intelligence — research that unsteadies our grip on concepts we consider singularly human.</p>\n<p>One botanist who studies how sagebrush send distress signals to each other has found that individual plants appear to have different risk tolerance — a metric of personality, the very notion of which in an organism without a brain-based mind challenges our central assumptions about consciousness. Other research on a family of flowering desert shrubs found that female plants heed signals from both male and female plants, but males only heed other males — intimations of preference and judgment, also features of personality and consciousness. Schlanger synthesizes some of the most provocative findings:</p>\n<blockquote><p>Plants could be said to have dialects, and are alert to their contexts enough to know when to deploy them. More than that, they have a clear sense of who is who; who is family, and who is not. They are in touch with their surroundings, and with the fluctuating status of their enemies. Their communication is not just rudimentary but complex and layered, alive with multiple meanings.</p></blockquote>\n<p>In fact, no aspect of this new botany is more paradigm-shifting than the study of plant communication. (Canadian forester Suzanne Simard’s epoch-making research into <a href=\"https://www.themarginalian.org/2019/07/10/trees-ted-ed/\">mycorrhizal tree communication</a> was the fulcrum that began shifting the paradigm.) Schlanger considers how this very notion changes our understanding of nature:</p>\n<blockquote><p>Communication implies a recognition of self and what lies beyond it — the existence of other selves. Communication is the forming of threads between individuals. It’s a way to make one life useful to other lives, to make oneself important to other selves. It turns individuals into a community. If it is true that a whole forest or field is in communication, it changes the nature of that forest or field. It changes the notion of what a plant is.</p></blockquote>\n<p>It also changes the notion of what a mind is. We have taken it to be the product of a brain attached to a nervous system, but perhaps a mind is a complex, self-organizing system networked across the entire organism. Perhaps the whole plant is a mind.</p>\n<figure><a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=680%2C661&amp;ssl=1\" width=\"680\" height=\"661\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=320%2C311&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=600%2C583&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=240%2C233&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/05/OfraAmit_UniverseInVerse_cover_white.jpg?resize=768%2C746&amp;ssl=1 768w\" /></a><figcaption>Art by Ofra Amit for <a href=\"https://www.themarginalian.org/2024/05/01/the-universe-in-verse-book/\"><em>The Universe in Verse</em></a></figcaption></figure>\n<p>Emerging from this particular field of science is a larger lens on the nature of knowledge. A century and a half after astronomer Maria Mitchell <a href=\"https://www.themarginalian.org/2013/08/01/maria-mitchell-diaries/\">contemplated the fate of science</a>, observing that “we reach forth and strain every nerve, but we seize only a bit of the curtain that hides the infinite from us,” Schlanger writes:</p>\n<blockquote><p>The world is a prism, not a window. Wherever we look, we find new refractions.</p></blockquote>\n<p>Couple <a href=\"https://www.amazon.com/Light-Eaters-Unseen-Intelligence-Understanding/dp/0063073854/?tag=braipick-20\" target=\"_blank\"><strong><em>The Light Eaters</em></strong></a> with <a href=\"https://www.themarginalian.org/2023/08/23/ghost-pipe/\">the poetic science of the ghost pipe</a> — Earth’s most supernatural plant, which thrives mysteriously without eating light — then revisit this triptych meditation on <a href=\"https://www.themarginalian.org/2022/02/20/michael-pollan-flowers-botany-of-desire/\">flowers and the meaning of life</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"ef88064a8a259c2595dcf21592fed6852b5a7e9c312048eefc9c1888daeb2c50","category":"default"}