{"title":"Turning to Stone: A Geologist’s Love Letter to the Wisdom of Rocks","link":"https://www.themarginalian.org/2024/08/17/turning-to-stone-marcia-bjornerud/","date":1723912606000,"content":"<p><a href=\"https://www.amazon.com/Turning-Stone-Discovering-Subtle-Wisdom/dp/1250875897/?tag=braipick-20\" target=\"_blank\"><img loading=\"lazy\" width=\"320\" height=\"486\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?fit=320%2C486&amp;ssl=1\" alt=\"Turning to Stone: A Geologist’s Love Letter to the Wisdom of Rocks\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?w=987&amp;ssl=1 987w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?resize=320%2C486&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?resize=600%2C912&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?resize=240%2C365&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/turningtostone_bjornerud.jpg?resize=768%2C1167&amp;ssl=1 768w\" /></a></p><p>Among the great salvations of my childhood were the rocks and minerals lining the bookshelves of our next door neighbor — a geologist working for the Bulgarian Ministry of Environment and Water. I spent long hours casting amethyst refractions on the ceiling, carving words into the cutting board with a shard of obsidian, seeing alien oceans and clouds in an orb of agate, feeling in my small bones the almost unbearable beauty of this world and the size of time. I hadn’t been alive a decade, and I was holding millions of years in my palm. </p>\n<p>Half a lifetime later, I coped with heartbreak by traversing a landmass to go live alone in the middle of an old-growth forest. Each day I walked the same trails for hours, trying to make a new path through life between the ferns and the feelings. As the weeks unspooled into months, time did what it always does and I began healing. </p>\n<p>One day on my regular afternoon walk, my eye fell upon a small heart-shaped stone. That is how it began: I suddenly started seeing them everywhere — quarry of hearts strewing the once blank trails. Each day I filled my pockets with them, took them home, and painted them gold. I bought a vintage typesetter’s drawer, hung it on the wall, and placed a small stone heart in each compartment. </p>\n<p><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?resize=680%2C684&amp;ssl=1\" width=\"680\" height=\"684\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?resize=320%2C322&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?resize=600%2C604&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?resize=240%2C241&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts1_MariaPopova.jpg?resize=768%2C772&amp;ssl=1 768w\" /></p>\n<p>Given <a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/#omens\">my views on omens and the nature of the universe</a>, I did not take them as signs. I took them as affirmation that we are pattern-seeking animals and makers of meaning who form search images of what we are looking for and then find it as it rises out of the vastness of reality by the fulcrum of the mind. (This can endanger the life of the heart, for we often carry an unconscious search image of a broken model of love, which we then find in the relationships we seek out.) </p>\n<p>The gift of the stone hearts was something else entirely: They helped me feel what is hard to fathom — scales of space and time too vast for the mind to hold, yet necessary for calibrating our transient existence and its fleeting tremors of the heart. They helped me remember that if time can change the shape of even a rock, it can change the shape of a life.</p>\n<p><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=680%2C1000&amp;ssl=1\" width=\"680\" height=\"1000\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=320%2C471&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=600%2C883&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=240%2C353&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=768%2C1130&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/08/stonehearts_MariaPopova.jpg?resize=1044%2C1536&amp;ssl=1 1044w\" /></p>\n<p>These existential undertones of stones permeate <a href=\"https://www.amazon.com/Turning-Stone-Discovering-Subtle-Wisdom/dp/1250875897/?tag=braipick-20\" target=\"_blank\"><strong><em>Turning to Stone: Discovering the Subtle Wisdom of Rocks</em></strong></a> (<a href=\"https://search.worldcat.org/title/1393205559\" target=\"_blank\"><em>public library</em></a>) by geologist Marcia Bjornerud — part memoir, part portal of science, part love letter to rocks as “raconteurs, companions, mentors, oracles, and sources of existential reassurance,” lensed through the science and wonder of particular rocks that have made our planet a world, from familiar pillars of civilization like granite and flint to molecular marvels like dolomite and diamictite.</p>\n<p>At a time when subatomic colliders are searching for the “God particle” and space telescopes are peering into the beginning of time, amid cosmological concepts too abstract and scales too immense for us to fully grasp, Bjornerud celebrates stone as a way of anchoring ourselves in our planetary inheritance, inseparable from our cosmic origins yet intimate and alive. (We now know that rocks <a href=\"https://www.nytimes.com/2024/08/08/science/mantle-core-drill-ocean.html?te=1&amp;nl=science-times&amp;emc=edit_sc_20240813\" target=\"_blank\">may hold the key to the origin of life</a>.) She writes:</p>\n<blockquote><p>Geology, with its focus on tangible records of the distant past, offers a bridge between human experiences of the world and the awe-inspiring but cold and formidable emptiness of space. Learning to read the storylines of Earth’s history directly from rocks — understanding the plots and protagonists that shaped the places where we live — can help to provide a feeling of “embeddedness” in the cosmos, a sense of continuity and kinship with past and future. Perhaps the most distinctive characteristic of geologic thinking is the practice of roaming freely across many scales in space and time. In doing so, we can see ourselves in miniature, part of a long lineage of creatures on a creative planet that has renewed itself for more than four billion years while keeping an idiosyncratic diary of its activities over time in the form of rocks.</p>\n<p>[…]</p>\n<p>Developing a collective sense of ourselves as Earthlings — native inhabitants of an old, durable planet — may bring reassurance in a time when so many human systems that once seemed robust are showing signs of fragility.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2023/10/13/a-stone-is-a-story/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/10/astoneisastory4.jpg\" /></a><figcaption>Art by Marc Martin from <a href=\"https://www.themarginalian.org/2023/10/13/a-stone-is-a-story/\"><em>A Stone Is a Story</em></a></figcaption></figure>\n<p>Epochs ago, when we were first fathoming the nature of the universe and our place in it, Johannes Kepler — who devised his revolutionary laws of planetary motion <a href=\"https://www.themarginalian.org/2019/12/26/katharina-kepler-witchcraft-dream/\">while defending his mother in a witchcraft trial</a> — was ridiculed for seeing the Earth as an ensouled body that has digestion, that suffers illness, that inhales and exhales like a living organism. A quarter millennium later, the young German marine biologist Ernst Haeckel gave scientific shape to that belief in <a href=\"https://www.themarginalian.org/2022/02/04/universe-in-verse-bloom/\">coining the word <em>ecology</em></a>, which remained an obscure academic term until Rachel Carson made it a household word with <a href=\"https://www.themarginalian.org/2017/01/27/rachel-carson-silent-spring-dorothy-freeman/\"><em>Silent Spring</em></a> a century later. A generation after Carson insisted that <a href=\"https://www.themarginalian.org/2017/09/20/rachel-carson-lost-woods-the-real-world-around-us/\">“our origins are of the earth, and so there is in us a deeply seated response to the natural universe, which is part of our humanity,”</a> Bjornerud vindicates Kepler and, with an eye to <a href=\"https://www.themarginalian.org/2021/08/17/annaka-harris-conscious/\">panpsychism</a>, considers the rehumanizing power of relating to the stony body of the world:</p>\n<blockquote><p>We are creatures shaped by the planet’s rocky logic. Each of us is, most fundamentally, an Earthling. On the beach, pebbles of Ordovician dolomite prattle with Archean granite, their combined memories spanning half the age of the Earth.</p>\n<p>[…]</p>\n<p>Rocks assure us that the past is no less real than the present. I spot a walnut-size piece of porphyritic basalt — one of the “Chinese calligraphy” stones my sister and I collected in childhood. I thank it for revealing itself to me and slip it into my pocket. The stones are communicating with one another, with the waves and wind, with my feverish brain. A recent theory of consciousness posits that intelligent awareness can emerge when the components of a large system have a certain level of interconnectivity. Neurons in the human brain reach the critical threshold. In the presence of these chattering cobbles, it seems obvious to me that, according to that definition, Earth is hyperconscious.</p></blockquote>\n<p>Couple <a href=\"https://www.amazon.com/Turning-Stone-Discovering-Subtle-Wisdom/dp/1250875897/?tag=braipick-20\" target=\"_blank\"><strong><em>Turning to Stone</em></strong></a> with <a href=\"https://www.themarginalian.org/2023/10/13/a-stone-is-a-story/\"><em>A Stone Is a Story</em></a> — a picture-book about geology as a portal to deep time — then revisit Robert Macfarlane’s magnificent <a href=\"https://www.themarginalian.org/2019/08/16/underland-robert-macfarlane/\"><em>Underland</em></a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"efa7b15ce930fd39ac95c03207123ed3b756c13842c37a76bb4eabe845cb63f1","category":"default"}