{"title":"Four years to prove ourselves","link":"https://blog.webb.page/2021-08-05-four-years-to-show-and-prove.txt","date":1628121600000,"content":"<p>The ICA (Internet Commerce Association) recently hosted a free webinar where\nthey discussed the second round of gTLD applications via ICANN. For reference,\nthe year is 2021 at this time of writing. The first and last round of gTLD\napplications happened in the anagram for this year: 2012; nearly a <strong>decade</strong>\nago. As noted by one of the panel experts (Jeff Neuman, Jothan Frakes,\nPhil Buckingham, and Christa Taylor were in attendance), the world was MUCH\ndifferent then. A notable example of such change was the mention of .crypto.\nApparently, it was considered but seeing as how the crypto space was still in\nits infancy, ICANN brushed it off. Depending on who you speak to today, crypto\nis EVERYWHERE; much to the chagrin of one of my security buddies. \"Crypto\" as\nshorthand used to mean \"cryptography\" but now it's been co-opted\nby cryptocurrency.</p>\n<p>The panelists think there will be even more interest in the next batch of\napplications, especially if ICANN reduces the cost of admission. Some\nsuggstions they discussed:</p>\n<ul>\n<li>knocking off $70,000…of the $185,000 entry price</li>\n<li>application fee floor</li>\n<li>eventual refunds from failed bids</li>\n</ul>\n<p>These are decent changes but ICANN is plagued by bueracracy and the snail-like\npace that typically commands. An oft-repeated refrain was, \"Yes, they (ICANN)\ncan move faster and implement what the community wants…but WILL they?\"\nAccording to someone in the chat:</p>\n<blockquote>\n<p>ICANN doesn't have significant numbers of registrars in underserved regions.\nThey keep putting obstacles in the way for registrars in those regions.</p>\n</blockquote>\n<p>And, another notable quote:</p>\n<blockquote>\n<p>ICANN working with community (members) requires a change in philosophy.</p>\n</blockquote>\n<p>ICANN's current way of making decisions is obviously long and drawn out and\naway from the public eye, until they've decided something.</p>\n<p>As I was listening to the discussion, I couldn't help but feel that Handshake\nhandled a lot of the problems the panelists discussed. Namely (hah), rolling\napplications and not letting other applicants aware of which names you intend\nto bid on. When Handshake was revealed to the public, a handful of names were\nreleased over the course of several weeks. Also, the way you bid on names is\nvia a Vickrey-style auction. In short, Vickrey-style auctions are anonymous and\nthe amounts bid can be a mixture of a true bid and a blind bid. You can find\nmore information here. In short, it aims to make auctions feel more fair.</p>\n<p>The conservative estimate for the launch of the secound round of gTLD\napplications is 2025. Four years from now. 13 years since the last round.\nTo me, this sounds a bit nutty. Insane even.</p>\n<p>The panelists suggested that anyone looking to get their own TLD via ICANN\nshould keep their expectations in check and be realistic. It takes a war chest\nof funds to keep going back and forth with ICANN to approve your application.\nWith that also comes an immense time commitment. They expect any name to take\nbetween 4-5 years to develop, but gave .music as an example that took nearly\n10 years to finalize.</p>\n<p>I see opportunity here.</p>\n<p>If you're an HNS maximalist/shill like myself, pro ENS, or a combination of the\ntwo, we have four years to kick ass and develop our ecosystems. Crypto took a\ndecade to get big, we can <em>easily</em> do it in half the time. We are in a unique\nposition to not only discover brilliant use cases unheard of on\nthe legacy ‘Net, but to also bring these experiences to the masses and\ngain that sweet traction.</p>\n<p>Four years to show and prove. Let's get it. 🕸</p>\n","author":"","siteTitle":"the webb blog","siteHash":"d87386c8de21b16d23a4d22ceb0991728c5b4e4486d627490c6fcde14e563300","entryHash":"f0d854b92ec2a4032b477627ab9a94df9fa23b34afdef19301f3566928bbbb5c","category":"Sites"}