{"title":"Why I left America","link":"https://sive.rs/left","date":1646784000000,"content":"<p>\nI was living on the beach in Santa Monica, California, and life was perfect.\nI was in paradise, and deeply happy.\n</p><p>\nFriends wanted to travel, but I had no interest.\nI had already lived a few years each in New York City, Boston, Chicago, Portland, and San Francisco.\nSanta Monica was perfect.\nI loved the weather, the people, the lifestyle, the business opportunities, and everything.\nIt was the best place on earth.\n</p><p>\nBut I always want to learn and grow.\nTo grow intellectually, you need to be surprised.\n<strong>\nIf we’re not surprised, we’re not really learning.\n</strong>\nWe may add new information, but not really update our understanding of the world.\nNo “Wow!”\nNo “Aha!”\n</p><p>\nTo keep learning and growing, we should always seek out new perspectives.\nAppreciate music, food, and experiences we initially dislike.\nRead about subjects we know nothing about.\nUnderstand people we disagree with.\nTake on new challenges.\nAvoid routine.\n</p><p>\nI started feeling like my happiness and <strong>comfort</strong> — my feeling that things here are the way they <strong>should</strong> be — might make me <strong>stagnate</strong>, plateau, or atrophy.\n</p><p>\nYes I could have forced myself to learn and grow from home.\nBut I’d be fighting the gravity that pulls me into my comfortable chair and routines.\n<strong>\nI wanted an environment that forces me to grow.\n</strong>\nSomewhere full of daily surprises, whether I seek them or not.\n</p><p>\nSo I forced myself to leave America.\nLeave my comfort zone.\nI considered finding new perspectives inside America, living in Texas, Louisiana, South Carolina, New Mexico, and Alaska.\nBut why the artificial boundary?\nWhy not Turkey, Nigeria, Finland, Indonesia, Israel, China, and Brazil?\n</p><p>\nPlaces have a living philosophy.\nI wanted to understand these different approaches to life.\nI wanted them to also feel like home.\n</p><p>\nSo I set off into the world, with that goal.\n<strong>\nMove to a place that feels strange, until it feels like home.\n</strong>\nConstantly learning and growing.\nThen do it again, pursuing discomfort, until the whole world is my home.\n</p><p><em>\nFor another side to this story, read “<a href=\"https://sive.rs/xus\">Why I let go of my U.S. citizenship</a>”.\n</em></p>\n<img src=\"/images/bigfish.jpg\" alt=\"scene from the movie Big Fish\" />\n<p><i>\n(This picture is from the movie “<a href=\"https://en.wikipedia.org/wiki/Big_Fish\">Big Fish</a>”, where at the beginning of the hero’s journey, he finds a paradise, and everyone there begs him to stay, but he says, “I’m sorry, I may never find a place this nice again, but I need to go out into the world and have my adventure.”)\n</i></p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f12213766111613c62fda002788f2fa3a82a97afbad73d751557ded02ca754fc","category":"Sites"}