{"title":"The Terrifying Project 2025","link":"https://kottke.org/24/07/the-terrifying-project-2025","date":1720474320000,"content":"\n        <p><a href=\"https://www.theguardian.com/commentisfree/article/2024/jul/06/trump-project-2025-robert-reich\">Former Secretary of Labor Robert Reich on Project 2025</a>, <a href=\"https://archive.org/details/2025_MandateForLeadership_FULL\">the extremist conservative plan</a> for America if Trump wins the 2024 election — a wish-list to continue their fascist takeover of America.</p>\n\n<blockquote><p>One key goal of Project 2025 is to purge all government agencies of anyone more loyal to the constitution than to Trump — a process Trump himself started in October 2020 when he thought he would remain in office.</p>\n\n<p>Trump has promised to give rightwing evangelical Christians what they want. Accordingly, Project 2025 calls for withdrawing the abortion pill mifepristone from the market, expelling trans service members from the military, banning life-saving gender affirming care for young people, ending all diversity programs, and using “school choice” to gut public education.</p>\n\n<p>Project 2025 also calls for eliminating “woke propaganda” from all laws and federal regulations — including the terms “sexual orientation”, “diversity, equity, and inclusion”, “gender equality”, and “reproductive rights”.</p>\n\n<p>Other items in the Project 2025 blueprint are precisely what Trump has called for on the campaign trail, including mass arrests and deportations of undocumented people in the United States, ending many worker protections, dropping prosecutions of far-right militias like the Proud Boys, and giving additional tax cuts to big corporations and the rich.</p>\n\n<p>Trump has repeatedly claimed that climate change is a “hoax”. Project 2025 calls for expanding oil drilling in the United States, shrinking the geographic footprint of national monuments, terminating clean energy incentives, and ending fossil fuel regulations.</p>\n\n<p>Trump has said he’d seek vengeance against those who have prosecuted him for his illegal acts. Project 2025 calls for the prosecution of district attorneys Trump doesn’t like, and the takeover of law enforcement in blue cities and states.</p></blockquote>\n\n<p>The 900-page document was prepared by Heritage Foundation, whose president stated recently on a right-wing podcast that “We are in the process of the second American Revolution, which will remain bloodless if the left allows it to be”. (This is the same logic used by abusers: “Why did you make me do that to you?”)</p>\n\n<p>[<a href=\"https://en.wikipedia.org/wiki/Project_2025\">The Wikipedia article about Project 2025</a> seems like a pretty good summary with lots of direct quotes and citations.]</p>\n\n<p>This all sounds sort of alarmist until you actually read what’s written in the document, like this passage on abortions:</p>\n\n<blockquote><p>Because liberal states have now become sanctuaries for abortion tourism, HHS should use every available tool, including the cutting of funds, to ensure that every state reports exactly how many abortions take place within its borders, at what gestational age of the child, for what reason, the mother’s state of residence, and by what method.</p></blockquote>\n\n<p>It’s like that old bit of <a href=\"https://www.oprah.com/oprahs-lifeclass/when-people-show-you-who-they-are-believe-them-video\">advice</a>: “When people show you who they are, believe them”. Conservatives are literally telling us their plans for exacting a fascist regime under Trump…we should believe them.</p>\n\n<p>More on Project 2025 <a href=\"https://www.theguardian.com/tv-and-radio/article/2024/jun/17/john-oliver-trump-second-term\">from John Oliver</a>:</p>\n\n<p></p>\n\n<blockquote><p>The consequences of Schedule F could be catastrophic for the government. As Jacqueline Simon, the policy director for the American Federation of Government Employees, put it: “There will be a massive exodus of competence.”</p>\n\n<p>“When you fire everyone who knows what they’re doing and only hire people who will say yes to the rich guy in charge, that’s not a recipe for good government,” Oliver added. “It’s a recipe for the Titan submersible.”</p>\n\n<p>With a civil service full of loyalty appointees, Trump wouldn’t need Congress to pass a national ban on abortion drugs, for example, when his head of the Food and Drug Administration could just rule them “unsafe” — a plan specifically outlined in Project 2025.</p></blockquote>\n\n<p><a href=\"https://www.edweek.org/policy-politics/what-would-happen-to-k-12-in-a-2nd-trump-term-a-detailed-policy-agenda-offers-clues/2024/03\">Education Week</a> simply states one of Project 2025’s goals: “The U.S. Department of Education would be eliminated.”</p>\n\n<p>Politico: <a href=\"https://www.politico.com/news/2024/02/20/donald-trump-allies-christian-nationalism-00142086\">Trump allies prepare to infuse ‘Christian nationalism’ in second administration</a>:</p>\n\n<blockquote><p>The Heritage Foundation’s Project 2025 offers more visibility into what policy agenda a future Trump administration might pursue. It says policies that support LGBTQ+ rights, subsidize “single-motherhood” and penalize marriage should be repealed because subjective notions of “gender identity” threaten “Americans’ fundamental liberties.”</p>\n\n<p>It also proposes increasing surveillance of abortion and maternal mortality reporting in the states, compelling the Food and Drug Administration to revoke approval of “chemical abortion drugs” and protecting “religious and moral” objections for employers who decline contraception coverage for employees. One of the groups that partners with Project 2025, Turning Point USA, is among conservative influencers that health professionals have criticized for targeting young women with misleading health concerns about hormonal birth control. Another priority is defunding Planned Parenthood, which provides reproductive health care to low-income women.</p></blockquote>\n\n<p>The Guardian: <a href=\"https://www.theguardian.com/world/2023/sep/15/project-2025-policy-manifesto-lgbtq-rights\">US hard-right policy group condemned for ‘dehumanising’ anti-LGBTQ+ rhetoric</a>:</p>\n\n<blockquote><p>Purveyors of pornography, Roberts writes, “are child predators and misogynistic exploiters of women. Their product is as addictive as any illicit drug and as psychologically destructive as any crime. Pornography should be outlawed. The people who produce and distribute it should be imprisoned. Educators and public librarians who purvey it should be classed as registered sex offenders. And telecommunications and technology firms that facilitate its spread should be shuttered.”</p></blockquote>\n\n<p>And I found these two pieces helpful in explaining the plan: <a href=\"https://www.bbc.com/news/articles/c977njnvq2do\">Project 2025: A wish list for a Trump presidency, explained</a> (BBC) and <a href=\"https://theconversation.com/friday-essay-project-2025-the-policy-substance-behind-trumps-showmanship-reveals-a-radical-plan-to-reshape-the-world-227161\">Project 2025, the policy substance behind Trump’s showmanship, reveals a radical plan to reshape the world</a> (The Conversation).</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Donald%20Trump\">Donald Trump</a> · <a href=\"https://kottke.org/tag/John%20Oliver\">John Oliver</a> · <a href=\"https://kottke.org/tag/politics\">politics</a> · <a href=\"https://kottke.org/tag/Project%202025\">Project 2025</a> · <a href=\"https://kottke.org/tag/Robert%20Reich\">Robert Reich</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"f21743fa860eeb8a2979fd132a02b9b1c05aed32411ff3fb61ab2f39e04f173e","category":"default"}