{"title":"Between Psyche and Cyborg: Carl Jung’s Legacy and the Countercultural Courage to Reclaim the Deeply Human in a Posthuman Age","link":"https://www.themarginalian.org/2024/03/29/jung-vs-borg/","date":1711758466000,"content":"<h3>“A reanimated world is one in which spirit and matter are not just equally regarded but recognized as mutually dependent.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/Jung-Borg-Finding-Deeply-Posthuman/dp/1736205714/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"480\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?fit=320%2C480&amp;ssl=1\" alt=\"Between Psyche and Cyborg: Carl Jung’s Legacy and the Countercultural Courage to Reclaim the Deeply Human in a Posthuman Age\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?w=1000&amp;ssl=1 1000w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?resize=320%2C480&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?resize=600%2C899&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?resize=240%2C360&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/03/jungvsborg.jpg?resize=768%2C1151&amp;ssl=1 768w\" /></a></p><p>“To be a human being among people and to remain one forever, no matter in what circumstances… that’s what life is all about, that’s its task,” the young Dostoyevsky exulted in <a href=\"https://www.themarginalian.org/2019/12/05/dostoyevsky-execution-life/\">a letter to his brother</a> just after his death sentence was repealed — death, that great clarifying force for what it means to be alive, what the stakes and sanctities of living are.</p>\n<p>In the two centuries since, our understanding of what it means to be human, to be mortal and imperfect and ablaze with feeling, has altered dramatically as we have entrusted the cold logic of computation with answering the soul’s cry for connection, for creativity, for meaning — something Dostoyevsky’s contemporary Samuel Butler anticipated in his far-seeing admonition against <a href=\"https://www.themarginalian.org/2022/09/15/samuel-butler-darwin-among-the-machines-erewhon/\">the dehumanization of humanity in the hands of our machines</a>, something that has metastasized in today’s technocratic cult of posthumanism.</p>\n<p>In <a href=\"https://www.amazon.com/Jung-Borg-Finding-Deeply-Posthuman/dp/1736205714/?tag=braipick-20\" target=\"_blank\"><strong><em>Jung vs Borg: Finding the Deeply Human in a Posthuman Age</em></strong></a>, Glen Slater bridges ecology, depth psychology, systems theory, and various post-Cartesian philosophies to explore how this civilizational cult has effected “a widening divide between fabrication and authenticity, a loss of more self-aware and soulful modes of living, and an increase in anxiety and depression,” and what we can do to rewild the psyche and reclaim the soul. </p>\n<p>He begins by drawing an analogy between <a href=\"https://www.themarginalian.org/2017/01/27/rachel-carson-silent-spring-dorothy-freeman/\">the catalytic impact of Rachel Carson’s <em>Silent Spring</em> on awakening the modern ecological conscience</a> and the need for a conscious awakening from the dangerous dream of posthumanism into which Silicon Valley has lulled us. Just as the industrial capitalism of Carson’s era commodified our planet’s ecosystems and elemental resources, Slater observes that digital capitalism has “turned our habits of mind into the earth’s most valuable commodity”; just as Carson pioneered the holistic view of ecology that may be our only path to saving Earth, her contemporary <a href=\"https://www.themarginalian.org/tag/carl-jung/\">Carl Jung</a> pioneered the holistic view of psychology that might, just might, save the human soul from death by commodification. </p>\n<figure><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2012/03/carljung.jpg?w=680&amp;ssl=1\" /><figcaption>Carl Jung</figcaption></figure>\n<p>Slater writes:</p>\n<blockquote><p>Whether or not we have turned the ecological corner, there is more consciousness about the way we relate to the world around us and the actions required to avert a climate catastrophe. </p>\n<p>However, the world <em>within</em> us, the inner life of thought and emotion, is another matter. Here integrative understanding has been resisted. The human psyche, the ecosystem of the mind, with its own structures and dynamics, our relation to which is surely as significant as our relation to the outer world, now faces its own significant disruption, one that essentially parallels the syndrome Carson described… The depths of human nature are becoming harder to recognize and protect. Abundant information has furthered scientific knowledge but not human understanding. It has instead left us dazed, confused, and disoriented. Attention, motivation, identity, self-image, and the capacity to reason clearly and imagine deeply are all impacted… While the advantages of digital technologies are impressed upon us at every turn, the rapid entry of these technologies into every aspect of life is evidently impacting our ecology of mind.</p></blockquote>\n<p>With an eye to the urgency of “moving beyond objectification of the earth and of the bodies and minds that inhabit it,” he adds:</p>\n<blockquote><p>The technosphere now overlays the ecosphere and we cannot help but inhale its post-industrial gases. Virtuality has begun to displace reality, making the ground of human existence hard to discern… The human psyche and the nature of the whole person are not only suffering in this technospheric environment, the suffering has itself been given over to technological solutions, resulting in a vicious cycle.</p>\n<p>[…]</p>\n<p>The penchant for digital ways of relating, expanding faith in AI, and the one-sided education designed to service these things are combining to generate reductive conceptions of psychological life. We are, in particular, discounting the deeply human… the essential qualities of human experience, which extend from the instinctual patterns that shape basic behavior to the timeless values that mold the cultural imagination. The deeply human anchors the vertical axis of inner understanding; it grounds the ecology of mind. It is also what connects us to the more-than-human. In our era, however, an almost exclusive dedication to a horizontal axis of data gathering threatens this verticality and grounding. This is leading to a world drowning in information and thirsting for understanding.</p></blockquote>\n<figure><a href=\"https://society6.com/product/primordial-chaos-by-hilma-af-klint-1906-1907_framed-print?curator=brainpicker\" target=\"_blank\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=680%2C946&amp;ssl=1\" width=\"680\" height=\"946\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=320%2C445&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=600%2C835&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=240%2C334&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=768%2C1069&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/09/hilmaafklint_primordialchaos_1906-1907.jpg?resize=1104%2C1536&amp;ssl=1 1104w\" /></a><figcaption><em>Primordial Chaos</em> by Hilma af Klint, 1906-1907. (Available as <a href=\"https://society6.com/product/primordial-chaos-by-hilma-af-klint-1906-1907_framed-print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/product/primordial-chaos-by-hilma-af-klint-1906-1907_cards?curator=brainpicker\">stationery cards</a>.)</figcaption></figure>\n<p>At the heart of this civilizational crisis is the systemic compartmentalization of our experience, evident in the core polarities and dichotomies of Western culture — past and future, inner and outer, matter and spirit. Pulsating beneath it all is our dissociation from the life of the body, which connects us to the life of the Earth and the life of the universe. Everything beautiful that we touch and see and hear — birdsong, a sunrise, a kiss — is a bittersweet reminder that we have a body and are therefore mortal. Dissociation thrives on <a href=\"https://www.themarginalian.org/2023/04/25/ernest-becker-heroism/\">the denial of death</a> that began with our ancestors’ mythologies of immortality and is culminating in Silicon Valley’s lurid and lucrative dreams of redesigning human nature, of downloading the mind onto disembodied machines and reducing the soul to a datum. </p>\n<p>Pointing to Jung’s timeless cosmogony of the unconscious as the antidote to this damaging delusion, Slater writes:</p>\n<blockquote><p>Jung’s comprehension of the depths of human nature constitutes an incisive counterpoint to the assumptions of posthumanism and to the dissociative bubble that presently fosters these assumptions… Jung sheds light on the self-regulating nature of the psyche and the archetypal forms behind this — forms we may choose to overlook but cannot ultimately dismiss. These forms pertain to brain structure, anatomy, and evolved patterns of perception and behavior. But they also reflect the larger rhythms of the cosmos and are seemingly woven into the fabric of life itself. Jung pointedly demonstrates that even as we have embraced reason and science, the archetypal world of non-rational impulses and religious ideas have continued to unconsciously influence our thoughts and actions.</p></blockquote>\n<p>Jung’s crowning contribution was to invite an understanding of the psyche as the foundation of all perception, experience, thought, feeling, and action — the wellspring of our humanity. In exploring the psychology of the unconscious with all of its interlaced convolutions — archetypes and complexes, projections and introjections — Jung illuminated the way our dreams and fantasies unconsciously shape the course of our lives, the way our arts and sciences cohere into a vast collective unconscious that shapes the course of our civilization. With an eye to Jung’s legacy, Slater writes:</p>\n<blockquote><p>It is the psyche that contains the pursuit of the angelic, the claims of the animal body, and the structures and dynamics that join the two. It is the psyche that generates and insists upon the symbolic expressions of culture, which are often based on the transformative and aspirational power of ordinary, even elemental, things — mountains and rivers, suns and moons, fire and rain — thereby reminding us of the inextricable bond between mind and world. If cosmic matter has given rise to consciousness, and we are now called to grasp the nature of consciousness, realizing that thinking about our thinking is the necessary companion of any exploration and understanding of the universe that surrounds us, our grasp of the inner world becomes just as vital as our grasp on the outer world — perhaps even more so.</p></blockquote>\n<figure><a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-1573_framed-print?curator=brainpicker\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=680%2C987&amp;ssl=1\" width=\"680\" height=\"987\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=320%2C465&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=600%2C871&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=240%2C348&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=768%2C1115&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2023/03/FranciscoDeHolanda11.jpg?resize=1058%2C1536&amp;ssl=1 1058w\" /></a><figcaption>Art by <a href=\"https://www.themarginalian.org/2023/03/08/francisco-de-holanda/\">Francisco de Holanda</a>, 1573. (Available as <a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-1573_framed-print?curator=brainpicker\">a print</a> and as <a href=\"https://society6.com/product/art-by-francisco-de-holanda-from-images-of-the-ages-of-the-world-1573_cards?curator=brainpicker\">stationery cards</a>.)</figcaption></figure>\n<p>Nearly a century after the Swiss poet, philosopher, and linguist Jean Gebser made <a href=\"https://www.themarginalian.org/2022/04/29/jean-gebser-the-ever-present-origin/\">his exquisite case for the evolution of consciousness</a>, Slater reflects on Jung’s legacy and writes:</p>\n<blockquote><p>Godlike power necessitates godlike responsibility. This begins with self-awareness, which is rooted in a sober consideration of the human psyche, the most critical part of which is shedding light on the shadow side of our willful pursuits… Will and reason alone cannot form a seat of wise agency — a far more expansive consciousness is required.</p>\n<p>[…]</p>\n<p>An expansion of consciousness is imperative if we are to make responsible use of the transformative power in our hands… With divine guidance largely beyond our secular vision, we are left to look within for something deeper than our controlling inclinations and to look without to perceive the guidance of nature’s intelligence. Guidance must ultimately come from dialogue with these marginalized sources of knowledge and from the cultural imagination, which shapes this dialogue. The result will be a “co-creation” — a partnership between innovation, self-knowledge, and a cosmology befitting this age. Such a co-creative process will mitigate and shape our technologies as well as generate opportunities for spiritual renewal.</p></blockquote>\n<p>Such co-creation, Slater argues, demands a reanimated view of existence — one that “counters the commodification of all things that is currently consuming us,” one that “conveys a confluence of spirit and matter — the very means by which a sense of soul is generated.” He writes:</p>\n<blockquote><p>A reanimated world is one in which spirit and matter are not just equally regarded but recognized as mutually dependent. The great task of this late modern era is thus to bring together what the spiritual preoccupations of the old world and the material focus of the new world have torn apart. The psyche shows us this dependency whenever a person or group attempts to embrace one without the other, in the way the neglected side begins to rule the unconscious… But the earth process itself suggests we rediscover nature as spirit as well as understand it as matter — nature as presence, intelligence, and root source of inspiration and imagination… Both mind and earth are calling for perspectives capable of marrying these dimensions of reality.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/arthurrackham_grimm5.jpg\" /></a><figcaption>Art by Arthur Rackham for a <a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\">rare 1917 edition</a> of the Brothers Grimm fairy tales. (Available <a href=\"https://society6.com/product/art-by-arthur-rackham-from-a-rare-1917-edition-of-the-brothers-grimm-fairy-tales_print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>Countering this fragmentation of reality requires, above all, learning to resist our dissociative tendencies and trust our emotions — for, as philosopher Martha Nussbaum observes in her <a href=\"https://www.themarginalian.org/2015/11/23/martha-nussbaum-upheavals-of-thought-neediness/\">masterwork on the intelligence of the emotions</a>, “emotions are not just the fuel that powers the psychological mechanism of a reasoning creature, they are parts, highly complex and messy parts, of this creature’s reasoning itself.” Slater considers the building blocks of this self-trust:</p>\n<blockquote><p>Such trust begins with a natural appreciation of emotional intelligence and the guiding potential of this intelligence, which can feel like it emanates from a will of its own. This trust may grow over a long time or it may come as a sudden life-lesson. But few things beyond the contemplation of emotional responses open the door to the deeply human and the awareness of having an inner partner [that] operates apart from conscious, rational direction. To be full of emotion is to be animated by something in spite of ourselves; perhaps this is why we end up regularly conversing with the sadness or anger that grips us. Emotions like these stand in need of negotiation, mollification or perhaps just more attention. Often, when we want to keep moving on, the emotions will not allow it. And sometimes when we would choose to hold back, emotions charge ahead.</p></blockquote>\n<p>Because our emotions are a fundament of our human nature, which is itself a fractal of Nature, they are the raw material for the co-creative process that offers an antidote to the dehumanization of humanity. Slater writes:</p>\n<blockquote><p>We are affected by desire for more satisfying ways of being, outrage about all that is regularly exploited and destroyed, fear of what stresses and overwhelms, and shame about participating in the machinations of it all. To consider the way emotion comes upon us, from a nature we call “ours,” all the while being a branch of Nature itself, calls into question whether these emotions even belong to us or to the sufferings of the world, and we are being directed to feel and respond on its behalf. In other words, our animation may be the world’s way of speaking to us, and thus be an indispensable dimension of the co-creative process. Recognition of the autonomous intelligence of these deep emotional responses may be an invitation to attune ourselves to the presence of the earth’s own intelligence — or intelligences.</p></blockquote>\n<p>It is the psyche that bridges these regions of intelligence, the inner and the outer, the human and the cosmic, death and life. Slater writes:</p>\n<blockquote><p>The psyche, which is obviously grounded in nature, also leads us beyond this ground, into a concern with destiny and leaving some trace of ourselves in service to humanity… We neither have to lean on notions of a spirit that literally departs the body, nor on fantasies of downloading our minds. Rather, we accept that the substance of psychic experience, accumulated over a lifetime, marks everything we do and everyone around us. And such a marking can be dreamed on. Life and death thus intertwine to produce defining qualities of being.</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?resize=680%2C887&amp;ssl=1\" width=\"680\" height=\"887\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?resize=240%2C313&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?resize=320%2C417&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?resize=768%2C1002&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2018/11/Velocity_Hilts.jpg?resize=600%2C783&amp;ssl=1 600w\" /></a><figcaption>Art by the Brothers Hilts from <a href=\"https://www.themarginalian.org/2018/11/20/a-velocity-of-being-letters-to-a-young-reader/\"><em>A Velocity of Being: Letters to a Young Reader</em></a>.</figcaption></figure>\n<p>In a passage evocative of James Baldwin’s soulful insistence that <a href=\"https://www.themarginalian.org/2022/01/31/james-baldwin-nothing-personal-love/\">“it is necessary… to know that in oneself, waiting to be found, there is a light,” and that “everything in our lives depends on how we bear the light,”</a> Slater adds:</p>\n<blockquote><p>The wonder of psychological life is that this dimming of the ego-light allows the perception of another light, one that has been in the background all along… Posthumanism brightens the ego-light, the light of the intellect and will that blankets the light of natural consciousness the wise ape presents to us. It fails to reconcile our spiritual reach and our instinctual ground. It cracks cultural vessels that have always incubated this reconciliation and truncates rather than extends the human experiment.</p></blockquote>\n<p>Lensing Jung’s legacy through the light of thinkers as varied as Hannah Arendt, William James, Yuval Harari, and Oliver Sacks, Slater goes on to explore and celebrate the countercultural movement in the margins of this techno-trance — ways of seeing and of being that, unlike posthumanism, refuse to exclude beauty, eros, and transcendence from the human story, a story told in the language of the soul, irreducible to data. Complement <a href=\"https://www.amazon.com/Jung-Borg-Finding-Deeply-Posthuman/dp/1736205714/?tag=braipick-20\" target=\"_blank\"><strong><em>Jung vs Borg</em></strong></a> with Iain McGilchrist on <a href=\"https://www.themarginalian.org/2023/05/10/iain-mcgilchrist-the-matter-with-things/\">how we render reality</a>, James Bridle on <a href=\"https://www.themarginalian.org/2023/01/26/james-bridle-intelligence/\">rethinking intelligence</a>, and Pierre Teilhard de Chardin on <a href=\"https://www.themarginalian.org/2023/05/06/the-heart-of-matter-pierre-teilhard-de-chardin/\">bridging the scientific and the sacred</a>, then revisit Jung himself on <a href=\"https://www.themarginalian.org/2021/12/07/carl-jung-next-right-thing/\">the most important paradigm for living</a>. </p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"f23b5dda231e935ce9cb235e9bf5ac62102a274ec90f679a625d01db6df49026","category":"default"}