{"title":"Life-Ruining Mistakes?","link":"https://kottke.org/24/04/life-ruining-mistakes","date":1714075202000,"content":"\n        <p>The other day, the novelist Robin Sloan mentioned in his <a href=\"https://www.robinsloan.com/newsletters/extinguish-a-star/\">newsletter</a> that he really liked the Financial Times. It seems everyone’s talking up the Financial Times lately, so I went and followed them on Instagram. </p>\n\n<p>The <a href=\"https://www.instagram.com/p/C5-c4i-tUxu\">first post in their feed</a> was for an essay by Janan Ganesh, about how although the American self-help industry makes it seems like most mistakes can be salvaged, <a href=\"https://ft.pressreader.com/article/282557318242321\">many are in fact unsalvageable and life-destroying</a>. An excerpt: </p>\n\n<blockquote><p>The sur­prise of middle age, and the ter­ror of it, is how much of a per­son’s fate can boil down to one mis­judge­ment.</p>\n\n<p>Such as? What in par­tic­u­lar should the young know? If you marry badly — or marry at all, when it isn’t for you — don’t assume the dam­age is recov­er­able. If you make the wrong career choice, and real­ise it as early as age 30, don’t count on a way back. … A big [mistake], or just an early one, can fore­close all hope of the life you wanted.</p></blockquote>\n\n<p>At first I found it oddly cheering (if I can’t fix my mistakes, I might as well relax and accept my circumstances), but then I found it sad. (Does my husband feel like he made a life-destroying mistake by marrying me? LMAO.) Now I’m more like ¯\\_(ツ)_/¯ because things can only ever go the way they go. Anyway, I’m not yet a FT subscriber, but it was a nudge.</p>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Financial%20Times\">Financial Times</a> · <a href=\"https://kottke.org/tag/Janan%20Ganesh\">Janan Ganesh</a> · <a href=\"https://kottke.org/tag/life\">life</a> · <a href=\"https://kottke.org/tag/mistakes\">mistakes</a> · <a href=\"https://kottke.org/tag/self-help\">self-help</a></p>\n\n        \n\n    ","author":"Edith Zimmerman","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"f287f71a47611268396961b3e2858e038225f0098b5709ac99ee62874a4a5227","category":"default"}