{"title":"Ang Bantayog","link":"https://chias.blog/2023/the-monument/","date":1695603156000,"content":"<span><span>Reading Time: </span> <span>10</span> <span>minutes</span></span>\n<p><em>On September 23, 1972, the dictator Ferdinand Marcos placed the Philippines under martial law.</em></p>\n\n\n\n<p>An expansive digital monument stretches before you, laying out 11,103 candles. Once a day, you are invited to light one and wait a moment, each candle representing a name from the HRVCB’s (inexhaustive) Roll of Victims. When lit, a name (at times, a life lost)–is revealed &amp; remember, the candle burning on to represent a life taken.</p>\n\n\n\n<p>‘The Monument’ is an internet art piece that speaks to memorials, mourning, and memory as experienced by machines and technologies. Dithered candles flood the screen under a fog as you scroll nearly infinitely, accompanied by a log of remembered names, soundtracked by an ethereal composition with loose whispers and the sounds of matches struck in the background. Utilizing the inherent nature of the browser and internet to create a networked experience for gathering, memorializing, and also forgetting—it exists to mirror the struggle of collective memory as experienced in the past 51 years since the imposition of martial law, more than to be a lasting marker or true spatial memory. Here, the website poses a monument as an infrastructural question: how do we gather, maintain, and remember, together?</p>\n\n\n\n<p>The monument lives on the URL <a href=\"http://ang-bantayog.com\">http://ang-bantayog.com</a>.</p>\n\n\n\n<h3>One and whole</h3>\n\n\n\n<p>There are two ways to experience the monument, ‘one’ and ‘whole’ – that alter how ‘memories’ are shared: collectively or locally.</p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"538\" src=\"https://chias.blog/wp-content/uploads/buo-1024x538.png\" srcset=\"https://chias.blog/wp-content/uploads/buo-1024x538.png 1024w, https://chias.blog/wp-content/uploads/buo-300x158.png 300w, https://chias.blog/wp-content/uploads/buo-768x403.png 768w, https://chias.blog/wp-content/uploads/buo-620x326.png 620w, https://chias.blog/wp-content/uploads/buo.png 1200w\" /></figure>\n\n\n\n<p>In the ‘whole’ version of the monument, memories are communally shared… When others light a candle, you’ll hear their match and remember a name, too.<br />A collective memory reaches farther.<br />⤥ <a href=\"http://ang-bantayog.com/buo\">ang-bantayog.com/buo</a></p>\n\n\n\n<p></p>\n\n\n\n<figure><img loading=\"lazy\" width=\"1024\" height=\"538\" src=\"https://chias.blog/wp-content/uploads/isa-1024x538.png\" srcset=\"https://chias.blog/wp-content/uploads/isa-1024x538.png 1024w, https://chias.blog/wp-content/uploads/isa-300x158.png 300w, https://chias.blog/wp-content/uploads/isa-768x403.png 768w, https://chias.blog/wp-content/uploads/isa-620x326.png 620w, https://chias.blog/wp-content/uploads/isa.png 1200w\" /></figure>\n\n\n\n<p>As one alone, it would take approximately 30 years for each candle to be lit: the magnitude of loss paced with the decay of human &amp; machine memory. As memory is saved within the browser localStorage, it is erased when the viewer’s (browser) history is cleared.<br />⤥ <a href=\"http://ang-bantayog.com/isa\">ang-bantayog.com/isa</a></p>\n\n\n\n<p><br /></p>\n\n\n\n<p><strong>Of memory and memorialization</strong></p>\n\n\n\n<p>Intentionally programmed &amp; designed to keep ‘defaults’ in mind, the monument operates within the environmental constraints of its technologies. For instance, ‘localStorage’ is used to store the ‘names remembered’, a form of data storage without expiration that is usually only erased when the user’s (browser) history itself is cleared. The website itself is accessible by a temporary domain (e.g. an equivalent to acquiring ‘property’ on the web, in exchange for a human-readable address in the URL). The enormity of victims and loss also make it nearly impossible for most machines to scroll past a few hundred candles, with most browser windows often shutting down. These mechanics are intentionally used as metaphors (often intimately analogous to their real-world equivalents), the limitations of machines not too different from those of man. While the common assumption is that technologies to be faultless and everlasting, in truth, they are often manufactured to be just as scarce, our hardware maybe just as fragile as our bodies. </p>\n\n\n\n<p><strong>Of digital space and revisionism</strong></p>\n\n\n\n<p>Beyond the organic decay of memory, we live in an era of intensified revisionism and political repression: a digital environment that contributed to the election of the ousted dictator’s son, Bongbong Marcos, who now sits as the 17th president of the Philippines. The internet coexists as a place of liberation &amp; of learning, and simultaneously one of immense loss &amp; repression. As technologies are reflections of human will &amp; of power, they have the potential to exacerbate real life inequities just as they do the power to redistribute agency and knowledge.</p>\n\n\n\n<p>The technologies used to program the monument represent the decay of memory, the burden of externalized knowledge wrought by the new digital era, the active potential of technologies to rewrite history situated within a post-colonial internet with militant origins. Most often, these manifest as questions of environments: of visibility, optics, and both tangible and social infrastructures that dictate how we commune, and remember. In the website as an exercise of visibility, we are moved to consider who and what we pay attention to (the monument asks every visitor to wait for at least a minute before participating in a lighting), how often we return (such as the candle lighting being limited to once a day), and whose lives are afforded the privilege of remembering.</p>\n\n\n\n<p>The monument is an imperfect site. By nature, it can never be a true ‘memorial’. <strong><em>Rather than a more lasting monument to memory, it will exist as another memory itself.</em></strong> It is perhaps more symbolic of the <em>struggle of memory</em>. It is transient, temporary, and tethered to the technologies it’s built upon—which falter more than man. What does it mean, to mourn and become in digital space? In between waking, remembering, and action, can we ‘never forget’ online? Perhaps the only way to combat the rate of decay is to collectively gather, and remember—as when the infrastructure that holds our memories fail, human hands might rebuild then.</p>\n\n\n<div>\n<figure><img loading=\"lazy\" src=\"https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x-680x1024.png\" width=\"340\" height=\"512\" srcset=\"https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x-680x1024.png 680w, https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x-199x300.png 199w, https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x-768x1156.png 768w, https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x-620x933.png 620w, https://chias.blog/wp-content/uploads/CleanShot-2023-09-24-at-17.52.11@2x.png 772w\" /></figure></div>\n\n\n<h3>Q&amp;A</h3>\n\n\n\n<p>Russell Ku of Rappler wrote <a href=\"https://www.rappler.com/nation/ang-bantayog-website-hopes-rethink-remember-martial-law/\">an article about Ang Bantayog</a>, but I also wanted to share the full question-and-answer I was sent over and wrote out here. </p>\n\n\n\n<p></p>\n\n\n\n<p>1. <strong>What was the process in making the “Ang Bantayog” website? How long did it take you to put this website together from conceptualization to publication? </strong></p>\n\n\n\n<ul>\n<li>I’ve long been making browser-based art, thinking about websites as a worlding exercise in investigating the environmental and infrastructural. As I’ve been physically distanced from the Philippines since coming to the US for college, I have been interested in treating websites as space, literally as <em>sites</em>, as a form of gathering &amp; social practice.</li>\n\n\n\n<li>‘Ang Bantayog’ was conceptualized and developed in April 2023 in response to my growing interest in digital preservation and memory, and the current administration &amp; political landscape that arose for lack of that. I developed an early version with candles flooding the screen in a seemingly infinite vertical scroll over two days, inspired by the layout of other martial law activations I’ve seen, from stone markers to activated street memorials. I reached out to Bantayog ng mga Bayani’s May Rodriguez &amp; Karl Ramirez in May via email to share the draft &amp; concept behind the piece to get their thoughts, and then picked up the site again around September 19th to develop both forms of ‘memory’ to speak to the shared labor of memory and the power of the collective against the degradation that any one individual might phase. I launched it soon after, purchasing the domain on the 20th.</li>\n</ul>\n\n\n\n<p>2. <strong>What were the challenges in making the website, especially given that you’re commemorating all 11,103 victims of human rights violations of Martial Law in the website? </strong></p>\n\n\n\n<ul>\n<li>The challenge was in understanding that this is not a true commemoration, that it would ever be an equivalent to a monument. A website positing itself as a memorial might be doomed; dwelling on the web itself means continuously losing access to one’s own past.<em> I’m creating something that by nature is designed for its own disappearance, as a memorial to those who have disappeared. </em></li>\n\n\n\n<li>My practice’s nature is about visibility and infrastructure, operating in full awareness that the sites I make, like those of early net art pioneers or community archivists (such as Mon Ramirez’ Arkibong Bayan), is always at this risk<strong>. I am most interested in commemoration as catalysts and interventions, and so this is an exercise of collective memory more than the impossible act of replicating memory itself. </strong>Preservation, of immaterial sites and of memory, is a [communal] act. Embracing the ephemeral, transient, and instability of the internet has made this piece a reflection of the past 51 decades of struggle to fight, remember, and convene—a continuation of the people’s struggle beyond just a passive recognition of an atrocity, as if long gone. It is a closer reflection to what people have struggled for before.</li>\n</ul>\n\n\n\n<figure></figure>\n\n\n\n<p>3. <strong>Why did you decide to focus on the 11,103 figure of state-recognized human right victims for the project, especially when Amnesty International notes there were 3,240 known extrajudicial killings, 34,000 documented tortures, 70,000 imprisonments, and 77 recorded disappearances? </strong></p>\n\n\n\n<ul>\n<li>The magnitude of terror and loss far exceeds the 11,103 names drawn from the HRVCB’s Roll of Victims. I scraped and drew from this list as it was important for me to highlight names on the website, akin to how names are etched on physical memorials, all while recognizing that it is inexhaustive. Even if these names represent just a fraction of an incalculable loss, I was struck by how few have record of life online, beyond their name on the roll on this one government website’s table. In a way, further circulation of their names in digital space–which is just as territorial and pervasive as real space–is one means of resisting their erasure. There’s an immense politic to who is remembered: who is visible, who receives the infrastructure for recognition–and who answers for this is in control of history, or the perception of it.</li>\n</ul>\n\n\n\n<p>4. <strong>What were the feelings you had when developing this website? What went through your mind as you went on with the project? </strong></p>\n\n\n\n<ul>\n<li>I make to connect: myself to the question of memory, to the struggle at home, to my own contentious relationship with my technologies. </li>\n\n\n\n<li>After the site’s launch, I keep a tab of the ‘whole’ version open at all times and hear the sound of a striking match every few minutes; I am glad to feel interdependent in the work of memory, and of recognition of our environments that work to repress it.</li>\n\n\n\n<li>Many times I scroll to a lit candle and try to look into the name presented, finding no record of their life online but a listing on the HRVCB’s website—which is the most heartsinking part. I hope for other records can further take on to continue recognizing these names for their courage, sacrifice, and people they were: instead of just the harm done to them ascribed by a seemingly arbitrary point system.</li>\n</ul>\n\n\n\n<p>5. <strong>You mentioned in your post that “[you are] thinking about the internet coexisting as a place of liberation &amp; of learning, and also of immense loss &amp; repression,” especially it’s also online disinformation that led to the election of the late dictator’s son to Malacañang, what do you think is the role of the internet in the present in helping people remember and never forget about Martial Law atrocities? </strong></p>\n\n\n\n<ul>\n<li>The internet was the source of my political awakening, as with many of my peers and mentors. It is also where I am fearful of seeing those around me, even my loved ones, succumb to extremism and hatred. As one of the most potent reflections of human behaviors &amp; will, the internet accelerates how we learn, but might also exacerbate divides.</li>\n\n\n\n<li>Infrastructurally and socially, the Filipino internet is not distributed or designed in a way that allows everyone to truly ‘learn’ or ‘remember’. Algorithmic feeds constrain access to a diversity of information &amp; tend to extremism and the manipulation of bad actors; many Filipinos face inequities in accessing adequate hardware &amp; connectivity, and corporate ‘free internet’ programs are distributed with nebulous intentions; local narratives &amp; community histories (such as that of many martial law survivors) often go under/undocumented on the internet, or if they are, might be suppressed and lack the avenues for apt distribution. This is what I think about in terms of ‘loss and repression’.</li>\n\n\n\n<li>I view the internet most as a tool and medium, thinking about it in its simplest roots for networking. It has potential as an archive, a place of discussion that transcends many (but not all) material limitations—but only when the internet becomes a more agentic place, one where its consumers are better equalized in distribution, authorship, in making it.</li>\n</ul>\n\n\n\n<figure></figure>\n\n\n\n<p>6. <strong>What do you think can Filipinos and other institutions can do to retain or instill collective memory of Martial Law? </strong></p>\n\n\n\n<ul>\n<li>Continuing to preserve physical &amp; digital artifacts, to steward folk &amp; local practices of networking, memory, and sharing, and to broaden often myopic viewpoints of who gets to be ‘remembered’, ‘preserved’ is crucial… Memory is a collective &amp; lifelong practice. To remember beyond physical (or digital) monuments, to remember even when there might be no record but the voice, to provide individuals alike the tools and funding necessary to understand and deconstruct the past, and to recognize that no one institution has authority over narrative… ultimately, it is in how each of us remember.</li>\n\n\n\n<li>The record is a tool for both oppression and liberation, and no database or flattened table of names is in itself a whole story: these are all merely structures to which we then form narratives that we tell each other to understand the past.</li>\n</ul>\n\n\n\n<p>9. <strong>I know that you are active in your “Philippine Internet Archive” initiative to combat revisionism and disinformation online, how is your project going? What are the challenges in taking on such a big step to archive the history of the Philippine internet and what are your plans for the future? Why did you decide to take on such projects in the first place? </strong></p>\n\n\n\n<ul>\n<li><em><strong>The ‘Philippine Internet Archive’ is a bit of a misnomer just like ‘Ang Bantayog’ is.</strong> </em>More than a traditional archive or collection, I’m working on it as a history of Filipino networking that decenters the internet’s militant, colonialist roots and instead looks equally at those who make its access possible: Pisowifi vendors, infrastructural maintainers, tech laborers, call center workers, and alternative media publications. I’ve been conducting interviews over the past 6 months (often at 5AM my time!), but majority of our efforts are centered on <a href=\"https://kakakompyutermoyan.com/\">Kakakompyuter Mo Yan!</a>, a digital exhibition commissioning 20+ artists for new media works, software, and performances that explore technology’s intersections. </li>\n\n\n\n<li>Living and ‘liberating’ myself online for as long as I could remember (I made my first website when I was 7 years old), I realized that I’ve been using websites as <a href=\"https://escapethealgorithm.substack.com/p/why-arent-there-more-websites-about\">an exercise to preserve myself</a> and all that I loved. To situate myself on the internet, to make myself seen, to embrace the labor of maintenance, hosting &amp; service, alongside all the transgressions of presentation and performativity have been my central questions. I’d like to dedicate my whole life to my nation, and this question is even further unresolved when you consider the internet’s relation with territorialization and erasure (I <a href=\"https://www.are.na/chia/on-domain-naming\">gave a talk in Copenhagen</a> last month on domain names, identity, &amp; colonialism), e.g. in the dissolution of democracies or even in national memories of the former Yugoslavia.</li>\n</ul>\n\n\n\n<p>10. <strong>Given the latest technological developments at the moment such as AI, how do you think technology can still help in helping people remember things that we’d not feel comfortable revisiting or to hold people to account, especially as I earlier mentioned that it has also led to the spread of disinformation? </strong></p>\n\n\n\n<ul>\n<li>Technology can help us be more agentic and discerning of our time and attention if wielded properly. Developments that blindlessly favor optimization &amp; the performant (such as algorithmic feeds, user-optimized content, some AI use cases) offload the work of scrutiny, discovery, and discernment to oft corporate interests that do not work in our favor.</li>\n\n\n\n<li>I’m more interested in traditionally antiquated technologies that do not seek to rewrite human behavior in the guise of augmenting it.</li>\n\n\n\n<li>Some people see technology as extensions of their body or mind. I suppose it is a question of whether it is the human that shapes their technologies, or the technology that is shaping the human—the latter of which always includes the question of the human in power behind that shaping.</li>\n</ul>","author":"Chia","siteTitle":"Chia's Blog","siteHash":"7dc353ea389a058fbb1ddc7e2759b1e898e00f950ae3e34f720ffa7cdc1bb916","entryHash":"f28bb190cdc336a76728c49d865a2805b01e9983cb58278f1b3fc52b74d13c3c","category":"Sites"}