{"title":"Trump is Unfit to be President","link":"https://www.usv.com/writing/2024/08/trump-is-unfit-to-be-president/","date":1722546376000,"content":"<p>Donald Trump is unfit to be the president of the United States of America. He is unfit to hold any public office. It boggles the mind that a number of investors and entrepreneurs have come out in support of Trump despite his obviously disqualifying character, which has been revealed time and again through words and actions. Sometimes there are hard choices to make when people are immensely talented but also deeply flawed. This is not one of those situations.</p>\n<p>Many years ago while on vacation we met some contractors from Atlanta. I casually said something along the lines of “oh there must have been a lot of work with Trump building casinos.” They replied to the effect of “we wouldn’t be here on vacation if we had worked for Trump – he’s bankrupted some of our best friends.” I asked them to elaborate and they explained that Trump would make small upfront payments to contractors telling them they would get paid fully upon work completion and then simply stiff them when the work was done. I thought to myself that surely someone couldn’t get away with that repeatedly but would get sued instead. But that is exactly what Trump had done again and again and it has been well documented .</p>\n<p>Stiffing contractors is emblematic of a man who all his life has gotten away with being a bad person. And knowing that he was able to do so because of his wealth and the power that comes along with it. Then even bragging about it, such as in the infamous “grab them by the pussy” tape where he repeatedly says “you can do anything .“Or when he said “I could stand in the middle of Fifth Avenue and shoot somebody and I wouldn’t lose any voters. ”</p>\n<p>Trump is a man who believes deeply that he is above everyone else and above the law. That this entitles him to do as he pleases. That might makes right. No surprise that such a man would do a 180 on issues if he believes it serves his purpose. And no surprise that he will not commit to accepting the results of the upcoming election and tried all sorts of shenanigans to stay in power following his defeat in the prior one.</p>\n<p>All of this is widely known. These aren’t alleged actions or rumored words. There are receipts all around and they would cover many pages of writing. How anyone can get past that and still believe that the issues they care about are worth supporting him is beyond me, even more so given that Trump has no record of keeping any commitments.</p>\n<p>Trump is unfit for any public office. And Trump most certainly is unfit to be the President of the United States.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/08/trump-is-unfit-to-be-president/\">Trump is Unfit to be President</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"f3992ea222915ab7e3fdd9b038f75e862e5465ddaf00019542e2b49faaf3c4b8","category":"default"}