{"title":"A simple model of AI and social media","link":"https://feeds.feedblitz.com/~/875353478/0/marginalrevolution~A-simple-model-of-AI-and-social-media.html","date":1712465705000,"content":"<p>One <strong>MR</strong> reader, Luca Piron, writes to me:</p>\r\n<blockquote><p> I found myself puzzled by a thought you expressed during your interview with Professor Haidt. In particular, from my understanding you suggested that in the near future AI will be able to sum up the content a user may want to see into a digest, so that they can spend less time using their devices.</p>\r\n<p>I think that is a misunderstanding of how the typical user experiences social media. While there surely are some brilliant people such as the young scientists you described during the episode who use social media only to connect with peers and find valuable information, I would argue that most users, alas including myself, turn to social media when seeking mindless distraction, when bored or maybe too tired to read of watch a film. Therefore, having a digest will prove unsatisfactory. What a typical user wants is the stream of content to continue.</p></blockquote>\r\n<p>I think these are some of the least understood points of 2024.  Let us start with the substitution effect.  The “digest” feature of AI will soon let you turn your feeds into summaries and pointers to the important parts.  In other words, you will be able to consume those feeds more quickly.  In some cases the quality of the feed experience may go up, in other cases it may go down (presumably over time quality of the digest will improve).</p>\r\n<p>We all know that if tech allows you to cook more quickly (e.g., microwave ovens), you will spend less time cooking.  That is true even if you are “addicted” to cooking, if you cook because of social pressures, if cooking puts you into a daze, or whatever.  The substitution effect still applies, noting that in some cases the new tech may make the cooked food better, in other cases worse.  In similar fashion, you will spend less time with your feed, following the advent of AI feed digests.</p>\r\n<p>Somehow people do not want to acknowledge the price theory aspect of the problem, as they are content to repeat the motives of young people in spending time with their feeds.  (You will note there is the <em>possibility</em> of a broader portfolio effect — AI might liberate you from many tasks, and you could end up spending <em>more</em> time with your feed.  I’ll just say don’t bet against the substitution effect, it almost always dominates!  And yes for addictive goods too.  In fact those demand curves usually don’t look any different.)  No one has to be a young genius scientist for the substitution effect to hold.</p>\r\n<p>Note that a majority of U.S. teens<a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://www.pewresearch.org/internet/2022/08/10/teens-social-media-and-technology-2022/\" target=\"_blank\"> report</a> they spend about the right amount of time on social media apps (8% say “too little time”) and they are going to respond to technological changes with pretty normal kinds of behavior.</p>\r\n<p>I think what has in fact happened is that commentators have read dozens of MSM articles about “algorithms,” and mostly are not following very recent tech developments, including in the consumer AI field.  Perhaps that is why they have difficult processing what is a simple, straightforward argument, based on a first-order effect.</p>\r\n<p>Another general way of putting the point, not as simple as a demand curve but still pretty straightforward, is that if tech creates a social problem, other forms of tech will be innovated and mobilized to help address that problem.  Again, that is not a framing you get very often from MSM.</p>\r\n<p>The AI example is also a forcing one when it comes to motives for spending time with social media feeds.  Many critics wish to have it both ways.  They want to say “the feed is no fun, teenagers stick with the feed because of social pressures to be in touch with others, but they ideally would rather do something else.”  But when a new technology allows them to secede from feed obsession to some degree, (some of) those same critics say: “They can’t/won’t secede — they are addicted!”  The word “dopamine” is then likely to follow, though rarely the word “fun.”</p>\r\n<p>It is better to just start by admitting that the feed is fun, and informative, for many teenagers and adults too.  Of course not everything fun is good for you, but the “social pressure” verbal gambit is a slight of hand to make social media sound like an obvious bad across all margins, and a network that needs to be taken down, rather than something we ought to help people manage better, at the margin.  If it really were mainly a social pressure problem, it would be relatively easy to solve.</p>\r\n<p>For many teens, both motives operate, namely scrolling the feed is fun, and there are social pressures to stay informed.  The advent of the AI digest will allow those same individuals to cut back on the social pressure obligations, but keep the fun scrolling.  Again, a substitution effect will operate, and furthermore it will nudge individuals away from the harmful social pressures and closer to the fun.</p>\r\n<p>As Katherine Boyle <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://twitter.com/KTmBoyle/status/1776278905420177483\" target=\"_blank\">pointed out on Twitter</a>, a lot of this debate is being conducted in terms of 2016 technology.  But in fact we are in 2024, not far from the summer of 2024, and soon to enter 2025.  Beware of regulatory proposals, and social welfare analyses, that do not acknowledge that fact.</p>\r\n<p>In the meantime, please do heed the substitution effect.</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html\">A simple model of AI and social media</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/875353478/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/875353478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/875353478/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/875353478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/875353478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/875353478/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comments\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a> \r\n<div><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comments\"><h3>Comments</h3></a><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comment-160740945\">In reply to Naveen K.   Are you starting to get the image that ...</a> <i>by Chris</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comment-160740944\">In reply to M.   You're an idiot if you think that means ...</a> <i>by chris</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comment-160740943\">In reply to M.    Advertisers probably don't want to be ...</a> <i>by Dino the Isaurian</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comment-160740938\">In reply to Hoosier.   Isn't M's point that automation can ...</a> <i>by Sand Wizard</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comment-160740936\">I stopped reading and keeled over laughing at the “addicted ...</a> <i>by Adrin</i></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/a-simple-model-of-ai-and-social-media.html#comments\">Plus 10 more...</a></li></ul></div><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/algorithmic-collusion-by-large-language-models.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=algorithmic-collusion-by-large-language-models\">Algorithmic Collusion by Large Language Models</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/generative-ai-for-economists.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=generative-ai-for-economists\">Generative AI for economists</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/04/your-subsidies-are-undercutting-my-subsidies.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=your-subsidies-are-undercutting-my-subsidies\">Your Subsidies are Undercutting My Subsidies!</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"f3dad855519e598480732e5eddb215f57144c1be46ef2d6db840de958833d74d","category":"default"}