{"title":"rats are surprisingly sweet pets","link":"https://sive.rs/rats","date":1731369600000,"content":"<p>\nI used to live in a basement apartment, next to the trash room.\nRats were often blocking my door, and I could hear them walking in the ceiling right above me as I slept.\n<strong>I hated them so much</strong> that I happily killed as many as I could, with no remorse.\n</p><p>\nMany years later, I saw my 5-year-old boy nurturing a ladybug at the playground, giving it so much love.\nI realized it was time to get him a pet.\nI called the pet store, and they recommended mice.\n</p><p>\n“Mice?!\nDon’t they bite?”\n</p><p>\n“No.\nThese are domestic mice, also known as ‘fancy mice’.\n<strong>\nWild versus domestic are as different as a wild dog versus a poodle.”\n</strong>\nThey are bred over many generations to be sweet companions.\n</p><p>\nSo we got mice, and they were wonderful.\nAs easy as goldfish, and much more fun.\nMy boy would carry his mouse in his pocket as we headed out into nature to play.\nWe built them homes, boats, and toys.\n</p><p>\nSo that was surprise number one.\nMice make great pets for kids.\nLow-maintenance, super-portable, perfect for playground attention, and a short lifespan.\n</p><p>\nA few months ago, our last mouse died.\nI was surprised how hard I cried - the hardest I’ve cried in my life.\nShe was such a big part of my boy’s childhood.\n</p><p>\nA few weeks later, he asked for a rat.\nMy arch enemy?\nI thought he was kidding.\nThen he showed me videos of pet rats being adorable - maybe even better than mice.\nOK.\n</p><p>\nWe adopted two twin brothers, which he named Cricket and Clover.\nThey look almost identical but I can tell them apart by their personality.\nFull of energy and wants to climb to my shoulder?\nThat’s Cricket.\nMellow and wants to cuddle in my armpit?\nThat’s Clover.\n</p><p>\nTurns out they’re even better than mice.\nMice can’t help where they pee and poo, but rats, like cats, save it for their litter box.\nRats are very trainable, so they can come when called.\nThey’re more attached and affectionate.\nThey have more personality, which then makes us more attached and affectionate, too.\nGo search for videos of pet rats, and you'll see.\n</p><p>\nMany times a day, I go cuddle them and kiss their bellies, and they lick my nose.\nThey’re wonderful.\n</p><p>\nAs much as I love these rats, <strong>my deepest joy is that I'm loving what I used to hate</strong>.\nCuddling what I used to kill.\n</p>\n\n<br />\n(That’s Cricket, licking my head. Who knows why.)","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f4448fbaa78f5bde874f1bcccfd2fdb6335b5f540504bae0cfb6b4f672a3dce5","category":"Sites"}