{"title":"The Reason Social Security Currently Has a Funding Shortfall","link":"https://kottke.org/24/08/the-reason-social-security-currently-has-a-funding-shortfall","date":1724182298000,"content":"\n        <p>For as long as I can remember, Americans have been concerned that the government’s Social Security program will run out of money by the time they get to use it because the Baby Boomers will suck the well dry. But as former Secretary of Labor Robert Reich explains, Social Security trustees planned for the Boomers <a href=\"https://robertreich.substack.com/p/an-easy-way-to-save-social-security\">but will face a shortfall in the next decade because of increased income inequality in the US</a>.</p>\n\n<blockquote><p>The Social Security trustees anticipated the boom in boomer retirements. This is why Social Security was amended back in 1983, to gradually increase the age for collecting full retirement benefits from age 65 to 67. That change is helping finance the boomers’ retirement.</p>\n\n<p>So what did the trustees fail to anticipate? Answer: the degree of income inequality in 21st century America.</p>\n\n<p>Put simply, a big part of the American working population is earning less than the Social Security trustees (including me) anticipated decades ago — and therefore paying less in Social Security payroll tax.</p>\n\n<p>Had the pay of American workers kept up with what had been the trend decades ago — and kept up with their own increasing productivity — their Social Security payroll tax payments would have been enough to keep the program flush.</p>\n\n<p>At the same time, a much larger chunk of the nation’s total income is going to the top than was expected decades ago.</p>\n\n<p>Here’s the thing: Income subject to the payroll tax is capped. Every dollar of earnings in excess of the cap is not subject to Social Security payroll taxes. This year’s cap is $160,200.</p></blockquote>\n\n        \n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Robert%20Reich\">Robert Reich</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"f494a6c33e0cb06e781ed25a730a778ad1c07a2c883995c41765f5237561d871","category":"default"}