{"title":"Wood Egg (my new company)","link":"https://sive.rs/eg","date":1370649600000,"content":"<p>\nLike everyone, I can get deeply curious about something, and dive in.\n</p><p>\nStarting five years ago, I got deeply curious about the differences between countries and cultures, fascinated with understanding the different perspectives.\nI talked about a few fun ones in <a href=\"http://www.ted.com/talks/derek_sivers_weird_or_just_different.html\">this 2-minute TED talk</a>.\n</p><p>\nSo two years ago, <a href=\"https://sive.rs/singapore\">I moved to Singapore</a>, and started visiting all the countries in Asia, asking dumb questions, making good friends.\n</p><p>\nGetting to know these countries is endlessly interesting.\nI want to understand them as well as I understand the 50 U.S. states.\n</p><p>\nBut my learning felt too unstructured.\nSo while walking around Yogyakarta, Indonesia, remembering “<strong>the best way to learn something is to teach it</strong>”, I came up with an ambitious plan.\n</p><p>\nI decided to produce and publish <strong>16 books per year on 16 countries in Asia</strong>:\nCambodia, China, Hong Kong, India, Indonesia, Japan, Korea, Malaysia, Mongolia, Myanmar, Philippines, Singapore, Sri Lanka, Taiwan, Thailand, and Vietnam. \n</p><p>\nSure, they wouldn’t be great at first, but I committed to <strong>improving them every year for many years</strong>.\nAfter a few years of doing this, they should be pretty awesome.\n</p><p>\nInstead of being all-encompassing, I decided to focus just on entrepreneurship: a network I was already tapped into, a good filter for understanding a country’s culture, and a subject that may be useful to others.\n</p><p>\nWhat to name it?\nThat only took a minute.\nI like <a href=\"https://seths.blog/2003/06/naming_a_busine/\">Seth Godin’s advice about naming</a>.\nThe Entrepreneur’s Guide?\nE… G…  Egg!\nGolden Egg?  Too cliché.\nWood Egg?  Yep!\nSounds like an exotic carved Thai or Indonesian treasure.\nGood enough.\n</p><p>\nI set up a Singapore corporation for it from my Yogyakarta hotel room that night in August 2011, and began the next day.\n</p><p>\nAnd now, <strong>after a year and a half of work</strong> — (and some hard lessons learned that I’ll write about soon) — <strong>they’re done!\nSo my new company is launched:</strong>\n</p>\n<p><strong><a href=\"http://woodegg.com/\">Wood Egg — the entrepeneur’s guides to Asia</a> (<a href=\"http://woodegg.com/\">woodegg.com</a>)</strong></p>\n<a href=\"http://woodegg.com/\"><img src=\"/images/wood-egg-450-450.jpg\" alt=\"wood egg\" /></a>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f495b9e140b38457142fbc1430657d4824a978265ceee175b599fdb680892781","category":"default"}