{"title":"The Deal","link":"https://www.usv.com/writing/2024/11/the-deal/","date":1732279581000,"content":"<p>Founders have little to no diversification. They are all in on one idea, company, and mission. It’s an insanely high-risk, high-reward endeavor. As founders become increasingly wary of this level of risk concentration, they begin to think about ways to mitigate it. One idea I’ve heard repeatedly is the notion that a group of founders can self-assemble and contribute a percentage of their equity in their company to a shared pool. That way, if they fail and one of the other founders in the group succeeds, everyone else can benefit to some degree. It’s a coordinated equity swap. I’ve heard this idea many times over, but I have yet to see it work in practice (although I am hopeful that someone can find a way to make this work for founders in either a programmatic or bespoke way).</p>\n<p>I have found a solution to this problem, and it has worked marvelously well. Whenever I tell people about it, they think it’s batshit crazy. But then they usually come around and see how unique, important, and beautiful it is. I think more people, founder or otherwise, should do it. Here’s the story.</p>\n<p>Steve Martocci and I have known each other for nearly twenty years. We built GroupMe together and when you found a company with someone you form a bond that stands the test of time. After GroupMe was acquired, our interests diverged. Steve had an idea for a company that would change the music industry, and I wanted to shake up the world of small business lending. But we knew we always wanted to work together and bet on each other no matter what.</p>\n<p>So we made an agreement. We would do all of our investing and company building together, even if we wanted to do totally different things. For every company I would start, Steve would own a meaningful piece of my equity/carry (e.g. ~15%), and vice versa. And for every investment we wanted to do, we’d always bring it to each other and offer to split it evenly. It has worked out , and we have been able to make concentrated bets with our time over the years building companies and now doing venture capital while diversifying risk.</p>\n<p>The neat thing about this agreement is that nothing is papered. It’s just a code we live by. I feel very lucky to have this deep sense of trust and respect with a partner like Steve. I acknowledge how rare it is. And I think more founders should try to find something similar. In the short term it might feel strange, but over the long term it’s extremely powerful economically, psychologically, and emotionally. This concept doesn’t just have to apply to founders, it could apply to anyone. Making bets and investments in people you admire and work well with produces returns that cannot be measured in cents or dollars.</p>\n<p>Founders have little to no diversification. They are all in on one idea, company, and mission. It’s an insanely high-risk, high-reward endeavor. As founders become increasingly wary of this level of risk concentration, they begin to think about ways to mitigate it. One idea I’ve heard repeatedly is the notion that a group of founders can self-assemble and contribute a percentage of their equity in their company to a shared pool. That way, if they fail and one of the other founders in the grou…</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/the-deal/\">The Deal</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"f50b3566219ccb55044b1b787d939c2b1a4df2eb149479145de3c9a1aa86c89d","category":"Sites"}