{"title":"Podcasting... good?","link":"https://www.garbageday.email/p/podcasting-good","date":1732735926000,"content":"<div><div><h2>Welcome To Panic World</h2><p>I will be brutally honest. I had basically given up on podcasting. I spent most of 2022-2023 sitting through endless pitch meetings with different podcast “companies” — many of which seemed to just be LLCs built around a single sad Gen Xer parked at his kitchen table recording true crime shows hosted by former <i>Office</i> cast members. They’d demand I make them pilots for free, send me off on wild-goose-chase reporting projects that went nowhere (also for free), and always, without fail, end our months-long situationship with “maybe we can pick this up again next quarter.” </p><p>Based on what I can tell, every podcast company has a window of about nine days each year where they can greenlight a new show and they don’t seem to fully know when that nine-day window might appear on their calendar. I never hit it, I guess. And I could get into the larger systemic issues that turned professional podcasting into a dog food factory, but the short answer is America’s massive radio conglomerates learned how to make non-linear radio shows that live on your phone faster than podcasting pioneers could figure out how to become advertising monopolies. So it goes.</p><p>All of this is why, when my now-producer Grant Irving reached out to me last spring about just making the show he and I had been kicking around, I told him in no uncertain terms: Absolutely fucking not. Luckily for Grant — and, I guess, luckily for me, as well — I have bad personal boundaries and also can’t resist making content. Which is how we ended up with Panic World. And, amazingly, our new little show crossed a couple big milestones this week. Ones we weren’t sure we’d hit by the end of the year.</p><p>First up, for the last three weeks, we’ve been consistently getting over 15,000 downloads a week, most recently cracking 25,000 a week. This was, actually, the only real goal we had set for ourselves with this first batch of episodes. We arbitrarily picked 15,000 as the number for our “ok, the show works” metric. But last week’s episode <a href=\"https://podcasts.apple.com/us/podcast/did-tumblr-turn-kids-trans-with-vera-drew/id1740187810?i=1000677594028&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">with Vera Drew</a>, director of <i>The People’s Joker</i>, was also our first episode to cross 10,000 downloads in one week on its own. We did have an earlier episode that outperformed that one, but it was our episode <a href=\"https://podcasts.apple.com/us/podcast/are-kids-brains-being-rotted-by-screens-with-michael-hobbes/id1740187810?i=1000670644262&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">with Michael Hobbes</a> and it was embedded on the homepage of <i>The Verge</i>, so we haven’t been counting that one. (That said, <i>Verge</i> editors, we love you, feel free to do that anytime.)</p><p>The last big milestone we hit this month is that our entire channel has crossed 100,000 total downloads. The fact we were able to do this in only 11 self-produced episodes is an amazing feeling. We honestly didn’t even have it on our roadmap.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/b6d1af87-fcb4-4474-acaf-a365d1a7d0e9/Screenshot_2024-11-27_at_12.46.28_PM.png?t=1732729606\" /><div><span><p>(Line go up, baby!)</p></span></div></div><p>The popular notion that podcasting is somehow easy is actually very wrong. You’re operating much more in the dark than you are with other kinds of digital media. For instance, with a given Garbage Day issue, if the open rate is bad, we can assume the subject line didn’t work. If we lose subscribers, we can assume the content or publishing frequency is bothering people. If the shares on social platforms are weak, the issue wasn’t very compelling. I could go on and on, but there are a ton of signals you can use to course correct and a bunch of opportunities to both grow — or lose — your audience. And podcasting is not like that. </p><p>Audiences are both more finicky and stickier, so it takes longer to build an audience and it’s slower to lose one, but it’s also much harder to pull out of a nose dive. And most podcasters will tell you that there comes a point in the lifecycle of a show where it plateaus and if that plateau happens before it’s profitable, well, you don’t have a ton of options to fix it. (This is essentially what happened with both of my previous podcasts, Internet Explorer and The Content Mines.)</p><p>But, for now, Panic World is growing and, even more miraculously, we actually enjoy making the show. Internally, we had been calling it “<i>Hot Ones</i> for internet rabbit holes” or “<i>Behind The Bastards</i> but chattier\" to prospective guests, but I think with our last couple episodes we’ve firmly found the show. I also think we’ve cracked a format for our <a href=\"https://patreon.com/panicWorld?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">bonus Patreon episodes</a>. We won’t be spamming the feed with them, but the two we’ve released seem to work and we’re aiming for about two a month. So the fact we not only like the show, but it’s also doing well according to every metric we decided to care about is, basically, a possibility I had never even considered.</p><p>Thanks to everyone who has listened so far. Thanks, again, to Grant for slowly manipulating me into doing something I did not want to do. To our business manager Josh Fjelstad and the podcast collective Multitude for helping us get some resources to launch with. To our indefatigable research Adam Bumas. To all our guests. It’s been a blast. If you’re looking for something to drown out the inevitable fights around the Thanksgiving table this year, <b><a href=\"https://podcasts.apple.com/us/podcast/panic-world/id1740187810?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">go check it out</a></b>.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/6aac2d8c-64af-46f4-9e67-07416bdef909/Stop_spam_calls_now_600x400.jpg?t=1732733736\" /></div><p><b>Silence Your Spam Calls Today</b></p><p>Garbage Day readers, you've probably — definitely — noticed an uptick in spam calls and texts this fall, right? Well, have you ever wondered how they get your info in the first place? It's data brokers! They sell your address, phone number, Social Security Number, family contacts, and more, to anyone willing to pay. And, yes, it's all totally legal. On the bright side, you can always opt out of these sites yourself and stop the spam. BUT... doing all that on your own is frustrating and can take hours.</p><p>That's why you should use <b>Incogni</b> instead. They'll remove your data from over 180 data brokerages and people-search sites automatically, so you can kiss spam goodbye.</p><p>Better yet, they're giving our readers 58% off with code DAYDEAL, <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">which you can use by clicking here</a>. Never worry about being tracked on the web again. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">Here's that link one more time!</a></p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2><span>A Hamlet-Ass Question</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/99e22ad0-7b20-459f-ba31-af1a77650399/Screenshot_2024-11-27_at_12.17.44_PM.png?t=1732727878\" /><div><span><p>(<a href=\"https://x.com/wife_geist/status/1861202181199650939?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">x.com/wife_geist</a>)</p></span></div></div><hr /><h2><i>Pod Save America</i> Surveys The Wreckage Of The Harris Campaign</h2><p>The <i>Pod Save</i> guys had members of Vice President Kamala Harris’ campaign team on the show this week and it has generated an INCREDIBLE amount of <a href=\"https://x.com/mikenellis/status/1861799026196156779?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">discourse</a>. Honestly, I actually think the episode is worth <a href=\"https://www.youtube.com/watch?v=dZOpWp02WVs&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">listening to in full</a> for the same reason I’d want to understand exactly how a car crash I was involved with happened, but it is maddening. Just one of the clips the show shared on X has been enough to generate a nuclear-level meltdown online.</p><blockquote><p></p><p>Harris Campaign Senior Advisor <span>@stefcutter</span> explains why Kamala Harris was unwilling to differentiate herself more from Joe Biden on policy. In an exclusive interview with PSA, top Harris campaign staff reflect on the 2024 election. Out now wherever you get your podcasts.… <span>x.com/i/web/status/1…</span></p><p></p><a href=\"https://twitter.com/podsaveamerica/status/1861534056929783827?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\"><p> — Pod Save America (@PodSaveAmerica) <br /> 10:14 PM • Nov 26, 2024 </p></a></blockquote><p><i>Pod Save America</i> host Dan Pfeiffer is also catching some flack for not doing any real pushback against the Harris staffers during the interview. I didn’t really mind because I walked away with the answers I, personally, needed, but I also understand why people are not exactly thrilled about the presentation of the episode.</p><p>Fellow <i>Pod Save</i> host Jon Favreau <a href=\"https://x.com/jonfavs/status/1861646134856286280?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">defended</a> the episode, writing on X, “I think people need to decide if they're genuinely interested in finding out what went wrong in 2024 so Dems can win again, or if they're just going to reject any data or information that doesn't confirm all their political beliefs.” There are a lot of <a href=\"https://x.com/glennylennox/status/1861681622262690220?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">good responses</a> as to why this episode doesn’t actually accomplish that, but I thought freelance Lisan al-Gaib Jack Schlossberg was particularly succinct, <a href=\"https://x.com/jbkschlossberg/status/1861766126398497213?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">writing</a>, “I think you need a permanent vacation :) SPIRITUAL WARFARE.” Not entirely clear what he means by that, but it <i>feels</i> right. Schlossberg has also <a href=\"https://x.com/Annie_Wu_22/status/1861824735912337766?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">taken the fight</a> over to Instagram.</p><p>Anyways, you should prepare yourself for more <i>Pod Save America</i> discourse. Hasan Piker <a href=\"https://x.com/hasanthehun/status/1861647425208770583?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">is now saying</a> that he’s going on <i>Pod Save</i> tomorrow, which, if true, possibly confirms that someone over at Crooked Media <a href=\"https://www.garbageday.email/p/where-is-the-lib-joe-rogan?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">is reading</a> Garbage Day 👀</p><hr /><h2>Apparently Around Half Of All The Long Posts On LinkedIn Are AI-Generated Now</h2><p>I mean, how can you tell? Humina humina humina.</p><p>OK, so, this comes <a href=\"https://originality.ai/blog/ai-content-published-linkedin?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">from a study</a> recently published by Originality AI, a startup focused on AI detection. And <i>WIRED</i> has a <a href=\"https://www.wired.com/story/linkedin-ai-generated-influencers/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">good writeup</a> of this, as well. First, they define a “long post” on LinkedIn as 100 words or more. They analyzed close to 9,000 of these long posts published between 2018 and 2024 and discovered almost a 200% increase in AI-produced content and a little over half of those posts contained AI-generated material.</p><p>This isn’t totally surprising, of course, if you’ve looked at any of the content on LinkedIn in the last couple years. It’s also not really clear if LinkedIn even cares. Even though the platform is trying to be a place for <a href=\"https://www.theinformation.com/articles/linkedin-is-news-publishers-new-best-friend?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">legitimate publishers</a>, it has also been very aggressive <a href=\"https://techcrunch.com/2024/10/29/linkedin-launches-its-first-ai-agent-to-take-on-the-role-of-job-recruiters/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">about integrating AI</a>. Which, taken together, makes me think LinkedIn is actually playing both sides here. If AI is the future of white collar work, they’ve got a slop factory ready to go. If, suddenly, people start reading and writing words online again, they have a bunch of news organizations set up on their platform.</p><hr /><h2>Is This The First Pig Squeal On National Television?</h2><p>Hardcore band Knocked Loose performed their song “Suffocate” on <i>Jimmy Kimmel Live</i> this week. You can check out a <a href=\"https://www.youtube.com/watch?v=XftvR3AwPvc&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">video of their full set here</a>.</p><p>Knocked Loose is easily the biggest thing in heavy music right now. And, more impressively, they’ve reached that level without watering their sound down. No clean vocals, no dip in aggression — in fact, their newest album is arguably their darkest yet. I’m not sure if young people still watch TV, so I can’t tell if Knocked Loose just activated a bunch of new young hardcore kids across the country with this, but it’s still a huge achievement for both the band and the genre. It’s also possible that this is the first time an earnest pig squeal vocal has ever happened on national TV.</p><p>While we’re on the subject of things being mainstream that have never been mainstream before…</p><hr /><h2>I Hadn’t Heard This Fandom Take</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@msaleshadiva?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\"> @msaleshadiva </a><p>#stitch with @luvlainey Thats why fandom hasnt been fun all of a sudden #fyp #tumblr #animetiktok #animefandom #fandomculture </p></section></blockquote><p>So I came across <a href=\"https://x.com/flickergguk/status/1861530715751408047?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">this video this week</a> and I think it’s a really interesting idea. I’m not sure I totally agree, but I wanted to pin it here, nonetheless. Essentially, TikTok user @msaleshadiva is arguing that during COVID lockdown a bunch of normal young people were bored enough to start getting interested in “weird kid” media — anime, alternative music, certain kinds of video games, etc. And @msaleshadiva believes this has directly led to an increase in aggression in online fandom spaces. Effectively, <a href=\"https://en.wikipedia.org/wiki/Eternal_September?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">Eternal September</a> for nerd culture. </p><p>I’ve been searching my own memories for when the switch happened — and I do think there has been a switch — and I think it was likely before 2020, but it’s possible that by 2020 the floodgates had opened at there was no going back. More thoughts on this soon!</p><hr /><h2>Please Don’t Do Poppers At <i>Wicked</i></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/15d3b1b6-7593-40dc-9c30-daf3b778289b/Screenshot_2024-11-27_at_12.37.59_PM.png?t=1732729103\" /><div><span><p>(<a href=\"https://www.reddit.com/r/wicked/comments/1h03yoa/poppers_during_wicked/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">r/wicked</a>)</p></span></div></div><p>A redditor noticed someone in their <i>Wicked</i> screening who appeared to be huffing poppers before every song. Garbage Day is pro-singing during <i>Wicked</i>, but we are not pro-huffing drugs in public during <i>Wicked</i>. Also, I saw it last night and there were a few people quietly singing in the audience (maybe even me 😌) and it was actually a lovely experience.</p><p>All that said, the film was visually awful to look at and the mixing of the score was barely karaoke level. It’s clear that most major studios now are producing movies for primarily for cell phones. Which is a shame because <i>Wicked</i> is wonderful — except for a sequence involving flying monkeys in the third act where the movie forgets it’s a musical. Also, as a life-long fan of the <i>Step Up</i> franchise, including <i>Wicked</i> director John Chu’s opus and the franchise’s peak, <i>Step Up 3D</i>, I highly suggest watching this scene if you want to see him really go off with proper sound design and color grading. <i>Wicked</i> riffs on it several times to much lesser effect.</p><hr /><h2>Mushrooms Are Serious</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/92c9dbc3-b2ff-43c6-b753-8fa131bb7861/Screenshot_2024-11-27_at_1.52.49_PM.png?t=1732733585\" /><div><span><p>(<a href=\"https://bsky.app/profile/weirdmedieval.bsky.social/post/3lbshzmhtwk2q?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">bsky.app/profile/weirdmedieval.bsky.social</a>)</p></span></div></div><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.theatlantic.com/politics/archive/2024/11/democrats-harris-billionaire-mistake/680779/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">“The Democrats’ Billionaire Mistake”</a></p></li><li><p><a href=\"https://embedded.substack.com/p/talking-talk-tuah-parody-podcast?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">“Meet the Talk Tuah super fans”</a></p></li><li><p><a href=\"https://www.thecut.com/article/what-is-a-khia-pop-music-slang-internet-explainer.html?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">“What, Exactly, Is a 'Khia' in Pop Music?”</a></p></li><li><p><a href=\"https://www.esquire.com/news-politics/a62875397/homelessness-in-america/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">“The Invisible Man”</a></p></li></ul><hr /><p>P.S. here’s some <a href=\"https://www.reddit.com/r/Ska/comments/1h0gdix/i_called_a_conservative_morning_show_and_talked/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=podcasting-good\" target=\"_blank\">very important ska content</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=eb5b6bb8-2007-402c-8b3c-547d541f6cf1&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"f5364e717794ace8555b3ee9ce9ec3967dedcbed4cda9354e87872e3b5833304","category":"Sites"}