{"title":"Why Walz was the perfect choice","link":"http://scripting.com/2024/08/10/155808.html?title=whyWalzWasThePerfectChoice","date":1723305488000,"content":"<p><img src=\"https://imgs.scripting.com/2024/08/10/dietMountainDew.png\" /><a href=\"https://en.wikipedia.org/wiki/George_Lakoff\">Lakoff</a> talks about the Nurturing Mother and the Strict Father as models for Democrats and Republicans respectively, and how the Dems never got this, and never campaigned accordingly. Now they're doing it. Owning the nuturing mother mode, but also the Protective Father, tough and angry when necessary, but a fun dad, a sweetheart. Biden was that, but we caught him too late in life for that to really flourish, hence the low approval ratings. </p>\n<p>I think we can afford now to ignore the NY Times et al. We don't just want freedom, we are free, now. That's what we're feeling. Now we're an army and we're ready to march. We're ready to fight and our weapons are our feet, our voices and our votes. This is why it's working. </p>\n<p>At first I didn't like White Dudes for Harris but now I get it. I saw a guy who'd normally I'd think of as a MAGA, in the crowd behind Kamala yesterday while she spoke, I thought yeah us old white dudes need permission to have sweet hearts. It's time for us to be happy too. Why the f not.</p>\n<p><a href=\"https://s3.amazonaws.com/scripting.com/2024/08/10/whyWalzPerfectChoice.m4a\">7-minute podcast</a>.</p>\n<p></p><div><img src=\"https://imgs.scripting.com/2024/08/10/oldWhiteMenCanHaveSweetHeartsToo.png\" />Models for the Protective Father with President Kamala. </div><p></p>\n<p>PS: Bush had the <a href=\"https://news.gallup.com/poll/4924/bush-job-approval-highest-gallup-history.aspx\">highest approval</a> in history after 9/11. 90%.</p>\n<p>PPS: In case it's not obvious, there are some old white dudes who overwhelmingly support Trump who might respond to the Protective Father position. </p>","author":"","siteTitle":"Scripting News","siteHash":"d6ad59631287cc248e52fdfe0c4f962c0fd08643d455b40f799700d8b2f97c65","entryHash":"f599ffb676e52cf11a2bb490b14b3dffee28ee28d9a801a552d423912df46a84","category":"default"}