{"title":"your art, ecosystem, and alchemy","link":"https://keningzhu.com/journal/art-ecosystem-and-alchemy","date":1728651032000,"content":" \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n    \n  \n    \n\n      \n\n      \n        <figure>\n          \n        \n        \n\n        \n          \n            \n          \n            \n                \n                \n                \n                \n                \n                \n                \n                <img src=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=1000w\" width=\"2388\" height=\"1668\" srcset=\"https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=100w 100w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=300w 300w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=500w 500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=750w 750w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=1000w 1000w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=1500w 1500w, https://images.squarespace-cdn.com/content/v1/51e8148de4b01c1eb79c1977/872332cc-fd27-4f88-9d72-a7d2f9366768/art%2C_ecosystem%2C_alchemy+10.11.jpg?format=2500w 2500w\" loading=\"lazy\" />\n\n            \n          \n        \n          \n        \n\n        \n      \n        </figure>\n      \n\n    \n  \n\n\n  \n\n\n\n\n\n  <p><em>reframings on </em><a href=\"https://keningzhu.com/entrepreneurship\" target=\"_blank\"><em>growing a creative business</em></a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p>this post is about the integration and interdependence of three practices:</p><ol><li><p>making art</p></li><li><p>sharing your work on the internet </p></li><li><p>having a business &amp; making money </p></li></ol><p><br />I’ll be reframing each practice as <strong>ART, ECOSYSTEM, and ALCHEMY</strong> work, and — in contrast to our ultra-compartmentalized, capitalist culture — I’ll explain how each practice is in deep, symbiotic relationship with each other. to embrace the interdependence of each practice is to deconstruct the dichotomy between art &amp; money; and resolve the tension between soul work and material survival. </p><p>these practices form the bridge and journey from the immaterial (art) into the material (money), and ultimately, give us permission to be our whole, embodied creative selves, at home in the world. </p><p>I’ll go through each of them, one by one. </p><p><br /></p><h1>art — your creative life source </h1><p><br />art is composed of your creative practices that nourish and feed your soul, your life, your internet presence, and ultimately, your business. art is the distillation of your core essence, your longings and curiosities, your sense of truth, what’s sacred, meaningful, and beautiful. it reflects your connection to spirit and inspiration. it is your thread, your lens, your portal to the world. </p><p>art is not about concrete products or outputs, but the long winding path you walk everyday — <a href=\"https://keningzhu.com/journal/the-process-is-the-way\" target=\"_blank\">your devotion to the process</a>. this process always leads you somewhere deeper, unexpected, or new. <strong>it is generative</strong> — you give it your life energy, then what you create will feed you back. always. </p><p>it is often so hard to remember to center your art practice — when it seems so disintegrated with the world of money and making a living. but if you think about business as about <a href=\"https://keningzhu.com/journal/business-as-honoring-creative-energy\" target=\"_blank\">the exchange of creative energy</a> (rather than just labor), then you’ll remind yourself that it’s the work of making art as <a href=\"https://keningonline.squarespace.com/journal/artist-entrepreneur\" target=\"_blank\">your integrated, whole self</a> — that allows you to show up in the world with something to offer. you’re able to give to others from your creative nourishment — with the nuance and full expressiveness of your individuality. it is your voice. </p><p>learning how to de-compartmentalize your artist self in your business practice is an ongoing practice. it begins with acknowledging that <strong>the practice of</strong> <strong>creativity is life source.</strong> you do it because it makes you more of who you are. it both <em>IS</em> your gifts and offerings, and amplifies your gifts and offerings to the world. like money, art is water. it feeds everything you have to give. it sustains life. </p><p><br /></p><h1>ecosystem — your digital presence as environment <br /></h1><p>ecosystem is how you share your work on the internet — the accumulation of your creative presence — not as a “<em>feed</em>,” but as a digital environment, a world, a garden of your mind that you invite others to wander through. <a href=\"https://keningzhu.com/worldbuilding\" target=\"_blank\">world-building</a> is about allowing your creative expression to inhabit a space on the internet. it is important that this be a space you own, rather than a social platform. <em>(see also: </em><a href=\"https://keningzhu.com/journal/the-internet-as-creative-practice\" target=\"_blank\"><em>the internet as a creative practice</em></a><em>)</em> </p><p>an ecosystem invites others to come to you, to spend time in your world, rather than you entering the stream of their content feed. </p><p>if the process of <strong>art</strong> begins as something private and personal — then the <strong>ecosystem</strong> are those processes made public. it is a public notebook of your musings, sketches, notes, thoughts, writings, and finished creative work. it is a garden for your ideas and collected inspirations. here, you can also share your insights and perspectives around the topics or ideas you work with, inside your business. </p><p>an ecosystem is composed of all the containers or channels where you share your work. I think about the website as the multi-form, master vessel — the place that holds everything you have to share, in all mediums or forms. <br /></p><p><strong>FORMS</strong><br />writing<br />visual<br />audio / podcast<br />video <br />newsletter<br /><br /><strong>TOPICS</strong><br />art<br />ideas<br />process<br />inspiration &amp; curations<br />personal life  <br />… <br /></p><p>an ecosystem is <em>everything</em>. the accumulated forms, ideas, topics, themes — as well as the digital threads that move you, from one node of your web of ideas, to another. consider also which elements live primarily in <em>your</em> digital universe — vs. which ones exist as satellites or space colonies, elsewhere. (ie, <em>podcasts</em> on Spotify/Apple, <em>writings</em> on Substack.) </p><p>Substack tries to be a one-stop solution for building a multi-form ecosystem <em>(as newsletter x podcast x blog x website)</em> — in that you have a “web home base” AND you have direct access to people’s inboxes AND you have a sense of community through comment threads. but remember that Substack is a platform, and I find it hard to trust platforms. (for more on this, see: <a href=\"https://keningzhu.com/journal/the-joy-of-missing-out-on-platforms\" target=\"_blank\">the joy of missing out on platforms</a>). </p><p>the most important thing to remember about growing an ecosystem is that <strong>it thrives through slow, deliberate accumulation</strong>. you must plant, tend, and garden it, over time. then, the ecosystem will become a digital space that feeds you, and your guests. when you have an ecosystem, you won’t need <a href=\"https://keningzhu.com/journal/your-website-is-not-a-brochure\" target=\"_blank\">your website to be a brochure</a>, and you won’t need a marketing funnel to sell, because by then, <a href=\"https://keningzhu.com/journal/build-a-labyrinth-not-a-funnel\" target=\"_blank\">you will have grown a labyrinth.</a></p><p><br /><br /></p><h1>alchemy — your offerings for guiding change <br /></h1><p>alchemy is about facilitating change, growth, evolution, or transformation in another. alchemy is what we do when we offer services or products of any kind. </p><p>I’m using alchemy to describe any business container or offering — <em>client work, group work, courses, workshops, books, zines...</em> anything that you give to others in exchange for money, with the intention to help them navigate a shift in their lives. </p><p><strong>they are crossing a river, and your alchemy work is the boat.</strong> </p><p>we buy things <em>because</em> we want change. we invest in things because we want to deliberately steer life in the direction of our dreams and desires. money is the energetic medium that facilitates change — it might seem like “the goal” of a business, but it is only a side effect; a byproduct in alchemy work. when you spend money on an offering, you’re inviting someone to help you. when you offer something for money, you’re inviting others on a journey or adventure; extending a hand and saying, <em>“I can guide you across this river.”</em> </p><p>it is important to know that your alchemy work is sacred, and <strong><em>not</em></strong> for everyone. in fact, the more specific you can be inside your ecosystem, the more likely it is that you can attract the right people for your offerings. when I specific, I mostly mean: being your most un-inhibited, essential self — and trusting that <em>not only is that enough</em>, your truth is what will draw people in. </p><p>I know that this all might sounds vague and hard, but <strong><em>it all begins with the creative practice</em></strong>. it starts with art. it’s about letting your creative psyche take up space in your life — then allowing it to take up space in the digital world, through an ecosystem you grow — then, through that ecosystem, you magnetize the right people into your world. those are the people our gifts are meant to serve. </p><p>and of course, the alchemy work we offer others is <em>always</em> a direct result of alchemy work we’ve gone through ourselves. it is the fruit of our ecosystems; the most focused, potent, concentrated distillation of our power. if the ecosystem is our public gardens, then our offerings are the medicinal plants and bottled potions. we’ve spent our entire lives gathering, brewing, and refining it. </p><p>we serve others with our alchemy <em>because</em> we have served ourselves. in an interconnected universe of souls, everyone I serve is a part of me, and I am a part of everyone I serve. this applies not just to alchemy, but to everything. </p><p></p><p></p><h1>an interdependent process</h1><p> </p><p><strong>art</strong> is the processes of feeding and sustaining your creative life source through creative practice, in whatever forms and mediums you do it.  </p><p><strong>ecosystem</strong> is the accumulated expressions of your creativity — in a digital environment you own. it <em>is</em> your art, but also expands beyond your art, as a public garden of your creative mind. it is a container that holds your spirit, ideas, and ways of seeing the world, where you invites others to wander through. </p><p><strong>alchemy</strong> is the change and transformation that you guide in others — through containers of offerings, as services or products. it represents the gated inner gardens of your digital labyrinth. those that embark on the journey with you choose you <em>because</em> of your ecosystem and your creative force. they give you money as a part of the invitation, and you use this money to feed back into your life, and thus, back into your art. </p><p></p><h1>art &amp; money as life-giving </h1><p>if we think about the equation this way, then money and art serve similar purposes, in that they both feed and sustain your life. they are yin and yang in that they seem like opposites, but instead, counterbalance one another. </p><p>in our capitalist world, we’ve been taught to value one over the other — to believe that only money is real and art is for luxury hobbyists and idealist dreamers. but we forget that <strong>it is <em>always</em> the immaterial that creates the material.</strong> art makes money — not as a transactional exchange, but as a messy process of harnessing creative energy, and directing it into ecosystem and alchemy work. this is the work of sharing our creative energy with the world — and allowing that energy to come back to us, to water our worlds, again. </p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n<hr />\n\n\n  <p><strong>see related: </strong></p><p><a href=\"https://keningzhu.com/journal/business-as-honoring-creative-energy\" target=\"_blank\">honoring your creative energy in business</a><br /><a href=\"https://keningzhu.com/journal/artist-entrepreneur\" target=\"_blank\">the way of the artist entrepreneur</a><br /><a href=\"https://keningzhu.com/journal/my-business-is-a-hammock-i-weave-by-hand\" target=\"_blank\">my business is a hammock i weave by hand</a><br /><a href=\"https://keningzhu.com/journal/web-world-as-water\" target=\"_blank\">web world as water: digital ecosystems that give life</a></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n\n\n\n  <p><em>💌 I write a weekly newsletter on creative alchemy called </em><a href=\"https://buttondown.email/keningzhu?tag=guide.notes\" target=\"_blank\"><em>guide.notes</em></a><em>. Find me also on my podcast: </em><a href=\"https://keningonline.squarespace.com/podcast\" target=\"_blank\"><em>botanical studies of internet magic</em></a><em>.</em></p>\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n  \n\n\n\n ","author":"Kening Zhu","siteTitle":"kening zhu","siteHash":"ef8a94b9fc20c32a4ee7d94ee971337d278e8b2fafe747123e4eb5cea026e84e","entryHash":"f64665d52baf931b82e4afe1146967cd2877cbf2820b131af872a3f993c9394e","category":"Sites"}