{"title":"USV Microfiche #5","link":"https://www.usv.com/writing/2024/11/usv-microfiche-5-2/","date":1732110349000,"content":"<p>Human-powered and AI-curated, Microfiche is a 90-second sprint through the last month at USV. From our early conversations to signed term sheets, we cover the full scope of our work. Here’s what caught our eye this month. We’d love to hear what’s caught yours.</p>\n<p>**Think reading is for robots? You can listen to this newsletter as a podcast .</p>\n<p>Early Conversations</p>\n<p>Join our conversation around some ideas we’ve been throwing around. We’d love to hear why we’re wrong.</p>\n<p>1/ Decentralized Networks as a Counterbalance to AI Centralization : The team explored the potential for decentralized technologies to shape the future of AI. They discussed how crypto networks could create more transparent and equitable models of data ownership and control, incentivize the development of open-source AI models and tools, and foster a more decentralized and resilient AI ecosystem. This discussion reflects a growing awareness of the potential risks associated with the concentration of AI power in the hands of a few large companies. It suggests that decentralized technologies could offer a counterbalance to this trend, empowering individuals and communities to participate in the development and governance of AI systems.</p>\n<p>2/ The Future of Healthcare : A Shift Towards Empowerment and Personal Responsibility – The team reflected on the evolving landscape of healthcare, particularly in the context of a more deregulated environment. The discussion centered on the potential for increased individual agency in navigating health decisions, moving away from a reliance on established institutions and consensus-driven approaches. This shift could empower individuals to take greater control of their health, but also raises concerns about navigating a potentially confusing and even dangerous marketplace of ideas.</p>\n<p>3/ You Don’t Change the World by Selling to Incumbents : We reflected on a core principle of our investment thesis: transformative change comes from the edges, not the center. Selling to incumbents often means adapting to their constraints, which can dilute the disruptive potential of new ideas. True innovation happens by empowering challengers and building outside established systems, where social and technological forces can reshape entire markets. If our goal is to back the forces that will redefine industries, partnering with incumbents is not the path forward.</p>\n<p>4/ Uncorrelated Bets Matter: The discussion centered on the importance of understanding the wide range of possible outcomes in AI and making strategic bets across those scenarios. Some argued that heavily investing in foundational models carries high risk, especially with increasing competition, while others saw the need to place bets on more niche applications—like healthcare or materials—where unique data can create defensibility. The consensus was that spreading investments across uncorrelated sectors helps hedge against uncertainties and ensures exposure to various success scenarios, even as the market evolves unpredictably.</p>\n<p>5/ The Impact of AI on Content Creation Businesses : The rise of AI challenges content creation businesses, particularly those without strong network effects. The team notes these companies risk disruption as AI tools replicate their output. To survive, they must build ecosystems where value grows as more users join. Strong network effects, distribution advantages, and community differentiation are critical to staying competitive in a landscape where AI is rapidly commoditizing content.</p>\n<p>Further Discussions</p>\n<p>Stuff we’re actively doing and looking for.</p>\n<p>1/ Data Springs by Grace Carney</p>\n<p>2/ Low Fi Computing by Nick Grossman</p>\n<p>3/ How USV Built an AI Brain for Venture Capital featuring Matt Cynamon</p>\n<p>4/ Product-Bot Fit by Jared Hecht</p>\n<p>5/ The Beba Case: An Amicus Podcast featuring Samson Mesele and NotebookLM</p>\n<p>Recent Investments</p>\n<p>Glow Protocol – DePin at the edge of energy markets.</p>\n<p>Supp – A network empowering confident self-directed health, starting with supplements​​​​​​​​​​​​​​​​.</p>\n<p>Company Updates</p>\n<p>Stuff thats happening in the real world.</p>\n<p>1/ Anthro Energy received a $25m Federal grant to open the first US Owned advanced electrolyte production facility , a critical component in the future manufacturing of EVs.</p>\n<p>2/ Sling has officially launched in the U.S ., enabling instant, borderless payments.</p>\n<p>3/ Rupa was acquired by Fullscript , accelerating the company’s vision of providing a new model for practicing whole person medicine at scale.</p>\n<p>4/ Viam Robotics was named the official AI technology provider of the New York Islanders and UBS Arena .</p>\n<p>5/ Greg Brown, CEO of Udemy, has joined the board of Splice.</p>\n<p>Special Note</p>\n<p>The whole USV team will be visiting SF at the end of January. Drop us a line if you’d like to get together.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/usv-microfiche-5-2/\">USV Microfiche #5</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"The Librarian","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"f67c1ac058f82bfbc65be77ed12593c898e94c5cf9e31dd4dcab0d44d5880ae7","category":"Sites"}