{"title":"Daily run, part two","link":"https://sive.rs/run2","date":1666915200000,"content":"<p>\nIn my previous post, “<a href=\"https://sive.rs/run\">a daily run</a>” — (please <a href=\"https://sive.rs/run\">read it first</a>) — <strong>running was a metaphor for whatever actions you take in your life.</strong>\nThe story is about how we choose beliefs because they’re <strong>useful, not true</strong>.\n</p>\n\n<h2>\nBeliefs make emotions.\nEmotions make actions.\n</h2>\n<p>\nActions come from emotions.\nEmotions come from beliefs.\n<strong>\nSo choose whatever belief makes you take the action you want.\n</strong>\n</p><p>\nPicturing one future makes you quit.\nPicturing another future makes you jump out of bed, full of inspiration and action.\nA single thought can exhaust you or motivate you.\n</p><p>\nOne belief makes you act selfish.\nAnother belief makes you act generous.\nOne thought makes you do something stupid.\nAnother thought makes you do something smart.\n<strong>\nWhat matters is the action they create.\n</strong>\nSo choose the thought that works for you.\n</p><p>\nIn <a href=\"https://sive.rs/run\">the story</a>, picturing a pot of gold, or a tiger, or hot coals, made real improvements in the runner’s actions.\n</p>\n\n<h2>\nAdopt beliefs for your current needs only.\n</h2>\n<p>\nWhat works for others might not work for you.\nWhat you needed yesterday might not be what you need today.\nLife is nuanced.\nChoose your goals and beliefs only for how they help you <strong>now</strong>.\n</p><p>\nLast week, my over-confidence was getting in the way of my learning.\nSo I chose to believe <a href=\"https://sive.rs/below-average\">I’m bad at this</a> and have a lot to learn.\nThis week it’s time to perform, so to summon the courage, I choose to believe I’m <a href=\"https://sive.rs/book/AlterEgoEffect\">great at this</a>.\nNeither belief is true, but I adopted them because they helped me take the right actions.\n</p><p>\nDrop beliefs that aren’t helping you anymore.\nIgnore social pressure to be the way you used to be.\n</p><p>\nIn <a href=\"https://sive.rs/run\">the story</a>, picturing a pot of gold didn’t work well in the past, but later worked great during a different situation.\n</p>\n\n<h2>\nAdopt beliefs just for fun, to try different ways of being.\n</h2>\n<p>\nDon’t over-focus on the usual goal.\nTake your eyes off the prize and look around.\nCreative experiments, curiosity, and adventures are fun.\n<strong>\nFun is always a legitimate and underrated goal.\n</strong>\n</p>\n\n<h2>\nDifferent beliefs serve different goals.\n</h2>\n<p>\nGurus and pundits prescribe their beliefs.\nBut their prescription might only apply if you have a very specific situation and destination.\n<a href=\"https://sive.rs/advice\">Advice</a> should come with this disclaimer.\n</p>\n\n<h2>\nDon’t care whether something is true — only whether it works for you.\n</h2>\n<p>\nWhen you declare a belief to be <strong>true</strong>, it closes minds, cements identities, and leads to tribal fights with anyone who doesn’t find that belief to be true <em>for them</em>.\n</p><p>\n<strong>\nBeliefs are a means to improve actions.\n</strong>\nTo say that one belief is the best — that one is right and others are wrong — is ignorant of the purpose of beliefs, and the nuanced differences in people’s current needs.\n</p>\n<hr />\n<p>\nI’d love to hear your thoughts on this subject, and how the explanation could be improved.\nThis will probably be the topic of my next book.\n</p>\n<figure><img src=\"/images/run.jpg\" alt=\"trail through forest\" /><figcaption>photo © <a href=\"https://www.flickr.com/photos/72616463@N00/38672745471/\">Josephine Stenudd</a></figcaption></figure>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f7d9b994e5e391a80057c73fd77b016897fdb7c13f1225563271e02ac301b8aa","category":"Sites"}