{"title":"Minimalissimo, R.I.P.","link":"https://om.co/2024/10/16/minimalissimo-r-i-p/","date":1729093549000,"content":"<p>I discovered Minimalissimo 15 years ago, literally on the day they started publishing. It became part of my RSS reader. It found a home in a folder called “The good stuff,” which had many such websites and blogs. These were aesthetics-oriented online destinations. Many of these sites are gone — becoming irrelevant with age. Others migrated to Instagram. Yesterday, Minimalissimo announced that they too will stop publishing.</p>\n\n\n\n<p>“The site is in archival mode,” the founders <a target=\"_blank\" href=\"https://minimalissimo.com/articles/2009-2024\">wrote on the website</a>. “The plan is to keep it up and preserve all the content that was posted throughout the years, but we’re not going to update it further.” It is a wonderful repository of “the finest examples of minimal architecture, art, interior, furniture, lighting and product design.” The site features 4,000 projects and more than 30,000 images.</p>\n\n\n\n<p>They will continue to publish their monthly newsletter. Something they wrote <a target=\"_blank\" href=\"https://buttondown.com/minimalissimo/archive/minimalissimo-edited-2670/\">in the most recent issue</a> made me pause and wonder about the general direction of “writing” and “websites.”</p>\n\n\n\n<blockquote>\n<p>As you might have noticed, the web is going through quite the odd phase lately. More and more sites are shutting down — even very old, established ones — and search is getting progressively worse. There was a time, back in the late 2010s, when sites like Minimalissimo were playing an important role in the web ecosystem and thousands of people were visiting the site daily. Over time though, that audience slowly drifted away. Consumption shifted, from websites to social media. We followed the flow and did our best to adapt to an evolving landscape while trying to remain true to our values.</p>\n</blockquote>\n\n\n\n<p><a href=\"https://carlbarenbrug.com/15-years-of-loving-curation\">A note on</a> Carl Barenbrug’s blog accurately points out the web’s present reality. </p>\n\n\n\n<blockquote>\n<p>By 2019, the volume of design blogs and magazines on the web was huge. Many began to look the same and we began to notice so much recycled content. Curation was becoming increasingly challenging if we wanted to maintain distinctiveness. On top of this, social media was very quickly eating away at indie websites like a plague. Our readership was declining year after year, and the pressures of pumping more energy into social media platforms to be noticed and relevant was a huge time sink. And it stunk. Much like the algorithms we’d all have to navigate in the years that followed. We were fighting a losing battle.</p>\n</blockquote>\n\n\n\n<p>Reading between the lines, they’re saying distribution now outweighs creation itself. This isn’t surprising. </p>\n\n\n\n<p>Minimalissimo, you will be missed. </p>\n\n\n\n<p><em>October 16, 2024. San Francisco</em></p>\n\n\n\n<p></p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"f7e0dd2d7f7ae538613c473f0727d2eaf0e754ac2d14c77375d4a913584fe5bf","category":"Sites"}