{"title":"I Miss Writing Here","link":"https://www.usv.com/writing/2024/05/i-miss-writing-here/","date":1716822065000,"content":"<p>It’s been a long time since I have written here. And I miss it. There has been a confluence of factors that have made it difficult.</p>\n<p>First, there has been simply finding the time. I have been crazy busy at work with many portfolio companies going through some kind of crisis as part of the adjustments in the financing environment over the last couple of years. I have also been working through some personal issues that have provided an opportunity for growth but have been time intensive (more on that some day, maybe). I have also been investing in staying fit by working out consistently, with strength training on Mondays, Wednesdays and Fridays and cardio on Tuesdays, Thursdays, and Saturdays. And finally I have been preparing for a transatlantic sail (more on that shortly).</p>\n<p>Second, the world is continuing to descend back into tribalism. And it has been exhausting trying to maintain a high rung approach to topics amid an onslaught of low rung bullshit. Whether it is Israel-Gaza , the Climate Crisis or Artificial Intelligence , the online dialog is dominated by the loudest voices. Words have been rendered devoid of meaning and reduced to pledges of allegiance to a tribe. I start reading what people are saying and often wind up feeling isolated and exhausted. I don’t belong to any of the tribes nor would I want to. But the effort required to maintain internally consistent and intellectually honest positions in such an environment is daunting. And it often seems futile.</p>\n<p>But I don’t give up easily. And I have started to miss writing here so much that I will figure out how to resume it. I am writing as much for myself as for anyone who may feel similarly distraught at the state of discourse.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/05/i-miss-writing-here/\">I Miss Writing Here</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Albert Wenger","siteTitle":"http://www.usv.com/feed","siteHash":"628cf95acf2204bb0b1633ad294b90483a47fc067742fc28c14bbe7ca7e45bd8","entryHash":"f80c8c9c72fa08582a374186496e92e0a313729099b1085142b4a2b65efde99d","category":"default"}