{"title":"My old clothes don’t fit","link":"https://sive.rs/clothes","date":1564531200000,"content":"<p>\nI was uncomfortable, unhappy, and restless.\nI didn’t want to meet new people, because I felt I was giving the wrong impression.\nSomething wasn’t right.\nIt took me months to figure out the real problem:\nMy clothes don’t fit anymore!\n</p><p>\nOnce I realized this, I had to decide what new clothes would fit the new me.\nLike many of us, I looked to the style of glamorous and successful people.\nI should wear what they wear since it works so well for them.\nI tried on many of their outfits, but nothing fit.\nThat was really disappointing, because I thought that’s why they share their choices with the world — so we can do what they do.\nI thought it would be that easy.\n</p><p>\nEventually, after a lot of searching, I found clothes that are just my size.\nBut I couldn’t get them on!\nThere was no room at all.\nI’m embarrassed to say I overlooked something obvious.\n<strong>\nI was trying to wear new clothes on top of the old ones.\n</strong>\nI didn’t realize I had to completely remove my old clothes before putting on something new.\n</p><p>\nIt was easy to take off my old clothes for a few days, but just having them around made it too easy to put them on again.\nThey were so comfortable!\nI’d been wearing these things for so many years that they really became my identity.\nIf you put my old clothes on a mannequin, it would look like me.\nWhat does that say about me, then?\nWe are what we wear?\nClothes make the man?\n</p><p>\nSo, I had to completely discard them.\nIt was sad — I thought those clothes would last forever.\nI documented them for archive’s sake, then gave them away.\nI’m glad someone else can use them.\n</p><p>\nIn this transition, before I put on my new clothes, I’m naked.\n</p><p>\nIt feels weird.\nI’m surprised I’m allowed to go out like this.\n</p><p>\nOld friends hardly notice, but new people I meet are confused and can’t tell why I’m not wearing something.\n<strong>\nAn outfit would show them how I can help.\n</strong>\n(And that’s all most people want to know.)\n</p><ul><li>\nA power suit would show I can help their business.\n</li><li>\nA monk’s robe would imply I could help their soul.\n</li><li>\nExplorer’s gear would prove I could lead an adventure.\n</li><li>\nA clown costume might at least make them laugh.\n</li></ul><p>\nBut nothing at all?\nThey probably <a href=\"https://sive.rs/useless\">can’t use me</a> for anything.\n</p><p>\nI get invited to speak at events, but it’s clear that they really just want the outfit I used to wear.\nI explain that it doesn’t fit, but they’re upset that I won’t put it on just one more time.\n</p><p>\nDon’t worry — I’m not going to be a nudist now.\nThat’s inconsiderate to almost everyone.\nI’ll put on my new clothes soon.\n</p><p>\nBut I’m just sharing this story in case your discomfort might just be that your old clothes don’t fit anymore.\n</p>\n<img src=\"/images/mannequin.jpg\" alt=\"mannequin\" />\n<div>Mannequin photo by <a href=\"https://www.flickr.com/photos/92799712@N04/15649911528\">Oiluj Samall Zeid</a></div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f8a17acc60756702006d516b006b867a98aba55de934e4ebed6ac49a892c3e69","category":"Sites"}