{"title":"Here’s how to live: Be independent.","link":"https://sive.rs/htl01","date":1638316800000,"content":"<p>\nAll misery comes from dependency.\n<br />\nIf you weren’t dependent on income, people, or technology, you would be truly free.\n<br />\nThe only way to be deeply happy is to break all dependencies.\n</p><p>\nMost problems are interpersonal.\n<br />\nTo be part of society is to lose a part of yourself.\n<br />\nCut ties with society.\n<br />\nDon’t engage.\n<br />\nDon’t even rebel, because that’s reacting.\n<br />\nInstead, do what you’d do if you were the only person on Earth.\n</p><p>\nPeople think we live in a world of politics, society, norms, and news.\n<br />\nBut none of it is real.\n<br />\nThey’re just interpersonal drama.\n<br />\nThey’re the noisy waste product of unhealthy minds.\n</p><p>\nCrowds are hysterical, and inbreed opinions.\n<br />\nDon’t be a part of any group.\n<br />\nDon’t take sides on any fight.\n<br />\nInstead of standing out from the crowd, just avoid and ignore the crowd.\n<br />\nAvoid social media and the zeitgeist.\n<br />\nIts stupidity will infect you.\n<br />\nDon’t align with any religion, philosophy, or political stance.\n<br />\nStay unlabeled and unbound.\n</p><p>\nRules and norms were created by the upper class to protect their privilege — to categorize people into high versus low society.\n<br />\nNone of it applies to you.\n<br />\nLong ago, people had to follow norms to have high social status, otherwise they’d be ostracized and couldn’t survive.\n<br />\nBut now you can survive, mate, and thrive without social status.\n<br />\nSo it’s both irrational and unwise to follow those norms.\n</p><p>\nDogs bark.\n<br />\nPeople speak.\n<br />\nIt doesn’t mean a thing.\n<br />\nWhat they say and do has nothing to do with you, even if it seems directed your way.\n<br />\nThe only opinion that matters is your own.\n<br />\nWhen you know what you’re doing, you won’t care what anyone else is doing.\n<br />\nWhen you’re indifferent to people’s words and actions, nobody can affect you.\n</p><p>\nDon’t believe anything anyone says.\n<br />\nListen if you want, but always decide for yourself.\n<br />\nNever agree with anything the same day you hear it, because some ideas are persuasively hypnotic.\n<br />\nWait a few days to decide what you really think.\n<br />\nDon’t let ideas into your head or heart without your permission.\n</p><p>\nBeing independent means you can’t blame others.\n<br />\nDecide everything is your fault.\n<br />\nWhoever you blame has power over you, so blame only yourself.\n<br />\nWhen you blame your location, culture, race, or history, you’re abdicating your autonomy.\n</p><p>\nEveryone has their own lives to manage.\n<br />\nNobody is responsible for you, and you aren’t responsible for anybody.\n<br />\nYou don’t owe anyone anything.\n</p><p>\nFriends are great at the right distance.\n<br />\nJust like you can’t read something if it’s pushed up against your face, or too far away, you should keep your friends at arm’s length — close but not too close.\n</p><p>\nHave more than one romantic partner, or none.\n<br />\nTo avoid emotional dependence, never have just one.\n<br />\nDon’t worry about being lonely.\n<br />\nNothing is more lonely than being with the wrong person.\n<br />\nIt’s always better to be alone.\n</p><p>\nYou can’t be free without self-mastery.\n<br />\nYour past indulgences and habits might be addictions.\n<br />\nQuit a harmless habit for a month, just to prove you can.\n</p><p>\nWhen you say you want more freedom from the world, you may just need freedom from your past self.\n<br />\nYou don’t see things as they are.\n<br />\nYou see them as you are.\n<br />\nChange yourself and you change the world.\n</p><p>\nLearn the skills you need to be self-reliant.\n<br />\nLearn to drive, fly, sail, garden, fish, and camp.\n<br />\nLearn emergency medical and disaster preparedness.\n<br />\nAssume nobody will help you.\n</p><p>\nDon’t depend on any company, especially not the big tech giants.\n<br />\nUse only open-source software and open communication protocols.\n<br />\nKeep your own backups.\n<br />\nGet your own domain.\n<br />\nRun your own server.\n</p><p>\nLive where you feel most free.\n<br />\nMove symbolically far away from where you grew up.\n<br />\nLiving in a foreign place helps make it clear that this culture’s rules don’t apply to you.\n</p><p>\nThe best place for self-reliance is a rural off-the-grid home.\n<br />\nGenerate your own electricity.\n<br />\nCollect your own water.\n<br />\nGrow your own food.\n</p><p>\nOr have no home at all.\n<br />\nWhen you have no home, the whole world is your home.\n<br />\nBe a nomadic minimalist to break dependencies on stuff.\n<br />\nOur hunter-gatherer ancestors thrived by carrying nothing, then finding or making what they needed.\n</p><p>\nBe a perpetual traveler, living out of a suitcase.\n<br />\nMove to a new country every few months, never a registered resident of anywhere.\n<br />\nSpread the different aspects of your life across different countries to avoid depending on any one country.\n<br />\nEarn multiple passports.\n<br />\nIf a country enters into war or makes your life hard, just leave.\n<br />\nTo be nomadic is to be a pacifist.\n</p><p>\nMake friends wherever you go, so that no one place has all of your friends.\n</p><p>\nOwn your own business with many small customers to avoid depending on any big client.\n<br />\nOffer products, not a personal service, so your business can run without you.\n<br />\nCreate many sources of income like this.\n</p><p>\nDon’t sign contracts.\n<br />\nBe willing to walk away from anything.\n</p><p>\nEventually, you will have done it.\n<br />\nYou’ll be absolutely free and independent.\n<br />\nIt’s the ultimate liberation.\n</p><p>\nThen you can appreciate everything from a healthy distance.\n<br />\nYou can appreciate your country from abroad, once it’s not your only option.\n<br />\nYou can appreciate family, once they’re not forced upon you.\n<br />\nYou can laugh at the hysteria of the crowd, and learn from it too.\n<br />\nYou can take sides in a fight, with a smirk.\n<br />\nYou can even take responsibility for someone else.\n</p><p>\nBeing fully independent is how to live.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"f98e912ca377f362abf20d0e55c17bea3e33722b12a366d764c3eb3a48e73785","category":"Sites"}