{"title":"This is the pre-election blitz?","link":"https://www.garbageday.email/p/this-is-the-pre-election-blitz","date":1730748270000,"content":"<div><div><h2>Conservatives Are Real Worked Up About A Dead Squirrel</h2><p>Last week, New York’s Department of Environmental Conservation confiscated a TikTok-famous squirrel and raccoon named Peanut and Fred, respectively, and euthanized them. The <a href=\"https://apnews.com/article/new-york-pet-squirrel-seized-peanut-pnut-e6318ee7e74492465bb6b0fc22f085ad?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">official line</a> from the DEC is that when the animals were taken during the raid Peanut bit a human and both animals were destroyed due rabies protocols.</p><p>Peanut and Fred were owned by a man named <a href=\"https://www.instagram.com/squirrel_dad_12/?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Mark Longo</a>, a fitness influencer, who has now found himself at the center of a massive right-wing flashpoint. Elon Musk has posted or shared close to a dozen posts about Peanut in the last 48 hours. It’s reasonable to assume Musk is trying to recapture some of the Harambe magic, back when the gorilla’s death was all <a href=\"https://www.cincinnati.com/story/news/2016/08/15/internet-harambe-wont-die/88426498/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">tied up with Trump in 2016</a>.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/521dfe49-5ec1-4e7a-a1ce-bff478c1e98a/Screenshot_2024-11-04_at_10.58.39_AM.png?t=1730735943\" /><div><span><p>(<a href=\"https://x.com/elonmusk/status/1852745739379658774?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">x.com/elonmusk</a>)</p></span></div></div><p>That is clearly a chipmunk. Obi-Wan Kenobi’s lightsaber is famously blue. And the obvious joke here would have been O-Pea Nut Kenobi, you stupid asshole. But I digress.</p><p>There’s a lot of misinformation flying around about Longo at the moment. I’ve seen some <a href=\"https://bsky.app/profile/genocideman.bsky.social/post/3la3vmolx3a2f?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">big posts on Bluesky</a> alleging that Peanut was destroyed because Longo didn’t want to vaccinate the squirrel due to fears of giving it autism. But I haven’t seen any proof of that. There are also unconfirmed photos of a squirrel wearing a MAGA hat that people are claiming was Peanut, but, once again, I’m not clear if that was the same squirrel. Yes, I am aware of how stupid the sentences are that I am currently writing. </p><p>What we do know is that Longo found Peanut seven years ago. And after Peanut started going viral, Longo launched the P’Nuts Freedom Farm Animal Sanctuary, which houses close to 300 other animals. To own a wild animal like a squirrel in New York requires a permit and Longo admitted during a round of media hits this weekend that he was still in the process of getting a license to own both Peanut and Fred. Also, yes, Longo and his wife have <a href=\"https://www.threads.net/@marisakabas/post/DB9H2zQutN7?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">an OnlyFans page</a>. Which is only an important detail here because of how swiftly the online right has jumped on this story. Conservatives have also turned it into a digital manhunt for the person who called in the complaint. Even the <i>New York Post</i> <a href=\"https://nypost.com/2024/11/03/us-news/who-ratted-out-pnut-the-squirrel-owners-have-their-theory-and-its-a-rich-one/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">is trying</a> to figure out who it was.</p><p>Sarah Fields, the president of Texas Freedom Coalition, a private right-wing advocacy group, accused a random photographer in Texas of being Peanut’s whistleblower, but also included screenshots of a totally unrelated Instagram influencer in <a href=\"https://x.com/SarahisCensored/status/1852856387048481127?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">the call out post</a>, writing, “make her famous.” Fields then posted a followup, explaining, “If you think ‘making someone famous’ means to dox someone, then there is something very wrong with the way you think.” Alright.</p><p>Peanut’s story was also particularly popular with the reactionary tech and finance sickos that spend all day psychically rotting away on X. Venture capitalists and hedge funders <b><a href=\"https://www.wired.com/story/elon-musk-peanut-the-squirrel/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">were quick</a></b> to weaponize this against Vice President Kamala Harris’ campaign. Though, contrary to what Katherine Boyle, a general partner at Andreessen Horowitz, wrote over the weekend, I don’t think this will have <a href=\"https://x.com/ktmboyle/status/1852735439020376160?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">any material impact</a> on the election tomorrow. If anything, it tells the opposite story. We are seeing the final stages of Musk’s master plan, years in the making. And it, frankly, sucks.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/32f60a41-001b-438f-91fb-96eb5678d68c/Screenshot_2024-11-04_at_11.34.09_AM.png?t=1730738064\" /><div><span><p>(<a href=\"https://x.com/DreamLeaf5/status/1852897702616457329?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">x.com/DreamLeaf5</a>)</p></span></div></div><p>Imagine you are very stupid and also, at least on paper, very rich. You've just come out of COVID lockdown feeling isolated and impotent, you're addicted to Twitter because you have no real friends, you’re reading a lot of right-wing bullshit because you resent your trans daughter, you don't want to pay taxes, and all of your businesses require government subsidies to exist. So you buy Twitter and start converting it into a machine to influence American elections. You dismantle the previous verification system that benefitted real journalists and replace it with a monetization scheme and algorithm that incentivize right-wing tabloid content. You launch an AI tool that lets users make \"memes\" without any technical skill. And you install yourself as the top user of the platform and beam your posts directly into everyone's feeds. In the months leading up to the next election, to try and sway the vote, you point your great and powerful public perception weapon straight at the political party you assume is going to make you pay more taxes and take away your free money. And, yet, after all of that effort. After all of that plotting and scheming, the cash and personal reputation burned. This is the sum total of what you do with it? An outrage cycle about a euthanized squirrel? This is your pre-election blitz? </p><p>And the answer is, of course it is. Because the guy we're talking about here has no idea how anything works, how real people live, what they care about. And, honestly, we should be lucky. Because if we weren’t dealing with a total dumbass, we’d be in serious trouble.</p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5f705e56-d777-4d27-9124-e3ffc95d1871/600x400.png?t=1730733143\" /></div><p><b>Silence Your Spam Calls Today</b></p><p>The election is finally here, Garbage Day readers. And you've probably definitely noticed an uptick in spam calls and texts, right? Have you ever wondered how they get ahold of your info? Well, it's data brokers. They sell your address, phone number, Social Security Number, family contacts, and more, to anyone willing to pay. And, yes, it's totally legal. On the bright side, you can always opt out of these sites yourself and stop the spam. BUT... doing all that on your own is frustrating and can take hours.</p><p>That's why you should use Incogni instead. They'll remove all your data from over 180 data brokerages and people-search sites automatically, so you can kiss spam goodbye.</p><p>Better yet, they're giving our readers 58% off with code DAYDEAL, <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">which you can use by clicking here</a>. Never worry about being tracked on the web again. <a href=\"https://deal.incogni.io/aff_c?offer_id=6&amp;aff_id=1008&amp;url_id=1&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Here's that link one more time!</a></p><hr /><div><h2><span>Think About Supporting Garbage Day!</span></h2><p><span>It’s $5 a month or $45 a year and you get Discord access, the coveted weekend issue, and monthly trend reports. What a bargain! Hit the button below to find out more.</span></p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\"><span> Upgrade </span></a></div><p><span>There’s also a new referral program, which is a great way to get Garbage Day for free in exchange for sharing it with your friends. </span><span><span><b>Click here to check it out.</b></span></span></p><hr /></div><h2><span>A Good Post</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5be90d18-e983-49ed-9a48-ebb155af7afe/Screenshot_2024-11-04_at_10.30.05_AM.png?t=1730734233\" /><div><span><p>(<a href=\"https://bsky.app/profile/publichealthguy.bsky.social/post/3la4zsjbspt2t?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">bsky.app/profile/publichealthguy.bsky.social</a>)</p></span></div></div><hr /><h2>X Belongs To The Machines Now</h2><p><i>—by Adam Bumas</i></p><p>For our monthly <a href=\"https://www.garbageday.email/p/the-new-york-times-is-back-baby?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Garbage Intelligence</a> reports, we track which X accounts get the most new followers every month. Musk is usually at the top of the list for a bunch of obvious reasons, but last month the second and third spots for October went to @Playstation and @ESPN. Both accounts have been on our lists before, but never together and absolutely never in the functional top two spots.</p><p>I’ve started using these accounts, along with @NASA (which was also in the top 10 this month), as a benchmark for how actively engaged people are with the app formerly known as Twitter. You see, when you make a new account, you’re made to follow at least one other account before it can show you the timeline, and it seems like these three are the most common recommendations for first follows (at least for English speakers).</p><p>So what does it mean that the most popular follows in October were automatic recommendations? I think it points to the majority of the engagement on X now being inauthentic. This isn’t Musk moving around the algorithm, this is the company having no reason — and no ability — to stop people registering masses of new accounts to boost their like and follow numbers. This isn’t just to help them reach the For You timeline, it’s boosting various <a href=\"https://www.rollingstone.com/politics/politics-features/trump-watches-coins-crypto-guide-election-grifts-1235113285/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">grifts</a>, <a href=\"https://decrypt.co/250194/massive-twitter-hack-targets-large-accounts-crypto-scam?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">get-rich-quick schemes</a>, and <a href=\"https://sherwood.news/crypto/hamster-kombat-crypto-game-youtube-social-media-growth-hack/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">crypto projects</a> — but I repeat myself.</p><p>I always hesitate to use the word “bots,” since in the past decade it’s more or less come to mean “internet accounts I don’t respect.” And there’s still plenty of real people on X — thousands of people with brains and jobs who want a PS5 Pro and followed @Playstation, or were excited for Shohei Ohtani and followed @ESPN (hope they were fans of <a href=\"https://www.mlb.com/video/shohei-ohtani-reaches-on-catcher-s-interference?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">catcher’s interference</a> lol). But all I have to work with is the numbers, and the deluge of engagement-farming accounts are washing away any impression humans can leave on those numbers.</p><hr /><h2>Threads Is Very Big</h2><p>Threads power user and <i>Business Insider</i> reporter Katie Notopoulos <a href=\"https://www.businessinsider.com/threads-users-how-many-meta-twitter-instagram-2024-11?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">shared a story</a> this morning reporting that, as of this month, Threads has 275 million “users”. And at this rate, the app will be as big as Twitter was in 2019 by January. But Notopoulos pointed out something very important about comparing Threads to Twitter. “It's weird that it could be Twitter-sized without ever having any sort of usefulness, unique culture, or ‘moment,’” she <a href=\"https://www.threads.net/@katienotopoulos/post/DB84DT7u-Wm?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">wrote</a>. “There's been nothing notable that happened ON Threads. It just... kind of is there.”</p><p>And it’s true. Think about everything that happened on or via Twitter by 2019. The <a href=\"https://imgur.com/a/WDwyW?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Zola thread</a> had already happened by 2015! In fact, pretty much everything you associate with Twitter had already happened by 2019. </p><p>I keep waiting for Threads to turn on somehow. Behind all the merciless dunking I do on the gas leak site, I’ve always assumed that Meta was waiting for it to be big enough for content to consistently go viral there, like it does on Facebook or Instagram. One of Meta’s big overarching strategies post-2012 has been building platforms where a lot of things are constantly happening. An internet that feels like cable TV. So my working theory on Threads is that it just hasn’t hit a scale where that can happen yet.</p><p>But this number really puts things in perspective. Threads is about half the size of X right now. So what’s the deal?</p><hr /><h2>MrBeast Investigated The Allegations</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/3d5114c8-4462-48b7-951b-85f8bada8c5d/Screenshot_2024-11-04_at_1.26.42_PM.png?t=1730744821\" /><div><span><p>(<a href=\"https://x.com/MrBeast/status/1852410203486183777?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">x.com/MrBeast</a>)</p></span></div></div><p>MrBeast put out a statement over the weekend that his company hired Quinn Emanuel Urquhart &amp; Sullivan, LLP, to investigate a slew of allegations that have recently surfaced against him and his team. They found no evidence of “pedophilia, grooming, child pornography, etc.,” nor did they find evidence that MrBeast or his team had hired anyone “with histories towards illegal or questionable legal conduct.” The firm did find several instances, however, of workplace misconduct.</p><p>It is probably not a great sign that MrBeast’s X post announcing these findings was Community Note’d, linking to a former employee seemingly <a href=\"https://x.com/jake_theviking/status/1821595585624854748?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">directly contradicting</a> some key points from the investigation. It’s also not a great sign that the letter MrBeast shared was written by Alex Spiro, the go-to lawyer for <a href=\"https://www.newyorker.com/magazine/2023/07/31/how-alex-spiro-keeps-the-rich-and-famous-above-the-law?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Musk</a>, <a href=\"https://www.vanityfair.com/style/2023/03/alex-spiro-lawyer-elon-musk-megan-thee-stallion-jay-z?srsltid=AfmBOooPbwPHQaeSOlYh1OM9tgqqzekOybzvk78E7Mr3FGKvQPLw25dV&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">Kanye West</a>, <a href=\"https://news.bloomberglaw.com/business-and-practice/nyc-mayor-adams-turns-to-elon-musks-go-to-lawyer-alex-spiro?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">New York Mayor Eric Adams</a>, and more.</p><hr /><h2>I Didn’t Realize The Rizzler Was Just Some Other Kid They Found</h2><blockquote><p></p><p>THEY WERE LYING THE ENTIRE TIME? HES NOT FAMILY?</p><p></p><a href=\"https://twitter.com/justcatmeme/status/1852718766280286548?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\"><p> — Mittens (@JUSTcatmeme) <br /> 2:25 PM • Nov 2, 2024 </p></a></blockquote><p>Maybe this is old news, but I assumed that The Rizzler, real name Christian Joseph, was like a cousin or something to A.J. and Big Justice, The Costco Guys. But it turns out he’s just… some other kid who was big online? And they’ve just added him to their whole bit? Where are The Rizzler’s parents? Is he going down to Florida to make content with The Costco Guys all the time? Is he in school? How does this work?</p><p>In related Rizzler news, Baby Gronk, a tween viral celebrity who does not seem to, uh, have the same kind of support system that The Rizzler does, <a href=\"https://x.com/BabyGronk5/status/1852038930385838310?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">recently challenged</a> The Rizzler to a boxing match. Hoping these two titans can squash this beef before it spins out of control. </p><hr /><h2><span>Alarmo Can Run </span><span><i>DOOM</i></span></h2><blockquote><p></p><p>After my last post, it was pretty clear what everyone wanted to see on the Alarmo. So, here it is - Doom running on the Nintendo Alarmo!</p><p></p><a href=\"https://twitter.com/garyodernichts/status/1852753537001718021?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\"><p> — Gary (@GaryOderNichts) <br /> 4:44 PM • Nov 2, 2024 </p></a></blockquote><hr /><div><h2><span>Did you know Garbage Day has a merch store?</span></h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/51eefe2c-07bf-408c-a27d-887ea8b2f580/Screenshot_2024-05-23_at_4.33.09_PM.png?t=1716493112\" /></div><p><span><b><a href=\"https://internetgarbage.creator-spring.com/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">You can check it out here!</a></b></span></p><hr /></div><h2>Some Stray Links</h2><ul><li><p><a href=\"https://discussingfilm.net/2024/11/01/boom-mic-speed-ratliff-saw-interview/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">“Boom Mic Operator Speed Ratliff Looks Back on 20 Years of </a><a href=\"https://discussingfilm.net/2024/11/01/boom-mic-speed-ratliff-saw-interview/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\"><i>Saw</i></a><a href=\"https://discussingfilm.net/2024/11/01/boom-mic-speed-ratliff-saw-interview/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\"> and Viral Fame”</a></p></li><li><p><a href=\"https://www.youtube.com/watch?v=jNMWkD5VsZ8&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">“Beating every possible game of </a><a href=\"https://www.youtube.com/watch?v=jNMWkD5VsZ8&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\"><i>Pokémon Platinum</i></a><a href=\"https://www.youtube.com/watch?v=jNMWkD5VsZ8&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\"> at the same time”</a></p></li><li><p><a href=\"https://www.wsj.com/finance/trump-odds-polymarket-election-betting-whale-3d94bed3?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">“The Trump-Betting Whale Speaks Out: ‘I Have Absolutely No Political Agenda’”</a></p></li></ul><hr /><p>P.S. here’s a <a href=\"https://www.tumblr.com/thepurplepope/765711684734271488/saw-this-absolute-king-at-the-paris-miku?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=this-is-the-pre-election-blitz\" target=\"_blank\">VERY online cosplay</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=0db753aa-7bcc-4001-a3d7-19ef3f284564&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"fa2447a4974b4e89d217dc222a40b57668813ca53d9059379c4ca73c77ea1025","category":"Sites"}