{"title":"It's time to leave Substack","link":"https://www.garbageday.email/p/its-time-to-leave-substack","date":1704920485000,"content":"<div><div><h2>Yeah, I’m Out</h2><p>I decided I would give Substack the holidays to get their shit together. I also wanted to hear from readers — and I’ve heard from <b>many</b> of you. But, most importantly, I needed some time to research where Garbage Day could move to if this truly was the breaking point for my relationship with Substack.</p><p>I’ve only ever hosted Garbage Day on Substack. So most of its form and features were created using the site’s CMS. And between the litany of coupons I gave out early on and the new third price tier I introduced for Garbage Intelligence last year, moving has become somewhat daunting. But after the last few weeks, I can’t stay here anymore. </p><p>Substack has always had moderation issues, like every big platform. But, unlike every big platform, the company has a habit of turning these, frankly, fairly basic trust and safety problems into weird political fights that drag on for weeks. They did it in 2021 when trans writers were getting doxxed and harassed — by newsletters that are still very much publishing and monetizing on their platform — and they did it again last month after <i>The Atlantic</i> <a href=\"https://www.theatlantic.com/ideas/archive/2023/11/substack-extremism-nazi-white-supremacy-newsletters/676156/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">reported</a> that neo-Nazis were publishing on the site. They were in <a href=\"https://www.garbageday.email/i/139500411/im-considering-paywalling-my-comments?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">my comment sections</a>, as well.</p><p>Right before Christmas, Substack co-founder Hamish McKenzie <a href=\"https://substack.com/@hamish/note/c-45811343?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">published</a> a truly boneheaded post responding to the Nazi controversy, which contains what is may be the single worst paragraph ever written by a tech founder:</p><div><blockquote><p>I just want to make it clear that we don’t like Nazis either—we wish no-one held those views. But some people do hold those and other extreme views. Given that, we don't think that censorship (including through demonetizing publications) makes the problem go away—in fact, it makes it worse. </p><figcaption></figcaption></blockquote></div><p>My man, you’re not supposed to acknowledge actual Nazis are using your product. Even Elon Musk doesn’t do that.</p><p>Following McKenzie’s post, I spoke with a lot of other writers on Substack, as well as folks at Substack directly. I agreed to keep my conversations with Substack off the record and I will honor that. Of course, most of what they told me was then <a href=\"https://www.platformer.news/p/substack-says-it-will-remove-nazi?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">given as a statement</a> to <i>Platformer</i> almost verbatim this week. Which makes things easier for me. Substack’s new strategy essentially boils down to asking for users and writers to flag objectionable content. As they told <i>Platformer</i>, “if and when we become aware of other content that violates our guidelines, we will take appropriate action.”</p><p>None of this had to happen. Ghost, a Substack competitor, has almost no real moderation to speak of, but no one seems to care. You know why? Because it’s not trying to jam all of its users into one feed to compete with Twitter or whatever. Substack, meanwhile, has insisted on adding more social features over the last three years, instead of making their email product better. Which is still missing tons of pretty basic features. And so they, predictably, ended up creating a poorly moderated network that was attractive to extremists. It’s been a decade since ISIS uploaded their first videos to social media. We know that this is what extremists do. And you can’t protect your social network on a case-by-case basis when you “become aware” of it. And don’t even get me started on silly a feed-based social platform is when you don’t have any ads on your site. Also, the funniest irony here is that their social features don’t even work! I asked around to make sure it wasn’t just me and it’s not. The Substack app doesn’t actually convert any readers. </p><p>In the last year, I had 5,000 people sign up for Garbage Day through the app. Of those 5,000, only 37 people converted into a paying subscription. Meanwhile, one of the best conversion methods for me has been gift subscriptions because, surprise surprise, my own readership is much better at recommending my newsletter than the divorced too-racist-for-LinkedIn losers sharing graphs about phrenology on Substack’s app. If only Substack had invested time and energy into building more products like that instead of making a new right-wing playpen.</p><p>I don’t think newsletters like Garbage Day leaving will make a dent in Substack’s bottom line. And, honestly, part of me would feel better if they just said, “conservatives make us more money, so we’ll do what they want.” Though, that tends to only work in the short-term because conservative media is a race to an oftentimes violent and always irrelevant bottom. </p><p>I really liked using Substack and have had great interactions with their team over the years and don’t actually want to move tbh. But it’s clear that it’s time. So, over the next month, I’ll be migrating off the site. I think I’m know where I’ll be going, but if anyone has any particular thoughts on that, shoot me an email. Thank you for being patient with me. You can still sign up and still pay for a subscription (and I hope you do lol). All of that should move seamlessly with me.</p><div><a target=\"_blank\" href=\"https://garbageday.beehiiv.com/subscribe?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\"><span> Subscribe now </span></a></div><hr /><h2>MattPat Is Leaving YouTube</h2><p><i>—by Adam Bumas</i></p><p>Enormously popular YouTuber MatPat (real name Matthew Patrick) announced yesterday that in March, he’ll be stepping down as host of his videos. He’ll still be involved and make occasional appearances, but leaving his show <i>Game Theory</i> and its many spinoffs marks the end of an era. An era that I I think a lot of people hadn’t even realized had started in the first place. </p><p><i>Game Theory</i>’s heyday was the early-to-mid 2010s, back when all the heavily-layered internet-native storytelling that forms the lifeblood of the show was just starting to solidify. MatPat’s videos were all new perspectives on games and media, in theory (lol). Their real influence, though, was synthesizing all these ideas from secondary media, academic analysis, fanon, creepypasta, TVTropes, and so on, into a simple and easy format.</p><p>The viewership obviously skews very young, but MatPat was a valuable resource for anyone just coming to grips with how the MCU operated or the notion that you were supposed to put work into assembling a backstory. It was a great primer for how players were intended to think about video games like <i>Five Nights at Freddy</i>’s and <i>Undertale</i>, and definitely had a hand in their enormous success.</p><p>Whatever happens next for MatPat, we’re only just starting to see the culture he helped to shape hit it big. He had a predictably embarrassing cameo in last year’s <i>FNAF</i> movie, which I said at the time was a bellwether for Gen Z culture hitting the mainstream. I wouldn’t exactly say he’s done the same, though. This is definitely an early retirement, rather than moving on to bigger and better things.</p><hr /><h2>Time To Play Another Round Of “Is This A Real Podcast”?</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/954933f9-9059-4442-a817-c8e9d9daccf5/0f0f313e-a1fa-42ab-9efe-d76bd7ac9cda_487x780.png?t=1705691547\" /></div><p>I saw this on Threads after <a href=\"https://www.threads.net/@daveleebbg/post/C14W90LMmBo?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">it was shared</a> by <i>Bloomberg</i> columnist Dave Lee, who wrote, “Obsessed with this emerging ad format. Totally real podcast ep with the bros.”</p><p>While the video is clearly an ad for the brand Vuori Clothing, I got curious if the podcast was totally fake. I didn’t recognize any of the hosts and part of me wondered if the fake podcast clip trend had become so widespread that now brands were setting up fake studios and casting actors to make these. Which seemed as crazy as it did possible.</p><p>After digging through <a href=\"https://www.tiktok.com/@vuoriclothing?lang=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">Vuori’s account</a>, I found other clips featuring these guys and in the comments one horny user asked who the main guy was. His name is Sal Di Stefano. He’s a health and fitness coach who does, in fact, have a podcast. It’s called the <i>Mind Pump Show</i>.</p><p>So weirdly enough, this is a real podcast. They produce hour long episodes and they recently featured Jordan Peterson’s daughter Mikhaila as a guest, to give you a sense of how it aligns politically lol.</p><p>I am unclear if Vuori paid <i>Mind Pump</i> for the sponcon (I have to assume so?), but regardless, the brand then cut up the clips and are using them as ads on TikTok.</p><hr /><h2>Josh Hutcherson Has Seen The Whistle Meme</h2><p>Actor Josh Hutcherson has finally had the “Whistle Song” meme explained to him, which is something sorta similar to a Rick Roll, but based a lot more in Gen Z fandom nostalgia. Like a Rick Roll, the joke is you slip it into an edit or you link to you without telling people. He talks about the meme above with Jimmy Fallon and he <a href=\"https://www.etonline.com/josh-hutcherson-reacts-to-the-whistle-edit-and-jennifer-lawrences-viral-golden-globes-moment-217624?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">told </a><i><a href=\"https://www.etonline.com/josh-hutcherson-reacts-to-the-whistle-edit-and-jennifer-lawrences-viral-golden-globes-moment-217624?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">ET Online</a></i> that his brother sat him down and showed him a bunch of examples. “I don't get it, but I'm here for it,” he said.</p><p>If you’re still having trouble wrapping your head around how the meme works, here’s <a href=\"https://www.youtube.com/watch?v=BbeeuzU5Qc8&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">another pretty good explainer</a>. </p><hr /><h2>AI Hardware Is Probably/Maybe The Future, But It’s Gonna Be Real Rocky Getting There</h2><p>Humane, the company behind that incredibly expensive AI pin, <a href=\"https://www.theverge.com/2024/1/9/24032274/humane-layoffs-ai-pin?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">is laying off</a> a chunk of its workforce before their launch in March. Seems not good? </p><p>But the shaky ground that AI hardware startups are building on hasn’t scared off a bunch of different companies from Entering The Arena. This week, at CES, a startup called Rabbit launched their AI “pocket companion,” which I actually think is sort of neat.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/97677286-93b5-4bb0-9075-b0d28aac72e3/611eb096-66e5-4924-bd64-5b465d016b24_947x639.png?t=1705691547\" /></div><p>It looks like a synthesizer that would cost too much on Kickstarter, which I appreciate. And I like that Rabbit seems to be really trying to rethink the smartphone and app store concept. I, personally, hate smartphones and have pretty much from the jump and agree that the way we use the web has grown beyond what can fit in a smartphone app. *Big deep breath* All that said…</p><p>Trying to replace the smartphone with an even more limited piece of hardware — what is essentially a microphone, an even smaller screen, and a camera — does not seem like a good way to fix these problems. I’m even less clear on how this is meant to fit into my life. Do I carry it around along with my phone? If so, why would I do that? And if not, do they really think this could reliably replace everything I do with my phone? Nothing <a href=\"https://twitter.com/rabbit_hmi/status/1744781083831574824?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">in their keynote</a> has convinced it could. (I will probably still buy one lol).</p><hr /><h2>Twitch Is Laying Off 500 Employees</h2><p>Twitch <a href=\"https://www.bloomberg.com/news/articles/2024-01-09/amazon-s-twitch-to-cut-500-employees-about-35-of-staff?srnd=undefined&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">announced</a> this week that they’re laying off over a third of their staff, which has rightfully spooked a lot of streamers. Back in December, I really <a href=\"https://www.garbageday.email/p/why-isnt-twitch-a-better-website?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">laid into Twitch</a> for, well, not being a better website. They completely bungled their pandemic head start and I’ve struggled understand what how they’ve been operating last couple years. </p><p>And the layoffs this week seem to prove it wasn’t just all in my head. Something is very off inside the company. If I have any current or former Twitch employees that read Garbage Day, shoot me a message. I’m desperate to get a better understanding what happened here.</p><p>Meanwhile, yesterday, YouTube CEO Neal Mohan <a href=\"https://www.threads.net/@neal_mohan/post/C1s8DAHLCYs?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">highlighted</a> a bunch of new streaming features the platform is adding, which is certainly interesting timing.</p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/484c803d-17e8-4c9a-9cac-88b8e25e7bb9/e0a2cc5b-39a9-4860-90d6-db900b3b361a_1946x1102.png?t=1705691548\" /></div><p>YouTube streams now have a “Channel Activity” section that gives you a bunch of new moderation tools. It’s smart. The only real thing Twitch still has over its competitors is its live chat and that seems fairly easy to build elsewhere else. I think it’s just taken a while for platforms like YouTube to realize that was Twitch’s secret sauce.</p><hr /><h2>What’s This TikToker’s Deal?</h2><div></div><p>I have been completely obsessed with these TikToks from a user named Luke Blovad, who, best as I can tell, lives inside of a simulation of 2003. One of Blovad’s videos <a href=\"https://twitter.com/_claypot/status/1744526233319162146?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">went viral again</a> on X recently, with a user declaring, “white person of the century,” and I had to understand more about what was happening here.</p><p>Blovad is a streetwear fashion influencer and skater. The videos you’ve probably seen from Blovad are the <i>Ed, Edd n Eddy</i>-core ones, but there’s a lot more. But Blovad posts a lot of different fashion content, along with some very genderfluid lewds. Light NSFW warning if you head over to Blovad’s Instagram. But the TikTok page’s main focus is promoting Blovad’s music, which is pretty decent hyperpop and emo trap. </p><p>So I guess the 2000s nostalgia stuff is just a growth hack thing? Unclear. Like a lot of Gen Z content, it exists in a netherworld between earnestness and satire that I find both deeply compelling and extremely confusing.</p><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://forward.com/opinion/575722/chabad-tunnels-antisemitism-twitter/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">“How Twitter activists turned a viral story about Orthodox Jews into a modern blood libel”</a></p></li><li><p><a href=\"https://www.rollingstone.com/culture/culture-news/secret-chabad-tunnels-new-york-1234942995/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">“Twitter Explodes With Antisemitic Misinfo After Secret Tunnels Found Under NYC Synagogue”</a></p></li></ul><hr /><p>P.S. here’s <a href=\"https://twitter.com/matttomic/status/1091760027327594496?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=it-s-time-to-leave-substack\" target=\"_blank\">some good Canadian content</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=8f2de697-bc43-4375-b7e0-ebb38fdac6bb&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"fb74ec7e460a1ca398c272947194ada3f79178f3c1c6f4cfac16b41cd4dc0f28","category":"default"}