{"title":"How I backup","link":"https://sive.rs/backup","date":1708992000000,"content":"<p>\nSome people have asked, so here is how I do my backups.\nIt takes me about <strong>ten seconds per day</strong> and <strong>five minutes per month</strong> to maintain.\n</p><p>\nIt works well for me, but I’m always open to suggestions.\nJust <a href=\"https://sive.rs/contact\">email me</a> with any ideas or questions.\n</p>\n\n<h2>every-day documents (~40 GB)</h2>\n<p>\nFiles I use and change every day: documents, emails, code, diary, ideas, website, accounts, etc.\n</p>\n<ul><li>\nI have a desktop and a laptop, so I keep this ~40 GB directory cloned with rsync every day or so between them.\nWhenever I turn on one computer, I sync it from the other.\n</li><li>\nDaily rsync to an encrypted Linux USB stick attached to the desktop.\n</li><li>\nDaily rsync to an encrypted MacOS USB stick attached to the laptop.\n</li><li>\nDaily rsync to an encrypted ZFS SSD inside the desktop.\n</li><li>\nDaily rsync to OpenBSD remote attached storage at vultr.com as <a href=\"https://sive.rs/ti\">described at my “Tech Independence” page</a>.\n</li></ul>\n<p>\nI’ve written shortcuts for these rsync commands so it’s really as simple as me typing <code>bkz</code> or <code>bkstick</code> in the terminal as I’m working anyway.\nI do it a few times a day, especially if I’ve just made or saved something of value.\nAnd always right before I shut down the computer, which I do almost any time I step away from it for more than a few minutes.\nThat’s why I say it’s like ten seconds a day, just typing that command occasionally.\n</p>\n\n<h2>keepsakes (~3 TB)</h2>\n<p>\nRarely-accessed files I want to keep forever: videos and photos of my kid, music and film collection.\n</p>\n<ul><li>\nThree different external 4TB 2.5\" drives, in three different formats: ZFS, OpenBSD, MacOS.\n</li><li>\nEvery month or so, I connect them via USB cable, and rsync everything to each of them, bringing one down to a safe deposit box downtown, and taking out the one that was there from my last visit.\n</li><li>\n5TB at <a href=\"https://www.hetzner.com/storage/storage-box\">Hetzner Storage Box</a>, I rsync remotely.\n</li><li>\n4TB at <a href=\"https://zfs.rent/\">ZFS.rent</a>, a ZFS encrypted clone.\n</li></ul>\n<p>\nSo that’s five copies of my keepsakes in four different locations.\nEach one also has a recent copy of my every-day documents from above.\nSo a few minutes a month to connect the USB drives, and I only do the safe deposit box when I’m going that way anyway, and only takes a couple minutes.\n</p><p>\nIn the days of spinning-platter hard drives, they used to die surprisingly often, so I like the security of many copies.\nBut it also helps to have some deliberately behind others, so on the rare case where I’ve deleted something, then rsynced my dailies and even my monthly, then realized I need that thing I deleted, then I know the drive in the safe deposit box has it since I haven’t updated that one in a couple months.\n</p>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"fba9a222288902a771bbf36b5b58fd11063c2d169b16c872ef041d968c10a3c4","category":"Sites"}