{"title":"Relax for the same result","link":"https://sive.rs/relax","date":1443744000000,"content":"<p>\nA few years ago, I lived in Santa Monica, California, right on the beach.\n</p><p>\nThere’s a great bike path that goes along the ocean for seven and a half miles.\nSo, fifteen miles round trip.\nOn weekday afternoons, it’s almost empty.\nIt’s perfect for going full speed.\n</p><p>\nSo a few times a week, I’d get on <a href=\"https://surlybikes.com/bikes/straggler\">my bike</a> and go as fast as I could for the fifteen-mile loop.\nI mean really full-on, 100 percent, head-down, red-faced sprinting.\n</p><p>\nI’d finish exhausted and look at the time:\n<strong>\nforty-three minutes.\n</strong>\nEvery time.\nMaybe a minute more on a really windy day, but basically always forty-three minutes.\n</p><p>\nAfter a few months, I noticed I was getting less enthusiastic about this bike ride.\nI think I had mentally linked it with being completely exhausted.\n</p><p>\nSo one day I decided <strong>I would do the same ride, but just chill</strong>.\nTake it easy, nice and slow.\nOK, not <em>super</em> slow, but dialing it back to about 50 percent of my usual effort.\n</p><p>\nAnd ahhh… what a nice ride.\nI was relaxed and smiling and looking around.\nI was barely giving it any effort.\n</p><p>\nI saw two dolphins in the water.\nA pelican flew right over me in Marina del Rey.\nWhen I looked up to say “wow!” he shit in my mouth.\nI can still remember that taste of digested shellfish.\nI had to laugh at the novelty of it.\n</p><p>\nI’m usually so damn driven, always doing everything as intensely as I can.\nIt was so nice to take it easy for once.\nI felt I could do this forever, without any exhaustion.\n</p><p>\nWhen I finished, I looked at the time: <strong>forty-five minutes.</strong>\n</p><p>\nWait — what?!?\nHow could that be?\nYep.\nI double-checked: forty-five minutes, as compared to my usual forty-three.\n</p><p>\nSo apparently all of that exhausting, red-faced, full-on push-push-push I had been doing had given me only a <strong>4 percent</strong> boost.\nI could just take it easy and get <strong>96 percent of the results</strong>.\n</p><p>\nAnd what a difference in experience!\nTo go the <em>same</em> distance, in about the <em>same</em> time, but one way leaves me exhausted, and the other way, rejuvenated.\n</p><p>\nI think of this often.\nWhen I notice that I’m all stressed out about something or driving myself to exhaustion, I remember that bike ride and try dialing back my effort by 50 percent.\nIt’s been amazing how often everything gets done just as well and just as fast, with what <em>feels</em> like half the effort.\n</p><p>\nWhich then makes me realize that half of my effort wasn’t effort at all, but just unnecessary stress that made me <em>feel</em> like I was doing my best.\n</p>\n<img src=\"/images/bikesand.jpg\" />\n<div>Bicycle photo <a href=\"https://www.flickr.com/photos/mike-dean/12008975114\">© Mike Dean</a></div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"fbc850770768afdf9c1f53459e0dd87a588ecbc9ab2eaff35da3fd9ef9705638","category":"Sites"}