{"title":"What&#8217;s Inside This Crater in Madagascar?","link":"https://kottke.org/24/01/whats-inside-this-crater-in-madagascar","date":1706556896000,"content":"\n        <p></p>\n\n<p>The Vox video team spotted a small village in the middle of huge crater in Madagascar. They decided to investigate.</p>\n\n<blockquote><p>Right in the center of the island nation of Madagascar there’s a strange, almost perfectly circular geological structure. It covers a bigger area than the city of Paris — and at first glance, it looks completely empty. But right in the center of that structure, there’s a single, isolated village: a few dozen houses, some fields of crops, and dirt roads stretching out in every direction. </p>\n\n<p>When we first saw this village on Google Earth, its extreme remoteness fascinated us. Was the village full of people? How did they wind up there?</p></blockquote>\n\n<p>This video is great for so many reasons. It’s a story about geology, cartography, globalization, the supply chain, infrastructure, and the surveillance state told through the framework of falling down (waaaay down) an online rabbit hole. It reinforces the value of academics and the editing is top shelf.</p>\n\n<p>Though, I wonder if profiling this village on the internet is a good thing to do. This isn’t some YouTube bro helicoptering into the village unannounced — the Vox team worked with locals, received permission, etc. — but these villagers are a minority group who have chosen to live in a remote area with particularly good natural resources…and now their secret is out. And maybe their neighbors (or Mr. Beast) will choose to pay them a visit sometime soon. (via <a href=\"https://waxy.org/\">waxy</a>)</p>\n\n        \n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Madagascar\">Madagascar</a> · <a href=\"https://kottke.org/tag/video\">video</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/01/whats-inside-this-crater-in-madagascar\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"fcc8313b1a42bf336b2250dcc9ced4934ef79c5c22393b9c34b0aa1b3ef8919e","category":"default"}