{"title":"Apple’s Vision Pro -The Meta-Review.","link":"https://om.co/2024/01/30/apples-vision-pro-the-meta-review/","date":1706635440000,"content":"<p>Apple Vision Pro reviews have started to roll in — and depending on who you read, the consensus vacillates between amazing and work in progress. In most cases, they reflect some version of reality. If one is looking for faults with Apple’s face computer, then one will find them. And if you are looking at what it represents, you are going to be excited. I am in the ‘camp’ of the amazed, though I am not blinded by the challenges that await Vision Pro in the real world.</p>\n\n\n\n<span></span>\n\n\n\n<p>The Verge’s Nilay Patel sums up the challenge of Vision Pro, writing:</p>\n\n\n\n<blockquote>\n<p>The technology to build a true optical AR display that works well enough to replace an everyday computer just isn’t there yet. The Magic Leap 2 is an optical AR headset that’s <a target=\"_blank\" href=\"https://www.theverge.com/2022/7/12/23205702/magic-leap-2-enterprise-release-price-shipping-date-mixed-reality-ar-headset\">cheaper and smaller</a> than the Vision Pro, but it’s plagued by compromises in field of view and image quality that most people would never accept. So Apple’s settled for building a headset with real-time video passthrough — it is the defining tradeoff of the Vision Pro. It is a VR headset masquerading as an AR headset. And let me tell you: the video passthrough on the Vision Pro is <em>really good</em>. It works! It’s convincing. You put the headset on, the display comes on, and you’re right back where you were, only with a bunch of visionOS windows floating around.</p>\n</blockquote>\n\n\n\n<p>Let’s get on with the cons: The Verge points out problems like ‘motion blur,’ ‘blurriness,’ ‘color fringing,’ ‘limited field of view,’ and ‘vignetting.’ I have not personally experienced any of these because, well, I don’t have the device.</p>\n\n\n\n<p>The device is sometimes laggy. It’s heavy, and the wired battery is limited to just over 2 hours. You can plug it into a ‘wall charger’ with a USB-C cable, or daisy-chain it to another USB-C battery pack. And it does get a tad warm. You need to use the ‘dorky’ headband to use the device without feeling the weight (or in some cases, a headache).</p>\n\n\n\n<p>None of this surprises me! Vision Pro is, after all, a full-blown computer. It’s made from magnesium, carbon fiber, and aluminum. It has two high-resolution front-facing cameras (video pass-through), two cameras that face down to track your hands and gestures, a LiDAR, TrueDepth cameras, and some kind of infrared lights. The device has two tiny MicroOLED displays packed with a total of 23 million pixels. (As I noted in an earlier piece, these displays are the magic and the primary reason why Vision Pro is so expensive.)</p>\n\n\n\n<p>All these sensors, cameras, and displays are powered by an M2 chip and an R1 spatial coprocessor, and fans. Apple has packed this in an enclosure that is about three times the weight of the iPhone 15 Pro Max and is still lighter than the iPad 12.9. Paint me impressed purely from a technological standpoint.</p>\n\n\n\n<p>What’s even more impressive is the sound — Apple is using beamforming to direct the sound into your ears. And unless you are blasting it out loud — you could get away with wearing it in a public place — though people in Business Class will notice the slight din from the seat next to them. Let’s face it — the early adopters are at the front of the bus. Plus, Apple is hoping they will splurge on a new pair of AirPods Pros.</p>\n\n\n\n<p>Reviewing the reviews, I can say that none are unfair, and from my limited use, they reflect reality without hyperbole (with an occasional exception or two). What I found missing was any real discussion about the future of computing and how this advances (or not) from that perspective.</p>\n\n\n\n<figure><img width=\"1024\" height=\"576\" src=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-1024x576.jpg\" srcset=\"https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-1024x576.jpg 1024w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-300x169.jpg 300w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-768x432.jpg 768w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-1536x864.jpg 1536w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-192x108.jpg 192w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-1100x619.jpg 1100w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-180x100.jpg 180w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-560x315.jpg 560w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605-1800x1013.jpg 1800w, https://149366103.v2.pressablecdn.com/wp-content/uploads/2023/06/Apple-WWCD23-Vision-Pro-EyeSight-230605.jpg 1920w\" /></figure>\n\n\n\n<h4>Here are some of the reviews:</h4>\n\n\n\n<ul>\n<li><strong>Best 3-minute video Overview</strong>: <a href=\"https://x.com/caro_milanesi/status/1752333021368217902?s=20\" target=\"_blank\">Carolina Milanese</a> says ‘Apple has delivered a solid first-generation product on a platform that will define spatial computing.’ (<a href=\"https://creativestrategies.com/exploring-apple-vision-pro-a-personal-journey/\" target=\"_blank\">She wrote it up as well</a>.) </li>\n\n\n\n<li><strong>Best Review</strong>: <a href=\"https://www.wsj.com/tech/apple-vision-pro-review-39f2d82e?mod=wknd_pos1\" target=\"_blank\">Wall Street Journal’s Joanna Stern</a>, writes: “So much of what the Vision Pro can do feels sci-fi. I’m flicking apps all over my home office. I’ve got multiple virtual timers hovering over my stove. I’m watching holograms of my kid petting a llama. It’s the best mixed-reality headset I’ve ever tried, way more advanced than its only real competition, the far cheaper Meta Quest Pro and Quest 3.” <a href=\"https://youtu.be/8xI10SFgzQ8?feature=shared\" target=\"_blank\">Joanna’s video review is even more fun and approachable for real people</a>. Such a great showcase of its potential. </li>\n\n\n\n<li><strong>Best review for uncles</strong>: <a href=\"https://www.cnet.com/pictures/check-out-apples-vision-pro-headset-and-everything-in-the-box/\" target=\"_blank\">CNet.com</a> which sums it up, ‘At this price, and with so few VisionOS launch apps, the Vision Pro isn’t a device I’d recommend to any of my friends or family. Instead, I’d recommend you get a free demo at an Apple Store, marvel at its features, and wait and see.’</li>\n\n\n\n<li><strong>Best review by word count</strong>: <a href=\"https://daringfireball.net/2024/01/the_vision_pro\" target=\"_blank\">John Gruber</a> says “like that original iPhone and the original Macintosh before it, this first Vision Pro is no joke.” </li>\n\n\n\n<li><strong>Best NitPick</strong>: <a href=\"https://www.theverge.com/24054862/apple-vision-pro-review-vr-ar-headset-features-price\" target=\"_blank\">Nilay Patel of The Verge</a>: “Is using the Vision Pro so good that I’m willing to mess up my hair every time I put it on?” </li>\n\n\n\n<li><strong>Best Non-Review Review: </strong><a href=\"https://spyglass.org/vision-profoundly-uncool/\" target=\"_blank\">MG Siegler writes</a>, ‘There’s no point in beating around the bush: you’re going to look ridiculous while wearing the Vision Pro.’</li>\n</ul>\n\n\n\n<p>By the way, these written reviews are nice and all, but in the end, it will be the YouTubers who determine the fate of the device and its longevity in the market. <a href=\"https://www.youtube.com/watch?v=GkPw6ScHyb4\" target=\"_blank\">Brian Tong</a> and <a href=\"https://www.youtube.com/watch?v=SaneSRqePVY\" target=\"_blank\">Marques Brownlee</a> have early takes — I wasn’t too blown away. I would wait for take two!</p>\n\n\n\n<p>In case you were wondering, what’s my take? It’s coming soon — I had to rewrite the entire piece because of these Apple reviews — and I don’t intend to replicate what has already been published.</p>\n\n\n\n<p>January 30, 2024. San Francisco</p>","author":"Om Malik","siteTitle":"Om Malik","siteHash":"56aa7c22de1a9e5680d03082a2a13db78fe214c96b8119e8d54042cbf2d355ae","entryHash":"fdc7dfa372e7dd00f42d090b7848d20c47213163cddd531e605d9034fc17f064","category":"default"}