{"title":"Monthly self-expansion project","link":"https://sive.rs/exex","date":1571788800000,"content":"<p>\nHere’s an idea:\n<strong>\nEvery month, pick something you hate or know nothing about, and get to know it well.\n</strong>\nSpend a few hours per week, for an entire month, just learning about that subject.\nWhy?\n</p><p>\nThe idea is inspired by a very successful friend of mine who is regrettably closed-minded.\nShe hates everything that isn’t European, sophisticated, and familiar.\nCulture of India?\nHates it.\nChinese opera?\nHates it.\nWest African music?\nHates it.\nAny mention of any of these things, and she completely shuts down.\nAppreciating them is not an option.\nI tried to play her my favorite Indian music, and West African music, but nope.\nJust a few seconds into it, she asks me to shut it off.\n</p><p>\nIt made me realize that <strong>some of the greatest joys in my life</strong> are the things I used to hate, or know nothing about, and now have grown to love.\nRead my post “<a href=\"https://sive.rs/hate\">Loving what I used to hate</a>” for my story about that.\n</p><p>\nSo I thought:\nInstead of letting it happen accidently or randomly, why not be deliberate about it?\nSome ideas of things to study for a month would be…\n</p>\n<ul>\n<li><a href=\"https://www.thegreatcourses.com/courses/everyday-engineering-understanding-the-marvels-of-daily-life.html\">civil engineering</a></li>\n<li>Tolstoy</li>\n<li>archery</li>\n<li>Bollywood</li>\n<li>dog training</li>\n<li>Dungeons and Dragons</li>\n<li>chess</li>\n<li>Zanzibar</li>\n<li>cryptography</li>\n<li>emergency medical training</li>\n<li>anything <a href=\"https://www.thegreatcourses.com/courses/sort-by/inline_rating/sort-direction/desc?ICMP=126572\">The Great Courses</a> has a course about</li>\n<li>anything <a href=\"https://www.veryshortintroductions.com/\">Very Short Introductions</a> has a mini-book about</li>\n</ul><p>\nIf it’s learning a skill, read Josh Kaufman’s <a href=\"https://first20hours.com/\">First 20 Hours</a> and use that approach.\n</p><p>\nWhile you might lean towards things you’ve always wanted to learn about, I think it’s more interesting to ask yourself, “What do I have absolutely no interest in?” or “What sounds repulsive to me?”, then aim to understand one of those things.\nStart with a kind of music you hate, or a part of the world that sounds unappealing to you.\nThat’s where the real self-expansion happens.\n</p><p>\n<strong>\nWhenever we learn about something, we learn to appreciate it.\n</strong>\nSo it’s most rewarding if it’s something you previously had no appreciation for.\n</p><p>\nI like this idea a lot, and plan to do it soon.\n</p>\n<img src=\"/images/exex.jpg\" alt=\"expanding arrows\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"fe29f00f87f6771a774bb470d7fc00123150a2ff764a85e87cc6df08df253bb1","category":"Sites"}