{"title":"To hone your writing, hire a translator.","link":"https://sive.rs/tra","date":1498003200000,"content":"\n<div>\n<a href=\"#\">Deutsch</a>\n<a href=\"#\">English</a>\n<a href=\"#\">Español</a>\n<a href=\"#\">Esperanto</a>\n<a href=\"#\">Français</a>\n<a href=\"#\">Português</a>\n<a href=\"#\">Русский</a>\n<a href=\"#\">中文</a>\n<a href=\"#\">日本語</a>\n<a href=\"#\">한국어</a>\n<a href=\"#\">العربية</a>\n</div>\n<aside>\nحتى تتمكن من صقّل كتاباتك، قُم باستئجار مترجم.\n</aside>\n<aside>\nUm dein Schreiben zu verbessern, engagiere einen Übersetzer.\n</aside>\n<aside>\nTo hone your writing, hire a translator.\n</aside>\n<aside>\nPor perfektigi vian skribon, dungu tradukiston.\n</aside>\n<aside>\nPara perfeccionar tu escritura, contrata a un traductor. \n</aside>\n<aside>\nPour aiguiser votre plume, engagez un traducteur.\n</aside>\n<aside>\nあなたの文章に磨きをかけるために翻訳者を雇います。\n</aside>\n<aside>\n글쓰기를 연마하시려면, 번역가를 고용하세요.\n</aside>\n<aside>\nPara aprimorar sua escrita, contrate um tradutor.\n</aside>\n<aside>\nНаймите переводчика, чтобы отточить ваши писательские навыки.\n</aside>\n<aside>\n要磨练你的写作，请聘用一名翻译员。\n</aside>\n<p>\nهل تريد أن تكتب بوضوح وإيجاز؟\n</p>\n<p>\nMöchtest du klar und prägnant schreiben?\n</p>\n<p>\nDo you want to write clearly and succinctly?\n</p>\n<p>\nĈu vi volas skribi klare kaj koncize?\n</p>\n<p>\n¿Deseas escribir de forma clara y concisa?   \n</p>\n<p>\nVous voulez écrire de façon claire et succincte ?\n</p>\n<p>\n明確に簡潔に書きたいと思いませんか？\n</p>\n<p>\n명확하고 간결하게 글을 쓰고 싶으세요?\n</p>\n<p>\nDeseja escrever de maneira clara e sucinta?\n</p>\n<p>\nХотите писать понятно и лаконично?\n</p>\n<p>\n你希望写得清楚简洁吗？\n</p>\n<p>\nقُم باستئجار مترجم.\n</p>\n<p>\nDann engagiere einen Übersetzer.\n</p>\n<p>\nHire a translator.\n</p>\n<p>\nDungu tradukiston.\n</p>\n<p>\nContrata a un traductor.\n</p>\n<p>\nEngagez un traducteur.\n</p>\n<p>\n翻訳者を雇うのです。\n</p>\n<p>\n번역가를 고용하세요.\n</p>\n<p>\nContrate um tradutor.\n</p>\n<p>\nНаймите переводчика.\n</p>\n<p>\n请聘用一名翻译员。\n</p>\n<p>\nحيثُ يتقاضى المترجمون المحترفون حوالي 10 سنتات لكل كلمة، لذلك تجعلك الترجمة تتساءل عن قيمة كل جملة.\n</p>\n<p>\nProfessionelle Übersetzer verlangen ungefähr 10 Cent pro Wort, daher lässt dich das Übersetzen den Wert jedes einzelnen Satzes hinterfragen.\n</p>\n<p>\nBecause professional translators charge around 10 cents per word, translating makes you question the value of every sentence.\n</p>\n<p>\nĈar profesiaj tradukistoj pagigas ĉirkaŭ 10 cendoj per vorto, traduki igas vin kontesti la valoron de ĉiu frazo.\n</p>\n<p>\nDebido a que los traductores profesionales cobran alrededor de 10 centavos por palabra, recurrir a uno hace que te cuestiones el valor de cada frase.\n</p>\n<p>\nComme les traducteurs professionnels facturent environ 10 centimes le mot, faire traduire votre texte vous fait remettre en question la valeur de chaque phrase.\n</p>\n<p>\nプロの翻訳者は1語当たり約10セントの料金を請求するので、翻訳することによってすべての文章の価値を疑問視するようになります。\n</p>\n<p>\n전문 번역가는 단어당 10 센트 정도를 받기 때문에, 번역은 모든 문장에 대해서 그만한 가치가 있는가를 생각하게 합니다.\n</p>\n<p>\nComo tradutores profissionais cobram cerca de 10 centavos de dólar por palavra, traduzir faz você questionar o valor de cada frase.\n</p>\n<p>\nТак как профессиональные переводчики берут около 10 центов за слово, переводы заставляют вас подвергать сомнению ценность каждого предложения.\n</p>\n<p>\n因为专业翻译人员翻译每个词的费用约为10美分，所以翻译会让你质疑每句话的价值。\n</p>\n<p>\nمنذ فترة طويلة، كنت امتلك موقع قديم تمت ترجمته إلى عشر لغات.\nولأن كل جملة تتكلف 10 دولارات، وكل فقرة 50 دولار، فقد تعلمت حذف كل كلمة غير ضرورية.\n</p>\n<p>\nVor einiger Zeit ließ ich meine alte Seite in zehn Sprachen übersetzen.\nDa jeder Satz 10 $ und jeder Absatz 50 $ kostete, lernte ich jedes unnötige Word heraus zu kürzen.\n</p>\n<p>\nLong ago, I had my old site translated into ten languages.\nBecause each sentence cost $10, and each paragraph cost $50, I learned to chop every unnecessary word.\n</p>\n<p>\nAntaŭ longa tempo, mi tradukitigis mian malnovan retejon al dek lingvoj.\nĈar ĉiu frazo kostis $10, kaj ĉiu alineo kostis $50, mi lernis kiel forigi ĉiujn ne-neprajn vortojn.\n</p>\n<p>\nHace tiempo, traduje mi antigua página web a diez idiomas diferentes.    \nYa que cada frase me costaba 10 $ y cada párrafo 50 $, aprendí a evitar las palabras innecesarias.\n</p>\n<p>\nIl y a longtemps, j’ai fait traduire mon ancien site en 10 langues.\nChaque phrase coûte 10$. Chaque paragraphe coûte 50$. J’ai appris à retrancher tous les mots superflus.\n</p>\n<p>\nずいぶん前に、私の古いサイトを10の言語に訳してもらったことがあります。\n各文章は10ドルかかり、各段落は50ドルかかったので、私はすべての不必要な単語を削ることを学びました。\n</p>\n<p>\n오래 전, 저의 오래된 사이트를 10개 언어로 번역을 의뢰해 봤어요.\n각 문장에 10달러가 들었고, 각 문단에 50달러가 들었기 때문에 모든 불필요한 단어를 없애는 법을 배웠어요.\n</p>\n<p>\nMuito tempo atrás, eu traduzi meu site em dez idiomas.\nComo cada frase custava US$ 10, e cada parágrafo custava US$ 50, eu aprendi a cortar todas as palavras desnecessárias.\n</p>\n<p>\nКогда-то давно мой старый сайт был переведен на 10 языков.\nТак как каждое предложение стоило 10 долларов, а каждый параграф — 50, я научился отсекать каждое ненужное слово.\n</p>\n<p>\n很久以前，我请人将原来的博客翻译成十种语言。\n因为每句话花费10美元，每段话花费50美元，我学会了删减每一个不必要的词语。\n</p>\n<p>\nفإذا كنت تستطيع توصيل نفس الفكرة باستخدام كلمات أقل، فمن المُرَجَح سهولة قرائتها وفهمها.\n</p>\n<p>\nWenn du die gleiche Idee mit weniger Worten übermitteln kannst, ist die Wahrscheinlichkeit, dass etwas gelesen und auch verstanden wird, größer.\n</p>\n<p>\nIf you can communicate the same idea with fewer words, it’s more likely to be read and understood.\n</p>\n<p>\nSe vi povas komuniki la saman ideon per malpli da vorto, ĝi estos pli verŝajne legata kaj komprenata.\n</p>\n<p>\nSi puedes transmitir la misma idea, pero con menos palabras, es más probable que se lea y se entienda. \n</p>\n<p>\nCommuniquez la même idée avec moins de mots. Vous aurez plus de chances qu’elle soit lue et comprise.\n</p>\n<p>\nより少ない言葉で同じ考えを伝えることができれば、読んでもらいそして理解してもらう可能性が高くなります。\n</p>\n<p>\n최소의 단어로 당신의 생각을 전할 수 있다면, 더 쉽게 읽히고 더 쉽게 이해할 수 있는 글이 될 수 있습니다.\n</p>\n<p>\nSe você conseguir comunicar a mesma ideia com menos palavras, é mais provável que ela seja lida e compreendida.\n</p>\n<p>\nЕсли вы изложите идею более кратко, она с большей вероятностью будет прочитана и понята.\n</p>\n<p>\n如果你可以用较少的词语传达相同的想法，那么它更有可能被阅读和理解。\n</p>\n<p>\nفالجملة التي يَسهُل ترجمتها، تكون أيضاً أسهل للفهم.\nلذا اطلب من المترجم الخاص بك المشورة حول كيفية جعل النص الأصلي أكثر وضوحاً.\n</p>\n<p>\nEin einfach zu übersetzender Satz, ist zudem einfacher zu verstehen.\nFrage deinen Übersetzer daher, wie dein Original besser zu verstehen wäre.\n</p>\n<p>\nA sentence that’s easier to translate is also easier to understand.\nSo ask your translator how your original could be clearer.\n</p>\n<p>\nFrazo kiu estas pli facile tradukita estas ankaŭ pli facile komprenita.\nDo demandu al via tradukisto kiel via originalo povus pliklariĝi.\n</p>\n<p>\nCuanto más fácil de traducir sea una frase, más fácil será también de entender.\nAsí que consulta con tu traductor para que te aconseje sobre cómo podrías hacer de tu original algo más claro.\n</p>\n<p>\nUne phrase simple à traduire est aussi plus simple à comprendre.\nAlors demandez à votre traducteur en quoi votre texte d’origine pourrait être plus clair.\n</p>\n<p>\n翻訳が簡単であればあるほど文章もより理解しやすくなるのです。\nですから、オリジナルの文章をどうのようにしたらより明確にできるのか翻訳者にアドバイスを求めます。\n</p>\n<p>\n쉽게 번역할 수 있는 문장은 또한 쉽게 이해 됩니다.\n그러니 당신의 번역가에게 당신의 원문이 얼마나 명확한지 조언을 구하세요.\n</p>\n<p>\nUma frase que é fácil de traduzir é ainda mais fácil de entender.\nPortanto, peça dicas ao seu tradutor sobre como deixar seu original mais claro.\n</p>\n<p>\nПредложение, которое легче перевести, и понять тоже легче.\nТак что спросите у переводчика совета, как можно сделать ваш исходный текст яснее.\n</p>\n<p>\n一个更容易翻译的句子也更容易理解。\n所以请咨询你的翻译员如何让你的原作更清楚。\n</p>\n<p>\nتحدث مع المترجمين لك أثناء عملهم، حتى يتمكنوا من طرح جميع أسئلتهم.\nلقد وجدت أسئلتهم تساعدني دائماً وأتمكن من تحسين النص الأصلي من منظور جديد.\n</p>\n<p>\nSprich mit deinem Übersetzer, während dieser arbeitet, damit er dir all seine Fragen stellen kann.\nMir helfen die Fragen des Übersetzes, mein Original aus einer ganz neuen Perspektive heraus zu verbessern.\n</p>\n<p>\nTalk with your translator while they work, so they can ask you all of their questions.\nI’ve found their questions always help me improve my original from a new perspective.\n</p>\n<p>\nParolu kun via tradukisto laboranta, do ri povas respondi iajn demandojn.\nMi trovis ke tradukistaj demandoj ĉiam helpas min plibonigi mian originalon dank’al  nova sinteno.\n</p>\n<p>\nComunícate con tu traductor mientras trabaja; de ese modo puede acudir a ti para resolver todas sus dudas.\nSus preguntas siempre me han ayudado a mejorar el original desde una nueva perspectiva.\n</p>\n<p>\nDialoguez avec votre traducteur pendant qu’il travaille, il pourra ainsi vous poser toutes ses questions.\nLeurs questions m’ont toujours aidé à améliorer mon texte d’origine en l’abordant sous un angle nouveau.\n</p>\n<p>\n翻訳している間に翻訳者と話すのです。そうすれば翻訳者はあなたに全ての質問をすることができます。\n私は翻訳者からの質問が、新しい観点からオリジナルの文章を改善するのにいつも役立つことに気付きました。\n</p>\n<p>\n번역을 하는 동안 번역가와 이야기를 통해, 그들이 당신에게 모든 질문을 할 수 있도록 하세요.\n새로운 통찰력으로 내 원문을 향상시킬 수 있는 열쇠가 그들의 질문 속에 있었습니다.\n</p>\n<p>\nConverse com seu tradutor enquanto ele estiver trabalhando, para que ele possa tirar todas as dúvidas com você.\nEu descobri que as perguntas deles sempre me ajudavam a melhorar meu original através de uma nova perspectiva.\n</p>\n<p>\nОбщайтесь с переводчиком, пока он работает, чтобы он мог задавать все свои вопросы. \nЯ обнаружил, что его вопросы всегда помогают мне улучшить исходный текст с новой перспективы.\n</p>\n<p>\n在翻译员进行工作的同时与他们交流，这样他们能够问清楚所有的问题。\n我发现他们的问题总是会帮助我从一个新的角度改进我的原作。\n</p>\n<p>\nولكنّي لست خبيراً في هذا الشأن، لذا يُرجى مشاركة أي اقتراحات في التعليقات أدناه.\n</p>\n<p>\nIch bin kein Experte auf diesem Gebiet, also teile bitte unten deine Anregungen.\n</p>\n<p>\nBut I’m not an expert at this, so please share your suggestions, below.\n</p>\n<p>\nSed mi ne spertas pri tio, do bonvolu doni viajn konsilojn, sube.\n</p>\n<p>\nPero tampoco es que sea un experto en la materia, así que, si tienes alguna sugerencia, no dudes en plasmarla en la sección de comentarios que aparece a continuación.\n</p>\n<p>\nMais je ne suis pas expert en la matière, alors si vous avez des suggestions, n’hésitez pas à m’en faire part dans les commentaires ci-dessous.\n</p>\n<p>\nしかし、私はこれについての専門家ではありませんから、どうか下記のコメント欄でどんな提案でも共有してください。\n</p>\n<p>\n하지만 제가 이 분야에 전문가는 아니기 때문에, 아래에 어떤 댓글이라도 달아서 의견을 나눠 주세요.\n</p>\n<p>\nMas eu não sou especialista nisso, portanto, compartilhe suas sugestões nos comentários abaixo.\n</p>\n<p>\nНо я в этом не специалист, так что, пожалуйста, делитесь любыми предложениями в комментариях ниже.\n</p>\n<p>\n但我不是专家，所以请在下面的评论中分享任何建议。\n</p>\n\n<img src=\"/images/sculptor.jpg\" />","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"fe5bc25a6459c06db99116e529f1769109caa268792dd196280b708ceb816dd2","category":"default"}