{"title":"Tiger Tail and Tigers Blood","link":"https://kottke.org/24/03/tiger-tail-and-tigers-blood","date":1711728499000,"content":"\n        <p>Tiger Tail ice cream is an <a href=\"https://www.atlasobscura.com/foods/tiger-tail-ice-cream-canada\">orange ice cream with black licorice swirl</a>s generally only found in Canada (until this summer when you can get it in Somerville after I make it even though I’m not very good at swirling).</p>\n\n<blockquote><p>A ribbon of black licorice swirled into an orange-flavored ice cream base gives this tiger its stripes. The old-school flavor sold well in soda parlors from the 1950s to the 1970s, and many Canadians now consider it a childhood classic. As curious as it may seem, kids (and nostalgic adults) are among the biggest fans of the citrus and black licorice combination.</p></blockquote>\n\n<p><a href=\"https://www.tastingtable.com/1330684/what-is-tigers-blood-flavor-taste/\">Tigers Blood sorbet is a sorbet with strawberry, coconut, and watermelon</a>, and maybe we’ll make that one, too. </p>\n\n<blockquote><p>Depending on who you ask, Tiger’s Blood could have originated as early as the 1940s or as late as the 1990s and was invented anywhere from Hawaii to Texas. Regardless of what the true story is, it’s safe to say that its creation was a success as it remains incredibly popular across the country.</p></blockquote>\n\n<p>Tigers Blood is also the name of the <a href=\"https://www.npr.org/2024/03/23/1240235509/waxahatchee-tigers-blood-review\">new album by Waxahatchee</a>. </p>\n\n<blockquote><p>On Tigers Blood, no bond is linear or static. Some of these songs sound ready to run, bursting from the traps; others take their ease with intoxicating beauty. Love boomerangs and comes back. Sisters have an unexpected showdown about their respective heady and cautious approaches to life. </p></blockquote>\n\n<p>See how it’s all come together now?</p>\n\n <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/ice%20cream\">ice cream</a> · <a href=\"https://kottke.org/tag/Waxahatchee\">Waxahatchee</a></p>\n\n <p>💬 <a href=\"https://kottke.org/24/03/tiger-tail-and-tigers-blood\">Join the discussion on kottke.org</a> →</p>\n\n    ","author":"Aaron Cohen","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"febb359cce77123adf2e9b63ff7dbf046a5768b229bb33f41dcdf16d0805f092","category":"default"}