{"title":"The end of TikTok's audio golden age","link":"https://www.garbageday.email/p/end-tiktoks-audio-golden-age","date":1707160782000,"content":"<div><div><h2>Here Comes TikTok’s Napster Moment (Sorta)</h2><blockquote><p></p><p>if anyone cares macdennis teenage dream edit is not on tiktok anymore bc edits to katy perry songs are being muted so i made it private but it's still safe here</p><p></p><a href=\"https://twitter.com/paddysroyco/status/1753445942940844516?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\"><p> — girl dennis reynolds (@paddysroyco) <br /> Feb 2, 2024 </p></a></blockquote><p>Last week, Universal Music Group (UMG) <a href=\"https://www.fastcompany.com/91020977/tiktok-users-what-to-know-about-universal-music-group-catalog?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">pulled their catalog</a> from TikTok. In an instant, videos that once were soundtracked to the voices of Taylor Swift and Post Malone fell silent. And now, not even the artists themselves can share their music on the app.</p><p>In an <a href=\"https://www.universalmusic.com/an-open-letter-to-the-artist-and-songwriter-community-why-we-must-call-time-out-on-tiktok/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">open letter</a> published last week, UMG placed the bulk of the blame on concerns about artificial intelligence. “TikTok is allowing the platform to be flooded with AI-generated recordings — as well as developing tools to enable, promote and encourage AI music creation on the platform itself,” the corporation wrote, going so far as to accuse the short-form video app of “sponsoring artist replacement by AI” (a charge that’s more than a little strange, considering, as <i><a href=\"https://www.theverge.com/2024/1/31/24056727/universal-music-group-umg-tiktok-music-removal-ai-pay-negotiations?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">The Verge</a></i><a href=\"https://www.theverge.com/2024/1/31/24056727/universal-music-group-umg-tiktok-music-removal-ai-pay-negotiations?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"> reported</a>, UMG has an AI music agreement already in place with YouTube.)</p><p>But we’ve seen this before. For the past 25 years, the web has been caught in a push-and-pull cycle between copyright holders and streaming platforms. And every time a crackdown like this happens, it only results in three things: More piracy, ironically enough, a worse environment for fans, and more hoops for smaller artists to jump through. The end of TikTok’s audio golden age is already shaping up to be no different.</p><p>In July 2001, Napster was <a href=\"https://www.fastcompany.com/1683310/downloaded-how-napster-conquered-the-world-how-the-world-conquered-napster-and-where-we-are-?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">shut down</a> amid a flurry of lawsuits and congressional hearings. This <a href=\"https://www.billboard.com/pro/music-piracy-2022-stream-ripping/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">didn’t kill music piracy</a>, of course, but it pushed it to the fringes of the web and created a schism within the music industry that we still see today. Big artists on major labels like Metallica could easily go after individual pirates, while smaller artists either had to accept that their music would end up on apps like Kazaa or LimeWire or BitTorrent, or find new distribution models. On that latter front, artists like Radiohead and Jeff Rosenstock were early pioneers and, in a lot of ways, they actually did define how the music industry would begrudgingly change thanks to social media.</p><p>The arrival of YouTube in 2005, and then sites like SoundCloud and Spotify three years later were what helped that evolution happen. The streaming era led to partnerships and licensing agreements reached between the labels and the platforms; the question was always whether or not a streaming company could scale up fast enough to negotiate licensing agreements for all the stolen music on their platform. This is exactly what TikTok’s strategy was when it launched in the U.S. in 2017. (Neither TikTok nor UMG immediately responded to a request for comment.)</p><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@wlambily?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\"> @wlambily </a><p>they took down some of mariahs discography like osessed, its a wrap, we belong togethe#tiktok #mariahcarey #fyp #viral </p></section></blockquote><p>TikTok’s parent company ByteDance created the app by taking many of the core features from their Chinese app Douyin and adding them on to an app they had recently acquired called Musical.ly. Musical.ly was a lip-syncing platform that had managed to build a growing community of former Vine stars. And so, many of the earliest TikTok trends were dances or lip-syncs because that’s what the initial user base already knew.</p><p>Audio has remained a key part of TikTok’s DNA. In fact, its tool for uploading audio files directly to the platform was a feature that had basically gone extinct from the social web due to fears of piracy. And the MP3 files users were uploading to TikTok created a powerful discovery mechanism inside of the app. If I upload an audio file to TikTok, other users can click on it and use it. And the app curates all of those videos in the same subcategory, making audio files almost function like a hashtag or a hyperlink. It’s not perfect, but it has been very good for the music industry. </p><p>According to a 2023 study — which, yes, was <a href=\"https://www.billboard.com/business/streaming/tiktok-music-discovery-luminate-study-1235502070/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">conducted by TikTok</a> — an overwhelming majority of users discover music on the app and it does correlate with both streams on platforms like Spotify, as well as with concert ticket sales. It’s worth noting that there are studies <a href=\"https://consequence.net/2013/10/study-shows-girl-talks-all-day-samples-actually-increased-sales-of-songs/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">going back at least a decade</a> that show similar benefits to open access to music.</p><p>And UMG-owned songs won’t completely vanish from TikTok, either. There will of course be bootlegs still. And users are already making fan edits with bad covers and using purposefully bad <a href=\"https://twitter.com/khilxr/status/1753452701793349995?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">royalty free music</a> in place of known pop songs. As <i>Billboard</i>‘s Kristin Robinson <a href=\"https://twitter.com/wordsbykristin/status/1753560488385139120?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">pointed out</a>, TikTok just won’t be tracking metadata for remixes of UMG content.</p><p>Fears of AI music on TikTok, whether real or imagined, were enough to put an end to one of the longest-running ceasefires between rights holders and internet platforms ever. For the past six years, record labels, monetized streaming platforms like YouTube and Spotify, and TikTok all worked together to create a massive explosion of music, the likes of which we haven’t seen in a generation. And it’s very likely that UMG’s TikTok pullout signals the start of a much more restrictive new status quo that could easily spread across the internet. One that, ironically enough, will hurt musicians the most.</p><p><i>This essay was co-published with the fine folks at Fast Company. You can read a longer version of it over on their site </i><a href=\"https://www.fastcompany.com/91023824/tiktok-napster-moment-umg?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"><i>by clicking here</i></a><i>.</i></p><hr /><p><i>The following is a paid ad. If you’re interested in advertising, email me at </i><span><span><i><a href=\"mailto:ryan@garbageday.email\" target=\"_blank\">ryan@garbageday.email</a></i></span></span><i> and let’s talk. Thanks!</i></p><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/136b8986-47a4-4580-a0cc-b5aa53ed5060/unnamed__1_.jpg?t=1707143287\" /></div><p>Hello garbage heads,</p><p>I’m releasing a collection of songs called Okay Headspace on February 9th. The songs are very short and sincere, with squealy guitars and crunchy drums, in the style of Big Star or Guided by Voices. They’re mostly about my infatuation with and revulsion for computers. </p><p>You can preorder it on <a href=\"https://companyvacation.bandcamp.com/album/okay-headspace?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">Bandcamp</a> or hear <a href=\"https://open.spotify.com/playlist/3IV4vPWIlC34BmH7OvoF07?si=85a9485c4e9e4c2b&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">the singles on Spotify</a>. Thanks for your time!</p><hr /><h2>The Vision Pro’s First Weekend</h2><p>A weird man I met at a journalism event about a decade ago let me try on his Google Glass. I did not find it very compelling. It was uncomfortable, of course, but it was also boring. I was standing in a weird carpeted basement having drinks and canapés and suddenly had a futuristic headset on my face. There were so many things I <i>wanted</i> to do with it, but it couldn’t really do any of them. My memory’s a little foggy, but I don’t even think it could browse the web.</p><p>A couple years ago, I put one of Meta’s Quest headsets on my face for the first time and had the same urge. After spending a few days jailbreaking it, I was able to get it to run Android apps and slowly started having fun playing with it. But, like the Google Glass, it was more annoying than it was exciting and I gave up. And this impulse, I’ve decided, is what differentiates good and bad hardware. We tend to assume that tech is meant to solve an existing problem in our lives. But I don’t think it’s about how easily it interfaces with your current life, rather how easily it responds to your imagination.</p><p>Garbage Day isn’t making the kind of money (yet lol) where I could justify buying a Vision Pro, but after reading and watching every review I can find, the Vision Pro seems to have gotten a lot closer to the headset that everyone’s been dreaming of. Though, I have yet to see anyone really, truly say that it’s worth $3500. </p><p>But if Apple is committed to “spatial computing,” the price will eventually meet the <a href=\"https://twitter.com/dril/status/1753920062363423199?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">form factor</a>, and what looks completely and totally <a href=\"https://twitter.com/bigblackjacobin/status/1754222795452510534?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">ridiculous</a> now, won’t anymore. It happened with iPods, iPhones, iPads, and AirPods. Once a version of a device allows you to start imagining a new life with it, nothing else really matters.</p><hr /><h2>OK, Hear Me Out, TikTok Is Gen Z Twitter And YouTube Is Gen Z Facebook</h2><blockquote><p></p><p>YouTube by and large is the most widely used online platform measured in our survey. With a somewhat lower share, Facebook is also a dominant player in the online landscape. And, roughly half of U.S. adults say they use Instagram. Explore more:</p><p></p><a href=\"https://twitter.com/pewresearch/status/1752847485062566211?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\"><p> — Pew Research Center (@pewresearch) <br /> Feb 1, 2024 </p></a></blockquote><p>Here’s a fascinating little insight from <a href=\"https://www.pewresearch.org/internet/fact-sheet/social-media/?tabId=tab-5b319c90-7363-4881-8e6f-f98925683a2f&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"><i>Pew Research Center</i></a>. YouTube is, far and away, the most popular platform for young adults — which <i>Pew </i>defined as ages 18 to 29. And as <a href=\"https://qz.com/tiktok-isnt-as-popular-among-users-as-you-would-think-1851216871?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"><i>Quartz</i></a><a href=\"https://qz.com/tiktok-isnt-as-popular-among-users-as-you-would-think-1851216871?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"> noted</a>, TikTok has even less site traffic than X, an app that only about 15 very divorced men use now. Though, site traffic is an imperfect way for measuring an app like TikTok.</p><p>And yet, we all know that TikTok is important. We can see the mobs fighting for large lead-filled cups in Target and the new emerging fashion trends hitting the streets of major cities around the world. We all know that baby gronk rizzed up Livvy Dunne. So what gives?</p><p>Well, this dynamic between YouTube and TikTok is, in many ways, very similar to how Facebook and Twitter interacted with one another about a decade ago. The bigger, more closed-off app Facebook was more stable and pervasive, but less interesting to talk about. It’s where publishers could, once upon a time, deliver news and reach audiences and build businesses. But Twitter, the smaller, more discoverable nightmare world of kaleidoscopic discourse and endless drama, was the one was getting — and driving — all of the attention.</p><p>If more rights-holders like UMG end their licensing agreements with TikTok, however, it’s not hard to imagine the short-form video app losing its influence in much the same way Twitter did once major news outlets stopped using it last year.</p><hr /><h2>“Fast Car” Good</h2><p>In honor of Tracy Chapman performing “Fast Car” at the Grammy’s last night (and, I guess, Luke Combs was also there), please take five minutes and watch Chapman’s 1988 Wembley performance, embedded above.</p><p>Once you’ve watched that, go read poet and essayist Hanif Abdurraqib’s <a href=\"https://www.instagram.com/stories/nifmuhammad/3295623290315016101/?hl=en&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">Instagram Story</a> about Chapman’s performance. It makes an incredible video even more incredible. On the off chance you read this after the Instagram Story expires, <a href=\"https://twitter.com/alyssakeiko/status/1754362887290638672?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">here are screenshots</a>.</p><p>Do not, however, interact with the unfortunately viral video on X of Chapman performing at the Grammy’s last night. You can read more about that <a href=\"https://twitter.com/alexkoppelman/status/1754508171366842775?s=12&amp;t=GArJOEJ41SKT7sLfzFsugQ&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">here</a>.</p><hr /><h2>Everyone On Tumblr Is Going Nuts For The African Forest Buffalo</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/64256093-65fa-4596-b1a9-1bc80381dafc/Screenshot_2024-02-05_at_2.10.24_PM.png?t=1707153074\" /><div><span><p>(Tumblr/”African forest buffalo”)</p></span></div></div><p>I was trying to figure out why the African forest buffalo was going viral on Tumblr right now, but I think I’m actually more confused than I was. The post that appears to have kicked it off <a href=\"https://www.tumblr.com/bovineblogger/737305512599797760?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">was this one</a>, which doesn’t make a lot of sense, but, hey, what on Tumblr does. If I had to guess as to why users like this breed of buffalo so much right now, I’d guess it’s the ears. Which are very fun.</p><p>Anyways, here’s a <a href=\"https://www.tumblr.com/insertisfruity/739236250685521920/what-in-the-fresh-hell-is-going-on-with-the?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">big post</a> of more African forest buffalo content. Enjoy! </p><hr /><h2>An Important Science Experiment</h2><blockquote><section><a target=\"_blank\" href=\"https://www.tiktok.com/@evan.eac?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\"> @evan.eac </a><p>how much plastic wrap can stop me?</p></section></blockquote><hr /><h2>I Am Really Bad At This Crafting Game</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/5becd965-5ca9-446c-859f-8509a1c77c4f/Screenshot_2024-02-05_at_11.38.36_AM.png?t=1707143944\" /><div><span><p><a href=\"https://neal.fun/infinite-craft/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">neal.fun/infinite-craft</a></p></span></div></div><p>According to <a href=\"https://twitter.com/nealagarwal/status/1752719299691647395?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">the game’s creator</a>, Neal Agarwal, a user managed to create Peter Griffin a minute after it launched. It took me several minutes to make a meteor, as you can see in the screenshot above. But I didn’t get much farther than that.</p><p>Agarwal also made the <a href=\"https://neal.fun/password-game/?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">Password Game</a>, which is also really good. Also, any games or apps that run in a browser are a net positive for the world and we need more of them.</p><hr /><h2>A Good Bluesky Post</h2><div><img src=\"https://media.beehiiv.com/cdn-cgi/image/fit=scale-down,format=auto,onerror=redirect,quality=80/uploads/asset/file/04448276-e8be-40a1-8477-43d84271ae2a/Screenshot_2024-02-05_at_3.07.34_PM.png?t=1707156476\" /><div><a href=\"https://bsky.app/profile/arr.bsky.social/post/3kkksu2mqgk2w?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"><span><p>(@arr.bsky.social)</p></span></a></div></div><hr /><h2>Some Stray Links</h2><ul><li><p><a href=\"https://www.vox.com/culture/2024/2/1/24056883/tiktok-self-promotion-artist-career-how-to-build-following?utm_source=pocket_reader\" target=\"_blank\">“Everyone’s a sellout now”</a></p></li><li><p><a href=\"https://www.ign.com/articles/argylle-ending-explained?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">“</a><a href=\"https://www.ign.com/articles/argylle-ending-explained?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"><i>Argylle</i></a><a href=\"https://www.ign.com/articles/argylle-ending-explained?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\"> Ending and Post-Credits Scene Explained”</a></p></li><li><p><a href=\"https://www.rat.house/p/in-defense-of-the-internet-culture?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">“in defense of the internet culture beat”</a></p></li></ul><hr /><h2>Think About Supporting Garbage Day</h2><p>It’s $5 a month or $45 a year and you get paid issues and Discord access. Hit the button below to find out more. Thank you I love you.</p><div><a target=\"_blank\" href=\"https://www.garbageday.email/upgrade?utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\"><span> Upgrade </span></a></div><hr /><p>P.S. here’s a <a href=\"https://www.youtube.com/playlist?list=PL5qSB1KRnUOzEPbx1Pzt6iNbHLNJHHQ9X&amp;utm_source=www.garbageday.email&amp;utm_medium=newsletter&amp;utm_campaign=the-end-of-tiktok-s-audio-golden-age\" target=\"_blank\">perfect YouTube playlist</a>.</p><p><i>***Any typos in this email are on purpose actually***</i></p></div><div><br /><hr /><a target=\"_blank\" href=\"https://www.beehiiv.com/?utm_campaign=c857b866-ccdc-4da6-9d9c-0353d6820355&amp;utm_medium=post_rss&amp;utm_source=garbage_day\">Powered by beehiiv</a></div></div>","author":"Ryan Broderick","siteTitle":"Garbage Day","siteHash":"f6f2268f28b352c16d6836ba0dcf62d1334588ef4ccbdcbdd896fc6dd07bbcb7","entryHash":"fef841f6137c71d3a35f3e8c942eac9cd4c9e8188bf78b27be05bb17dbc3fd39","category":"default"}