{"title":"Floor Maps of Iconic NYC Fast Food Joints","link":"https://kottke.org/24/10/floor-maps-of-iconic-nyc-fast-food-joints-1","date":1728675255000,"content":"\n        <p>When he was asked to design <a href=\"http://bernheimerarchitecture.com/commercial/#/papaya-king-1/\">a new outpost</a> of iconic NYC hot dog joint Papaya King in the East Village, Andrew Bernheimer went around to several other establishments in the city built to serve food quickly — Chipotle, Russ &amp; Daughters, Katz’s, Shake Shack, Gray’s Papaya — and looked at their floor plans and flow of customers through their spaces. Mark Lamster <a href=\"http://designobserver.com/feature/how-to-design-an-iconic-ny-fast-food-joint/37803/\">talked to Bernheimer about the survey</a>.</p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/grays-papaya-floor.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/grays-papaya-floor.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/grays-papaya-floor.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"1020\" alt=\"Grays Papaya Floor\" /></p>\n\n<p><img src=\"/cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/katz-floor.jpg\" srcset=\"/cdn-cgi/image/format=auto,fit=scale-down,width=500,metadata=none/plus/misc/images/katz-floor.jpg 500w, /cdn-cgi/image/format=auto,fit=scale-down,width=1200,metadata=none/plus/misc/images/katz-floor.jpg 1200w\" loading=\"lazy\" width=\"640\" height=\"808\" alt=\"Katz Floor\" /></p>\n\n<blockquote><p>ML: I think at fast food joints we’re conscious that we’re in a very controlled environment, but perhaps don’t realize (because we are in a rush), just how manipulative that space can be. How did you see this playing out in the places you looked at?</p>\n\n<p>AB: It ranged. Artisanal places (like Russ &amp; Daughters) don’t feel manipulative in an insidious way at all (other than showing off some great food and triggering all sorts of synaptic response), while others do (Five Guys and their peanuts, a pretty nasty and obvious trigger to go order soda or spend money on WATER). We didn’t just look at fast food joints, but also icons of New York (R&amp;D, Katz’s) that do try to serve people quickly but I don’t think qualify as “fast food joints.” In these cases the manipulation is either entirely subliminal and beyond recognition, or it has been rendered unnecessary because a place has become iconic, the domain of the “regular.”</p></blockquote>\n\n<p>Speaking as a customer, places like Katz’s and Russ &amp; Daughters always felt like a total mess to me. Katz’s in particular is the worst: the whole thing with the tickets, paying on the way out, the complete lack of a single line, separate ordering locations for different types of food, etc.</p>\n\n<p>That Gray’s Papaya that used to be on the corner of 8th St and 6th Ave, however, was fantastic. It had the huge benefit of being situated on the corner, but when you walked in, there was the food being cooked right in front of you. It was obvious where the line was and what direction it was moving. And after getting your food, you could exit immediately out the “back” door or circle back against the line to find a counter spot to quickly eat your meal.</p>\n\n         <p><em>[This is a vintage post originally from Aug 2016.]</em></p>\n\n         <p><strong>Tags:</strong> <a href=\"https://kottke.org/tag/Andrew%20Bernheimer\">Andrew Bernheimer</a> · <a href=\"https://kottke.org/tag/architecture\">architecture</a> · <a href=\"https://kottke.org/tag/food\">food</a> · <a href=\"https://kottke.org/tag/interviews\">interviews</a> · <a href=\"https://kottke.org/tag/Mark%20Lamster\">Mark Lamster</a> · <a href=\"https://kottke.org/tag/NYC\">NYC</a> · <a href=\"https://kottke.org/tag/restaurants\">restaurants</a> · <a href=\"https://kottke.org/tag/timeless%20posts\">timeless posts</a></p>\n\n        \n\n    ","author":"Jason Kottke","siteTitle":"Kottke","siteHash":"89a883271b4598f9b33ebe87be70d38557bcd266e68aee521a8f93622e0ab723","entryHash":"ff4d76cc07de3873fca3077bc02889230c885a823332411a882fac31f3157689","category":"Sites"}