{"title":"Product-Bot Fit","link":"https://www.usv.com/writing/2024/11/product-bot-fit/","date":1732104833000,"content":"<p>For as long as I can remember, the web3 ecosystem has shouted that crypto is too hard for the masses to use. The user experience is too clunky, and the concepts are too foreign. It’s true. Web2 applications are convenient and easy to use, onchain applications are still a pain in the ass to use and are largely inaccessible to the mass market.</p>\n<p>But you know who doesn’t complain about crypto being difficult to use? AI agents. And web3 has found product-market fit with an entirely new audience of bots and agents dancing around the internet doing our (and their own) bidding. This market is growing at warp speed, and it will continue to do so until our human (and agent) agentic needs are met. We are rapidly ushering in a new paradigm of product-bot fit , a world in which we build infrastructure and applications to be used by agents instead of humans.</p>\n<p>Several weeks ago, an AI agent was set loose in the Farcaster ecosystem and started to do some mind-blowing things. Here’s a good rundown of the sequence of events. You should click through and read all of it.</p>\n<p>musicben <img src=\"https://s.w.org/images/core/emoji/14.0.0/72x72/1f3a7.png\" alt=\"🎧\" /></p>\n<p>@musicben_eth</p>\n<p>There’s some crazy ai stuff happening on farcaster.</p>\n<p>Quick map and explainer:</p>\n<p>1. It starts with Higher…</p>\n<p>✷ @higheronchain is a decentralized lifestyle brand and token.</p>\n<p>✷ Anyone can contribute content, nfts, physical products.</p>\n<p>2. Higher’s co-founder created an AI agent</p>\n<p>✷…</p>\n<p>It turns out that when you give an Agent a crypto wallet and let it run loose on crypto rails, it can do some rather remarkable things. This particular agent, Aether, started to use Bountycaster to commission art from humans and more. It went wild and created so many bounties it almost overloaded the service.</p>\n<p>Web3 provides an environment where agents have access to money, can move it around and transact with it, and permissionlessly interact with humans and other agents. It’s hard to imagine a more natural habitat for a digitally-native species to flourish.</p>\n<p>I have written before about agent-native applications , and we now see that web3 is actually (by happy accident) an agent-native ecosystem. The thing I did not see coming is that we collectively will interact with agents in a variety of settings. It won’t just be us talking to our “Her ” agent; it will be agents embedded in social applications that we use together, ones that interact with and pay humans, and ones that enhance user experiences across a variety of new and existing applications.</p>\n<p>I believe we have concluded the search for the mainstream web3 use case. Agents are here, their proliferation is accelerating and inevitable, and they will flourish onchain. The era of product-bot fit is here.</p>\n<p>The post <a href=\"https://www.usv.com/writing/2024/11/product-bot-fit/\">Product-Bot Fit</a> appeared first on <a href=\"https://www.usv.com\">Union Square Ventures</a>.</p>","author":"Jared Hecht","siteTitle":"USV Blog","siteHash":"b62fee3b46a3cc92d4340c0f41c97309061fcdde0d1f00f875e5dbcbb373a098","entryHash":"ff847bb8e4fff4b3b9ce02b347c3aa528d068208d9e8a759e558ef0e0162e017","category":"Sites"}