{"title":"Don’t Waste Your Wildness","link":"https://www.themarginalian.org/2024/10/13/dont-waste-your-wildness/","date":1728854102000,"content":"<h3>“What is wild cannot be bought or sold, borrowed or copied. It is. Unmistakable, unforgettable, unshamable, elemental as earth and ice, water, fire and air, a quintessence, pure spirit, resolving into no constituents. Don’t waste your wildness: it is precious and necessary. In wildness, truth.”</h3>\n<hr />\n<p><a href=\"https://www.amazon.com/gp/product/158542403X/?tag=braipick-20\" target=\"_blank\"><img width=\"320\" height=\"475\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/wild_jaygriffiths.jpg?fit=320%2C475&amp;ssl=1\" alt=\"Don’t Waste Your Wildness\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/wild_jaygriffiths.jpg?w=617&amp;ssl=1 617w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/wild_jaygriffiths.jpg?resize=320%2C475&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/wild_jaygriffiths.jpg?resize=600%2C890&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/10/wild_jaygriffiths.jpg?resize=240%2C356&amp;ssl=1 240w\" /></a></p><p>Once, while writing <a href=\"https://www.themarginalian.org/2018/11/01/figuring/\">my first book</a>, I lived on a lush volcanic island balding with so-called civilization, lawnmowers muffling its birdsong to turn its jungles into golf courses. </p>\n<p>I watched waves taller than factory chimneys break into cliffs black as spacetime, making mansions look like a maquette of life. </p>\n<p>I beheld the ancient indifferent faces of turtles older than the light bulb hatching their young under the NO TRESPASSING sign on a billionaire’s private beach. </p>\n<p>I looked into the open mouth of the volcano taunting the sky in the language of time. </p>\n<p>I kept thinking about how those fault lines between the elemental and the ephemera of human life most readily expose our gravest civilizational foible: regarding nature as something to conquer, to neuter, to tame, <a href=\"https://www.themarginalian.org/2018/05/10/america-ferrera-sojourns-in-the-parallel-world-denise-levertov/\">“forgetting that we are nature too,”</a> forgetting that we are taming our own wildness, neutering our very souls. </p>\n<p>Jay Griffiths offers a mighty antidote in her 2006 masterpiece <a href=\"https://www.amazon.com/gp/product/158542403X/?tag=braipick-20\" target=\"_blank\"><strong><em>Wild: An Elemental Journey</em></strong></a> (<a href=\"https://search.worldcat.org/title/71243821\" target=\"_blank\"><em>public library</em></a>) — the product of “many years’ yearning” pulling her “toward unfetteredness, toward the sheer and vivid world,” learning to think with the mind of a mountain and feel with the heart of a forest, searching for “something shy, naked and elemental — the soul.” What emerges is both an act of revolt (against the erasure of the wild, against the domestication of the soul) and an act of reverence (for the irrepressible in nature, for landscape as a form of knowledge, for life on Earth, as improbable and staggering as love.)</p>\n<figure><a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\"><img src=\"https://i2.wp.com/www.themarginalian.org/wp-content/uploads/2016/02/arthurrackham_grimm5.jpg\" /></a><figcaption>Art by Arthur Rackham for a <a href=\"https://www.themarginalian.org/2016/02/29/arthur-rackham-brothers-grimm/\">rare 1917 edition</a> of the Brothers Grimm fairy tales. (Available <a href=\"https://society6.com/product/art-by-arthur-rackham-from-a-rare-1917-edition-of-the-brothers-grimm-fairy-tales_print?curator=brainpicker\" target=\"_blank\">as a print</a>.)</figcaption></figure>\n<p>A century and a half after Thoreau “went to the woods to live deliberately” (omitting from his famed chronicle of spartan solitude the fresh-baked doughnuts and pies his mother and sister brought him every Sunday), Griffiths spent seven years slaking her soul on the world’s wildness, from the Amazon to the Arctic, trying “to touch life with the quick of the spirit,” impelled by “the same ancient telluric vigor that flung the Himalayas up to applaud the sky.” She writes:</p>\n<blockquote><p>I was looking for the <em>will</em> of the wild… The only thing I had to hold on to was the knife-sharp necessity to trust to the elements my elemental self.</p>\n<p>I wanted to live at the edge of the imperative, in the tender fury of the reckless moment, for in this brief and pointillist life, bright-dark and electric, I could do nothing else.</p>\n<p>[…]</p>\n<p>The human spirit has a primal allegiance to wildness, to really live, to snatch the fruit and suck it, to spill the juice. We may think we are domesticated but we are not.</p></blockquote>\n<p>It all began by getting lost in “the wasteland of the mind, in a long and dark depression” that left her unable to walk or write, “pathless, bleak and bewildered, not knowing which way to turn.” (A decade later, Griffiths would write <a href=\"https://www.amazon.com/Tristimania-Diary-Depression-Jay-Griffiths/dp/1619029464/?tag=braipick-20\" target=\"_blank\">an entire book</a> about that discomposing yearlong episode of manic depression.) Searching for “the octaves of possibilities,” reckoning with “the maybes of the mind,” yearning for release from the supermarket aisles of the psyche, she set out to find the savage antipode to “this chloroform world where human nature is well schooled, tamed from childhood on, where the radiators are permanently on mild and the windows are permanently closed.” She writes:</p>\n<blockquote><p>I felt an urgent demand in the blood. I could hear its call. Its whistling disturbed me by day and its howl woke me in the night. I heard the drum of the sun. Every path was a calling cadence, the flight of every bird a beckoning, the color of ice an invitation: come. The forest was a fiddler, wickedly good, eyes intense and shining with a fast dance. Every leaf in every breeze was a toe tapping out the same rhythm and every mountaintop lifting out of cloud intrigued my mind, for the wind at the peaks was the flautist, licking his lips, dangerously mesmerizing me with inaudible melodies that I strained to hear, my eyes yearning for the horizon of sound. This was the calling, the vehement, irresistible demand of the feral angel — <em>take flight</em>. All that is wild is winged — life, mind and language — and knows the feel of air in the soaring “flight, silhouetted in the primal.”</p></blockquote>\n<figure><a href=\"https://www.themarginalian.org/2024/07/26/almanac-of-birds/\"><img src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=680%2C1052&amp;ssl=1\" width=\"680\" height=\"1052\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=320%2C495&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=600%2C929&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=240%2C371&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=768%2C1188&amp;ssl=1 768w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2024/07/NightHeron_doubt.jpg?resize=993%2C1536&amp;ssl=1 993w\" /></a><figcaption>Art from <a><em>An Almanac of Birds: Divinations for Uncertain Days</em></a>. (Available as <a href=\"https://society6.com/a/artists/brainpicker/designs/28465351?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/a/artists/brainpicker/designs/28465351?curator=brainpicker\" target=\"_blank\">stationery cards</a>, benefitting the Audubon Society.)</figcaption></figure>\n<p>She lived for months with a hill tribe in the forests of the Burmese border, lost all her toenails climbing Kilimanjaro, met “cannibals infinitely kinder and more trustworthy than the murderous missionaries who evangelized them,” felt “what it is like to whimper with sheer loneliness on a Christmas Day in a jungle on the other side of the world,” learned to live in the seasons and the elements, “right within nature because there is nothing that is not nature.” </p>\n<p>She reflects:</p>\n<blockquote><p>To me, humanity is not a strain on wilderness as some seem to think. Rather the human spirit is one of the most striking realizations of wildness. It is as eccentrically beautiful as an ice crystal, as liquidly life-generous as water, as inspired as air. Kerneled up within us all, an intimate wildness, sweet as a nut. To the rebel soul in everyone, then, the right to wear feathers, drink stars and ask for the moon… We are — every one of us — a force of nature, though sometimes it is necessary to relearn consciously what we have never forgotten; the truant art, the nomad heart.</p></blockquote>\n<figure><a href=\"https://society6.com/product/moonlight-winter-by-rockwell-kent-1940_print?curator=brainpicker\" target=\"_blank\"><img loading=\"lazy\" src=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?resize=680%2C567&amp;ssl=1\" width=\"680\" height=\"567\" srcset=\"https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?w=1200&amp;ssl=1 1200w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?resize=320%2C267&amp;ssl=1 320w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?resize=600%2C500&amp;ssl=1 600w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?resize=240%2C200&amp;ssl=1 240w, https://i0.wp.com/www.themarginalian.org/wp-content/uploads/2022/02/rockwellkent_moonlightwinter.jpg?resize=768%2C640&amp;ssl=1 768w\" /></a><figcaption><em>Moonlight, Winter</em> by Rockwell Kent. (Available as <a href=\"https://society6.com/product/moonlight-winter-by-rockwell-kent-1940_print?curator=brainpicker\" target=\"_blank\">a print</a> and as <a href=\"https://society6.com/brainpicker/cards?sort=new?curator=brainpicker\" target=\"_blank\">stationery cards</a>.)</figcaption></figure>\n<p>Pulsating beneath the passionate poetics is an indictment and a beckoning. A decade after Maya Angelou channeled the selfsame polarity of human nature in her staggering space-bound poem <a href=\"https://www.themarginalian.org/2018/05/09/a-brave-and-startling-truth-maya-angelou/\">“A Brave and Startling Truth,”</a> Griffiths writes:</p>\n<blockquote><p>There are two sides: the agents of waste and the lovers of the wild. Either for life or against it. And each of us has to choose.</p></blockquote>\n<p>Reclaiming our wildness emerges as an act of courage and resistance amid the conspicuous consumption by which late-stage capitalism drugs us into mistaking having for being, anesthetizing the urgency of our mortality — that wellspring of everything beautiful and enduring we make. What Griffiths offers is a wakeup call from this near-living, a spell against apathy, against air con and asphalt, against our self-expatriation from our own nature: </p>\n<blockquote><p>What is wild cannot be bought or sold, borrowed or copied. It <em>is</em>. Unmistakable, unforgettable, unshamable, elemental as earth and ice, water, fire and air, a quintessence, pure spirit, resolving into no constituents. Don’t waste your wildness: it is precious and necessary. In wildness, truth. Wildness is the universal songline, sung in green gold, which we recognize the moment we hear it. What is wild is what drives the honeysuckle, what wills the dragonfly, shoves the wind and compels the poem. Wildness is insatiable for life; neither truly knows itself without the other. Wildness… sucks up the now, it blazes in your eyes and it glories in everyone who willfully goes their own way.</p></blockquote>\n<p>Complement <a href=\"https://www.amazon.com/gp/product/158542403X/?tag=braipick-20\" target=\"_blank\"><strong><em>Wild</em></strong></a> — a vivifying read in its entirety — with Wendell Berry’s timeless poem <a href=\"https://www.themarginalian.org/2021/03/12/wendell-berry-the-peace-of-wild-things-animated/\">“The Peace of Wild Things”</a> and artist Rockwell Kent, writing a century earlier, on <a href=\"https://www.themarginalian.org/2022/02/15/rockwell-kent-wilderness/\">wilderness and creativity</a>, then revisit Robert Macfarlane and Jackie Morris’s magnificent <a href=\"https://www.themarginalian.org/2020/11/21/the-lost-spells-macfarlane-morris/\">rewilding of the human spirit</a>.</p>\n<hr /><h3>donating = loving</h3><p>For seventeen years, I have been spending hundreds of hours and thousands of dollars each month composing <em>The Marginalian</em> (which <a href=\"https://www.themarginalian.org/2021/10/22/brain-pickings-becoming-the-marginalian/\">bore the outgrown name <em>Brain Pickings</em></a> for its first fifteen years). It has remained free and ad-free and alive thanks to patronage from readers. I have no staff, no interns, no assistant — a thoroughly one-woman labor of love that is also my life and my livelihood. If this labor makes your own life more livable in any way, please consider lending a helping hand with a <a href=\"https://www.themarginalian.org/donate/\">donation</a>. Your support makes all the difference.</p>\n\n<hr />\n\n<h3>newsletter</h3>\n<p><em>The Marginalian</em> has a free weekly newsletter. It comes out on Sundays and offers the week’s most inspiring reading. Here’s <a href=\"https://mailchi.mp/brainpickings/janna-levin-rebecca-elson-anne-lamott-james-gleick\">what to expect</a>. Like? <a href=\"https://www.themarginalian.org/newsletter/\">Sign up.</a></p>","author":"Maria Popova","siteTitle":"The Marginalian","siteHash":"052ac1be0de11784b9ef27664fbcf33da8263d0e7cb9c6e601ccd959f2d3aa78","entryHash":"ff8db83045da24c57311c015dff6ffc5d60b2bfb042436ff86bd214eab1de5e2","category":"Sites"}