{"title":"High and low decoupling, and other matters (from my email)","link":"https://feeds.feedblitz.com/~/902201525/0/marginalrevolution~High-and-low-decoupling-and-other-matters-from-my-email.html","date":1722573088000,"content":"<p>This is all from an anonymous reader, not by me, but I will not indent:</p>\r\n<p>“Hi Tyler,</p>\r\n<p>I enjoyed your post – <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/07/im-kind-of-tired-of-this.html\" target=\"_blank\">I’m kind of tired of this</a> – and wanted to respond to it as I think what you wrote gets at two important trends happening in politics today.</p>\r\n<p>1 – High and Low Decoupling</p>\r\n<p>First of all the examples of idiotic tribal behaviour you cited remind me of an idea I was first introduced to by Tom Chivers about the difference between high decouplers – individuals comfortable separating and isolating ideas from actions, and low decouplers – individuals who see ideas as inextricable from their wider contexts. –<a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Funherd.com%2F2020%2F02%2Feugenics-is-possible-is-not-the-same-as-eugenics-is-good%2F&amp;data=05%7C02%7Ctcowen%40gmu.edu%7C64b66a149c1a457a0cb008dcb0b36b93%7C9e857255df574c47a0c00546460380cb%7C0%7C0%7C638579531877024752%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=e%2FgvbjYheqjLgSvdkMJ9cdG5cHioH1DqLUbwpLbnuHY%3D&amp;reserved=0\" target=\"_blank\"> https://unherd.com/2020/02/eugenics-is-possible-is-not-the-same-as-eugenics-is-good/</a></p>\r\n<p>I would argue that up until today low decoupling (along with the everpresent sin of motivated reasoning) has been the cultural norm in politics for over a century, if not longer, and so much of the bollocks we see in political rhetoric and in corporate news coverage across the western world can be explained by everyone having to conform to the norm if they want to succeed.</p>\r\n<p>hat I would argue we are seeing now thanks to Twitter (and especially its inspired Community Notes feature) is the first proper challenge to the low decoupling cultural norm and the vacuum that is developing thanks to more and more people seeing (and criticising) politicians conforming to it. Indeed whilst the internet may not forget anything, up until Elon’s takeover of twitter the internet has been something of a toothless old dog.</p>\r\n<p>How will this shift away from low decoupling change political discourse? I suspect it will make debate more elitist and less accessible for ordinary people because arguments will have to become more sophisticated and require a certain level of engagement to understand. This will probably make political discussions seem  duller to many people due to a more analytical and rigorous style as opposed to the quick trite phrases of the present moment. because political actors will know that they can be “owned” or discredited as “fake news” if they are shown to be using spin or overly simplistic arguments. Counter intuitively (for those not paying attention) I also then think the decline of low decoupling will see the death of “fact checkers” because of the growing cynicism towards this movement and the growing appreciation of the fact that there are inherent biases underlying those checking the facts and that they often present their responses in emotive and low decoupling ways.</p>\r\n<p>It’s important to say I don’t think this change will necessarily change everyone’s behaviour but then it doesn’t need to. If it just changes the behaviour of the 10-20% of the population who take a moderate to high interest in politics (and are more important for changes within politics) then this will change the discussion even if the remaining 80% are still by and large low decouplers on political matters. But this change will itself play into the wider changes we are seeing in politics and which is the other point I want to highlight.</p>\r\n<p>2 – The political realignment</p>\r\n<p>Now going back to your post, what is arguably more interesting is the subtext of what you said, specifically your (low decoupling) defence of the new right. It could be argued that a Straussian reading of what you are saying is that despite where you thought you would be in the political new realignment you keep finding yourself in a different position and you find this fact unsettling. I think it shouldn’t be. It’s just that the present framing of the realignment is wrong and based on outdated understandings of the forces involved.</p>\r\n<p>Now in the established narrative the new realigned politics should pit socially conservative economic nationalists against cosmopolitan socially liberal centrists (and leftists). And for libertarians/classical liberals the argument by many has been that the best position for the libertarian/classical liberal right is towards the cosmopolitan liberal end of the spectrum due to alleged shared norms for open societies. However, I actually disagree with this interpretation as whilst it’s a good theory it does not fit the reality of what has happened or indeed is happening in western politics.</p>\r\n<p>The cosmopolitan liberal tribe could be about a commitment to open societies and broad liberal values but the reality has been and I would argue continue to be (because of the need to include radical leftists in this divide) a commitment to egalitarianism and the social democratic (left liberal) norms of political conduct which are poorly designed for our very online, wealthy multiracial Western nations.</p>\r\n<p>These norms have led to the toleration of state corruption and inefficiency “how dare you criticise the teachers”, “how dare you criticise the NHS”, “how are you criticise the EU/Federal government” and the promotion of cancellation against those who go against the established narrative on issues such as the speed/scope/direction of Net Zero, stand up for women’s rights against the trans ideology or who critique the current model of immigration/integration.</p>\r\n<p>The cosmopolitan liberals are on a hiding to nothing with all of these issues. And why? Because they as a political wing represent the status quo, and what we are seeing now is the beginning of the end for the dominant post 1945 social democratic settlement. 2020-21 I would argue, with the twin pillars of massive state control through the excuse of COVID and the cultural dominance of the BLM/Woke movement,  was Western social democracy at its apex and the longer that model to hold the more it will corrode and wither into either a Robespierre-esque focus on equity, or else a degeneration into deep green anti growth nihilism, either of which will kill it as a force anyway. This is why Emmanuel Macron now seems out of his depth, why Trudeau keeps failing, and why the European Union continues to stagnate – they are the status quo establishment and they’ve run out of ideas.</p>\r\n<p>So what then do I think will take its place. Well inevitably one wing of politics seeks to preserve the status quo and one wing seeks to overturn it and looking at the ideas floating around the populist/rightist/nationalist camp we can already see trends emerging. Now I will caveat that it will take a while for these to develop as intellectually there is no fertile “home” for this wing (being excluded from academia and more generally all sympathetic intellectual figures being shunned/condemned/cancelled but substack seems to be developing into a way “rightist” intellectuals can work and be paid to be intellectuals. And those intellectuals will not be drinking from a barren pool and when we look at the expected intellectual influencers it gets hard for classical liberals/libertarians to pretend they have no sympathy with this movement.</p>\r\n<p>Now in a previous comment you’ve stated you think that religious intellectual figures will be at the core of intellectual developments going forward but what I see is that the core figures will actually be 5 irreligious figures namely; Roger Scruton, Elinor Ostrom, Ayn Rand, Thomas Sowell and Lee Kuan Yew. Together these five offer a philosophical basis, an economic analysis and a political roadmap from which western rightist parties can seek direction. I struggle to think of 5 other intellectuals who could have more relevant ideas for the current moment. If I could term the ideology brewed from this pool of thought I would not call it populism or even national conservatism but State Capacity Localism (wink), or as a slogan, Politics for improving the oikos.</p>\r\n<p>And looking at the current trends and discussions already happening within politics you can clearly see the influence of the 5 in the way the discussions on the right are beginning to articulate possible policies;</p>\r\n<ul>\r\n<li>\r\n<p>Improving state capacity through slewing the deadwood of the bureaucratic state with a burn it down/drain the swamp mentality.</p>\r\n</li>\r\n<li>\r\n<p>Nationalisation offset by deregulation – probably a better compromise than what we have today.</p>\r\n</li>\r\n<li>\r\n<p>Local/community decision making on contentious topics with a focus on finding solutions over the current model of finding problems (forced by national government with the threat of national decision if a local solution is not found)</p>\r\n</li>\r\n<li>\r\n<p>The binning of multiculturalism as an idea and assimilation as the core of all arguments on immigration and racial/cultural integration. Combine this with increasing discussions on what countries have achieved high trust multiracial societies (spoiler – Singapore) I expect we will see a reflowering of support for secularism, the absolute necessity of learning the national language for access to employment and state services, and a zero tolerance for ethnic or religious based politics.</p>\r\n</li>\r\n<li>\r\n<p>Tough law and order policies focused on objective outcomes over cultural contexts. President Bukele (and Gavin Newsom when Xi came to visit) prove it can work.</p>\r\n</li>\r\n<li>\r\n<p>The return of aesthetics as a mode of political analysis – beautiful houses and pleasant neighbourhoods and with that an attempt to improve everywhere in a country, most especially rust belts/flyover country.</p>\r\n</li>\r\n<li>\r\n<p>The introduction of land value taxes – which as an idea is literally the opposite of a transnational globalist politics in how it encourages rootedness by design.</p>\r\n</li>\r\n<li>\r\n<p>A focus on high standards, individual responsibility and the veneration and promotion of outstanding individuals regardless of wider factors. Alongside which there will be a focus on repealing “hate” speech laws and the enshrining of free speech, a la first amendment, into multiple countries statutes.</p>\r\n</li>\r\n<li>\r\n<p>Finally I also expect as a response to overkill from the woke movement we will see (over time) the  return of shame as a cultural norm.</p>\r\n</li>\r\n</ul>\r\n<p>And finally coming specifically to the core of social democracy – the bureaucratic welfare state we know the current model is unsustainable and yet the cosmopolitan liberals at best tinker or at worst do nothing to it – because their leftist element don’t want change just higher salaries. And we know as a certainty it will need to change but what are the practical solutions I think each welfare state could go one of two ways; a) to one based on mutual aid (maybe seeing the return of friendly societies?) and community ownership, or b) a new great bargain of a Hayekian welfare state as originally thought up by Sam Bowman back in 2015. <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://nam11.safelinks.protection.outlook.com/?url=https%3A%2F%2Fwww.adamsmith.org%2Fblog%2Fphilosophy%2Flets-have-a-hayekian-welfare-state%2F&amp;data=05%7C02%7Ctcowen%40gmu.edu%7C64b66a149c1a457a0cb008dcb0b36b93%7C9e857255df574c47a0c00546460380cb%7C0%7C0%7C638579531877043712%7CUnknown%7CTWFpbGZsb3d8eyJWIjoiMC4wLjAwMDAiLCJQIjoiV2luMzIiLCJBTiI6Ik1haWwiLCJXVCI6Mn0%3D%7C0%7C%7C%7C&amp;sdata=GxhtJ31Cv7voAE807Zpuj2dL72t9dsBGxbbBCrpTIHY%3D&amp;reserved=0\" target=\"_blank\">https://www.adamsmith.org/blog/philosophy/lets-have-a-hayekian-welfare-state/</a>. Neither of this fits neatly into the cosmopolitan liberal box as they require are particularist, require thinking domestically not internationally and would necessarily require a conversation about who and what  is and isn’t included in welfare coverage – a conversation about the degree to which a society is closed off from others.</p>\r\n<p>And just thinking about these bullet points isn’t it clear there are ample opportunities for classical liberals/libertarians to get involved with the rightist end and influence the discussion and direction of debate. What does the cosmopolitan liberal politics offer – net zero by 2045 or 2050?  DEI officers in every workplace?</p>\r\n<p>A soft warm feeling because the New York Times tolerates your existence.</p>\r\n<p>Looking to the future I think we as western societies face a choice, but it is not between Heaven or Hell (as the corporate press on both sides would have it) or as some classical liberals/libertarians would see it as between a sort of hipster Reaganism and a reactionary Corbynism. I think the choice western societies face is between becoming new Argentinas or new Singapores (and as of last December Argentina have chosen Singapore) and this is why so many (such as yourself Tyler) find themselves on a different political side than they expected. The establishment has failed across the West; it’s just that we keep forgetting the establishment is the cosmopolitan left.”</p>\r\n<p>The post <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com/marginalrevolution/2024/08/high-and-low-decoupling-and-other-matters-from-my-email.html\">High and low decoupling, and other matters (from my email)</a> appeared first on <a href=\"https://feeds.feedblitz.com/~/t/0/0/marginalrevolution/~https://marginalrevolution.com\">Marginal REVOLUTION</a>.</p>\r\n<img height=\"1\" width=\"1\" src=\"https://feeds.feedblitz.com/~/i/902201525/0/marginalrevolution\" />\r\n<div><a href=\"https://feeds.feedblitz.com/_/28/902201525/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/fblike20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/29/902201525/marginalrevolution,\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/pinterest20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/24/902201525/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/x.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/19/902201525/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/email20.png\" /></a> <a href=\"https://feeds.feedblitz.com/_/20/902201525/marginalrevolution\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/rss20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/high-and-low-decoupling-and-other-matters-from-my-email.html#respond\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/comments20.png\" /></a> <a href=\"https://marginalrevolution.com/marginalrevolution/2024/08/high-and-low-decoupling-and-other-matters-from-my-email.html/feed\"><img height=\"20\" src=\"https://assets.feedblitz.com/i/commentsrss20.png\" /></a><h3>Related Stories</h3><ul><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/venezuela-under-brutal-capitalism.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=venezuela-under-brutal-capitalism\">Venezuela under “Brutal Capitalism”</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/my-excellent-conversation-with-alan-taylor-on-american-history.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-excellent-conversation-with-alan-taylor-on-american-history\">My excellent Conversation with Alan Taylor, on American history</a></li><li><a href=\"https://marginalrevolution.com/marginalrevolution/2024/07/my-podcast-with-peter-singer-and-kasia-de-lazari-radek.html?utm_source=rss&amp;utm_medium=rss&amp;utm_campaign=my-podcast-with-peter-singer-and-kasia-de-lazari-radek\">My podcast with Peter Singer and Kasia de Lazari-Radek</a></li></ul> </div>","author":"Tyler Cowen","siteTitle":"Marginal Revolution","siteHash":"242a3a39129b36e0c574c3796ca7ef3cf8af967286c2998fabf7240d1ad52a47","entryHash":"ffb10de7af52f6a036e8a62e05c29f1dbc9bc2f1a8bf64bc8a68765cdf800f1d","category":"default"}