{"title":"How to do what you love and make good money","link":"https://sive.rs/balance","date":1482105600000,"content":"<p>\nPeople with a well-paying job ask my advice because they want to quit to become full-time artists.\n</p><p>\nBut full-time artists ask my advice because they’re finding it impossible to make money.\n</p><p>\n(Let’s define “art” as anything you do for expression, even just blogging or whatever.)\n</p><p>\nFor both of them, I prescribe the lifestyle of the happiest people I know:\n</p>\n<ul><li><strong>\nHave a well-paying job.\n</strong></li><li><strong>\nSeriously pursue your art for love, not money.\n</strong></li></ul>\n<p>\nLet’s look at the ingredients of this plan.\nFirst: <strong>balance</strong>.\nYou’ve heard about balancing heart and mind, or right-brain left-brain, or whatever you want to call it.\nWe all have a need for stability <em>and</em> adventure, certainty <em>and</em> uncertainty, money <em>and</em> expression.\n</p><p>\nIf you have too much stability, you get bored.\nIf you don’t have enough stability, you panic.\nSo keep the balance.\n</p><p>\nDo something for love and something for money.\nDon’t try to make one thing satisfy your entire life.\n</p><p>\n<strong>\nEach half of your life becomes a remedy for the other.\n</strong>\nYou get paid stability for part of your day, but then need creative time for expression.\nSo you push yourself creatively, expose your vulnerable art to the public, feel the frustration of rejection and apathy, and then long for some stability again.\nEach half is a remedy for the other.\n</p><p>\n<strong>\nAbout the job:\n</strong>\nBe smart, and choose <a href=\"https://sive.rs/images/jobwages.jpg\">something that pays well with a solid future</a>.\nLook for statistics in your area about what pays the best when factoring in the required training.\nYou’ll probably need to study for a few years to build up the rare skills that are well-rewarded.\n<strong>This is a head choice, not a heart choice,</strong> since you’re not trying to make your job your entire life.\n</p><p>\n<strong>\nAbout your art:\n</strong>\nPursue it seriously.\nTake lessons.\nMake weekly progress.\nKeep improving, even if you’ve been doing it for decades.\n</p><p>\nIf you don’t progress and challenge yourself creatively, it won’t satisfy the balance.\nRelease and sell your work like a professional.\nFind some fans.\nLet them pay you.\nBut your attitude is different than someone who needs the money.\nYou don’t need to worry if it doesn’t sell.\nYou don’t need to please the marketplace.\nYou don’t need to compromise your art or value it based on others’ opinions.\n<strong>\nYou’re just doing this for yourself — art for its own sake.\n</strong>\nAnd you’re releasing it because that’s one of the most rewarding parts — important for self-identity — and gives you good feedback on how to improve.\n</p><p>\n<strong>\nYour main obstacle to this amazing life will be self-control.\n</strong>\nYou’ll need good time management to stop addictions like social media and video-watching, and make your art your main relaxing activity.\nYou’ll need good mind management to not think of your job after you leave the office.\n</p><p>\nMost full-time artists I know only spend an hour or two a day actually doing their art.\nThe rest is spent on the boring work that comes with trying to make it a full-time career.\nSo skip the art career and just do the art.\n</p><p>\nAnd that’s my advice for a rewarding life.\nI’ve met thousands of people over the last twenty years — many of them full-time musicians, many of them not — but the happiest people I know are the ones that have this balance.\n</p><p>\nDon’t expect your job to fulfill all your emotional needs.\nDon’t taint something you love with the need to make money from it.\n<strong>\nDon’t try to make your job your whole life.\nDon’t try to make your art your sole income.\n</strong>\nLet each be what it is, and put in the extra effort to balance the two, for a great life.\n</p>\n<img src=\"/images/seesaw.jpg\" />\n<div>See-Saw by Osch aka Otto Schade. Photo by <a href=\"https://www.flickr.com/photos/maureen_barlin/14946472205/\">Maureen Barlin</a>.</div>","author":"Derek Sivers","siteTitle":"Derek Sivers","siteHash":"4098504c0d0759e13901f29e63f7d7dbb1d972a078c6dc4560660f373da5c25e","entryHash":"fffcf9c1678ddc881f92798f94af2462ed8169c3bee7a1e0c4e800b29b2f355a","category":"default"}